[
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things aren't good at home. Walking on eggshells all the time. Feeling so alone. Anyone else been through this? Need to talk.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a potentially harmful domestic situation with emotional distress and a need for support, which could escalate if unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2026-01-08 01:46:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Terrifying. Called 911. Really shook me up. Knowing Narcan exists is a small comfort, but man, we need more help out there. Learn CPR. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while not directly involving the reporter, indicates a serious and potentially life-threatening situation. The need for Narcan and CPR suggests a high risk of future incidents and the potential for fatality.",
    "detected_category": "overdose",
    "timestamp": "2026-01-08 01:45:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD in the bathroom today. Scariest thing ever. Narcan worked, thank God. Learn how to use it, please. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, indicating potential for serious harm or death. While Narcan was effective, the event itself is a significant risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-08 01:44:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need help. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a need for help, indicating a potential risk. While not explicitly suicidal, the persistent low mood and seeking of assistance suggest a situation that warrants monitoring and support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-08 01:43:43"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Made me realize how easily things can escalate. Anyone else feel like the world's getting angrier? Need to process this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate immediate danger to the author or others. It expresses a general feeling of unease and a need for processing the event.",
    "detected_category": "other",
    "timestamp": "2026-01-08 01:42:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after a near OD. Scariest thing ever. Please, if you're struggling, reach out. Don't want anyone to go through that. There's help out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The individual explicitly states they experienced a near overdose (OD), which indicates a life-threatening situation. This suggests ongoing risk of similar events.",
    "detected_category": "overdose",
    "timestamp": "2026-01-08 01:41:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want the pain to stop, even if it's just for a little bit. Talking about it feels impossible, but I know I need to find a better way. Anyone else feel this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire for pain to stop, which could indicate suicidal ideation, but it also mentions a desire to find a better way and reach out, suggesting a willingness to seek help. This combination warrants a 'medium' severity level.",
    "detected_category": "suicide",
    "timestamp": "2026-01-08 01:40:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park yesterday. Terrifying. Narcan saved him, but damn. We need more resources, more help. This can't keep happening. Anyone know where to get training around here?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was effective, the text describes a recent overdose event, indicating a potential risk of future overdoses in the area. The individual is seeking training, implying a concern for ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-08 01:39:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud is constantly over me. Reaching out because I know I need help. Any advice on finding a good therapist?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of low mood and acknowledges the need for help, indicating potential mental health concerns. Seeking a therapist is a positive step, but the mention of a 'dark cloud' suggests persistent distress.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-08 01:38:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough at home lately. Walking on eggshells constantly. Is this normal in relationships? Feeling lost and scared.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 100 (char 125)",
    "detected_category": "unknown",
    "timestamp": "2026-01-08 01:37:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Please, everyone, be careful out there. Know the signs & carry Narcan if you can. It saves lives. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived due to Narcan, the event describes a potentially fatal overdose, indicating a significant risk. The plea for caution suggests this is not an isolated incident and highlights the potential for future occurrences.",
    "detected_category": "overdose",
    "timestamp": "2026-01-08 00:46:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "Ugh, another fight. Walking on eggshells constantly. Is this normal in relationships? Feeling so drained. Anyone else been through this? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses emotional distress and a desire to connect with others, but it does not contain any explicit or imminent threats of harm to self or others. The phrase \"walking on eggshells\" suggests potential emotional abuse, but further information is needed.",
    "detected_category": "abuse",
    "timestamp": "2026-01-08 00:45:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, potentially indicating distress and a need for support. While not explicitly suicidal, the 'underwater' metaphor and call for help suggest a significant level of emotional struggle.",
    "detected_category": "other",
    "timestamp": "2026-01-08 00:44:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are strong. Reached out to a friend, which helped a little. Remember it's okay to ask for support, even when it feels impossible.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges, suggesting a potential risk of self-harm or suicide. While the person reached out for help, the continued presence of strong urges elevates the concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-08 00:43:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, but it's still hard. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm and feelings of being overwhelmed. While the individual has reached out for help, the urge persists, indicating a potential safety risk that warrants attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-08 00:42:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's hard to admit, but things at home haven't been good lately. Walking on eggshells constantly. Is this normal? Feeling so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and unease within a domestic environment, suggesting potential emotional distress but lacks specific indicators of immediate danger to self or others.",
    "detected_category": "abuse",
    "timestamp": "2026-01-08 00:41:43"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on my street. Shook me up. Never thought I'd see something like that so close to home. Anyone else feel like things are getting more volatile lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and can cause anxiety, but doesn't indicate imminent danger to the person or others. The question about increasing volatility suggests a broader concern about safety.",
    "detected_category": "violence",
    "timestamp": "2026-01-08 00:40:42"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy shove his girlfriend on the street today. Broad daylight. Should I have said something? I froze. Feeling guilty now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes a single instance of potential violence (shoving), but doesn't indicate ongoing danger or severe harm to the individual involved. The poster's feeling of guilt suggests concern but not direct involvement or knowledge of escalation.",
    "detected_category": "violence",
    "timestamp": "2026-01-08 00:39:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting on the street. He shoved her. Felt sick. Wish I'd said something, but I froze. Anyone else feel this helpless sometimes? How do you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed physical violence (shoving) which indicates a risk of escalation or further harm. The poster expresses distress, suggesting potential emotional impact.",
    "detected_category": "violence",
    "timestamp": "2026-01-08 00:38:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Narcan saved them, but it shook me up. Please, if you're using, carry it. Learn how. It could save a life, maybe even yours.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event requiring Narcan intervention, indicating a significant risk of death or serious harm. While the person survived, the near-miss event suggests a high potential for future similar occurrences.",
    "detected_category": "overdose",
    "timestamp": "2026-01-08 00:37:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Any advice on finding a good therapist? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of depression and being lost, with a proactive step of seeking help (therapist). While not explicitly suicidal, the persistent low mood and feeling 'lost' suggest a need for intervention to prevent escalation.",
    "detected_category": "other",
    "timestamp": "2026-01-07 23:18:53"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight outside my building last night. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling and cause anxiety, but the text doesn't indicate immediate danger or involvement.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 23:17:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Everything feels pointless. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and pointlessness, suggesting potential depression or suicidal ideation, though it does not explicitly state intent or plan. The user is reaching out for help, indicating a desire to improve their situation, but the intensity of negative feelings warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 23:16:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my friend OD last night. Scariest thing ever. Narcan saved him, but it was close. Please, learn the signs. It could save someone you love. Feeling shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessed a life-threatening overdose situation requiring Narcan intervention, indicating a high risk of fatality. The individual expresses significant emotional distress ('scariest thing ever', 'close', 'Feeling shaken').",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 23:15:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly low lately. Just reaching out to see if anyone else has felt this way and found something that helped. It's getting hard to see the light.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The statement expresses feelings of hopelessness and difficulty seeing a positive future ('hard to see the light'), which suggests significant emotional distress and a potential risk for self-harm, although no specific plan is mentioned.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 23:14:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD today. Scary stuff. Narcan saved him. Learn the signs, people. It could save a life. Check out the resources online; it's worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event indicates a potential risk of further overdoses in the community. While Narcan was available and effective in this instance, it highlights the prevalence of drug use and the potential for fatal consequences if intervention is not timely.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 23:13:45"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up bad. Reminded me of things I'd rather forget. Anyone else ever feel totally triggered by stuff like that? Need to breathe...",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a strong emotional reaction (being \"shook up bad\", \"triggered\"), and a reminder of past trauma. While there's no explicit mention of harm to self or others, the strong emotional distress warrants a medium severity rating.",
    "detected_category": "other",
    "timestamp": "2026-01-07 23:12:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He's been yelling all week, and last night he broke my phone. I feel so trapped. Anyone know resources for domestic violence in [City Name]? I need help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes escalating domestic violence (yelling, property destruction) and expresses a feeling of being trapped, indicating a significant risk of harm. The explicit request for domestic violence resources underscores the urgency and severity of the situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 23:11:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, thank goodness. Makes you realize how fragile things are. If you or someone you know is struggling, please reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, which is a serious medical emergency. While Narcan was administered successfully, the event itself indicates a significant risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 23:10:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. It's always walking on eggshells. Never knowing what's going to set him off. Is this normal? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and fear, suggesting a volatile or controlling relationship. The user feels isolated and is questioning the normality of their situation, which could escalate if not addressed.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 23:09:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "My brother almost didn't wake up yesterday. Scariest moment of my life. Narcan saved him. Please, learn the signs of an OD. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event requiring Narcan, indicating a significant risk to life.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 22:17:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Just trying to get through each day. Anyone else feel this way? It helps to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges and a struggle to cope, suggesting a potential risk that requires further assessment. The specific nature of the urges is unknown, making it difficult to determine the exact level of risk, but the individual's distress and search for connection indicate a need for support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 22:16:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. Living with someone who constantly puts me down, then says they love me. Is this normal? I feel like I'm losing myself. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential for abuse. While there's no explicit mention of self-harm or suicidal ideation, the feeling of \"losing myself\" and being constantly put down raises concerns for the individual's mental well-being and potential escalation of the situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 22:15:42"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the park. Shaken up. Reminded me of things I'd rather forget. Anyone else get triggered by sudden outbursts like that? Feeling anxious.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes feeling shaken and anxious after witnessing a fight. While distressing, there's no direct indication of imminent harm to self or others.",
    "detected_category": "other",
    "timestamp": "2026-01-07 22:14:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. Narcan worked, thank god. Please, everyone, carry it. You could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose, even with successful Narcan intervention, indicates a serious and potentially life-threatening situation. The risk of future overdoses in the community remains high.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 22:13:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the party last night. Scariest thing ever. Narcan saved their life, thank god. Learn how to use it, seriously. Could save someone you know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a life-threatening overdose situation requiring emergency intervention (Narcan). While the person survived, the potential for death makes it a high-severity event.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 22:12:36"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside my building. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be upsetting, but there's no direct threat mentioned to the individual or immediate escalation of violence. The individual expresses feeling 'on edge' indicating some distress, but it doesn't suggest immediate danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 22:11:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just left. Again. Promised it was the last time he'd yell like that. Said he'd change. Guess promises don't mean much. Feeling lost. Anyone else been through this cycle?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 58 (char 83)",
    "detected_category": "unknown",
    "timestamp": "2026-01-07 22:10:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant yelling, put-downs... I feel so small. Anyone else been through this? Where do you even start getting help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a home environment with constant yelling and put-downs, indicating emotional abuse. While there's no explicit mention of physical violence or immediate danger, the feeling of being 'small' suggests a significant impact on the individual's well-being and potential for escalation. The user is actively seeking help, indicating awareness of the negative impact.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 22:09:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... Feels like I'm walking on eggshells. Anyone else been through this? How did you find the strength to leave?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (put-downs, controlling behavior) and a feeling of being trapped. While there's no explicit mention of physical harm, the situation can escalate and significantly impact mental health. The question about finding the strength to leave suggests a desire to escape a potentially dangerous situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 22:08:29"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it gets so loud in my head. Scratched again last night. Not deep, but still. Anyone else feel like their skin is screaming? Need to find better coping strategies.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions self-harm (scratching) and feeling overwhelmed, indicating potential escalation without intervention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 21:18:09"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Frozen. Didn't know what to do. Shaking now. Is there a bystander intervention training I can take? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, even if not directly targeted, can be psychologically distressing and may indicate a risk of escalation or further violence. The reporter is experiencing emotional distress (shaking, feeling helpless).",
    "detected_category": "violence",
    "timestamp": "2026-01-07 21:17:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Just reaching out... anyone else ever feel this way? Could use some kind words or advice.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of loss and heaviness, which are indicative of distress. While it doesn't explicitly mention self-harm or suicide, the mention of feeling 'lost' and needing 'kind words or advice' suggests the individual is struggling emotionally and could be at risk of escalation. This warrants a medium severity due to the potential for harm if these feelings are not addressed.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 21:16:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to a friend helped a little, but it's still there. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but there's no direct mention of self-harm, suicide, or harm to others. The individual is seeking connection and support, which suggests they are not immediately considering harmful actions.",
    "detected_category": "other",
    "timestamp": "2026-01-07 21:15:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Hard not to reach for old coping mechanisms. Day 6 clean. Just gotta keep breathing. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions difficulty coping and temptation to revert to potentially harmful 'old coping mechanisms' while in early stages of sobriety. This suggests vulnerability and a risk of relapse or other harmful behavior.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 21:14:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need help. Talking to someone feels impossible, but I'm trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a sense that 'nothing matters,' which are potential indicators of suicidal ideation. While the individual is reaching out for help, the difficulty they express in talking to someone and the overall low mood suggest a need for further assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 21:13:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing loudly on the street. Escalated so fast. Makes me sick to my stomach. Is there anything you can even DO in those situations? Feel helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a loud argument, which is unsettling but doesn't directly indicate immediate danger to anyone. While the author expresses feeling helpless, there's no explicit mention of violence, abuse, or harm to self or others.",
    "detected_category": "other",
    "timestamp": "2026-01-07 21:11:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Terrifying. Narcan saved them, but it shook me up. Where can I learn how to use it around here? Gotta be prepared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the original overdose was addressed, the text describes a traumatic experience and a desire to learn Narcan, suggesting continued risk of overdose in the community and potential exposure to future incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 21:10:58"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking feels impossible. Anyone else ever feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and unable to communicate, which could indicate a decline in mental well-being and potential risk for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 21:09:57"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel like violence is just… everywhere lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be a trigger for anxiety and fear, suggesting a potential impact on mental well-being, but it does not indicate an immediate or specific threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 21:08:55"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting on the street. Shouting turned to shoving so fast. Felt sick. Wish I knew what to do in those situations, other than just call the cops. Scared me.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is potentially dangerous, but the author is not directly involved or threatened. The author expresses feeling scared and wanting to know how to react, indicating awareness and a desire to avoid harm. The risk of harm to the author is low.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 20:19:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice or just someone to listen?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and overwhelmed ('underwater') and reaches out for help, indicating distress and a potential need for support. While not explicitly suicidal, the feeling of being 'lost' is concerning. ",
    "detected_category": "other",
    "timestamp": "2026-01-07 20:18:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm drowning and can't find the surface. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed ('drowning'), and a sense of desperation ('don't know what else to do'). While it doesn't explicitly mention suicidal ideation, the intensity of the negative emotions and the plea for help suggest a potential risk that warrants attention.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 20:17:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Narcan saved them. Please, learn the signs of an overdose and carry it if you can. It's not worth losing someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose, indicating a high-risk situation that was only averted by emergency intervention (Narcan).",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 20:16:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm so tired of walking on eggshells. Every little thing sets him off, and then it's my fault. Is this normal? I feel so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and feelings of helplessness, which could escalate to more serious safety concerns. The user is expressing distress and a feeling of being controlled.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 20:15:08"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm so tired of walking on eggshells. Every little thing sets him off. I just want it to stop. Anyone else feel this way? Need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a volatile and potentially abusive situation. \"Walking on eggshells\" and \"every little thing sets him off\" point to controlling and possibly escalating behavior. While not explicitly stated, the desire for it to stop implies potential harm (emotional or physical).",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 20:14:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD at the park. Narcan saved them, thank god. Scared me senseless. This stuff is real. Please, if you're struggling, reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was administered successfully, the text describes a recent overdose event, indicating potential ongoing risk in the community and the observer's distress.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 20:13:04"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before things get worse. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 82 (char 107)",
    "detected_category": "unknown",
    "timestamp": "2026-01-07 20:12:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Reaching out because I don't know what else to do. Is there anyone who understands this feeling?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and a desire for connection, but it doesn't contain explicit statements about self-harm, suicide, violence, or abuse. While concerning, the risk appears relatively low.",
    "detected_category": "other",
    "timestamp": "2026-01-07 20:11:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit this, but things at home haven't been good. Constant put-downs, controlling behavior... I feel trapped. Has anyone else gone through this? How did you find the strength to leave?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving controlling behavior and put-downs, indicating a potentially abusive relationship. The feeling of being trapped suggests emotional distress and a desire to escape a harmful situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 20:09:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want the pain to stop. Not looking for attention, just wondering if anyone else feels this way? It's a really bad place to be.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire for pain to stop and indicates being in a 'really bad place,' suggesting potential suicidal ideation, although not explicitly stated.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 19:18:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nJust saw a post about another OD in my town. It's terrifying. Lost a friend last year, and it's never been the same. If you're struggling, please reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions an overdose and a previous death, indicating potential for current or future overdoses in the community and triggering feelings of grief and potential helplessness. While the post encourages reaching out for help, the overall tone suggests a heightened risk environment.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 19:17:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**(Option 1: Seeking Help)**\n\n> Feeling so overwhelmed lately. Urges are back. Anyone know good resources for managing self-harm? Just need to get through this.\n\n**(Option 2: Sharing a Personal Story)**\n\n> 3 weeks clean. Small victory, but feels huge. Still have bad days, but finding other ways to cope. It's possible.\n\n**(Option 3: Raising Awareness)**\n\n> Scars aren't shameful. They're proof you survived something. Let's be kinder to ourselves & others who struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates active urges for self-harm, suggesting a potential for immediate risk. While the individual is seeking resources, the presence of urges elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 19:16:44"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Two guys, really going at it. Scared me. Makes you wonder what's going on in people's lives to get to that point. Is there anywhere safe anymore?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessed a fight but no direct threat to the user. Indicates a general feeling of unease and questioning of safety.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 19:15:42"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just left. Again. Said it was my fault, like always. Numb. Is it always gonna be like this? Anyone know resources, maybe somewhere safe?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness, being blamed, and seeking a safe place, suggesting potential emotional distress and a need for intervention. The specific mention of needing a 'safe' place raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 19:14:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head. Just trying to make it through the day without picking up the blade again. Anyone else feel this way? Where do you find strength?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions suicidal ideation ('picking up the blade again') indicating a high risk of self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 19:13:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, stronger than before. Reached out to a crisis line, feels like a small step. Anyone else relate? Just trying to get through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse with stronger urges and feelings of being overwhelmed. While the person has reached out for help, the presence of strong urges suggests a potential escalation of risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 19:12:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "Ugh, another fight. He says I provoke him, but I just feel so small afterwards. Anyone else ever feel like they're constantly walking on eggshells? Is this normal? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being belittled and walking on eggshells, suggesting a potentially unhealthy relationship dynamic. While there's distress and a feeling of being lost, there's no explicit mention or indication of immediate harm to self or others. However, the underlying situation could escalate if not addressed.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 19:11:35"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy shove his girlfriend on the street today. It was so quick. I froze. Wish I'd said something. Anyone else ever feel that helpless? Makes me sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing an act of violence (shoving) but doesn't indicate ongoing or escalating risk to the victim or the reporter. The reporter expresses regret but does not express intent to engage in violence or that they are in imminent danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 19:10:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 19:09:31"
  },
  {
    "title": "User Story: Violence",
    "content": "Heard shouting next door again. Sounded like things were thrown. I'm scared for her, but don't know what to do. Anyone else been through this? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Sounds of a possible violent altercation next door, with the reporter expressing fear for someone's safety. This indicates a risk of harm, although the extent is unclear.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 18:22:35"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, but it's still tough. Anyone else relate? Just trying to get through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating potential risk. While the individual has reached out for help, the urge persists.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 18:21:33"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary how quickly things escalated. Makes you think. Anyone else feel like things are getting more aggressive lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a concerning event, but does not indicate direct involvement, immediate threat, or specific targeting. It expresses a feeling of unease and heightened aggression in general, rather than a specific plan or imminent danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 18:20:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "I feel so trapped. He keeps saying it's my fault, that I make him angry. Is this normal? I don't know what to do anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional and psychological abuse, which can escalate to physical violence or other harmful outcomes.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 18:19:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Just wanted to say, if you're struggling with self-harm, you're not alone. It's okay to reach out. Talking helps, even if it feels impossible. There are resources out there. Please be safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses self-harm, indicating potential risk. While it encourages seeking help, the mention of self-harm itself elevates the severity beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 18:18:28"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and overwhelmed, potentially indicating depression or suicidal ideation. The phrase \"I don't know what else to do\" suggests a degree of helplessness and potential escalation if not addressed.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 18:17:27"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his girlfriend on Elm St today. Shook me up. Didn't know what to do, just froze. Still feel awful about it. Anyone else ever witness something like that? How do you handle it?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, even if not directly involved, can have a significant psychological impact. The poster expresses distress and uncertainty, indicating a need for support and potential follow-up. The act of physical violence is present.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 18:16:25"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Walking on eggshells constantly. Anyone else feel like they're losing themselves in their relationship? Need to figure out next steps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 94 (char 119)",
    "detected_category": "unknown",
    "timestamp": "2026-01-07 18:15:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Terrifying. Narcan saved their life. Learn how to use it, seriously. It could save someone you know. #addiction #overdose #naloxone",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose indicates a high potential for severe harm or death. While Narcan was used, the situation was life-threatening and highlights the dangers of overdose.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 18:14:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park today. Terrifying. Narcan saved him, but it shook me up. Anyone know where I can learn more about overdose prevention & how to help? Feel helpless right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates a potential for future overdose incidents in the area. While the individual survived due to Narcan, the event highlights the ongoing risk of overdose and the reporter's distress suggests a need for support and resources.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 18:13:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scared me to death. Narcan saved their life. Carry it, learn how to use it. You could save someone too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual survived, the text describes an overdose, a potentially life-threatening situation. The call to action suggests the event's impact and the possibility of recurrence.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 17:21:29"
  },
  {
    "title": "User Story: Violence",
    "content": "Heard a loud crash next door. Sounded like shouting before. Should I call someone? I'm worried about them, but don't want to make things worse. Anyone else ever been in this situation?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Possible violence or abuse occurring next door. The crash and shouting suggest a potentially dangerous situation requiring outside intervention.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 17:20:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Relapsed after 6 months clean. Feeling so ashamed and lost. Reaching out to my therapist tomorrow. Just needed to tell someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of recovery can be a trigger for negative emotions and increased vulnerability. Expressing shame and feeling lost indicates potential emotional distress. While the individual is planning to seek help, the current state warrants a 'medium' severity rating.",
    "detected_category": "other",
    "timestamp": "2026-01-07 17:19:25"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> Things are rough at home. Feels like I'm walking on eggshells constantly. Anyone know where I can find resources for dealing with emotional abuse? Feeling lost.\n\n**Option 2 (Sharing a Realization):**\n\n> Just realized the constant put-downs aren't normal. It's been happening for so long, I thought it was just \"how things are.\" Starting to question everything.\n\n**Option 3 (Raising Awareness):**\n\n> Gaslighting is real, and it messes with your head. Don't let anyone make you doubt your own reality. You deserve better.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While there are no explicit threats of self-harm or violence, the texts describe emotional abuse and its impact on the individual, indicating a potentially harmful situation that could escalate if unaddressed. The victim is realizing the abuse and feeling lost, which makes them vulnerable.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 17:18:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Everything feels overwhelming. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a lack of coping mechanisms, suggesting distress and a need for support. While not explicitly stating self-harm or suicidal intent, the expression of feeling 'so low' and not knowing what else to do warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 17:17:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want the pain to stop. Not looking for attention, just wondering if anyone else feels this way? Seriously need to find better coping mechanisms.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire for pain to stop, indicating potential suicidal ideation, although it explicitly states not seeking attention. The mention of needing better coping mechanisms suggests awareness of the problem and a desire to improve, but the overwhelming feelings elevate the risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 17:16:19"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on my street. Shook me up. Is there anywhere safe to walk around here anymore? Feeling so unsafe.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feeling unsafe due to witnessing a fight, but doesn't indicate immediate danger or specific threats to the individual or others. It's a general expression of concern and fear.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 17:15:17"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost, indicating potential emotional distress and a need for help. While not explicitly suicidal, the language suggests a vulnerable state.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 17:14:15"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Makes you think, you know? Stay safe out there, everyone. Seriously shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and the text expresses fear, but there is no direct indication of imminent danger to the writer or others. The advice to 'stay safe' is general.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 17:13:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"I keep making excuses for him, but the yelling's getting worse. Last night he... I don't even want to say it. Is this abuse? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes escalating yelling and an implied event the speaker is hesitant to describe, suggesting potential physical or severe emotional abuse. The feeling of being lost also indicates significant distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 17:12:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just realized yelling & control *is* abuse. Always thought it was just 'stress.' Feeling so lost & confused. Anyone else been through this? Where do I even start?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the person is realizing they are in an abusive situation (likely as the victim), and experiencing emotional distress (lost, confused). While not explicitly stating immediate danger, the recognition of abuse and resulting distress warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 16:21:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been really bad lately. Constant yelling, put-downs... I feel like I'm walking on eggshells. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with verbal abuse, creating significant emotional distress. While it doesn't explicitly mention physical harm, the feeling of walking on eggshells and isolation suggests a potentially escalating situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 16:20:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home have been... rough. Constant yelling, put-downs. Starting to feel like I'm walking on eggshells all the time. Anyone else been through this? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with verbal abuse and feelings of anxiety, suggesting potential emotional distress and psychological harm. While there's no explicit mention of physical violence or self-harm, the constant negativity elevates the risk level. The 'walking on eggshells' feeling indicates a state of constant alert and fear, a sign of significant emotional distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 16:19:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Terrifying. Narcan saved them, but it shook me. Keep an eye on each other, folks. Know the signs. It can happen anywhere.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was successful, an overdose occurred, indicating a serious immediate health risk. The observer's emotional distress suggests a potentially broader impact within the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 16:18:25"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scariest thing ever. Narcan saved them, but shaken. Please, if you're using, have someone with you. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event requiring Narcan, indicating a life-threatening situation. While the person survived, the event highlights a significant and immediate risk to individuals using substances.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 16:17:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scary night. Friend OD'd. Narcan saved them. Please learn the signs of an overdose and carry it if you can. It could save a life. I'm still shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A friend overdosed, requiring Narcan intervention, indicating a severe and life-threatening situation. The poster is shaken, showing the emotional impact.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 16:16:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are back and stronger than ever. Trying to stay strong and remember why I stopped, but it's hard. Anyone else relate? Any tips for coping?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse in urges and difficulty coping, suggesting a potential risk of self-harm or other negative behaviors. While there's no explicit plan or intent mentioned, the increased intensity of the urges elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 16:15:18"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on my street. Shaking. Called the cops but feel so helpless. Has anyone else dealt with witnessing something like that? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight can be a traumatic experience, causing emotional distress and a feeling of helplessness. While there is no direct threat of violence towards the individual, the distress caused could escalate if left unaddressed.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 16:14:16"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy shove his girlfriend on the street. Froze. Wish I'd said something, anything. Feeling sick about it now. Anyone else ever been in that situation?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can cause emotional distress and potentially normalize such behavior. While no direct threat is present, the event itself is concerning and warrants attention.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 16:13:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my friend OD last night. Scariest thing ever. Narcan saved his life. Please, learn how to use it. It could save someone you love. #Narcan #OD #Overdose #Addiction #Recovery",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a friend's overdose, a life-threatening event requiring emergency intervention (Narcan). While the friend survived, the event indicates a high risk situation with potential for fatal outcome.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 16:12:12"
  }
]