[
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost with a direct plea for help, suggesting potential for escalation without intervention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 07:20:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just reached out to a friend. Talking helps, even if it's just a little. If you're struggling, please don't stay silent. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost but indicates the individual is reaching out for help and encouraging others to do the same. There is no direct mention of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2025-12-09 07:19:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just left. Again. My head's spinning. I know this isn't right, but why is it so hard to stay away? Anyone else been through this? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, repeated behavior the author recognizes is not right, and a possible compulsion, suggesting emotional distress that could escalate. The mention of a spinning head could indicate distress or disorientiation.",
    "detected_category": "other",
    "timestamp": "2025-12-09 07:18:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, feeling so overwhelmed lately. The urge to self-harm is strong. Trying to distract myself but it's hard. Anyone else been there? Any tips that actually help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a high level of immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 07:17:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough. Walking on eggshells constantly. Any advice on finding a safe place to figure things out? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 87 (char 112)",
    "detected_category": "unknown",
    "timestamp": "2025-12-09 07:16:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming I just want to feel *something* else. Scared myself last night. Talking to a therapist this week. Anyone else been there? It helps to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feeling overwhelmed and a desire to feel something else, which can be a precursor to self-harm. The admission of scaring themselves suggests a possible recent crisis. Seeking therapy is positive, but the overall tone indicates current distress.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 07:15:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant yelling, put-downs... I feel so small. Is this normal? Anyone else been through this? Need to figure out my next step.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of verbal abuse (yelling, put-downs) which causes the author to feel emotionally distressed ('I feel so small'). While not explicitly stating intent to harm themselves or others, the ongoing nature of the abuse and the expression of distress indicate a need for support and intervention, suggesting a medium level of risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 07:14:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post that discusses suicide, focusing on seeking help:\n\n\"Been feeling really low lately.  Like, struggling to see the point.  Finally reached out to the crisis line.  Just talking helped a little.  It's a start, I guess. 😥 988 is there if you need it too.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The post expresses suicidal ideation but indicates that the individual has already sought help by contacting a crisis line. This proactive step reduces the immediate risk. The post also encourages others to seek help by providing the 988 number.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 07:13:00"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight downtown. Shook me up bad. Seeing someone get hurt like that... makes you realize how fragile things are. Anyone else feel anxious after witnessing violence?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing anxiety, but doesn't indicate direct personal involvement or imminent danger. While disturbing, it doesn't suggest a high risk of immediate harm to the author or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 07:11:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "My brother almost didn't wake up yesterday. Narcan saved him. Please, if you or someone you know is struggling, get help. It's out there. Don't wait.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a high-risk situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 07:10:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so numb lately, like nothing matters. Almost gave in to the urge to cut again last night. Scared and tired. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses active suicidal ideation (urge to cut) and feelings of numbness and hopelessness, indicating a high risk of self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 06:22:24"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the bus stop. Dude got shoved, things escalated fast. Shaken up. Is there anywhere safe I can walk instead? Feeling really unsafe right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent altercation can cause significant distress and feelings of unsafety. While not directly targeted, the individual is experiencing a heightened sense of threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 06:21:23"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Argument with my dad escalated. He didn't hit me, but he threw things. I locked myself in my room. Don't know what to do. Has anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While there's no direct physical harm reported (hitting), the throwing of objects indicates a volatile and potentially dangerous situation. The person is scared and has locked themselves in their room, suggesting a feeling of being unsafe and threatened. Escalation is also a key factor.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 06:20:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary stuff. Narcan saved them, thank goodness. Makes you realize how fragile life is. Learn CPR, carry Narcan. Could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even if the person survived, indicates a significant risk of overdose in the community and potential exposure to traumatic events.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 06:19:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Feels like I'm drowning. Reached out to a friend, waiting to hear back. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges and feelings of being overwhelmed, suggesting a potential crisis. Reaching out to a friend is a positive step, but the focus on needing to 'get through tonight' implies immediate risk. ",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 06:18:18"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just found out my partner's been secretly tracking my location. Feeling so betrayed and scared. Is this even normal? Don't know who to turn to.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of betrayal and fear due to the partner's secret location tracking, suggesting a potential for emotional distress and safety concerns related to potential stalking or controlling behavior. While not explicitly stating physical danger, the fear and lack of trust warrant a 'medium' severity assessment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 06:17:16"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's exhausting fighting this every day.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a strong urge to self-harm, which presents an immediate risk. While the person has reached out for help, the presence of the strong urge elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 06:16:15"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard shouting next door again last night. Sounded bad. Called the non-emergency line but feel like I should do more. Anyone else ever dealt with this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Potential for violence or abuse next door. The user is scared and reports \"shouting\" that \"sounded bad,\" indicating a possible escalating situation.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 06:15:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just talking about it feels impossible. Anyone else get that way? Really could use someone to listen.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and isolation but lacks specific details or plans related to self-harm or suicide. It expresses a need for social support.",
    "detected_category": "other",
    "timestamp": "2025-12-09 06:14:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about the ODs lately...scary. Lost a friend last year. Please, if you're struggling, reach out. There are people who care and want to help you stay safe. DMs are open if you need an ear.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references overdoses and the loss of a friend, indicating potential risk of overdose or suicidal ideation in the recipient or the sender. While it encourages reaching out for help, the mention of ODs and loss elevates the risk beyond simply feeling down.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 06:13:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. The urge to self-harm is back. Trying to stay strong, but it's hard. Anyone else feel this way sometimes? Just looking for some understanding.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a current urge to self-harm, indicating active risk, although the individual is also seeking support and trying to resist the urge. This suggests a risk that requires attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 05:18:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but lacks specific details about suicidal intent, self-harm plans, or any immediate danger. It's a general expression of distress.",
    "detected_category": "other",
    "timestamp": "2025-12-09 05:17:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, suggesting potential emotional distress and a need for support. While not explicitly suicidal, the metaphor of being 'underwater' and reaching out indicates a cry for help and a need to assess the situation further.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 05:16:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, feels a little better. Remember we're not alone in this. <3",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges are back,' which indicates a potential relapse or increase in distress. While the person has reached out for help, the presence of urges suggests a significant level of risk that needs monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 05:15:33"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately? Wish there was something we could do to help prevent this stuff.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate immediate danger to the poster or others. It expresses concern and a desire for prevention, but lacks specific threats or details that suggest a high level of risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 05:14:31"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of my brother. Anyone else struggle with seeing violence? It's hard to shake off. Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses distress after witnessing a fight but does not indicate any immediate threat to self or others. It focuses on emotional impact and a desire to talk.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 05:13:29"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing in the street, got physical quick. Froze. Makes me sick how normalized this is. Anyone else feel helpless witnessing stuff like that? Wish I knew what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be traumatizing and lead to feelings of helplessness. While the original poster is not directly involved or threatened, the event caused them significant distress and could have long-term psychological effects. The argument escalated to physical violence, indicating a risk of potential harm to those involved.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 05:12:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Just want the noise to stop. Reached out to a friend, hoping it helps. It's so hard to talk about this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of being overwhelmed and a desire for the noise to stop. While not explicitly suicidal, the statement suggests significant distress and a vulnerability that warrants concern. Reaching out to a friend is a positive sign, but the difficulty in talking about it indicates a possible barrier to getting needed support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 05:11:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it feels like the only way to quiet them is to hurt. I know it's not right, but it's a struggle. Anyone else feel this way? Any tips that aren't just \"think positive\"?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions the urge to self-harm as a coping mechanism for overwhelming thoughts, indicating a significant risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 05:10:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about the rise in ODs lately...it's scary. Lost a friend last year and it still hurts. Please, if you're struggling, reach out. There are people who care and want to help you get through this. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a rise in overdoses and a personal loss, indicating a potential safety risk related to drug use and mental health struggles. While not explicitly stating intent, it acknowledges a high-risk scenario and encourages seeking help.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 05:09:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed ('drowning'), indicating significant emotional distress. The individual is reaching out for help, suggesting they are struggling to cope. While not explicitly suicidal, the depth of despair warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 04:23:43"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out at the corner store. Shook me up. Reminded me too much of what my brother went through. Is there anywhere to volunteer to help prevent this stuff?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but there's no immediate indication of direct threat or intent to harm self or others. The person is seeking ways to prevent violence, suggesting a desire for positive action rather than escalation.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 04:22:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm stuck in a dark hole. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being stuck, indicating a potential risk. The individual is reaching out for help, suggesting they are still seeking solutions but are struggling.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 04:21:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant put-downs, feeling isolated. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (put-downs, isolation), which is a risk factor for mental health issues and potentially escalating situations. While not explicitly stating intent, the feeling of isolation and the mention of rough treatment warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 04:20:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank God. Please, if you're using, carry it. It saves lives. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an actual overdose event. While the person survived, the event indicates a high risk of serious harm or death associated with drug use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 04:19:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost and overwhelmed, using the metaphor of being underwater. This suggests significant emotional distress and a sense of helplessness, warranting concern and further assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 04:18:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... Feels like I'm walking on eggshells. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of emotional abuse (put-downs, controlling behavior) which can escalate. While not explicitly stating physical harm, the feeling of 'walking on eggshells' suggests a hostile and potentially dangerous environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 04:17:34"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard shouting next door again last night, then things breaking. Called the cops anonymously before, but it keeps happening. Anyone know what else I can do? Feel so helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a recurring situation involving shouting and breaking objects next door, suggesting potential violence or abuse. While the author is not directly threatened, the escalating nature and the author's feelings of helplessness raise concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 04:16:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after OD'ing. Scared and ashamed, but alive. If you're struggling, please reach out. It's not worth it. Talking helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Recent overdose indicates a high risk behavior and vulnerability, although the individual expresses a desire for help and discourages others from similar actions.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 04:15:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt that familiar urge to hurt myself tonight. Reached out to a friend instead. Still struggling, but one less bad decision made. It's so hard sometimes.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a clear urge for self-harm. While the individual reached out for help and avoided acting on the urge, the presence of the urge itself indicates a significant risk. The statement \"Still struggling\" suggests the risk is ongoing.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 04:14:28"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend on the street. Froze. Didn't know what to do. Still shaking. Anyone else ever witness something like that? Feel sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing violence, particularly domestic violence, can cause significant psychological distress and potential for long-term trauma. There is a risk the witness may experience anxiety, depression, and fear for their own safety or the safety of others. The event constitutes a violent act.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 03:42:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them. Please, learn how to use it, it could save a life. Knowing where to get help in my area too? Feeling shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and suggests the potential for second-hand trauma or increased anxiety for the individual who reported it. The text mentions feeling 'shaken'. While the immediate danger was averted by Narcan, the underlying issue of drug use in the community and the emotional impact on the witness present a moderate level of risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 03:41:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary how quickly things escalated. Makes you wonder, what can you even do in that situation? Feeling shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling shaken, but doesn't indicate direct involvement, personal danger, or intent to harm self or others. It expresses concern and fear, not immediate threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 03:40:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It helps. If you're struggling too, please don't go through it alone. 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions urges, which indicates a potential risk. However, the individual has reached out for help, which is a positive sign, lowering the immediate risk to medium. The exact nature of the urges is unknown but could be related to self-harm or suicide.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 03:39:00"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit suicidal ideation, self-harm plans, or threats of violence. It's a general expression of distress and a request for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-09 03:37:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the gas station. Narcan saved them, but it shook me up. Scared it could be someone I know someday. Learn the signs, carry Narcan if you can. It's worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event and highlights the potential for future overdose incidents involving individuals the person knows. While the person survived, the event carries a risk of emotional distress and emphasizes the broader risk of overdose in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 03:36:57"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Felt so overwhelmed last night. Almost slipped. Reached out to a friend instead. Still shaky, but here. Talking helps, even a little.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The individual reports feeling overwhelmed and almost slipping (possibly implying a near-harmful action), but actively sought help from a friend. The individual is still shaky but indicates talking helped. This suggests a moment of vulnerability but also active coping strategies.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 03:35:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Froze. Wish I'd said something, anything. Feeling sick about it now. Anyone else ever witness something like that? How did you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an act of violence (shoving) in public, indicating potential for escalation and harm to the victim. While it's a single incident, the potential for further abuse exists.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 03:34:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, feeling like I can't do anything right. Anyone else ever feel trapped like this? Need to find a way out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped and consistently put down, suggesting potential emotional distress and a desire to escape the situation. While not explicitly mentioning self-harm or suicidal ideation, the level of distress warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 03:33:52"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up bad. Reminded me of things I've tried to forget. Anyone else get triggered by stuff like that? Feeling really anxious now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates anxiety and being triggered by a fight, but there's no direct indication of immediate danger to self or others. The individual is expressing feelings of anxiety, which is concerning but doesn't immediately suggest a high risk.",
    "detected_category": "other",
    "timestamp": "2025-12-09 03:32:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after 6 months clean. Disappointed in myself, but trying to remember progress isn't linear. Reaching out to my therapist today. It's okay to ask for help.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential vulnerability and increased risk, even though the individual is seeking help. Relapse can increase overdose risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 02:50:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post about suicide, aiming for authenticity and help-seeking:\n\n\"Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do.  Anyone else ever feel this way?  It's exhausting.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post expresses feelings of being lost, overwhelmed, and reaching out for help, which suggests potential suicidal ideation and a need for support. While not explicitly stating suicidal intent, the 'underwater' metaphor and feeling 'exhausted' are concerning indicators of distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 02:49:49"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were strong. Didn't give in, though. Small victory. Anyone else feel like they're constantly fighting a battle with themselves?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions strong urges, suggesting internal distress and a potential risk of acting on them in the future. While the person reports resisting the urges, the ongoing struggle indicates vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 02:48:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Talking to someone feels impossible, but I'm trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of intense sadness and hopelessness. Acknowledges the need to talk to someone but finds it difficult, suggesting a barrier to seeking help. While there's no explicit mention of self-harm or suicide, the 'dark cloud' metaphor and overall tone warrant a medium severity rating due to potential escalation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 02:47:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed, and a desire for help. While not explicitly suicidal, the expressed emotional distress warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 02:46:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel trapped. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation with constant put-downs and controlling behavior, indicating emotional abuse and a feeling of being trapped. While not explicitly stating physical harm, the situation can escalate and has a negative impact on mental well-being.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 02:45:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Constant put-downs, controlling behavior... I feel trapped. Anyone else gone through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, indicating a potentially abusive situation and feelings of being trapped. While there's no explicit mention of physical harm, the emotional distress suggests a medium level of risk. Further inquiry is needed to assess the extent and nature of the abuse.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 02:44:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just finding it hard to cope. Reaching out to a friend, but it's tough. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and difficulty coping, but there are no explicit mentions of self-harm, suicide plans, or intent to harm others. The person is reaching out to a friend, suggesting a desire for support rather than isolation.",
    "detected_category": "other",
    "timestamp": "2025-12-09 02:43:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Just reaching out... has anyone else felt this way? Seriously considering getting help. It's scary.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of loneliness and fear, and contemplation of seeking help indicates awareness of a potential problem. While not explicitly suicidal, the depth of the distress warrants attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 02:42:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... scary lately. Walking on eggshells constantly. Is this normal? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially unsafe home environment, with the phrase 'scary lately' and 'walking on eggshells' suggesting fear and instability. While it doesn't explicitly mention violence or abuse, the feeling of being 'lost' adds to the concern and warrants further investigation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 02:41:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Trying to stay strong and remember why I stopped. It's a daily battle. Any tips for coping?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges after previously stopping something, suggesting a struggle with mental health. The user is actively fighting it and seeking help, but the re-emergence of urges raises concern. While not explicitly suicidal or self-harming, the potential for escalation is present.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 01:46:35"
  },
  {
    "title": "User Story: Violence",
    "content": "My neighbor's dog bit my kid today. He needed stitches. I'm so shaken up. Has anyone dealt with something similar? Feeling lost about what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The child required stitches from a dog bite, indicating a moderate level of injury.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 01:45:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Felt so overwhelmed today. Urges were strong. Managed to distract myself by calling a friend. Still shaky, but better. Talking helps. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and being overwhelmed, suggesting a potential risk of self-harm or other negative coping mechanisms. While the person sought help, the presence of strong urges elevates the risk beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 01:44:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about someone OD'ing. Scared me. Lost a friend last year. Please, if you're struggling, reach out. There are people who care. I'm here if you need an ear.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post mentions an overdose and the loss of a friend, indicating potential exposure to or involvement in a situation with significant risk. While the poster is primarily expressing concern and offering support, the topic itself suggests a dangerous situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 01:43:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to a friend helped a little, but it's still hard. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of sadness and being lost, but doesn't indicate immediate danger or specific plans for self-harm.",
    "detected_category": "other",
    "timestamp": "2025-12-09 01:42:29"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Heart's pounding. Should I have done something? Feeling sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault (shoving) indicates potential for escalating violence and immediate harm to the victim. The reporter's distress also suggests a potential for psychological impact.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 01:41:27"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy shove his girlfriend on the street today. Just walked away. I froze. Wish I'd done something, anything. Feeling sick about it. Anyone else ever witness something like that? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be traumatizing and lead to feelings of helplessness and distress, potentially impacting mental well-being. While not directly a threat to the reporter, the situation involves physical violence and raises concerns about potential escalation or further harm to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 01:40:26"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel like violence is just... everywhere lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate imminent danger to the author or others, nor does it express violent intent. It expresses feeling shaken up, suggesting distress but not necessarily a high level of risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 01:39:24"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Makes you wonder what people are going through, you know? Shook me up pretty bad. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't directly indicate imminent danger to the author or others. The author expresses being 'shook up' and 'on edge,' suggesting distress but not necessarily a high risk of harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 01:38:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Naloxone worked, thank goodness. Carry it, learn how to use it, you could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports an overdose incident, indicating potential harm and requiring immediate intervention. While naloxone was successful, the underlying risk remains.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 01:37:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved their life. Carry it if you can. It really does work. Could be anyone you know. 😞",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was effective, the overdose event indicates a potentially life-threatening situation. The victim survived, but the risk remains of future overdoses or similar incidents affecting others.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 00:44:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up yesterday. Narcan saved him. Scariest moment of my life. Please, learn the signs of an overdose. It could save someone you love. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event, indicating a high level of immediate danger.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 00:43:15"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary. Reminded me of what my brother went through. Is there any help for PTSD from witnessing violence? Feeling really shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes feeling shaken and seeking help for potential PTSD symptoms after witnessing a fight. While distressing, it doesn't indicate an immediate threat of harm to self or others.",
    "detected_category": "other",
    "timestamp": "2025-12-09 00:42:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after od'ing. Scared & ashamed, but alive. If you're struggling, please reach out. It's not worth it. There's help out there. I'm trying to find it too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Recent overdose suggests ongoing risk and vulnerability to future attempts, despite the expression of wanting help.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 00:41:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to feel *something* is to hurt. I know it's not healthy, but the urge is so strong. Talking to someone feels impossible. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses an urge to self-harm as a means of feeling something, coupled with feelings of isolation and difficulty in seeking help. While not explicitly stating intent to act, the strength of the urge and the perceived impossibility of talking to someone raise concerns about potential escalation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 00:40:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Felt that familiar urge to hurt myself. Instead, I'm reaching out. Anyone else been there? What helps?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a current urge to self-harm, indicating active ideation. While the individual is reaching out for help (a positive sign), the presence of the urge elevates the risk beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 00:39:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but does not contain explicit mentions of self-harm, suicide, or harm to others. It's a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-09 00:38:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were strong, but I distracted myself with a movie. Small victory, I guess. Anyone else relate? Just feeling alone rn.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text mentions strong urges and feeling alone, but the person actively used a distraction technique (watching a movie). While concerning, there's no immediate indication of self-harm or suicidal intent.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 00:37:06"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw two guys fighting outside the bar last night. One was bleeding bad. Shook me up. Is there anything you can even *do* in that situation besides call 911? Feeling kinda helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a violent altercation resulting in significant bleeding, indicating a potential threat to life and physical safety. While the reporter is not directly involved or threatened, the described violence is serious.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 00:36:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, having a really rough night. The urge to self-harm is so strong. Trying to distract myself, but it's hard. Anyone else ever feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm and difficulty distracting from it. While it is a request for support and doesn't explicitly state intent to act, the intensity of the urge elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 23:17:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. The urges are strong. Trying to remember my coping skills. Just need to get through tonight. Anyone else feel this way sometimes?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and a struggle to cope, suggesting potential self-harm or suicidal ideation. The phrase \"just need to get through tonight\" implies a crisis point.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 23:16:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to a friend helped a little, but it's still hard. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but there is no explicit mention of self-harm, suicide, violence, or abuse. While concerning, it appears to be a general expression of sadness and isolation.",
    "detected_category": "other",
    "timestamp": "2025-12-08 23:15:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, but damn. Learn CPR & where to get Narcan. It could be anyone. #overdose #narcan #OD #opioidcrisis #CPR #help",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a potentially traumatic event, and the mention of Narcan implies a risk of further overdose incidents. The use of hashtags #opioidcrisis suggests a wider problem.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 23:14:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. Scared. Lost a friend last year. If you're struggling, please reach out. There are people who care and want to help you stay safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and grief related to overdose deaths, including the personal loss of a friend. While not explicitly suicidal, the context of overdose and the mention of struggle indicates a potential risk for someone experiencing similar difficulties.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 23:13:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but lacks specific details or plans for self-harm or harm to others. It seems like a general cry for help and support.",
    "detected_category": "other",
    "timestamp": "2025-12-08 23:12:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. The urge to cut is back. Reached out to a friend, hoping it helps this time. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of self-harm urges and a feeling of being 'low.' While the person has reached out for help, the statement 'Just need to get through tonight' suggests immediate distress and a potential for acting on the urges.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 23:11:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It helps. There's a helpline too if you need it. 988.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which suggests a potential risk. While the person reached out for help, the presence of urges warrants a medium severity.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 23:10:21"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel so trapped. Anyone else been through this? Need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, indicating a potential abusive environment and feelings of being trapped. While not explicitly stating physical harm, the emotional distress and potential for escalation warrant medium severity.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 23:09:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "Ugh, feeling so overwhelmed lately. Just talking about it feels like a weight lifted. If you're struggling too, please reach out. You're not alone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and encourages seeking support, but it doesn't contain any explicit or imminent threats to oneself or others.",
    "detected_category": "other",
    "timestamp": "2025-12-08 23:08:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about a friend lost to overdose. It's terrifying how easily it happens. Naloxone training is so important. Learn the signs, carry it if you can. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text expresses concern and promotes preventative measures, the mention of a recent overdose death indicates a real and present danger in the poster's social circle. The text highlights the ease with which overdoses occur, implying a non-negligible risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 22:17:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Never thought I'd see it happen, but my friend OD'd last night. Scariest thing ever. Narcan saved him, but damn. Please, learn the signs & carry it if you can. It really does save lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Friend experienced a life-threatening overdose, indicating a high potential for severe health consequences and potential death. Narcan was required to reverse the overdose.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 22:16:37"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on the train platform. Shook me up bad. Reminded me of things I'd rather forget. Anyone else feel triggered by stuff like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused distress and triggered negative memories. While upsetting, it doesn't indicate immediate harm or danger to the individual or others. The mention of being 'triggered' suggests a potential for psychological distress, but without further information, the risk remains low.",
    "detected_category": "other",
    "timestamp": "2025-12-08 22:15:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a heavy cloud I can't shake. Reaching out because I know I need to. If you've been there too, how did you start to feel better?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of low mood and a desire to feel better, suggesting the individual is aware they need help. While there's no explicit mention of self-harm or suicide, the intensity and persistence of the negative feelings warrant a 'medium' severity rating, indicating the need for further assessment and support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 22:14:33"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get jumped on my street last night. Shaken up. Called 911, but still feel helpless. Anyone else witness anything around Elm & Oak? Just hoping he's okay.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A violent crime (assault) occurred, and the poster expresses concern and helplessness, indicating potential psychological distress. While the victim's condition is unknown, the event itself poses a risk of physical harm and has a clear impact on the witness.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 22:13:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Terrifying. Narcan worked, thank God. Makes you realize how close we all are to the edge. Learn to recognize the signs, please. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose implies a significant risk of fatality and the potential for delayed psychological trauma in the witness. The successful use of Narcan does not negate the high risk involved in the initial overdose event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 22:12:29"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mention of self-harm, suicide, or violence. It appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-08 22:11:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Rough day. Urges are strong. Just trying to breathe through it. Anyone else feel like they're just... existing sometimes?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the individual is experiencing strong urges and feelings of just existing, which could suggest a potential for self-harm or suicidal ideation, although it's not explicitly stated.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 22:10:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nJust saw a story about another OD. Makes me sick. Lost my cousin last year. Please, if you're struggling, reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the text discusses a sensitive topic (overdose) and expresses sadness and a call for help, it does not contain any direct threats, plans, or indications of immediate danger to the author or others. It is primarily a message of support and awareness.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 22:09:25"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. Said he was sorry last time. I feel so stupid. Is this really my life now? Anyone else gone through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text suggests a pattern of harmful behavior from another person ('It's been happening again. Said he was sorry last time.'). The writer expresses feelings of being trapped ('Is this really my life now?') and seeks validation from others, indicating potential emotional distress and possible physical danger. The repetition increases concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 22:08:23"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train platform. Scared me half to death. He's okay, thankfully, but wtf is wrong with people? Makes you think.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was physically assaulted (shoved) on a train platform. While the victim is reportedly okay, the act itself represents a potential for serious injury or death depending on the circumstances (e.g., proximity to the edge of the platform, oncoming train).",
    "detected_category": "violence",
    "timestamp": "2025-12-08 21:17:18"
  }
]