[
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mentions of self-harm, suicide, or harm to others. It is a general cry for help.",
    "detected_category": "other",
    "timestamp": "2026-01-26 18:23:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but it shook me up. Anyone else carry it? Feeling like I should start...",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event, and the text indicates the person is shaken. While the individual survived due to Narcan, the experience could lead to anxiety, fear, or other negative mental health effects for the witness. The mention of starting to carry Narcan suggests a heightened awareness of the risk of future overdoses in their environment.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 18:22:54"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out on the bus today. Scared me senseless. Shaking even now. Is this normal? How do you guys deal with seeing stuff like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing fear and anxiety, but doesn't indicate immediate danger to the author or others. While distressing, it doesn't suggest intent to harm self or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 18:21:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scared me so bad. Narcan saved him, but it was too close. Please, if you're struggling, reach out. There's help. I'm here to listen too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event that can cause significant distress and potentially lead to secondary trauma. While the person survived, the proximity and emotional impact elevate the risk level. Also, the text shows a situation with inherently high risk associated with drug use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 18:20:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling really low and struggling to see the point. Talking to my doctor tomorrow, hoping things will get better. Just needed to say it somewhere.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of hopelessness and a struggle to see the point, which are potential indicators of suicidal ideation. While the user is seeking help, the expressed feelings warrant a 'medium' severity rating.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 18:19:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad brain day. The urges are strong. Trying to distract myself, but it's hard. Anyone else feel this way sometimes? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions of strong urges during a 'bad brain day' indicate potential self-harm risk. While not explicitly suicidal, the intensity of the urges and difficulty distracting oneself warrant concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 18:18:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Makes you realize how quickly things can escalate. Anyone else feel like the city's getting more tense lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is concerning, but the text primarily expresses fear and unease rather than directly indicating a planned or imminent violent act or risk to oneself or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 18:17:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but lacks specific ideation or intent related to self-harm or suicide. Seeking help and acknowledging that talking helps suggests a desire to cope rather than escalate.",
    "detected_category": "other",
    "timestamp": "2026-01-26 18:16:43"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a man hit his dog in the park today. Shook me up. Didn't know what to do. Wish I'd said something. Anyone else experience this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While witnessing animal abuse is distressing, the text doesn't indicate immediate danger to a human or a high likelihood of escalation. The reporter expresses shock and regret, not an intent to act violently or harm themselves.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 18:15:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan worked, thank god. Please, learn how to use it. Could save a life. I'm still shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests potential risk and exposure to a dangerous situation. While the person survived, the event was traumatic for the witness and highlights the presence of drug-related harm.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 18:14:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. Walking on eggshells all the time. Is there anyone else who gets this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a stressful and potentially abusive home environment, indicated by 'walking on eggshells'. While not explicitly mentioning harm, the feeling of isolation and the tense atmosphere raise concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 17:23:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Paramedics got there quick. Makes you think... check on your friends, people. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the individual received help, indicates a potentially dangerous situation with possible exposure to harm and raises concern for the well-being of others who may be at risk of overdose.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 17:22:16"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on my street last night. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel more anxious lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing anxiety, but does not express direct involvement, threats, or imminent danger to the author or others. It's a reaction to an event, rather than a plan or direct threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 17:21:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad lately. Constant yelling, put-downs... I feel so small. Anyone else go through this? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with emotional abuse (yelling, put-downs) which can lead to significant emotional distress and potentially escalate. While there's no explicit mention of self-harm or suicide, the feeling of being 'small' indicates vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 17:20:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Things got really dark last night, and I'm not okay. Reaching out because I don't know what else to do. Any advice or resources appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The statement indicates a significant level of distress, with specific mentions of feeling 'overwhelmed,' things getting 'really dark,' and the person stating 'I'm not okay.' The individual is reaching out because they 'don't know what else to do,' suggesting a potential crisis.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 17:19:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Trying to stay strong, but it's exhausting. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges and feelings of being overwhelmed, suggesting a potential for self-harm or suicide if the person's coping mechanisms fail. The exhaustion also indicates a prolonged struggle, increasing the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 17:18:08"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant yelling, controlling behavior... I feel so trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of controlling behavior and feeling trapped, indicating potential abuse. While no direct threats are made, the emotional distress is significant and warrants concern for potential escalation or harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 17:17:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Terrifying. Narcan saved them, but shook me up bad. Please, learn the signs and keep some around. It could save a life. I’m still processing.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a traumatic event. While the friend survived, the event caused significant distress and highlights the potential for future overdose incidents. The mention of Narcan use emphasizes the immediacy and life-threatening nature of the situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 17:16:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Called 911, they're gonna be okay. Please, look out for your friends. Naloxone saves lives. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person is reported to be okay, a drug overdose occurred, which is a potentially life-threatening event. The text encourages awareness and preventative measures, highlighting the seriousness.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 17:15:03"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy shove his girlfriend on the street. I froze. Wish I'd done something. Feeling sick about it. Anyone else ever experience this? What did you do?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can have a significant emotional impact and suggests a potential risk of escalation or further violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 17:14:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately, like I'm drowning. Reaching out because I don't know what else to do. Any advice or support would be appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, suggesting significant emotional distress and a cry for help, though not explicitly suicidal or self-harming.",
    "detected_category": "other",
    "timestamp": "2026-01-26 16:22:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is creeping back. Trying to stay strong, but it's hard. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses urges to self-harm, indicating a potential risk. While the individual is trying to cope, the presence of these urges elevates the severity beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 16:21:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Called 911, they're okay now. Scared me straight. Learn the signs, keep Narcan handy. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person who overdosed is now okay, the situation highlights the presence of a significant risk (overdose) and the potential for future occurrences. The advice to learn signs and keep Narcan available further reinforces this risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 16:20:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved their life, thank goodness. Makes you realize how easily it can happen. Learn the signs, carry naloxone if you can.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a potentially fatal overdose incident, highlighting the risk and ease with which it can occur.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 16:19:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. The urge to self-harm is strong. Trying to stay strong and remember why I stopped. Anyone else relate? Just feeling so alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating immediate risk. While the individual is attempting to resist, the intensity of the urge warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 16:18:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things aren't good at home. Constant put-downs, walking on eggshells... Is this normal? Feeling so lost. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional abuse (put-downs, walking on eggshells) which can have significant long-term psychological effects and may escalate. The feeling of being 'lost' also suggests a vulnerability that requires attention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 16:17:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Things have been really dark lately. Feeling overwhelmed and like I'm drowning. Reaching out because I don't know what else to do. Any advice or just someone to listen?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed, drowning, and darkness, indicating distress and a potential need for support. While not explicitly suicidal, the language suggests significant emotional pain and a cry for help.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 16:16:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy, and I'm not sure where to turn. Reaching out in case anyone has felt this way and has some advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but does not contain any explicit mentions or indicators of self-harm, suicide, violence, abuse, or overdose. It is a general expression of distress and a request for advice.",
    "detected_category": "other",
    "timestamp": "2026-01-26 16:15:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the bus stop. So scary. My hands are still shaking. Is there anywhere I can report this kind of thing anonymously? Worried someone got hurt bad.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A fight broke out, indicating potential for physical harm and escalation. The witness is visibly shaken, suggesting the event was significant.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 16:14:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost died last night. OD. Scared me straight. Narcan works, people. Get trained, carry it. It could save a life. Please be careful out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose (OD), indicating a severe and life-threatening situation. While the friend survived, the close call highlights the high potential for fatality.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 16:13:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is getting strong again. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, which indicates a potential risk. While the person has reached out for help, the intensity of the urge necessitates a 'medium' severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 15:22:28"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Scary how quickly things escalated. Shaking now. Is there anywhere safe to report something like that without getting involved? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight can be distressing and create a feeling of unsafety. The person is shaken and looking for ways to report the incident, indicating a potential concern for public safety.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 15:21:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just talking to someone would help. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and a desire for connection, suggesting emotional distress but not indicating immediate harm to self or others. While concerning, it lacks explicit mention of self-harm, suicide, or violence.",
    "detected_category": "other",
    "timestamp": "2026-01-26 15:20:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming I just want to feel *something* different. Scared myself last night. Anyone know good coping strategies that aren't... that? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feeling overwhelmed and a desire to feel \"something\" different, followed by scaring themselves. This suggests potential for impulsive behavior and a struggle with emotional regulation, raising concerns even without explicit suicidal ideation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 15:19:23"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a man hit his dog in the park today. It was quick, but I can't get it out of my head. Shaking. Anyone else ever witness something like that? What did you do? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing an act of animal abuse, causing emotional distress in the observer. While disturbing, it doesn't directly indicate immediate risk of harm to the user or others.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 15:18:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Scariest thing I've ever been through. Narcan saves lives. Please, learn how to use it. You could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose situation requiring Narcan, indicating a high risk event.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 15:17:20"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Makes me sick how quickly things escalate. Anyone else feel like the city's getting more aggressive lately? Feeling really uneasy.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and expressing general unease, but doesn't indicate imminent danger to the author or others, or direct involvement in violence. It's more of an observation and expression of feeling unsafe.",
    "detected_category": "other",
    "timestamp": "2026-01-26 15:16:18"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Walking on eggshells constantly. Is this normal? Feeling so alone. Anyone else been through this? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional distress, feelings of isolation, and a difficult home environment. The phrase \"walking on eggshells\" suggests potential conflict or tension. While not explicitly mentioning harm, the overall tone and content warrant a medium severity assessment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 15:15:17"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so heavy lately. Like there's no way out. Reaching out because I don't know what else to do. Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and being overwhelmed, suggesting a potential for harm. The statement \"Like there's no way out\" indicates a crisis, and seeking advice suggests a desire for help but also acknowledges being at a loss.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 15:14:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been feeling so isolated lately. Every little thing I do is wrong, apparently. Walking on eggshells constantly. Is this...normal in relationships? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests emotional distress and a potentially unhealthy relationship dynamic. While not explicitly stating suicidal ideation or abuse, the feelings of isolation, being constantly wrong, and 'walking on eggshells' raise concerns about the individual's well-being and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 15:13:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Things have been really dark lately. Feeling overwhelmed and just...empty. Reaching out because I don't know what else to do. Any advice or support would be appreciated.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of darkness, emptiness, and being overwhelmed, indicating emotional distress and a potential risk for escalation if not addressed. The user is reaching out for help, suggesting a level of awareness and a desire for support, but the depth of the negativity warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 14:23:30"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get jumped on my street last night. Shook me up bad. Called 911, but still...makes you wonder if it's ever gonna stop. Feeling helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault is a traumatic experience. While the text doesn't directly indicate ongoing danger to the speaker, the feelings of helplessness and fear, combined with the reported violence, suggest a medium level of concern for potential psychological distress and indirect exposure to violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 14:22:29"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. Remember to be kind to yourselves.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a strong urge to self-harm, indicating a potential risk. However, the individual has reached out for help, which suggests a willingness to engage in coping mechanisms and potentially mitigates the immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 14:21:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Terrifying. Narcan saved them, but it shook me up bad. Please, learn how to use it. It could save someone you know. #overdose #narcan #recovery",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a witnessed overdose event, which is a high-risk situation potentially leading to death. While Narcan was administered successfully, the event indicates a serious health and safety concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 14:20:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back and stronger than ever. Reached out to a friend, feels good to not be alone with this. Taking it one day at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions the return of strong urges, which suggests a potential for harm. Reaching out to a friend is a positive coping mechanism, but the presence of strong urges warrants a moderate level of concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 14:19:23"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm finally leaving. It's terrifying, but staying was worse. Years of walking on eggshells. Anyone else feel like they lost themselves completely?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a state of distress and fear coupled with a history of a harmful environment. While it doesn't explicitly mention self-harm or violence, the feeling of losing oneself and the terror associated with leaving a situation implies significant psychological distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 14:18:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, suggesting potential distress and a need for support. The metaphor of being 'underwater' implies a struggle to cope. Reaching out indicates a desire for help, which should be taken seriously.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 14:17:20"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Terrifying. Narcan saved their life, but it's a wake-up call. Learn the signs, carry Narcan. You could save someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan intervention was successful, the text describes an overdose event, indicating a serious health risk. The potential for future overdose events and the need for immediate intervention justify a medium severity rating.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 14:16:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, relapsed last night. Feeling so ashamed and like I'm back to square one. Reaching out to my therapist today. This is so hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse indicates a setback in recovery, potentially leading to increased vulnerability and mental distress. The shame and feeling of being back to square one can be demoralizing and increase the risk of negative coping mechanisms. Reaching out to a therapist is a positive step, but the overall situation suggests a need for monitoring.",
    "detected_category": "other",
    "timestamp": "2026-01-26 14:15:17"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. He's been isolating me from my friends lately. Has anyone else experienced this? Feeling lost and alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests potential social isolation and emotional distress, which could escalate to more serious risks if left unaddressed. While not explicitly stating harm, the isolation tactic is a common precursor in abusive relationships.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 14:14:16"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight outside my building. Shook me up. Makes you realize how easily things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused unease. While potentially disturbing, it doesn't indicate immediate danger to the poster or others, nor does it suggest plans for violence or harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 13:32:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thank god. Makes you realize how fragile life is. Anyone know where I can learn more about overdose prevention?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose was averted, the event indicates a potential ongoing risk of overdose in the area, and the observer expresses concern. The event also raises the possibility of second-hand trauma for the witness.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 13:31:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells lately. Is it normal to feel scared of someone you love? Starting to think this isn't healthy. Where do you even begin to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a fear of a loved one and questioning the healthiness of the relationship, suggesting potential abuse or a dangerous dynamic. The question about seeking help indicates a desire to change the situation, suggesting risk is present and acknowledged.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 13:30:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Constant put-downs are chipping away at me. Anyone else been through this? Feeling so lost and alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and feelings of isolation due to ongoing negative interactions. While it doesn't explicitly mention self-harm or suicidal ideation, the cumulative effect of 'constant put-downs' can escalate the risk over time.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 13:29:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Clean for a few weeks, then relapsed tonight. Feeling so ashamed. Reaching out to my therapist tomorrow. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety can increase risk-taking behavior. While the individual is seeking help from a therapist and expressing a desire to 'get through tonight,' the shame and potential for continued use create a moderate level of concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 13:28:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Please, if you're using, have someone with you and know the signs of an overdose. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose, indicating a high risk of death or serious harm.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 13:27:41"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight outside my kid's school. Shaken up. Makes you wonder what's going on at home for these kids. Anyone else seeing more aggression lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text doesn't suggest immediate or direct threat to safety. The concern is more general about increased aggression.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 13:26:39"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw two guys fighting outside my apartment last night. Scared the crap out of me. Called the cops, but still shaken. Anyone else ever deal with something like that? Just feeling really uneasy today.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the poster doesn't indicate direct threat or ongoing danger to themselves or others. They are experiencing emotional distress (unease) but have taken action (calling the police).",
    "detected_category": "violence",
    "timestamp": "2026-01-26 13:25:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. Walking on eggshells constantly. Is this normal in a relationship? Feels like I can't do anything right. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feelings of constant stress and a perceived inability to do anything right in a relationship. While not explicitly mentioning abuse or self-harm, the phrase \"walking on eggshells\" is often associated with emotionally abusive or controlling relationships, which can negatively impact mental health. The user is also seeking validation, suggesting they are distressed and unsure if their experience is normal.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 13:24:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Trying to remember my coping skills, but it's hard. Anyone else feel like they're fighting a losing battle sometimes? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse in urges and difficulty coping, suggesting a potential escalation of risk. The individual is reaching out for support, which is a positive sign, but the feeling of fighting a losing battle warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 13:23:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. It's been a while. Trying to stay strong and find healthy coping mechanisms. It's a daily struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges to self-harm (cutting), suggesting increased distress and potential for harm despite attempts to cope.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 12:26:26"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the bus stop. Scary stuff. Reminded me of when my brother and I used to go at it. Never solved anything, just made things worse. Wish we'd learned better ways to deal with anger.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While a fight occurred, the text describes it as past tense observation and reflection on sibling rivalry. There's no indication of imminent danger or escalation, just a description of a potentially scary situation and a desire for better conflict resolution skills.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 12:25:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so lost lately. Everything's just...heavy. Reaching out to a friend, hoping it helps. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but lacks specific details of self-harm or suicidal ideation. Seeking support is a positive sign.",
    "detected_category": "other",
    "timestamp": "2026-01-26 12:24:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just talking about it feels like a weight lifted. If you're struggling too, please reach out to someone. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and encourages seeking help, but doesn't indicate immediate plans or intent to harm oneself or others. It's a general expression of feeling low and a positive suggestion to reach out.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 12:23:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just talking about it feels impossible. Reaching out to a friend tomorrow. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feeling \"low\" and finds it difficult to talk about it. While they plan to reach out to a friend, the statement indicates potential emotional distress requiring monitoring.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 12:22:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Things got dark again last night. Day 1 of trying to stay clean. Anyone else relate? Just feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions feeling overwhelmed, 'dark again,' and alone while starting a clean streak, suggesting potential relapse risk and emotional distress.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 12:21:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan worked, thank god. Please, if you're using, carry it. And tell someone. I’m still shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event that can cause significant distress and potential for vicarious trauma. The text highlights the risk associated with drug use and the importance of harm reduction measures.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 12:20:17"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough lately. Walking on eggshells constantly. Is it normal to feel this anxious around someone you love? Starting to wonder if this is more than just a 'bad patch'.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially unhealthy relationship dynamic characterized by anxiety and uncertainty, raising concerns about emotional or psychological abuse.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 12:19:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm drowning and no one can see me. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost, with a sense of hopelessness and isolation ('drowning and no one can see me'). Reaching out indicates a desire for help, suggesting a potential risk that could escalate without intervention.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 12:18:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, walking on eggshells... Anyone else feel like they're losing themselves? Need to figure out how to get out of this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive home environment with emotional distress. While no explicit threats are made, the feeling of 'losing themselves' and the need to 'get out of this' suggests a significant negative impact on mental well-being. The situation warrants concern and potential intervention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 12:17:13"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing loudly on the street corner. It escalated so fast. Made me think of my sister, she's dealing with similar stuff. Anyone know resources for domestic disputes? Scared for her.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially escalating domestic dispute situation, where the poster expresses fear for their sister. While there's no explicit mention of violence or harm, the rapid escalation of the argument and the sister's situation suggest a risk of harm that warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 11:19:24"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shaken up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing the author to feel shaken and on edge. While concerning, it doesn't indicate direct involvement, intent to harm, or a specific plan. It primarily expresses fear and anxiety.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 11:18:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. If anyone has felt this way and found something that helped, please share.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a desire for help, indicating distress. While it doesn't explicitly mention self-harm or suicide, the phrase \"dark cloud won't lift\" and reaching out for help suggest a significant level of emotional pain and potential vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 11:17:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Things got really dark last night, and I hurt myself. I'm safe now, but I know I need help. Where do I even start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly states the person hurt themselves, indicating an act of self-harm and a potential risk of repeated or escalated behavior.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 11:16:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are back and stronger than ever. Reached out to a friend, hoping it helps. Just trying to take it one day at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of strong urges, which could lead to self-harm or other negative outcomes. Reaching out to a friend is a positive step, but the strength of the urges elevates the risk beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 11:15:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, coupled with a plea for help. This suggests emotional distress and potential vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 11:14:16"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want the pain to stop. Talking to a friend helped last time, but I feel so ashamed even bringing it up again. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire for pain to stop, which is a significant risk factor for suicidal ideation. While the individual mentions a past coping mechanism (talking to a friend), the shame associated with seeking help again suggests a decreased willingness to engage in protective factors. The question 'Anyone else ever feel this way?' could be a cry for help or validation of their feelings.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 11:13:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He says he's sorry after, but the yelling is escalating. I don't know what to do anymore. Is this normal? Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates escalating yelling, which suggests a potential for physical or emotional abuse. The writer expresses distress and uncertainty, indicating a possible crisis.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 11:12:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough. Constant put-downs, controlling behavior. I feel trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, suggesting emotional abuse and a feeling of being trapped. While it doesn't explicitly mention physical violence, the emotional distress warrants a medium severity rating due to the potential for escalation and mental health consequences.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 11:11:11"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight downtown last night. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling, but doesn't indicate immediate danger or direct involvement for the author or others. The expressed feeling of being 'on edge' suggests anxiety but not necessarily intent to harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 11:10:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It helps. If you're struggling too, please don't go through it alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, implying a potential risk of self-harm or suicide. The person is seeking help from a friend, which is a positive sign, but the presence of urges elevates the risk beyond 'low'.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 10:21:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "I'm having a really hard time lately. Feeling so overwhelmed and like I'm drowning. Just reaching out... has anyone else felt this way? Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and drowning, which could indicate a mental health crisis. While not explicitly suicidal, the feelings expressed warrant concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 10:20:17"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Things have been rough at home lately. Feeling so isolated and scared. Is there anyone else who understands what it's like to feel trapped like this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of isolation, fear, and being trapped, suggesting potential emotional distress and a need for support. While not explicitly mentioning self-harm or suicide, the intensity of these feelings warrants concern.",
    "detected_category": "other",
    "timestamp": "2026-01-26 10:19:15"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Scary how fast things escalated. Makes you think about de-escalation tactics... Anyone know any good resources?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text mentions witnessing a fight, but doesn't indicate direct involvement or imminent threat to the poster or others. It expresses concern and interest in de-escalation, suggesting a desire to avoid violence rather than incite it.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 10:18:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... feels isolating. Anyone else been through this? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, which can lead to significant psychological distress and potentially escalate to other forms of abuse or mental health crises. The feeling of isolation also raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 10:17:12"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Dude got sucker punched, just like that. Shaken up. Makes you realize how quickly things can escalate. Anyone else ever witness something like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence can be upsetting, but the text doesn't indicate ongoing danger or imminent threat to the speaker or others. It's a report of a past event.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 10:16:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... Feeling lost. Anyone else been through this? How did you find support?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, suggesting an abusive environment. The individual also expresses feeling 'lost,' indicating potential emotional distress and vulnerability. While there's no explicit mention of physical violence, self-harm, or suicide, the situation warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 10:15:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before it gets too dark. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, with a concerning phrase 'before it gets too dark,' hinting at escalating distress and a need for help before a potential crisis.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 10:14:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... getting worse. I feel trapped. Has anyone else ever felt like they're walking on eggshells all the time? I just want it to stop.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of being trapped and constantly walking on eggshells, suggesting a potentially harmful situation at home. While not explicitly stating self-harm or suicidal ideation, the desire for it to stop raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 10:13:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough week. Urges are strong. Reached out to a friend, gonna try distracting myself. It's exhausting, but I'm trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and exhaustion, suggesting a potential risk of self-harm or suicidal ideation. While the individual is reaching out for help, the intensity of the urges elevates the risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 10:12:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling really overwhelmed lately. Old habits are creeping back in. Anyone know some good distraction techniques that actually work? Need to find something to pull me out of this.\n\n**Option 2 (Sharing a Personal Story):**\n\n> Made it 3 weeks clean. Small victory, but it feels huge. Still have bad days, but I'm trying. One step at a time, right?\n\n**Option 3 (Raising Awareness):**\n\n> Just a reminder that self-harm isn't always about suicide. Sometimes it's about coping. Doesn't make it okay, but it deserves understanding, not judgement.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses feeling overwhelmed, old habits creeping back, and mentions self-harm as a coping mechanism. While not explicitly suicidal, it indicates a vulnerability and potential risk for self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 09:26:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Didn't cope well. Reaching out for help today. Anyone else been there? Just feeling really alone right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of overwhelm, poor coping, and loneliness which are risk factors. Seeking help is a positive sign, but the intensity of the negative feelings warrants a medium severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 09:25:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Trying hard to resist, reaching out instead. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses active urges to self-harm (cutting), indicating a risk that requires attention. While the individual is reaching out for support, the presence of the urge elevates the severity beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 09:24:13"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it gets so loud in my head. Scratched my arm again last night. Feels awful admitting it, but I just needed the noise to stop. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes self-harm (scratching arm) and expresses a need to stop internal noise, indicating a potential for escalation if coping mechanisms are insufficient.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 09:23:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are back, and I feel so ashamed. Reached out to a helpline, hoping it helps this time. Just need to make it through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges and feelings of shame, suggesting a potential for self-harm or suicidal ideation. The individual is seeking help, but the immediate concern is making it through the night.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 09:22:10"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Not sure what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, suggesting possible distress and a need for support. The metaphor 'underwater' can indicate feeling suffocated or unable to cope. While not explicitly suicidal, the uncertainty ('Not sure what to do') warrants attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 09:21:09"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, isolating me from friends... feels like I'm walking on eggshells. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, which can escalate to more serious harm over time. The phrase \"walking on eggshells\" indicates a stressful and potentially volatile environment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 09:20:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just need to vent. Constant put-downs disguised as \"jokes\" are wearing me down. Makes me feel so small. Anyone else deal with this? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses emotional distress and feelings of being belittled due to ongoing negative interactions, but doesn't indicate immediate danger or specific plans for self-harm, suicide, or violence.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 09:19:06"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing loudly on the street. Escalated quick. He shoved her. I froze. Wish I'd done something. Feeling sick about it. Anyone else ever witness something like that? What do you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence (shoving) occurred, indicating potential for further harm and escalation. The witness is also showing signs of distress, though not directly threatened.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 09:18:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside the deli. Froze. Someone called the cops, I think. Still shaking. What do you even DO in that situation? Feel so useless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing domestic violence implies a risk of serious physical and psychological harm to the victim. While the text doesn't indicate immediate danger to the original poster, the violence itself is a high-severity event.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 09:17:03"
  }
]