[
  {
    "title": "User Story: Overdose",
    "content": "My cousin almost didn't make it last night. OD. Scariest hours of my life. Please, if you're struggling, reach out. There are people who care. Don't let shame silence you.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose (OD) event, implying a high risk to the individual who overdosed. The phrase \"almost didn't make it\" indicates a near-fatal situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-31 04:31:08"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up bad. Reminded me of my brother... Anyone else deal with lingering anxiety after witnessing violence? Feels like it's stuck with me.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes anxiety and emotional distress after witnessing a fight, but does not indicate imminent danger to self or others. It's a report of a past event and current emotional state.",
    "detected_category": "other",
    "timestamp": "2025-12-31 04:30:06"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend on the street. Froze. Someone called the cops, but I feel sick. Is there anything else I could have done? Scared to get involved but can't just stand by next time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence and the potential for escalation indicate a moderate risk level. While the immediate threat may be mitigated by the police being called, the emotional impact and potential for future similar events raise concerns.",
    "detected_category": "violence",
    "timestamp": "2025-12-31 04:29:05"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been...rough. Constant put-downs, controlling behavior. Feeling so isolated. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional and psychological abuse (put-downs, controlling behavior, isolation). While not explicitly stating physical harm, the situation described increases the risk of mental health deterioration and potential escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-31 04:28:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scary stuff. Please, if you're struggling, reach out. There's help available. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates potential exposure to dangerous substances and a risk of similar events, compounded by the plea for help which suggests a broader struggle within a network.",
    "detected_category": "overdose",
    "timestamp": "2025-12-31 04:27:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my kid's school. So messed up. Makes me sick how normalized this is becoming. Anyone else feel this way? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the original poster isn't directly involved in the violence, the observation of a fight outside a school, coupled with feelings of helplessness and concern about normalization, indicates a potentially escalating situation and distress. The mention of it being 'messed up' and 'sick' suggests emotional impact and potential anxiety about safety in the community. It warrants monitoring.",
    "detected_category": "violence",
    "timestamp": "2025-12-31 04:26:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Expresses a strong urge to self-harm and feelings of being overwhelmed, indicating immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-31 04:24:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary how quickly things escalated. My hands are still shaking. Anyone else feel on edge lately? What helps?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling shaken up, indicating distress but not direct involvement or threat. No specific risk factors are mentioned.",
    "detected_category": "violence",
    "timestamp": "2025-12-31 04:23:57"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Woke up feeling anxious again. Still trying to process everything that happened. Is it even abuse if it wasn't physical? Feeling so lost and confused.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses anxiety and confusion about a potentially abusive situation, which can escalate into more serious mental health issues if unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-31 04:22:55"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his partner on the street today. Shook me up. Didn't know what to do, just kept walking. Wish I'd said something. Anyone else ever freeze like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the text describes an act of violence (shoving), it is a single incident reported without ongoing threat or escalation. The observer expresses feeling shaken but unharmed. The risk is primarily related to the observed violence impacting the individual's emotional state.",
    "detected_category": "violence",
    "timestamp": "2025-12-31 04:21:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Called 911, thankfully they made it. Please, if you're struggling, reach out. There's help out there. Don't be afraid.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Direct report of a potentially fatal overdose incident, requiring emergency medical intervention. Highlights immediate danger and potential for recurrence.",
    "detected_category": "overdose",
    "timestamp": "2025-12-31 03:46:49"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his car mirror after getting cut off. Scary how quickly things escalate. Makes you wonder what's going on in his life. Hope he's okay, and no one gets hurt.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes an isolated incident of anger and property damage (punching a car mirror). While potentially indicating underlying issues, it doesn't suggest imminent or severe danger to the individual or others. There is a suggestion it could 'escalate', so it's not 'none', but there's no current critical risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-31 03:45:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Two guys, looked like it escalated fast. Shook me up bad. Makes you realize how quickly things can turn. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be upsetting, but the text doesn't indicate direct threat or ongoing danger to the poster or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-31 03:44:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them. Please, if you're using, carry it. It's free at most pharmacies. Know the signs. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent and direct experience of a potentially fatal overdose, indicating a high level of immediate risk for individuals using drugs.",
    "detected_category": "overdose",
    "timestamp": "2025-12-31 03:43:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just feeling really lost lately. Things at home are...tough. Walking on eggshells all the time. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Indicates emotional distress and a difficult home environment, suggesting potential for escalation if unresolved.",
    "detected_category": "abuse",
    "timestamp": "2025-12-31 03:42:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately. Like nothing matters. Reaching out because I know I need to. Talking to a friend tonight, hoping it helps.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 73 (char 98)",
    "detected_category": "unknown",
    "timestamp": "2025-12-31 03:41:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scared me senseless. Narcan worked, thank god. We need more access to it & better mental health support. This is getting out of control.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose indicates a serious and potentially life-threatening situation. While Narcan was effective, the incident highlights a significant risk to individuals and a wider public health concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-31 03:40:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post addressing suicidal feelings, aimed at sounding authentic and encouraging help-seeking:\n\n\"Been feeling so incredibly low lately, like I'm drowning. It's hard to see any way out. Talking to someone feels impossible, but I know I need to. Anyone else feel this way?\"\n\n**Important Considerations:**\n\n*   **Brevity:** It's short, fitting within character limits.\n*   **Authenticity:** It uses simple language and expresses relatable feelings of hopelessness and isolation.\n*   **Help-Seeking:** It acknowledges the difficulty of reaching out but emphasizes the need for it and invites connection.\n*   **Safety:** It avoids any graphic details or specific methods.\n*   **Ethical:** While realistic, it's framed to encourage positive action (talking to someone).\n\n**Disclaimer:** I am an AI and cannot provide mental health support. If you or someone you know is struggling with suicidal thoughts, please reach out to a crisis hotline or mental health professional.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses suicidal feelings (hopelessness, feeling like drowning, difficulty seeing a way out), indicating a risk of suicide. While it avoids specific methods and encourages help-seeking, the expression of suicidal ideation elevates the severity beyond 'low'.",
    "detected_category": "suicide",
    "timestamp": "2025-12-31 03:39:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Narcan saved their life. Please, learn the signs of OD and carry it. You could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event requiring Narcan, indicating a significant immediate threat to life.",
    "detected_category": "overdose",
    "timestamp": "2025-12-31 03:38:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up. Makes you realize how quickly things can escalate. Anyone else ever witness something like that? Still processing.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault resulting in unconsciousness suggests a potential for serious injury and psychological distress in the victim and the observer.",
    "detected_category": "violence",
    "timestamp": "2025-12-31 03:37:33"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling so overwhelmed lately. Reaching out to a friend tonight. Just need someone to listen, you know?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates distress and a need for support, but there are no explicit statements of self-harm, suicidal ideation, violence, abuse, or overdose. The individual is reaching out for help, which is a positive coping mechanism.",
    "detected_category": "other",
    "timestamp": "2025-12-31 02:54:39"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming. Feeling like I just need to feel *something* different, even if it hurts. Trying to find healthier ways to cope. Anyone else relate? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to feel 'something' even if it hurts, which could indicate self-harm. The user is also seeking healthier coping mechanisms, suggesting awareness of unhealthy ones.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-31 02:53:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "**(Option 1: Seeking Help)**\n\n> Feeling so lost lately. Things keep piling up, and I don't know where to turn. Anyone else ever feel this way? Could use some advice.\n\n**(Option 2: Sharing a Past Experience)**\n\n> Years ago, I was in a really dark place. It gets better. Please believe me. Reach out if you're struggling. There's help available.\n\n**(Option 3: Expressing Concern for a Friend)**\n\n> My friend's been really withdrawn. I'm worried about them. What's the best way to show support without making things worse?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "All options suggest potential underlying distress or concern for others, implying a need for support. While there's no explicit mention of self-harm or suicide, the 'dark place' reference in Option 2 and the friend's withdrawal in Option 3 raise concerns warranting a 'medium' severity.",
    "detected_category": "other",
    "timestamp": "2025-12-31 02:52:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD downtown. Scary stuff. Narcan worked, thank god. Makes you realize how fragile life is. Anyone else feel helpless sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be traumatizing and may trigger feelings of helplessness and anxiety. While the person survived, the event indicates a potential crisis situation and potential need for support.",
    "detected_category": "overdose",
    "timestamp": "2025-12-31 02:51:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, heaviness, and not knowing what else to do, suggesting emotional distress and a potential need for support. The act of reaching out indicates a willingness to engage and potentially mitigate risk, but the depth of distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-31 02:50:33"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up yesterday. OD is real, and scary. Please, if you're struggling, reach out. There are people who care and want to help. Don't let fear stop you.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text mentions an overdose (OD) incident where the person almost didn't wake up, indicating a life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-31 02:49:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to hide the bruises. Said I was clumsy. I don't know what to do anymore. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 50 (char 73)",
    "detected_category": "unknown",
    "timestamp": "2025-12-31 02:48:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not explicitly mention self-harm, suicide, violence, abuse, or overdose. It's a general expression of distress and a request for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-31 02:47:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. The urge to self-harm is strong. Reached out to a friend, but it's still tough. Anyone else ever feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, which indicates a potential for immediate risk. While the person has reached out for help, the struggle persists, suggesting that the protective factors may not be sufficient to mitigate the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-31 02:46:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Talking to my therapist tomorrow, but it's hard to get through tonight. Anyone else relate? Just feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of being overwhelmed and alone, suggesting a potential escalation of distress. While the individual is seeking help (talking to a therapist), the immediacy of the struggle ('hard to get through tonight') raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-31 02:45:26"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Constant put-downs, controlling behavior... I feel so small. Anyone else been through this? How did you find the strength to leave?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, indicating a potentially harmful situation. While not explicitly stating physical harm, the consistent negativity and feeling 'small' suggest a risk to the individual's mental and emotional well-being, potentially escalating over time.",
    "detected_category": "abuse",
    "timestamp": "2025-12-31 01:46:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Froze. Should I have done something? Feel sick about it. What can you even DO?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can cause significant distress and potential for escalation. While the reporter is not the victim, the incident itself represents a risk of harm to the partner and the reporter's distress could escalate if they feel inactionable.",
    "detected_category": "violence",
    "timestamp": "2025-12-31 01:45:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "> Feeling so lost. Things escalated again last night. I don't know what to do anymore. Is there anyone else who understands this? #abuse #domesticviolence #help",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a recent escalation of abuse and feelings of helplessness. While there's no explicit mention of self-harm or suicidal ideation, the context of domestic violence and feeling 'lost' suggests a potential for harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-31 01:44:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Called 911, they're okay now. Learn the signs, please. Naloxone saves lives. Be safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the person is now okay, indicates potential for future incidents and highlights the presence of a dangerous situation. The call for awareness and naloxone use reinforces the existing risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-31 01:43:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Scariest moment of my life. Narcan saved them. Please, learn the signs of an overdose. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a life-threatening overdose situation where the individual almost died, indicating a high level of risk and potential for fatality.",
    "detected_category": "overdose",
    "timestamp": "2025-12-31 01:42:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just want to feel okay again. Reaching out in case anyone else gets it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and loneliness but does not contain any explicit threats or plans for self-harm or harm to others. It's a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-31 01:41:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, with an implicit cry for help. The 'underwater' metaphor suggests potential for feeling overwhelmed and unable to cope, indicating some distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-31 01:40:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...not good. Walking on eggshells all the time. Anyone else feel like they're losing themselves? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 87 (char 112)",
    "detected_category": "unknown",
    "timestamp": "2025-12-31 01:39:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I hate it. Reached out to a friend, hoping it helps. Just taking it one day at a time. 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential escalation of distress. While the individual is seeking support from a friend, the presence of urges warrants a moderate level of concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-31 01:38:42"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street. He shoved her, hard. Made me freeze up. Wish I'd said something, anything. Feeling sick about it now. Anyone else ever feel like this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a physical altercation involving a potential act of violence (shoving). The mention of 'shoved her, hard' suggests a level of force that could cause injury. The witness expresses distress and regret, indicating a potentially harmful situation.",
    "detected_category": "violence",
    "timestamp": "2025-12-31 01:37:40"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Two guys just going at it. Scared me half to death. Makes you wonder what's going on with people, you know?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessed a fight, expressing fear. No specific threats or indications of ongoing danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-31 00:47:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Narcan saved him. Please, learn the signs of an overdose. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event averted by Narcan, indicating a severe and immediate risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-31 00:46:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud is constantly over me. Reaching out because I know I need to. Talking to a therapist tomorrow. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of persistent sadness and acknowledges needing help, indicated by reaching out and scheduling a therapy appointment. While they are not explicitly expressing suicidal ideation, the feelings of being constantly under a 'dark cloud' and feeling 'so low' warrants a medium severity rating as these feelings are often precursor signals.",
    "detected_category": "suicide",
    "timestamp": "2025-12-31 00:45:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just... heavy. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating potential emotional distress and a need for support. While not explicitly suicidal, the language suggests vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-31 00:44:18"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Some guy sucker punched another, out cold. Shaken up. Is there anywhere to report this anonymously? Felt so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A violent assault resulting in unconsciousness occurred. While the text doesn't indicate ongoing immediate danger, the severity of the assault and potential for further escalation or injury justify a 'medium' rating.",
    "detected_category": "violence",
    "timestamp": "2025-12-31 00:43:17"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Scary how quickly things escalated. Makes you think, you know? Stay safe out there, everyone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text mentions witnessing a fight, suggesting a potential risk of violence in the area. However, it's a second-hand account and doesn't indicate imminent danger to the user themselves, or any specific targets.",
    "detected_category": "violence",
    "timestamp": "2025-12-31 00:42:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "I feel so lost. It's been happening for so long, I don't even know what's normal anymore. Is this really how relationships are supposed to be? Feeling so small.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and diminished within a relationship, suggesting potential emotional distress and vulnerability. While not explicitly stating self-harm or suicidal ideation, the prolonged feeling of being 'small' can be indicative of a deteriorating mental state requiring attention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-31 00:41:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Been feeling so low lately. The urge to cut is strong. Trying to fight it, but it's hard. Anyone else get this? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses suicidal ideation (urge to cut) and indicates the individual is struggling to cope. While there's no explicit plan, the intensity of the urge and difficulty in fighting it raise the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-31 00:40:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back and stronger. Reached out to a friend, but it's still tough. Anyone else feel this way? Just trying to get through the day.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with strong urges, suggesting a potential for self-harm or relapse. While the person has reached out for help, they are still finding it difficult to cope, indicating an elevated risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-31 00:39:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw another post about overdose. Feels way too close to home. Lost my cousin last year. Please, if you're struggling, reach out. There's help available. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post expresses concern about overdoses and mentions the loss of a cousin, indicating a potential risk of overdose for someone connected to the poster. While not directly expressing suicidal ideation, the context and the mention of 'becoming a statistic' suggest a degree of vulnerability and the potential for harm if the issue is not addressed.",
    "detected_category": "overdose",
    "timestamp": "2025-12-31 00:38:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Talking helps, right? Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and a desire to connect with others, but does not contain specific threats or plans for self-harm.",
    "detected_category": "other",
    "timestamp": "2025-12-30 23:17:24"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need help. Any advice on finding affordable therapy? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 75 (char 100)",
    "detected_category": "unknown",
    "timestamp": "2025-12-30 23:16:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about the rise in ODs is scary. Lost a friend last year. Please, if you're struggling, reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about overdose deaths and acknowledges personal loss, suggesting a potential for distress and risk in the reader or someone they know. While not explicitly mentioning intention, the context implies a heightened vulnerability to overdose risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 23:15:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Just trying to get through the day without giving in. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges, suggesting a potential struggle with a pre-existing condition (possibly self-harm or substance abuse). While the person is trying to cope, the return of urges elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 23:14:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Trying to stay strong and remember why I stopped. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges to self-harm (cutting), which suggests a potential for harm. While the individual expresses a desire to resist these urges, the presence of the urge itself elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 23:13:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. The urge to self-harm is strong. Trying to distract myself but it's hard. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating a risk. While not explicitly stating intent or a plan, the intensity of the urge elevates the risk level beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 23:12:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Glad they're okay, but it shook me. Narcan saves lives. Learn how to use it. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential risk of further overdoses in the area and highlights the presence of a dangerous situation requiring intervention, even though the individual survived.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 23:11:15"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Makes you realize how quickly things can escalate. Anyone else feel like anger is just simmering everywhere lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't indicate imminent danger to the author or others. The text expresses concern about general societal anger, not a specific threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 23:10:14"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed ('lost', 'underwater', 'don't know what else to do'). While not explicitly suicidal, the desperation suggests a potential risk that warrants further attention and support.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 23:09:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Reached out to a friend, just talking helps. Remember you're not alone. 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which could be interpreted as self-harm or suicidal ideation. The individual is actively seeking help, which mitigates the risk to some extent, but the presence of urges necessitates a 'medium' severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 23:08:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. Narcan worked, thank God. But it's a wake-up call. We gotta look out for each other. Learn the signs, carry Narcan. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event indicating the presence of a serious risk, although the immediate danger was averted. The call to action suggests a broader issue within the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 22:17:24"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Just reaching out... has anyone else felt this way? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and being lost, but lacks specific indicators of immediate harm or suicidal intent. It appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-30 22:16:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like a dark cloud won't lift. Reaching out because I know I need to talk to someone. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a need to talk to someone, suggesting potential mental health distress. While it doesn't explicitly mention self-harm or suicidal ideation, the feeling of a persistent 'dark cloud' warrants a 'medium' severity due to potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 22:15:21"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Constant put-downs & control... feels isolating. Anyone else been through this? Just need to know I'm not alone & maybe find some resources.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes experiencing constant put-downs and control, which suggests emotional abuse and isolation. While not explicitly stating physical harm or suicidal ideation, the feelings of isolation and being in a controlling environment warrant concern and indicate potential escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 22:14:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor being taken away in an ambulance last night. OD. Scared. We need to talk about this more, it's hitting too close to home lately. Anyone know resources?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 57 (char 82)",
    "detected_category": "unknown",
    "timestamp": "2025-12-30 22:13:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so low lately. Relapsed after 6 months clean. Just reaching out... anyone else been there? It's so hard to stop.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety is a risk factor for negative outcomes. Expressing difficulty in stopping suggests a lack of control and potential escalation of substance use. While not explicitly suicidal, the low mood and relapse create a vulnerable state.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 22:12:16"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on my street last night. Shook me up. Made me realize how close it all is, you know? Anyone else feel like things are getting more volatile lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate imminent danger or direct involvement. It expresses a feeling of increased volatility, but without specific threats or intentions.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 22:11:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Relapsed after 6 months clean. Feels like square one. Reaching out to my therapist tomorrow. Just needed to tell someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety can be a trigger for negative emotions and potentially lead to risky behaviors. Seeking therapy is positive, but the immediate aftermath of a relapse requires monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 22:10:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good lately. Walking on eggshells constantly. Is this normal? Feeling trapped. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a potentially unsafe home environment and feelings of being trapped, indicating emotional distress and possible abuse or controlling behavior. The phrase 'walking on eggshells' is often associated with volatile or unpredictable situations.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 22:09:12"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get punched outside the bar last night. Shook me up. Is it just me, or is everyone on edge lately? Makes you think...\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text doesn't indicate ongoing or escalating violence directly involving the speaker. It expresses concern and reflection rather than immediate danger or threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 22:08:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Finally left. Terrified but free. Years of walking on eggshells... Anyone else feel like they're still waiting for the other shoe to drop, even after they're out? Just trying to breathe.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and anxiety, suggesting a history of abuse or a threatening situation. The phrase \"walking on eggshells\" and \"waiting for the other shoe to drop\" indicate ongoing psychological distress and potential vulnerability, even after leaving a dangerous situation. While not explicitly stating imminent danger, the level of fear warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 21:17:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good lately. Walking on eggshells constantly. Anyone else ever feel this way? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The phrase \"walking on eggshells\" suggests a tense and potentially volatile home environment. While not explicitly stating abuse or violence, it indicates significant emotional distress and potential for escalation. The plea for reassurance also points to feeling isolated and vulnerable.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 21:16:49"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. My neighbor's yelling again. It's been escalating for weeks, and last night I heard glass breaking. Don't know what to do. Should I call someone?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Escalating yelling, possible property damage (breaking glass), and the reporter expresses fear, suggesting a potential risk of violence or abuse impacting the reporter and/or others nearby.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 21:15:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been...not good. Walking on eggshells all the time. I feel so isolated. Anyone else been through this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling isolated and experiencing a difficult home situation, suggesting emotional distress and potential risk of escalation. The phrase 'walking on eggshells' indicates a potentially volatile or abusive environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 21:14:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to feel *anything* is to hurt. I know it's not good, but the urge is so strong. Talking to someone feels impossible. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm as a means of feeling, and a feeling of isolation/inability to seek help. This indicates a serious risk of potential self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 21:13:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so numb lately, like I'm watching my life from behind glass. Reaching out because I know I need to talk to someone. Any advice on finding a good therapist?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feeling numb and detached, indicating emotional distress. While not explicitly suicidal or self-harming, the statement suggests a significant decline in mental well-being and a proactive search for help, warranting concern.",
    "detected_category": "other",
    "timestamp": "2025-12-30 21:12:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "**(Option 1: Seeking Help)**\n\n> Feeling so lost lately. Everything's just...heavy. Talking to someone feels impossible, but I know I need to. Any advice on where to start?\n\n**(Option 2: Sharing a Personal Story)**\n\n> Been there. The dark place. It DOES get better. It took time, therapy, and meds, but I'm here. Reach out. You're not alone.\n\n**(Option 3: Raising Awareness)**\n\n> Check in on your friends. Seriously. You never know what someone's going through. A simple \"how are you?\" can make a difference.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and heavy, but it also demonstrates a desire to seek help and acknowledges the need for support. While there's negativity, the active seeking of advice suggests a level of self-preservation and a willingness to improve the situation. The personal story offers hope and encourages reaching out, and the awareness message promotes general well-being. No direct threats or plans for harm are present.",
    "detected_category": "other",
    "timestamp": "2025-12-30 21:11:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just talking about it feels like a weight lifted. If you're struggling too, please reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being low, but focuses on seeking help and offering support to others. It does not contain explicit suicidal ideation, plans, or intent.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 21:10:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Just want to disappear. Talking to a therapist tomorrow, hoping it helps. It's hard to keep going sometimes.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of heaviness, wanting to disappear, and difficulty in continuing. While actively seeking help, the presence of suicidal ideation (wanting to disappear) elevates the risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 21:09:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling so drained and empty. Reaching out because I know I need to talk to someone. Any advice on finding affordable therapy?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being drained and empty, indicating potential depression. The explicit request for affordable therapy suggests awareness of needing help, but also a possible barrier to accessing it. While not explicitly suicidal, the language and help-seeking behavior warrant concern.",
    "detected_category": "other",
    "timestamp": "2025-12-30 21:08:36"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Some guy just started wailing on another. Makes you wonder what's going on in people's heads. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault implies potential for physical harm to the victim and bystanders. The mention of feeling \"on edge\" suggests a heightened state of anxiety and potential for further escalation of violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 20:18:56"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on my street last night. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing unease, but doesn't indicate direct involvement, threats, or immediate danger to the author or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 20:17:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough night. The urge to cut was so strong. Distracted myself with music. It helped, but I feel drained. Anyone else get through it like this? Need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text explicitly mentions a strong urge to self-harm (cutting). While the individual engaged in a coping mechanism, the presence of the urge indicates a significant risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 20:16:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just realized manipulation IS abuse. Always thought it was just 'being difficult.' Feels like the rug's been pulled. Anyone else gone through this? How did you start to heal?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses realization of past abuse (manipulation). While impactful, it focuses on understanding and healing rather than current danger. No immediate safety risk is apparent.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 20:15:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm underwater. Reaching out because I don't know what else to do. Any advice or just someone to listen?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The statement expresses feelings of deep sadness and hopelessness ('underwater,' 'don't know what else to do'), indicating potential distress. While it doesn't explicitly mention self-harm or suicide, the severity warrants a medium rating due to the potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 20:14:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out before things get worse. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed with a proactive statement to seek help before things worsen. This suggests a potential for escalation if support is not received.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 20:13:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. Feeling the urge to self-harm creeping up. Trying to distract myself, but it's hard. Anyone else been there? How do you cope? Just need to know I'm not alone rn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a current urge to self-harm, indicating an elevated risk. While the individual is attempting distraction, the presence of the urge necessitates a medium severity rating. The request for coping mechanisms also suggests a need for support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 20:12:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n>  Relapsed. Feeling so ashamed and alone. Reaching out for help again. Anyone know any good online resources?\n\n**Option 2 (Sharing Experience):**\n\n>  Clean for 3 months. Some days are still so hard. Just gotta keep reminding myself how far I've come.\n\n**Option 3 (Raising Awareness):**\n\n>  It's not attention-seeking, it's a sign of pain. Let's be kinder and more understanding to those struggling.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates a relapse, which is a vulnerable state and requires immediate support. While not explicitly suicidal, relapse significantly increases the risk of negative outcomes.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 20:11:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is back. It's like a really bad friend I can't shake. Trying to stay strong and reach out instead. Any tips for coping?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the return of urges to self-harm, which represents a potential risk. While the individual is actively trying to cope and reach out, the presence of the urge elevates the severity beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 20:10:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n\"Feeling so lost lately. Everything feels heavy. Anyone know of good resources for when you just need to talk?\"\n\n**Option 2 (Personal Story - vague, focusing on hope):**\n\n\"Been in a dark place, ngl. Slowly climbing out. Small wins matter. Grateful for the people who stuck around.\"\n\n**Option 3 (Raising Awareness):**\n\n\"Just a reminder to check in on your friends, even the ones who seem okay. You never know what someone's going through.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of being lost, overwhelmed, and being in a 'dark place'. While not explicitly suicidal, it suggests a potential mental health crisis and a need for support. The vague reference to a 'dark place' warrants a medium severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 20:09:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nSaw someone OD today. Scariest thing ever. Narcan saved them, thank god. If you or someone you know is struggling, please reach out. There's help available. Don't be afraid.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a critical safety event indicating immediate danger and potential for fatalities. The use of Narcan confirms the severity of the overdose.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 19:16:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Remember we're not alone in this. There are resources out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant and immediate risk to the individual's safety. While the person reached out to a friend, the presence of strong urges warrants high severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 19:15:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his car mirror after a bad call. Reminded me of my dad. Anyone else grow up with that kinda anger around? Makes you jumpy forever.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes an isolated incident of property damage and reflects on past experiences with anger. While it mentions anger, it does not indicate imminent harm to self or others.",
    "detected_category": "other",
    "timestamp": "2025-12-30 19:14:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Felt so overwhelmed last night. Used my coping mechanisms, even the unhealthy ones. Day 1 of trying to find better ways. This sucks.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Mentions using unhealthy coping mechanisms but expresses a desire to find better ways, suggesting a move towards healthier behavior. No explicit mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2025-12-30 19:13:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw another post about overdose. Scares me so much. Lost a friend last year. If you're struggling, please reach out. There are people who care and want to help you get better. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a past overdose death and expresses fear, indicating potential vulnerability to overdose or related mental health struggles in the broader community. While not directly threatening, it highlights a significant risk and encourages help-seeking.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 19:12:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so numb lately, then the urge hits. Scared I'm slipping back. Talking to my therapist tomorrow, but tonight feels rough. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which the author fears and describes as 'rough.' The feeling of numbness followed by urges suggests a potential risk of self-harm or suicidal ideation. Seeking therapy is a positive step, but the current state of distress warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 19:11:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. The yelling, the put-downs... feels like it's chipping away at me. Anyone else feel this lost? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, potential abuse (yelling, put-downs), and feelings of isolation. While not explicitly stating intent, the chipping away feeling and asking if others feel lost suggests a potential decline in mental well-being and warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 19:10:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Still trying to process everything. He said he loved me, but the yelling... the constant put-downs... Is this normal? Feeling so lost and confused.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse (yelling, put-downs) within a relationship, which can escalate. While not explicitly stating immediate physical danger, the confusion and distress are concerning and require further investigation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 19:09:48"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a violent altercation resulting in someone being knocked unconscious, indicating a potential risk of serious injury. The mention of feeling 'on edge' suggests possible psychological distress related to the witnessed violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 19:08:46"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Makes you wonder what's going on in people's lives that leads to that. Hope everyone involved is okay. Feeling shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessed a fight, expressing concern and unease. No direct threat or indication of severe harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 19:07:44"
  }
]