[
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train platform. Scared me half to death. He's okay, thankfully, but wtf is wrong with people? Makes you think.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was physically assaulted (shoved) on a train platform. While the victim is reportedly okay, the act itself represents a potential for serious injury or death depending on the circumstances (e.g., proximity to the edge of the platform, oncoming train).",
    "detected_category": "violence",
    "timestamp": "2025-12-08 21:17:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. Resisting urges is so hard rn. Just need to remember I've gotten through this before. Taking it one minute at a time. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses difficulty resisting urges, which could potentially relate to self-harm, though it's not explicitly stated. The individual is actively trying to cope, but the struggle suggests a potential risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 21:16:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Please, if you're using, carry it. Learn how to use it. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an actual overdose event, which represents a high risk to life and well-being.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 21:15:15"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel anxious after witnessing something like that? Need to process.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling anxious. While upsetting, it doesn't indicate immediate danger to the individual or others, nor does it suggest intent or planning of harmful actions.",
    "detected_category": "other",
    "timestamp": "2025-12-08 21:14:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, potentially indicating a mental health crisis. The phrase \"don't know what else to do\" suggests a lack of coping mechanisms and warrants further investigation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 21:13:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel so small. Has anyone else been through this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, which can escalate to physical violence or lead to significant mental health issues. While there is no immediate threat implied, the situation described has the potential for harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 21:12:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like nothing matters. Reaching out because I know I need to. Talking to a friend helped a bit. Gonna try to find a therapist tomorrow.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates low mood and feelings of hopelessness, suggesting potential depression. The individual recognizes the need for help and has already taken steps (talking to a friend), and plans to seek professional help (therapist). While there are no explicit suicidal ideations, the level of distress warrants a 'medium' severity due to the potential for escalation if not addressed. The action of reaching out is positive.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 21:11:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after almost losing my best friend to an OD. Scariest night of my life. Please, if you're struggling, reach out. There's help out there. Don't let this happen to someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose of a close friend, indicating a high risk situation and potential for future harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 21:10:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Reached out to a crisis line, just needed to tell someone. It helps, even a little. Please, if you're struggling too, don't stay silent.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and reaching out for help, suggesting a current struggle but active engagement with support systems. The plea to not stay silent implies awareness and a desire for others to seek help as well.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 21:09:03"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on the train. Shaken up. This city is getting scary. Anyone else feeling more on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight on public transport is unsettling, causing feelings of fear and anxiety, but there's no indication of direct harm or immediate threat to the individual or others mentioned in the text. It's a reaction to an event, not a plan or threat of violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 21:08:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, with a plea for help. While it doesn't explicitly mention self-harm or suicide, the metaphorical language (feeling underwater) and the act of reaching out suggest a significant level of distress that requires attention. The uncertainty warrants a 'medium' severity to ensure appropriate follow-up and support.",
    "detected_category": "other",
    "timestamp": "2025-12-08 20:19:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my friend OD last night. Terrifying. Called 911, thankfully they're okay. Scared me straight. Please be careful out there, look out for each other. Narcan saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates potential risk for the person who overdosed and secondary trauma for the witness. The friend is okay, mitigating the severity somewhat, but the risk of future overdose events or mental health impact remains.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 20:18:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Thankfully they're okay now, but please, if you're struggling, reach out. There's help available. Don't let it get that far.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose incident, which carries a significant risk of death or serious health consequences. While the person survived, the event highlights the potential for harm and underscores the need for preventative action.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 20:17:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got decked, out cold. Shaken up. Is it just me or is the city getting more aggressive? Anyone else notice this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A violent assault resulting in loss of consciousness was observed. While the victim is not the message sender, the event indicates a potential escalation of violence in the area.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 20:15:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to distract myself, but it's hard. Anyone else relate? Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of being overwhelmed and alone, suggesting a potential risk of self-harm or suicidal ideation, though no explicit plan or method is mentioned.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 20:14:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and overwhelmed, using the metaphor of being underwater. This suggests distress and a potential risk of escalation without support. The direct reach out for advice indicates a desire for help, but also suggests current coping mechanisms are insufficient.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 20:13:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD. It's terrifying. Lost a friend last year. If you're struggling, please reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions overdose and loss of a friend, indicating potential distress or vulnerability related to substance use. While it encourages seeking help, the direct reference to overdose events elevates the risk beyond just general sadness.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 20:12:53"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his girlfriend on the street today. Just walked right past. Still feeling sick about it. Should I have done something? What would you do?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be psychologically harmful and the original poster expresses distress. While the direct risk to the poster is low, the risk of escalation for the victim of the assault is unknown and potentially high. Further, the 'should I have done something' suggests a sense of unease and moral obligation.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 20:11:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a fight on my way home. Dude got clocked hard. Shook me up. Anyone else feel like things are getting more aggressive lately? Just trying to process.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be psychologically distressing and suggests a potential for escalation in the environment.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 20:10:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, but it shook me up bad. Please, if you're using, carry it. And know how to use it. It could save a life. #harmreduction #overdoseprevention",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 137 (char 162)",
    "detected_category": "unknown",
    "timestamp": "2025-12-08 20:09:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed ('underwater') which can be indicative of distress. The individual is actively reaching out for help, suggesting they are seeking a solution. While not explicitly suicidal, the language suggests potential vulnerability and requires further assessment.",
    "detected_category": "other",
    "timestamp": "2025-12-08 19:16:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, but shook me up. Makes you realize how close we all are to the edge. Anyone know where I can get trained in how to use it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while not directly involving the individual, can be emotionally distressing and highlight the prevalence of drug use and its potential for harm. The individual expresses feeling shaken and reflects on proximity to risk, which suggests a moderate level of psychological impact and concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 19:15:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park yesterday. Scared me senseless. Narcan saved him, thank god. Makes you realize how close we all are to the edge. If you're struggling, please reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a recent overdose incident, indicating the presence of dangerous substances and potential risk to others in the area. While the person was saved, it highlights the fragility of life and the prevalence of substance abuse issues.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 19:14:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head. Scratched my arm again last night. Feels stupid after. Anyone else know this feeling? Just trying to get through it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes self-harm (scratching) and feelings of distress. While it doesn't explicitly mention suicidal intent, the combination of factors suggests a need for concern and potential escalation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 19:13:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight. Hope it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and underwater, which suggests potential distress or depression. Reaching out to a friend is a positive coping mechanism, but the underlying distress warrants concern and monitoring.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 19:12:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just realized yelling every day & controlling who I talk to IS abuse. Didn't think it was 'that bad' 'til a friend pointed it out. Feeling lost & scared. Anyone else been through this? How did you start to heal?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the individual is experiencing emotional abuse, acknowledges its impact, and expresses feelings of being lost and scared. While there's no immediate threat of physical harm, the emotional distress and vulnerability suggest a need for support and potential escalation of the situation. ",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 19:11:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to hide the bruises. He says he's sorry after, but it keeps happening. I feel so lost and alone. Is this really my life now? Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes physical abuse (bruises) and expresses feelings of isolation and despair, indicating a high risk of immediate or future harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 19:10:46"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the park. So scary. My hands are still shaking. Is there anything I can do to help the guy who got hurt? Feel helpless right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A physical altercation resulting in injury has occurred. While the user isn't directly in danger, the potential for escalation and the presence of violence warrant a medium severity rating.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 19:09:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Just trying to get through it minute by minute. Anyone else relate? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential relapse or escalation of a previous struggle. While not explicitly stating intent to harm oneself, the feelings of isolation and minute-by-minute struggle warrant concern and indicate a need for support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 19:08:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm underwater. Reaching out because I don't know what else to do. If you've been there, how did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being overwhelmed and hopeless, reaching out for help. While not explicitly suicidal, the statement suggests significant emotional distress and a potential risk that needs to be addressed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 19:07:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling? Need to remember I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of loneliness and being lost, but does not contain explicit mention of self-harm, suicide, or harm to others. Seeking connection and shared experiences suggests a desire for support.",
    "detected_category": "other",
    "timestamp": "2025-12-08 18:21:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you realize how quickly things can escalate. Shaken up. Anyone else ever witness something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate immediate danger to the author or others. The author expresses being shaken up but is primarily seeking coping strategies.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 18:20:39"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Just trying to take it one day at a time. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges, suggesting a potential relapse or escalation of a pre-existing issue. While not explicitly mentioning harm, the phrase 'rough time' and seeking coping mechanisms implies distress and vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 18:19:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Things have been rough at home lately. Walking on eggshells constantly. Is this normal? Starting to feel like I'm losing myself. Anyone else been through something similar?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 99 (char 124)",
    "detected_category": "unknown",
    "timestamp": "2025-12-08 18:18:35"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Just trying to take it one hour at a time. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential for self-harm. The individual is overwhelmed, which increases vulnerability. While there is no explicit plan, the presence of urges warrants a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 18:17:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant put-downs, controlling behavior... I feel so isolated. Has anyone else gone through this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, which can escalate to more severe safety risks over time. The feeling of being 'lost' indicates a potential for declining mental health.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 18:16:31"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend on the street. Froze. Wish I'd done something, anything. Feeling sick. Is there a bystander intervention training I can take?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessed violence indicating an immediate risk of harm to the girlfriend.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 18:15:29"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a fight break out downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potentially dangerous situation, but the author only expresses feeling shaken and on edge. There's no indication of direct involvement, planning, or intent to cause harm to themselves or others. It mainly expresses a general feeling of unease.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 18:14:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm so tired of walking on eggshells. Every little thing sets him off. Is this normal in a relationship? I feel so lost and alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and a feeling of being trapped. While not explicitly stating physical harm, the phrase \"walking on eggshells\" suggests fear and control dynamics, which can escalate. The feelings of being \"lost and alone\" raise concern for the individual's mental well-being.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 18:13:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "Sometimes it feels like I'm underwater, and the surface is miles away. Reaching out for help feels impossible, but I know I need to. If you've been there, what helped you take that first step?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and isolated, with a hint of needing help. While not explicitly suicidal, the metaphor of being underwater and far from the surface suggests a significant struggle. The request for advice on taking the first step implies a desire to improve the situation but acknowledges a significant barrier.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 18:12:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them. Carry it, learn how to use it. Could save a life. I'm still shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event indicating potential danger in the environment, even though Narcan was effective. The person's shaken state suggests a significant emotional impact.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 17:18:30"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you wonder what's going on in people's lives that leads to that. Hope everyone involved is okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning, but the poster expresses concern and hope for the individuals involved. There's no indication of direct involvement or intent to harm others.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 17:17:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw my neighbor being taken away by paramedics. OD. Please, if you're struggling, reach out. There are people who care and want to help you get through this. Don't let this be your story.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a recent overdose requiring medical intervention, suggesting an immediate risk of harm and potential for further overdose incidents in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 17:16:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Rough night. The urges were so strong. So glad I reached out instead. Talking really helped. Still shaky, but safer. There's support out there. You're not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges (unspecified, but potentially harmful) and ongoing shakiness, suggesting a recent crisis. Reaching out helped, but the person is still vulnerable.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 17:15:25"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a memorial for someone lost to overdose. Hits hard. We gotta be there for each other. Naloxone saves lives, know how to use it. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a fatal overdose, which implies a potential risk of further overdoses or substance abuse issues within the community. While not explicitly stated, the memorial suggests a recent event and the plea for naloxone awareness indicates a concern for ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 17:14:23"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The yelling is constant, and now...other things. Feeling trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates potential abuse (physical or emotional) and a feeling of being trapped, coupled with increasing difficulty coping. This suggests a high risk of escalation and potential for immediate harm to the individual.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 17:13:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm underwater. Talking feels impossible, but I know I need to reach out. Any advice on finding help when you're suffocating?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed ('suffocating'), and unable to communicate, suggesting significant emotional distress and a potential need for immediate support. While it doesn't explicitly mention self-harm or suicide, the intensity of the distress warrants a 'medium' severity assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 17:12:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain explicit statements of suicidal intent, self-harm plans, violence, abuse, or overdose. It appears to be a general expression of distress and a call for support.",
    "detected_category": "other",
    "timestamp": "2025-12-08 17:11:17"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so trapped. Has anyone else experienced this? How did you find a way out?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, suggesting emotional and potentially psychological abuse. The feeling of being 'trapped' raises concern for escalation. While not explicitly stating imminent harm, the situation described could lead to further distress and potential harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 17:10:14"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a fight outside my kid's school. Shaking. Makes you wonder what's going on with people. Anyone else feeling on edge lately? I'm so worried about safety now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning, but doesn't indicate imminent danger to the author or others. It expresses general anxiety and worry about safety rather than a specific threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 17:09:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Talking to someone feels impossible, but I'm trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of low mood and difficulty reaching out for help, suggesting potential for escalation if left unaddressed. The user acknowledges needing help, which indicates some awareness of their situation, but the difficulty in talking to someone is concerning.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 16:19:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things aren't good at home. Walking on eggshells constantly. Anyone else feel like they're losing themselves trying to keep the peace? I don't know what to do anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a stressful and potentially harmful home environment, characterized by fear and self-sacrifice. The statement \"I don't know what to do anymore\" suggests a level of distress and potential for escalation, although no specific threats are mentioned.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 16:18:54"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy get shoved on the train platform. Shook me up. Made me realize how quickly things can escalate. Anyone else feel more on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While a violent act (shoving) occurred, the text focuses on the observer's anxiety and doesn't indicate ongoing threat or severe injury.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 16:17:51"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scared. Found my brother unresponsive. Narcan worked, but barely. Please, if you're using, even occasionally, carry it. It saves lives. Don't want anyone else to go through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal opioid overdose requiring Narcan. While the person survived, the situation was extremely dangerous and highlights the significant risk of overdose-related death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 16:16:50"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the corner store. Shook me up. Reminded me of my brother... Anyone else feel like anger's just everywhere lately? How do you guys cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning, but doesn't indicate direct involvement or imminent danger to the poster or others. The post expresses feelings of being shaken up and observations about anger, but does not include threats, plans, or self-harm indicators.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 16:15:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Just trying to take it one day at a time. Anyone else relate? Feeling pretty alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse in urges and feelings of isolation, suggesting a potential risk for self-harm or other negative outcomes.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 16:14:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Finally left. It's terrifying and empowering all at once. My head is still spinning, but I know I did the right thing. Any advice for navigating this new chapter? Feeling so lost. \"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of disorientation and being lost after a significant life change. While the language suggests emotional distress (\"terrifying\", \"lost\"), there's no direct indication of immediate danger to self or others.",
    "detected_category": "other",
    "timestamp": "2025-12-08 16:13:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Narcan saved them. Makes you think... Know the signs, carry it if you can. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports an overdose incident requiring Narcan, indicating a potential ongoing risk of overdose in the area. While the person survived, it highlights the presence of a significant health hazard.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 16:12:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Makes you realize how quickly things can escalate. Anyone else feeling on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text reports witnessing a fight, which is concerning but doesn't directly indicate imminent danger to the author or others. The author expresses feeling \"on edge,\" suggesting anxiety but not necessarily an immediate safety risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 16:11:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling so low and alone. Reaching out because I don't know what else to do. If anyone has felt this way, how did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being low, alone, and not knowing what to do. While it doesn't explicitly mention self-harm or suicide, the overall tone suggests emotional distress that warrants concern and further assessment. The user is reaching out for help, indicating a potential for escalation if support is not provided.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 16:10:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just heavy. Talking to a friend helped a bit, but it's still there. Gonna try to reach out for more support tomorrow. It's scary, but I gotta keep trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but it also shows resilience and a willingness to seek help. There's no immediate indication of self-harm or suicidal intent, but the individual is clearly struggling and requires support.",
    "detected_category": "other",
    "timestamp": "2025-12-08 15:19:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me. Please, if you're using, have someone with you, and have Narcan. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event indicating potential for further overdoses in the area and highlights the inherent risks associated with drug use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 15:18:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Thankfully they were ok. Naloxone saves lives, people. Please learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual survived, an overdose is a serious medical emergency with potential for fatality. The event caused distress to the observer.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 15:17:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so overwhelmed lately. The urge to cut is back. Day 3 of fighting it. Just posting here for some accountability. It's hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a recurrence of self-harm urges and active struggle to resist them. While the individual is seeking accountability, the presence of these urges suggests a significant risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 15:16:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up yesterday. Scariest night of my life. Please, if you're using, carry Narcan. It saves lives. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event, indicating a significant risk to life. The mention of Narcan and the friend almost not waking up strongly suggests a severe health emergency.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 15:15:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scared me half to death. Luckily, paramedics got there fast. Folks, please be careful out there. This stuff is real. Learn the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event indicates a potential for serious harm or death. While the individual survived due to intervention, the risk of overdose in the area is evident, posing a threat to others.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 15:14:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good lately. Constant yelling, then the silent treatment. Walking on eggshells. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially escalating situation of emotional distress and a negative home environment, possibly indicative of abuse or domestic conflict. While not explicitly stating imminent harm, the mention of 'walking on eggshells' and feeling 'alone' suggests vulnerability and a need for support.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 15:13:10"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain specific threats or plans. It's a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-08 15:12:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Like I'm underwater. Reaching out before I sink further. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 93 (char 118)",
    "detected_category": "unknown",
    "timestamp": "2025-12-08 15:11:06"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, leading to feelings of isolation. While not explicitly stating intent to harm oneself or others, the situation suggests a potential for escalation and requires attention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 15:10:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post about suicide, aiming for authenticity and focusing on seeking help:\n\n\"Feeling really low lately. Like, a weight I can't shake. Reaching out because I know I need to. Anyone know good resources for talking to someone? Just need to not feel so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post expresses feelings of low mood, being overwhelmed, and a direct need for help and connection. While not explicitly mentioning suicidal ideation, the intensity of feeling 'a weight I can't shake' and seeking resources for talking to someone suggests a level of distress that warrants concern and potential intervention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 14:19:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed but does not contain explicit threats or plans for self-harm, suicide, violence, abuse or overdose.",
    "detected_category": "other",
    "timestamp": "2025-12-08 14:18:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger than ever. Trying to stay strong, but it's hard. Any tips for coping? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges and feelings of being overwhelmed, suggesting a potential risk of self-harm or other harmful behaviors. The individual is seeking coping strategies, which indicates awareness but also acknowledges difficulty in managing the situation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 14:16:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm starting to realize the yelling and constant put-downs aren't normal. Feeling so lost and unsure. Is this what abuse feels like? Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential abusive situation and the user is experiencing emotional distress and confusion, suggesting a need for support and potential intervention. While there's no immediate threat of harm explicitly stated, the abusive environment elevates the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 14:15:57"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a guy shove his partner on the street. Shook me up. Did I do the right thing by just calling the police? I froze. Feeling guilty I didn't do more.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence observed. While the observer is safe, the act itself presents a risk to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 14:14:55"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs & walking on eggshells. Anyone else been through this? Feeling so alone. 💔",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential for abuse (put-downs, walking on eggshells). The expression of feeling alone with a broken heart emoji suggests vulnerability and a need for support. While not explicitly stating harm, the situation described carries a risk of escalating mental health issues.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 14:13:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit suicidal or self-harm ideation, plans, or intent. It appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-08 14:12:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a tough few weeks. Feeling really low and struggling to see the point. Reached out to a helpline, and just talking helped a little. If you're feeling this way too, please don't give up. There's support out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of hopelessness and being 'low,' which suggests potential suicidal ideation. The user has reached out for help, which is a positive sign, but the continued struggle suggests the risk is not negligible.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 14:11:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good lately. Constant put-downs, isolating me from friends... feels like I'm walking on eggshells. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (put-downs, isolation) which can escalate to physical violence or mental health crises. Walking on eggshells suggests fear and a controlling environment. While there's no explicit mention of physical harm, the situation indicates a potentially dangerous situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 14:10:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He says he's sorry, promises it won't happen again, but then...it does. Is this normal? I feel so lost. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a cycle of apology and repeated harmful behavior from another person. The user expresses feeling lost, indicating potential emotional distress and a need for support. While not explicitly stating violence or abuse, the language implies a negative and potentially harmful relationship dynamic.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 14:09:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I keep making excuses for him. He's stressed, he's tired... but yelling until I cry isn't okay, right? Starting to feel like I'm losing myself.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates verbal abuse, causing emotional distress and a loss of self, which escalates the potential for further harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 13:28:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, and reaching out for help indicates distress. While not explicitly suicidal or self-harming, the 'underwater' metaphor and feeling of desperation warrant concern and further assessment. The person is implicitly asking for help, which suggests they haven't yet given up, but their coping mechanisms may be failing.",
    "detected_category": "other",
    "timestamp": "2025-12-08 13:27:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really dark few weeks. Feeling so lost and alone. Reaching out because I don't know what else to do. If you've been there, how did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and isolation, indicating emotional distress. While not explicitly suicidal, the user is reaching out for help, suggesting a potential risk that warrants concern and support.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 13:26:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Just trying to take it one day at a time. Anyone else relate? Feeling pretty alone rn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges and feelings of loneliness, suggesting a potential risk for self-harm or suicide. The phrase \"rough time lately\" and \"urges are back\" are concerning.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 13:25:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "i messed up. again. feel so ashamed and alone. reaching out before it gets worse. anyone know any good coping skills that actually work? 😔",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of shame, loneliness, and a fear of things getting worse, suggesting potential escalation. Reaching out for coping skills indicates awareness and a desire to manage distress, but the mention of \"before it gets worse\" elevates the risk above low.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 13:24:07"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling really low lately. Like, unbearably so. Reaching out before things get worse. Anyone know resources that actually help?\n\n**Option 2 (Sharing Experience):**\n\n> Been there. Dark place. It DOES get better, even when you can't see it. Talking helped me. Don't give up.\n\n**Option 3 (Raising Awareness):**\n\n> Lost a friend. Hurts like hell. Please check in on your loved ones. You never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses feeling \"unbearably\" low and seeking help before things worsen, indicating potential for escalation. Option 3 mentions the loss of a friend, possibly to suicide, highlighting the potential dangers of ignoring mental health struggles.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 13:23:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a fight downtown last night. Guy got really hurt. Shook me up. Is there anywhere to volunteer to help prevent this stuff? Feels like I should do something.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing severe violence can have a significant psychological impact and suggests a potential risk for escalation of violence in the area.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 13:22:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to stay strong and remember why I stopped. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse in urges and feelings of being overwhelmed, suggesting a potential for self-harm or other negative coping mechanisms. While there is an attempt to stay strong, the return of urges elevates the risk level. ",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 13:20:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things are rough at home. Walking on eggshells constantly. Anyone know resources for dealing with emotional abuse? Feeling so lost.\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Finally out of that toxic relationship. Didn't realize how much he was controlling me until I left. It's hard, but worth it.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Gaslighting is real. It messes with your head. Don't let anyone make you question your own sanity.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses immediate distress and potential ongoing emotional abuse, indicating a need for support and possible escalation if unaddressed. Options 2 and 3 describe past situations.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 13:19:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and hopeless, which could indicate a risk of self-harm or suicidal ideation. The person is actively reaching out for help, suggesting they are aware of their distress but may lack coping mechanisms. More information is needed to determine if there is an immediate threat.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 13:18:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Narcan saved him, but shook me up. Makes you realize how close we all are to the edge. Be careful out there, friends. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event. While the person survived due to Narcan, the incident highlights the presence of potentially life-threatening drug use in the environment and the ease of access to dangerous substances. The author expresses feeling 'shook up' and reflects on how close everyone is to 'the edge,' suggesting a significant emotional impact. This has potential for creating distress in others and can have long-term effects if not processed in a healthy way.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 12:24:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, and a sense of desperation ('don't know what else to do'). While not explicitly suicidal, the metaphor of being 'underwater' suggests potential feelings of suffocation and being overwhelmed, warranting concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 12:23:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out to a friend tonight, hoping it helps. Remember to check on your loved ones. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but it also indicates help-seeking behavior by reaching out to a friend. There are no explicit mentions of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2025-12-08 12:22:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Clean for a few weeks but the urges came back hard. Reached out to a friend, which helped a little. Still feeling shaky. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse urges are strong, indicating potential for self-harm. Reaching out to a friend is a protective factor, but shakiness suggests continued distress.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 12:21:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, which could indicate mental distress. The individual recognizes the need for help but struggles to seek it, suggesting a barrier to accessing support and a potential escalation of the situation. The phrase \"like I'm underwater\" can be interpreted as a metaphorical representation of feeling suffocated or trapped by their emotions.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 12:20:14"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight outside my kid's school. Shook me up. Is this normal now? Feel so helpless. Wish people could just talk things out instead of...\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight outside a school implies a potential risk of violence and could escalate. While the text expresses feeling 'shook up' and 'helpless,' it doesn't indicate immediate danger but suggests a breakdown in community safety and potential for future incidents.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 12:19:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head. Relapsed after a few months clean. Feeling really ashamed and alone. Any advice on coping with the guilt?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of being clean suggests vulnerability and potential for escalation. Feelings of shame and isolation increase the risk. The request for coping advice indicates a desire for help but also acknowledges the current struggle.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 12:18:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a crisis line, just talking helped a little. It's a daily struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and a feeling of being overwhelmed, suggesting an increased risk. While reaching out for help is a positive sign, the ongoing daily struggle warrants a medium severity assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 12:17:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Trying to resist, but it's hard. Anyone else relate? Any tips for coping?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating active ideation and difficulty resisting the urge. While not an immediate threat of suicide, the intensity of the self-harm urges elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 12:16:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw my neighbor being taken away by ambulance. Think it was an OD. This stuff is scary. Anyone know where I can find resources to learn more about preventing this? I'm worried.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text reports a potential overdose requiring ambulance intervention. While the writer is not directly at risk, the proximity to the event and expressed worry suggest potential for increased risk if not addressed.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 12:15:04"
  }
]