[
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after 6 months clean. Disappointed but trying to be kind to myself. Reaching out for support today. It's a tough journey.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates vulnerability and a potential for escalation of substance use. While the individual is seeking support, the relapse itself represents a risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 06:23:54"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Dude got decked, just like that. Makes you realize how quickly things can turn ugly. Shaken up, honestly.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling, but the text does not indicate ongoing danger or specific threat to the speaker or others. It expresses being 'shaken up' which suggests a negative emotional impact, but not an immediate safety risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 06:22:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough few weeks. Feeling so alone, like nothing matters. Talking to a friend helped a little, but the dark thoughts keep coming back. Reaching out for professional help tomorrow. Wish me luck.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of loneliness, hopelessness, and recurring dark thoughts. While they have reached out to a friend and plan to seek professional help, the persistence of negative thoughts suggests a potential risk that warrants attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 06:21:51"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on my street. Shaken up. It's too close to home. Anyone else feel like things are getting more volatile lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is upsetting but doesn't indicate imminent danger to the person reporting. It expresses unease and a sense of increasing volatility, but lacks specific threats or indications of direct involvement.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 06:20:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home have been rough. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? How did you find help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, leading to feelings of isolation. While there's no explicit mention of physical harm or suicidal ideation, the situation indicates a potential for escalation and necessitates seeking help.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 06:19:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight. Hope it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed ('underwater'). While the individual is reaching out to a friend, the phrasing suggests a significant level of distress. The question 'It's okay to not be okay, right?' indicates a need for reassurance and validation, suggesting the individual is struggling to cope.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 06:18:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD. It hits different when it's someone you knew. Please, if you're struggling, reach out. There are people who care. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and awareness of overdose risk, indicating potential vulnerability within the author's social circle and implicitly acknowledging the prevalence of substance use issues. The reference to 'struggling' and 'don't become a statistic' suggests a concern for others who may be at risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 06:17:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Old coping mechanisms almost took over. Reached out to a friend instead. Still shaky, but here. There is another way. #YouAreNotAlone\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the person felt overwhelmed and old coping mechanisms (potentially harmful) almost took over, suggesting a risk. Reaching out to a friend is a positive sign, mitigating the immediate danger, but the shakiness implies ongoing vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 06:16:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"I keep making excuses for him, but the yelling is getting worse. Last night he broke a plate. Is this still just 'stress'? Feeling lost & scared.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Escalating yelling and property damage (breaking a plate) suggest a potential for violence and an unsafe environment. The person expresses feeling scared, indicating distress.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 06:15:42"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out at the bus stop. Shaken up. Called the cops, but still feel sick. Anyone else ever witness something like that? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence, causing emotional distress. While concerning, it doesn't indicate immediate danger to the individual or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 06:14:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Wish I'd said something, done something. Feeling sick about it now. Anyone else ever experience this? How do you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports of violence (shoving) observed in public. While not directly involving the reporter, it indicates a potential for escalation and risk of harm to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 05:22:05"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is there anyone else who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost and overwhelmed ('underwater') and is reaching out for help, indicating distress and potential vulnerability. While there's no explicit mention of self-harm or suicide, the intensity of feeling lost warrants a medium severity due to the potential for escalation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 05:21:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park today. Scary stuff. Narcan saved him, thank god. Makes you realize how close it is. Learn the signs, carry Narcan if you can. It saves lives. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose was non-fatal, the text describes a real-life overdose event requiring intervention, indicating a significant health risk present in the community. The phrase \"makes you realize how close it is\" increases the urgency.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 05:20:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Never thought I'd actually witness something like that. Is there anyone else feeling unsafe lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing the person to feel shaken and unsafe. While a fight indicates violence, the person is not directly involved or threatened in the text. The feeling of unsafety is general and not directed towards a specific threat or plan.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 05:18:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Been feeling so isolated lately. Partner's been controlling who I talk to & where I go. Walking on eggshells constantly. Anyone else experience this? It's exhausting.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional and social isolation coupled with controlling behavior from a partner, suggesting possible emotional abuse. While not explicitly stating physical violence or immediate danger, the feeling of \"walking on eggshells\" implies a stressful and potentially harmful environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 05:17:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but it does not contain any explicit or imminent threats of harm to self or others. It seems more like a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-15 05:16:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIP posts lately. OD is scary real. Lost a friend last week. Please, if you're struggling, reach out. There are people who care. Don't become another statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references overdose (OD) and the loss of a friend, indicating a potential risk, even though it also encourages seeking help. The mention of RIP posts and becoming a 'statistic' suggests the author is aware of a serious and ongoing problem.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 05:15:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Not sure what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed ('underwater') and uncertainty about what to do, indicating potential emotional distress and a cry for help.",
    "detected_category": "other",
    "timestamp": "2025-12-15 05:14:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"I used to think yelling & insults were just \"how he is.\" Now I'm realizing it's more than that. Feeling so lost & confused. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling lost and confused potentially due to verbal abuse (yelling and insults), which can escalate and negatively impact mental health.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 05:13:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes a witnessed act of violence, it doesn't indicate the poster is in immediate danger. However, it reflects a concerning event and heightened anxiety, suggesting a medium level of risk due to potential for escalation or broader safety concerns in the described area.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 05:12:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"I keep making excuses for him. Said he was stressed, tired... but is yelling and breaking things normal? Feels like I'm walking on eggshells all the time. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving yelling and breaking things, suggesting a potential risk of escalation to physical violence or abuse. The feeling of walking on eggshells indicates a consistently unsafe environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 04:33:45"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out at the park today. Just random, teenagers. It shook me up more than I thought it would. Feeling really anxious now. Anyone else experience stuff like this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, leading to anxiety. While unsettling, it doesn't indicate direct harm to the individual or imminent danger.",
    "detected_category": "other",
    "timestamp": "2025-12-15 04:32:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I hate it. Trying to stay strong and remember why I stopped. Just needed to say it out loud.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which could potentially lead to self-harm or other harmful behaviors. The user is expressing distress and struggling to cope, suggesting an elevated level of risk compared to simply feeling down.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 04:31:42"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I keep making excuses for him, but the yelling is getting worse. Last night he cornered me... I'm scared this is escalating. Has anyone else dealt with this? Need to talk.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes escalating verbal abuse and feeling cornered, indicating a potential for physical violence. The user expresses fear, suggesting a perceived threat to their safety.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 04:30:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Made me realize how easily things can escalate. Is there anywhere to volunteer, maybe help de-escalate situations? Feeling pretty helpless right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, not being involved in one or expressing intent to harm self or others. While shaken, the individual expresses a desire to help prevent escalation, indicating a prosocial response.",
    "detected_category": "other",
    "timestamp": "2025-12-15 04:29:39"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately? Stay safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which suggests potential exposure to violence. While concerning, it doesn't explicitly state a direct threat to the author or others beyond a general feeling of unease. The call to \"stay safe\" is a cautionary message rather than an indication of imminent danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 04:28:38"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you wonder what some people are going through to act like that. Hope everyone involved is okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While a fight is mentioned, the text focuses on empathy and concern for those involved. There is no direct threat or indication of escalating violence, self-harm, or other severe risks.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 04:27:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "*   \"Been feeling so numb lately. Like I'm watching my life from behind glass. Reaching out because I don't know what else to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of numbness and detachment, coupled with a sense of helplessness ('don't know what else to do'). This suggests emotional distress and a potential risk for self-harm or suicidal ideation, although there is no explicit mention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 04:26:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been walking on eggshells lately. He gets so angry over nothing. Anyone else experience this? Feels isolating and I don't know what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of feeling like one is 'walking on eggshells' due to another person's unpredictable anger. This suggests potential emotional abuse and a climate of fear, which, while not explicitly stating physical harm, indicates a harmful and potentially escalating situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 04:25:33"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a glass wall. Reaching out because I don't know what else to do. Is there anyone else who understands this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of numbness, detachment, and a plea for connection, suggesting emotional distress and a potential for escalation if left unaddressed. The phrase \"I don't know what else to do\" warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 04:24:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about another OD. Makes me think of my brother. Scariest night of my life. Narcan saved him. Please, if you're using, keep it on hand. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a past overdose of the author's brother and implies the author is concerned about the reader experiencing a similar event. While the author is promoting harm reduction rather than expressing intent, the mention of overdose and the encouragement to have Narcan on hand suggests an existing risk of overdose within the reader's social circle.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 03:48:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor OD yesterday. Terrifying. Paramedics got there fast, thankfully. Makes you realize how fragile life is. Check on your friends, people. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a neighbor's overdose indicates a serious health crisis event and potential indirect exposure to trauma, while the call to action suggests awareness and a desire to prevent further incidents.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 03:47:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Really fought the urge to hurt myself. Still feeling shaky, but I made it through. Reaching out instead. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text explicitly mentions fighting the urge to self-harm, indicating active suicidal ideation, even though the individual did not act on it. Reaching out is a positive sign, but the presence of the urge elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 03:46:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were strong, but I distracted myself with a movie. Small win, I guess. Anyone else feel like they're constantly fighting a battle with themselves?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions \"strong urges\" and a constant internal \"battle.\" While the individual reports successfully distracting themselves, the presence of strong urges suggests a potential for escalation and warrants monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 03:45:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things are bad at home. Walking on eggshells constantly. I feel so small. Is this normal? Anyone else go through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive or highly stressful home environment, characterized by fear and emotional distress (feeling 'so small'). The phrase 'walking on eggshells' suggests an unpredictable and potentially volatile situation. While not explicitly mentioning physical harm, the emotional impact and implied power imbalance raise concerns.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 03:44:48"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate imminent or direct threat to the author or others. It expresses feelings of anxiety and awareness of potential escalation but lacks specific details or plans.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 03:43:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Narcan saved them, thank god. Carry it, learn how to use it. It really can save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event and indicates the presence of a potentially life-threatening situation, even though Narcan was administered successfully. The experience can be traumatic for the witness, and the advice to carry and learn how to use Narcan highlights the ongoing risk of overdoses in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 03:42:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud is constantly over me. Reaching out because I know I need to. Talking to a therapist tomorrow. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a desire to seek help, indicating a potential risk that requires attention. The individual is taking a positive step by seeking therapy, but the underlying feelings warrant concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 03:41:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so overwhelmed lately. Like I'm drowning and can't see a way out. Talking to someone feels impossible, but I know I need to. Any resources anyone can suggest?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being overwhelmed, hopelessness ('drowning and can't see a way out'), and difficulty seeking help. While there is no explicit mention of self-harm or suicidal ideation, the distress level and feeling of being trapped suggest a need for intervention and increased risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 03:40:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about ODs lately is scary. Lost a friend last year... Narcan saves lives. Please, learn how to use it. You could save someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions overdose and the loss of a friend, indicating a risk of potential overdose incidents and highlighting the importance of Narcan. While it doesn't explicitly state an imminent risk, the personal connection and call to action elevate the severity.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 03:39:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is back. Reached out to a friend, but it's still tough. Just trying to get through the next hour. Anyone else relate? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a recurring urge to self-harm and difficulty coping, indicating a serious risk. While the individual has reached out for help, they are still struggling, signifying a potentially imminent threat to their safety.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 02:56:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. The urge to cut is so strong. Trying to resist, but it's exhausting. Anyone else get this? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating active suicidal ideation, but also mentions resisting the urge and seeking coping mechanisms, suggesting some protective factors. This places the risk at medium severity, requiring attention and support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 02:55:44"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Frozen. Should I have said something? Feel sick about it now. #domesticviolence #witness #help",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing someone being shoved indicates potential for further escalation of violence and possible injury.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 02:54:42"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Scared. My neighbor's been yelling again, worse than before. I heard crashing. Don't know what to do. Police were already here last month for a different incident.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports of escalating yelling, crashing sounds, and prior police involvement suggest a potential for violence and immediate danger to the reporting person or their neighbor.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 02:53:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just had another fight. Walking on eggshells is exhausting. Is this normal in relationships? Feeling so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses emotional distress and loneliness, but doesn't contain explicit threats of harm to self or others. The phrase \"walking on eggshells\" indicates potential relationship issues, but lacks details about physical or emotional abuse.",
    "detected_category": "other",
    "timestamp": "2025-12-15 02:52:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and exhausted, but does not contain explicit suicidal ideation, self-harm plans, or threats of violence. While concerning, the language is general and lacks immediate risk indicators.",
    "detected_category": "other",
    "timestamp": "2025-12-15 02:51:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are back, feel so ashamed. Reached out to the crisis line, just needed to tell someone. It helps, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which is a warning sign. Reaching out for help is positive, but the presence of urges suggests a potential risk that requires monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 02:50:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Called 911, they made it. Learn CPR, carry Narcan. It can happen to anyone. Please be careful out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a potentially fatal overdose situation requiring emergency medical intervention. While the person survived, the event highlights a significant risk of death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 02:49:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home have been rough. Constant yelling, put-downs... I feel so small. Anyone else been through this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of verbal abuse and emotional distress, which could escalate if unaddressed. The feeling of being 'small' suggests a potential impact on self-worth and mental health.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 02:48:34"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside the grocery. Froze. Didn't know what to do. Called 911, but I'm still shaken. Anyone else ever witness something like that? What do you DO?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an act of violence (punching a girlfriend) which constitutes a direct physical threat to another person. This falls under potential domestic violence/abuse, which often escalates.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 02:47:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "```\nJust need to vent. Constant put-downs disguised as jokes are really getting to me. Feels like I'm walking on eggshells all the time. Anyone else experience this? How do you cope?\n```",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes emotional distress due to put-downs, suggesting a potentially unhealthy environment. While it doesn't indicate immediate danger, prolonged exposure to such behavior can escalate risk over time. No direct threats or intent of self-harm or harm to others are indicated.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 01:47:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mentions of self-harm, suicide, violence, abuse, or overdose. It is a general expression of emotional distress and a desire for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-15 01:46:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so overwhelmed lately. Like I'm drowning. Anyone know any good resources for when you just... can't?\n\n**Option 2 (Personal Story):**\n\n> Thinking about a dark time. Grateful I got through it. If you're struggling, please reach out. You're not alone.\n\n**Option 3 (Raising Awareness):**\n\n> Lost a friend to suicide last year. Check in on the people you love. You never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text contains expressions of feeling overwhelmed and drowning, alongside mentions of suicide and past dark times. While not explicitly suicidal, the language indicates potential distress and vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 01:45:41"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, but it's still tough. Anyone else relate? Just trying to get through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, which indicates immediate risk. The person has reached out for help, which is a positive sign, but the feeling of being overwhelmed persists, suggesting the risk is ongoing.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 01:44:39"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Reminded me of my brother. Anyone else feel extra anxious after witnessing violence? I'm trying to stay calm.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and experiencing anxiety, but doesn't express intent to harm self or others. The individual is attempting to cope and stay calm.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 01:43:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. Yelling, then the silent treatment. Feels like walking on eggshells. Anyone else deal with this? I just feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes emotional distress and a potentially unhealthy relationship dynamic (yelling, silent treatment, feeling alone), but it doesn't explicitly mention any immediate or severe safety risks. Walking on eggshells indicates anxiety and discomfort, but not necessarily imminent danger. More information is needed to determine if this is escalating to physical abuse or violence.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 01:42:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scariest thing ever. Narcan saved them. Please, learn how to use it. It could save a life. I'm still shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, indicating a significant health risk and potential for future incidents. While Narcan was successful, the event caused distress, suggesting a concerning situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 01:41:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges are strong. Just trying to breathe and remember this feeling will pass. Anyone else relate? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and a difficult emotional state, suggesting potential self-harm or suicidal ideation. While not explicitly stated, the mention of 'urges' warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 01:40:33"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing so many RIPs lately. Lost another friend to an OD. This sh*t is relentless. Please, if you're struggling, reach out. There are people who care and want to help you get through this. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief over overdose deaths and encourages seeking help, suggesting a potential for self-harm or suicidal ideation in the struggling reader, compounded by the emotional distress related to overdose deaths. The language hints at hopelessness and a heightened risk environment.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 01:39:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD. Lost a friend last year. Scared it'll happen again. If you're struggling, please reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear of future overdose and acknowledges personal loss due to overdose, indicating potential vulnerability and raising concern for the author's well-being, though it doesn't express direct intent.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 01:38:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head. Relapsed after a few months clean. Feeling so much shame, but reaching out feels like the only option right now. Any advice on coping with the guilt?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse and intense feelings of shame suggest increased vulnerability and potential for harm. The individual is reaching out for help, indicating some awareness and desire for safety, but the relapse is a significant risk factor.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 00:48:26"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a fight break out on the bus. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else ever feel completely drained after witnessing something like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight, while disturbing, does not indicate imminent danger to the individual or others mentioned. The post expresses emotional distress (feeling drained) but no direct threat or call to action.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 00:47:24"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got seriously hurt. Shaken up. Is there anywhere to volunteer, like, help prevent this stuff? Feels awful just witnessing it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing severe violence indicates a potential risk of psychological trauma and/or desire to intervene in future potentially dangerous situations. The phrase 'seriously hurt' indicates a higher severity risk than a minor altercation.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 00:46:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight. It's scary but I need to try.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost and overwhelmed, using the metaphor of being underwater, indicating distress and potential hopelessness. The statement that reaching out is 'scary' suggests a significant barrier to seeking help, and the perceived need to 'try' implies a level of desperation. While not explicitly suicidal, these feelings represent a moderate risk of escalation without intervention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 00:45:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing a friend OD was the scariest thing. Narcan saved them. Please, learn how to use it. It could save a life. I'm still shaken. Is there anyone else who's gone through this? I need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes witnessing a friend's overdose, a high-risk event requiring immediate intervention (Narcan). The author expresses being shaken and needing to talk, suggesting potential emotional distress and the need for support. While the author is not the one who overdosed, witnessing such an event can be traumatizing.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 00:44:19"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... rough. Constant yelling, put-downs. Feels like I'm walking on eggshells. Anyone else been through this? Just feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile and verbally abusive home environment, causing emotional distress and feelings of isolation. While it doesn't explicitly mention physical harm or suicidal ideation, the constant negativity and feeling of walking on eggshells suggest significant emotional risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 00:43:18"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Two guys, really going at it. Scared me. Makes you wonder what's going on in people's lives to get to that point. Hope they're okay, eventually.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessed a fight, indicates potential for violence but no specific threat or ongoing danger to the reporter or others is implied.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 00:42:16"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. My neighbor's been yelling again, things getting thrown. Last time police came, nothing changed. Anyone know resources for domestic disturbances that actually help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential escalation of domestic violence, with yelling, objects being thrown, and a prior police intervention that was ineffective. While not explicitly stating physical harm, the situation suggests a risk of escalating violence and a feeling of fear and helplessness.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 00:41:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Almost relapsed after being clean for months. Reached out to a friend instead. Still shaky, but I made it through. Talking helps, even when it's the last thing you want to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual reports feeling overwhelmed and almost relapsing after a period of sobriety, indicating a significant vulnerability and risk of returning to harmful behavior. While they reached out for help, the close call suggests ongoing challenges.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 00:40:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Walking on eggshells constantly. Just need to feel safe again. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling unsafe at home and 'walking on eggshells,' which suggests a potentially volatile or abusive situation. While it doesn't explicitly mention violence or abuse, the feeling of constant anxiety and the desire for safety indicate a concerning situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 00:39:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my brother. He's okay now thanks to Narcan, but it was close. Scary how fast it can happen. Learn the signs, please. Could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Near-fatal overdose requiring Narcan indicates a severe immediate risk, even if the person is currently stable.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 23:17:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"He's been isolating me from my friends lately. Says they're 'bad influences.' Is this normal? Feeling so alone and confused.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Isolation from friends is a common tactic in abusive relationships, raising concerns about potential emotional or psychological abuse. The reported feelings of loneliness and confusion further amplify the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 23:16:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to a friend helped a bit, but it's still hard. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but it doesn't contain explicit threats or plans for self-harm, suicide, violence, abuse, or overdose. Seeking help from a friend indicates a coping mechanism.",
    "detected_category": "other",
    "timestamp": "2025-12-14 23:15:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw another ambulance downtown. Makes me sick thinking about it... lost a friend last year. Naloxone saves lives, people. Know where to get it. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses sadness and concern related to ambulance sightings and past loss, but doesn't indicate immediate danger. The message encourages naloxone use, suggesting awareness and a preventative approach to overdose rather than current risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 23:14:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post addressing suicide, while avoiding harmful content and focusing on seeking help:\n\n\"Felt so down lately, like nothing matters. Reached out to a friend and it helped more than I thought. If you're struggling, please talk to someone. You're not alone. 988 is there.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The post acknowledges suicidal feelings but emphasizes seeking help and provides a resource (988). It avoids graphic details or glorification.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 23:13:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Never thought I'd see it. Friend OD'd last night. Scariest thing ever. Narcan saved him. Learn the signs, carry it if you can. Could save a life. #overdose #narcan #recovery",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event requiring Narcan intervention, indicating a life-threatening situation. The friend was saved but this points to a high-risk scenario.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 23:12:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after od'ing. Scariest thing ever. Never thought it would happen to me. If you're struggling, please reach out. There's help out there. I promise it's worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose, indicating a significant risk of recurrence and potential for further harm or death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 23:11:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIPs lately. Lost another friend to an overdose last night. Please, if you're struggling, reach out. There are people who care. I wish [friend's name] had. 💔",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses grief and loss due to a friend's overdose, and implicitly acknowledges the potential for others to be struggling with similar issues. The mention of wishing the friend had reached out suggests the author is aware of the possibility of intervention, implying the situation could have been prevented, hence the elevated concern. There is an elevated risk of secondary trauma for people dealing with loss.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 23:10:03"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get punched outside the bar last night. Shook me up. Just walking away doesn't feel right, but what else can you do? Anyone else ever feel this helpless?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence can be upsetting, but the text describes an isolated incident and the author's emotional reaction to it. There's no indication of ongoing or escalating risk to anyone.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 23:09:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "**(Option 1: Seeking Help)**\n\n> Feeling so lost lately. Everything's just...heavy. Reaching out before things get worse. Anyone know good resources?\n\n**(Option 2: Sharing Experience)**\n\n> I've been there. That dark place. It DOES get better, even when you can't see it. Please, talk to someone.\n\n**(Option 3: Raising Awareness)**\n\n> Checking in on my friends today. You never know what someone's going through. A little kindness can go a long way.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Option 1 indicates distress and a desire for help, but doesn't suggest immediate danger. Option 2 is supportive and encouraging seeking help, while Option 3 promotes checking on friends. No explicit suicidal ideation or plans are mentioned.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 23:07:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's hard to admit, but things at home have been bad. Constant put-downs, isolating me from friends... Feeling trapped. Anyone else been through this? Need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional abuse and isolation, which can lead to significant distress and potentially escalate to self-harm or other harmful behaviors. The feeling of being \"trapped\" is a concerning indicator.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 22:17:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them. Please, if you or someone you know is struggling, reach out. There's help available. Don't let fear stop you.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was administered and the person survived, the event of an overdose indicates a significant risk of serious harm or death. The immediate danger has passed, but the underlying issue causing the overdose remains a serious threat.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 22:16:11"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw two guys fighting outside my building last night. Shook me up. Called the non-emergency line, but still feeling anxious today. Anyone else ever deal with something like this? Need to process.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate direct threat to the author. Anxiety is reported, but not to a level requiring immediate intervention. No mention of intent to harm self or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 22:15:09"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Hard to admit, but things at home have been rough. Constant put-downs, walking on eggshells... Is this normal? Feeling so lost and alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional distress, a potentially unhealthy home environment with put-downs and a sense of isolation. While not explicitly stating intent for self-harm or violence, the 'walking on eggshells' suggests potential abuse and the feeling 'lost and alone' indicates vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 22:14:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them. Pls learn the signs & carry it if you can. It really makes a difference. Where can I get more info about local resources?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessed a potentially fatal overdose, indicating a severe risk situation. While the person survived, the event highlights a significant danger and potential for future occurrences or similar emergencies.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 22:13:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling overwhelmed. Urges are strong tonight. Anyone else relate? Just trying to get through it.\n\n**Option 2 (Sharing Experience):**\n\n> Scars are a reminder of a past I'm working to leave behind. It's a journey, not a destination, right?\n\n**Option 3 (Raising Awareness):**\n\n> It's easy to hide the pain. Please check in on your friends, even the ones who seem okay. You never know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions strong urges and feeling overwhelmed, suggesting a potential for self-harm. While not explicitly stating intent, the urgency and emotional distress warrant a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 22:12:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Narcan saved them. Please, if you or someone you know is struggling, reach out. There's help available. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan intervention was successful, the text reports a drug overdose, which is a life-threatening event. The situation was resolved, but the potential for serious harm exists.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 22:11:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thankfully. Please, if you're struggling, reach out. Don't want anyone to go through that. Resources are out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, indicating a significant health risk and potential for fatality. While Narcan was effective, the event itself signifies a high level of immediate danger.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 22:10:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out before it gets worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, using the metaphor of being underwater. The phrase 'Reaching out before it gets worse' suggests a proactive attempt to seek help, but also implies the potential for escalation. While not explicitly stating suicidal ideation, the distress level and the mention of things potentially worsening warrant a medium severity assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 22:09:00"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out on the bus today. Scared me half to death. Is it just me, or is everyone on edge lately? How do you all cope with seeing stuff like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is alarming but doesn't indicate direct personal harm or immediate danger to the speaker. The speaker expresses fear and anxiety but doesn't suggest intent to harm themselves or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 22:07:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Just reached out to the crisis line. Talking helped, even just a little. If you're struggling, please don't wait. 988 is there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feeling \"heavy\" and reached out to a crisis line, indicating distress and potential vulnerability. While they state talking helped, the initial distress warrants a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 21:17:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on finding the strength?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, with difficulty reaching out for help, which are potential indicators of a mental health crisis. The expressed need for 'finding strength' suggests a desire to improve the situation but also hints at a current struggle.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 21:16:07"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Punches thrown, yelling... I froze. It brought back so many bad memories. Feeling shaky and anxious now. Anyone else get triggered by stuff like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and experiencing anxiety/triggering memories as a result. While distressing, there's no indication of immediate danger to self or others, or planning to cause harm.",
    "detected_category": "other",
    "timestamp": "2025-12-14 21:15:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed yesterday. Hurt myself again after being clean for a month. Disappointed in myself, but trying to be kind. Reached out to my therapist. One day at a time, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse of self-harm after a period of abstinence indicates increased risk. Reaching out to a therapist is a positive step, but the recent self-harm episode warrants monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 21:14:03"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy shove his girlfriend on the street today. Broad daylight. I froze. Wish I'd said something, anything. Feeling sick about it. Anyone else ever witness something like that? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an act of violence (shoving). While it doesn't indicate serious physical harm, it does describe a potentially escalating abusive situation.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 21:13:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "**(Option 1: Seeking Help)**\n\n> Been feeling so low lately. Like I'm underwater. Reaching out to a friend, but it's hard. Anyone else feel this way? Just need to know I'm not alone.\n\n**(Option 2: Sharing a Story)**\n\n> Lost my uncle to suicide years ago. Still hurts. Please check in on your loved ones, even the ones who seem okay. You never know what they're going through.\n\n**(Option 3: Expressing Hopelessness)**\n\n> Everything feels pointless. Don't know what to do anymore. I'm so tired.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 3 expresses feelings of hopelessness and lack of purpose, which are risk factors for suicide. Option 1 also indicates a depressed mood, but the act of reaching out is a protective factor. Option 2 is about support for others.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 21:12:00"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a glass wall. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of numbness and detachment, indicating a potential mental health crisis. The individual is reaching out, suggesting a need for support and intervention. While there's no explicit mention of self-harm or suicide, the overall tone warrants concern and further assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 21:10:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Didn't know what to do. Is calling the non-emergency line the right move next time? Feel sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence. While not directly involved, the event indicates a potential for escalation and caused distress to the observer.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 21:09:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another overdose. Scares me. Lost a friend last year. If you're struggling, please reach out. There's help out there. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and mentions the loss of a friend to an overdose, suggesting personal impact and awareness of the risk. It encourages seeking help, indicating a potential struggle with the issue.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 21:08:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Been having a rough time lately. Urges are back. Reached out to a friend, feels a little better. Remember you're not alone if you're struggling.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential risk. Reaching out to a friend is a positive coping mechanism, but the presence of urges still warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 21:07:54"
  }
]