[
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Reminded me of my brother. Anyone else feel extra anxious after witnessing violence? Need to breathe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence, causing anxiety. While distressing, it doesn't indicate immediate danger to the author or others, nor does it suggest intent to harm self or others. The event is described as being 'shaking up'.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 08:21:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges are strong. Trying to distract myself with a movie. Anyone else get through this? How?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges which, without further context, are concerning. The user is actively trying to cope, which is a positive sign, but the intensity of the urges warrants a medium severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 08:20:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling so lost and overwhelmed. Reached out to a friend, just needed to vent. Taking it one day at a time. There's help out there, even when it doesn't feel like it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but focuses on coping mechanisms like reaching out to a friend and taking things one day at a time. While concerning, it doesn't explicitly mention self-harm, suicidal ideation, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2025-12-18 08:19:21"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough lately. He's been isolating me from friends, saying I'm always wrong. It's exhausting. Anyone else been through this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and social isolation, which can escalate to more severe situations. The user is expressing distress and seeking help.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 08:18:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. The urge to cut is strong. Reached out to a friend, hoping it helps. Anyone else feel this way? It's so hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to cut, indicating active suicidal ideation with a specific method. Reaching out to a friend is a positive coping mechanism, but the presence of the urge signifies a high level of immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 08:17:18"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just left. Again. My head's spinning. Said he was sorry, said it wouldn't happen again...but it did. I feel so stupid. Is it ever gonna stop?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 61 (char 86)",
    "detected_category": "unknown",
    "timestamp": "2025-12-18 08:16:16"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. The yelling is constant, and now... I just feel numb. Anyone else ever feel trapped like this? Is there a way out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, feelings of being trapped, and mentions yelling. While not explicitly suicidal, the numbness and feeling trapped suggest a potential for escalation. The user is also reaching out for help.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 08:15:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD. Makes me sick. Lost my cousin last year. Please, if you're struggling, reach out. There are people who care. It's not worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about overdose deaths and mentions a personal loss due to overdose, implying potential risk to others struggling with substance use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 08:14:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Just reaching out to see if anyone else understands this heavy fog. Trying to find my way back to the light.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loss and being lost, but lacks specific details about self-harm, suicide, or harm to others. The phrase 'trying to find my way back to the light' suggests a desire for improvement rather than immediate danger.",
    "detected_category": "other",
    "timestamp": "2025-12-18 08:13:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get too much. Hurt myself again. Feeling ashamed but also...relieved? Need to find better ways to cope. Anyone else been there? How did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text explicitly mentions self-harm, indicating an immediate risk. While the writer expresses a desire to find better coping mechanisms, the act of self-harm has already occurred and requires attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 08:12:08"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I feel so lost. My partner keeps isolating me from my friends and family. It started small, but now I feel trapped. Has anyone else experienced this? Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes isolation and feeling trapped, which are indicative of potential emotional and psychological abuse. While not explicitly stating physical harm, the situation presents a risk of escalating distress and potential harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 07:19:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so lost lately. Everything's just...heavy. Anyone know any good resources for when you feel like you're drowning?\n\n**Option 2 (Sharing Experience):**\n\n> Been there. The darkness can feel all-consuming. But it DOES get better. Reach out. Please.\n\n**Option 3 (Raising Awareness):**\n\n> Checking in. Hope everyone's being kind to themselves & each other. You never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feeling 'lost' and 'drowning,' indicating significant emotional distress and a potential crisis. While not explicitly suicidal, the language suggests a need for support and resources.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 07:18:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Walking on eggshells constantly. Is this normal? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and potentially unsafe home environment where the individual feels isolated and is 'walking on eggshells.' This suggests possible emotional or psychological abuse, or a situation where conflict is frequent and unpredictable, but it doesn't specify immediate physical danger. The feeling of being alone adds to the concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 07:17:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\"Just realized I've been normalizing some really messed up behavior in my relationship. Gaslighting, constant put-downs... Is this abuse? Feeling lost and confused. Anyone been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional abuse and the individual is experiencing confusion and distress. While not explicitly stating intent to harm self or others, the normalization of abusive behaviors and resulting feelings of being 'lost' indicate a potential risk of escalating mental health issues.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 07:16:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Constantly walking on eggshells. Is this normal? Feeling so lost and alone. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home situation with constant anxiety ('walking on eggshells') and feelings of isolation, which could escalate if left unaddressed. While not explicitly mentioning harm, the distress and loneliness suggest a need for support.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 07:15:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's hard to admit, but things aren't good at home. Walking on eggshells constantly. Anyone else ever feel like they're losing themselves? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of distress, potential abuse (\"walking on eggshells\"), and a sense of losing oneself. While it doesn't explicitly mention self-harm or suicide, the level of distress warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 07:14:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes a fight and someone being knocked unconscious, it's a secondhand account and doesn't indicate the original poster is in immediate danger or planning violence. However, the description suggests a real-world violent incident and the associated distress warrants a medium severity rating.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 07:13:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so overwhelmed lately. Everything feels heavy. Reaching out before things get worse. Anyone know good resources?\n\n**Option 2 (Personal Story):**\n\n> Been there. The dark place is real. It DOES get better. Hold on, please. You are stronger than you think.\n\n**Option 3 (Raising Awareness):**\n\n> Check in on your friends. You never know what someone is going through. A little kindness can go a long way.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the author is feeling overwhelmed and reaching out to prevent things from getting worse. While not explicitly suicidal, the mention of 'before things get worse' and feeling 'heavy' suggests potential for escalation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 07:12:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scared me so bad. They're ok now, but it was a wake-up call. Narcan saves lives. Learn how to use it. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the person survived, indicates a significant safety risk in the environment and raises concern for potential future incidents.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 07:11:35"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor being carried out by paramedics last night. OD. Terrifying. Makes you realize how fragile life is. Check on your friends, folks. Really.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While not directly mentioning self-harm or suicide, the text describes an overdose and expresses the fragility of life, suggesting a potential for emotional distress and heightened risk awareness within the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 07:10:33"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but lacks specific details about suicidal ideation, self-harm plans, or any imminent danger. It's a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-18 06:22:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm underwater. Reaching out before it gets worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and a desire for connection before things worsen, suggesting potential for escalation without intervention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 06:21:46"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out downtown. Shook me up. Reminded me of things I try to forget. Anyone else get triggered by stuff like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling triggered, but it doesn't express intent to harm self or others. The focus is on the emotional impact of the event.",
    "detected_category": "other",
    "timestamp": "2025-12-18 06:20:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm underwater. Just reaching out to see if anyone else understands. Hard to keep going some days.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and hopelessness, with a passive expression of difficulty continuing. While not explicitly suicidal, the language suggests significant emotional distress and a potential risk of escalation if left unaddressed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 06:19:42"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just feeling really lost. Things at home have been... rough. I'm walking on eggshells all the time. Anyone else ever feel like that? Is it normal?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and walking on eggshells, suggesting stress and difficulty at home, but does not contain explicit threats or plans for self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2025-12-18 06:18:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Been feeling so isolated lately. My partner's constantly putting me down, and I'm starting to believe it. Anyone else been through this? Feeling lost.\"\n\n**Option 2 (Sharing a Story):**\n\n> \"Finally left. It was terrifying but I'm safe now. Years of walking on eggshells... never again. There IS a way out.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Emotional abuse leaves invisible scars. It's REAL, it hurts, and it's NEVER okay. Know the signs.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes experiences of emotional abuse and isolation, which can increase the risk of mental health issues and potentially escalate to more severe situations if left unaddressed. While not explicitly stating imminent harm, the vulnerability expressed warrants a medium severity rating.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 06:17:39"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight outside my kid's school today. Shook me up. Makes you wonder what's going on with people. Anyone else feel like things are getting more volatile?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight indicates a potential for violence and creates a feeling of unease, suggesting a medium-level risk due to the observed aggression and expressed concern about increasing volatility.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 06:16:37"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street. Really heated. Didn't get physical, but I was scared it would. Should I have done something? Feel helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The situation described involves a heated argument, but no physical violence occurred. The observer felt fear and helplessness, indicating potential escalation, but the immediate risk is low as no one was physically harmed.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 06:15:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just talking about it feels like a weight lifted. If you're struggling too, please reach out to someone. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness but also encourages seeking help and emphasizes not being alone. This suggests a struggle with mood but doesn't indicate immediate risk of harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 06:14:33"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Just reaching out to say if you're struggling, you're not alone. Talking helps, even if it's just a little. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being 'heavy,' which could indicate depression or distress. While it encourages seeking help, the underlying issue needs further investigation to assess potential risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 06:13:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD in my town. Scared. Addiction is a monster. If you're struggling, please reach out. There's help available. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and mentions a recent overdose in the town, indicating potential risk related to overdose or substance use issues in the community. While not directly suicidal, the mention of addiction and overdose suggests a vulnerable context.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 05:20:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Felt so overwhelmed yesterday. Urges were strong. Managed to call a friend instead. Still shaky, but glad I didn't give in. It's a daily battle.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and feelings of being overwhelmed, suggesting a potential risk of self-harm or relapse into a harmful behavior. The individual is actively fighting the urges, but the 'shaky' feeling indicates the struggle and continued vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 05:19:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them. Learn CPR, carry it if you can. You never know when you'll need it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a potentially traumatic event and highlights the risk of overdose in the community. While Narcan was used successfully, the event signifies a risk of future overdoses.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 05:18:05"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. Walking on eggshells constantly. Anyone else feel like their partner's mood dictates their whole day? Is that normal? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of constant stress and emotional dependence, suggesting potential emotional abuse or a volatile relationship. While not explicitly stating violence or harm, the phrase \"walking on eggshells\" indicates a potentially unsafe emotional environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 05:17:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. The urge to self-harm is strong. Talking feels impossible, but I know I need help. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm and acknowledges the need for help. This combination indicates a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 05:16:02"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm so tired of feeling small. He says it's 'just jokes' but it chips away at me. Has anyone else dealt with constant put-downs? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being worn down and diminished by the other person's behavior which could potentially lead to mental health issues if the abuse continues.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 05:15:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things at home are getting worse. Walking on eggshells constantly. Is this normal? Feeling so alone and scared.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a worsening home situation with feelings of fear and isolation. While not explicitly stating harm, the \"walking on eggshells\" suggests a potentially volatile or abusive environment, raising concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 05:13:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Wish I'd said something, anything. Feeling sick about it. What do you even do in that situation?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence and experiencing feelings of guilt and helplessness can be psychologically distressing and contribute to future safety risks. The act of violence itself suggests a risk of further violence or escalation.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 05:12:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my apartment. Shook me up. Makes you wonder what people are going through. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing emotional distress but no direct indication of immediate danger to the author or others. While the event is unsettling, it does not suggest imminent harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 05:11:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a crisis line, talking helps. Remember you're not alone. ❤️‍🩹",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Strong urge to self-harm indicated, which requires immediate attention and support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 05:10:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. The yelling, the insults... I feel so small. Is this normal? I don't know what to do anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential abuse, suggesting a need for intervention but does not explicitly mention self-harm or suicide.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 04:26:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved their life. Carry it, learn how to use it. You could save someone's kid, friend, or even a stranger. #overdose #Narcan #OD #opioid",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event and highlights the potential for life-threatening situations. The text encourages carrying and using Narcan, implying a significant risk of opioid overdose in the area.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 04:25:25"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Never seen anything like that in person before. Makes you realize how fragile everything is. Anyone else feel like their city's getting angrier?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate an immediate or ongoing threat to the author or others. While concerning, it doesn't suggest severe harm is occurring or imminent. It mainly expresses the author's emotional reaction and a general concern about the city's atmosphere.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 04:24:23"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Finally left. Scared & broke, but free. Gaslighting is real, and it messes you up. Any advice on rebuilding after emotional abuse? Feeling lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses fear, financial instability, and feeling lost after experiencing emotional abuse. While not explicitly stating self-harm or suicidal intent, the vulnerability and distress raise concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 04:23:21"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. The constant put-downs are chipping away at me. Anyone else feel like they're walking on eggshells all the time? Is this normal in a relationship? #abuseawareness",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a potential abusive relationship, suggesting a medium level of immediate risk. The user mentions 'constant put-downs' and 'walking on eggshells', classic signs of emotional abuse and control.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 04:22:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are back and stronger. Reached out to a friend, just need someone to listen. It helps, even a little. Taking it one hour at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges, which suggests a potential for self-harm or suicidal ideation. While the individual is reaching out for support and taking things one hour at a time, the intensity of the urges elevates the risk to medium.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 04:21:18"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Started over nothing, ended with someone bleeding. Makes you wonder, what's wrong with people? Feeling shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be psychologically distressing and indicates a potential for physical harm in the area.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 04:20:16"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong, but I'm trying to resist. Reached out to a friend, hoping it helps. Just need to make it through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm (cutting) and the individual is struggling to resist. While they are trying to cope by reaching out to a friend, the intensity of the urge and the focus on 'making it through tonight' indicate a high level of immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 04:19:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after 6 months clean. Disappointed in myself, but trying to remember recovery isn't linear. Back to therapy this week. One day at a time.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of recovery indicates a vulnerability and potential for escalation if not addressed. The individual is seeking help (therapy), which is a positive sign, but the relapse itself warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 04:18:12"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Seeing someone get hurt like that... makes you realize how quickly things can escalate. Anyone else feel anxious after witnessing violence?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence, which is upsetting, but doesn't indicate an immediate threat to the author or others. It expresses anxiety but no specific plans or intentions for harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 04:17:11"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm drowning. Reached out to a friend, just need someone to listen. It's hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and 'drowning', indicating distress. While the text shows help-seeking behavior (reaching out to a friend), the intensity of the negative feelings warrants a medium severity level.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 03:44:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Remember we're not alone in this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, which indicates an elevated risk. While the person has reached out for help, the urge persists.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 03:43:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy, and I'm not sure how to cope. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost, overwhelmed, and unsure how to cope. While there is no explicit mention of self-harm or suicide, the statement \"I don't know what else to do\" indicates a level of distress that warrants concern and further assessment. The \"heavy\" feeling suggests a burden and emotional pain.",
    "detected_category": "other",
    "timestamp": "2025-12-18 03:42:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Reached out to a friend, feels a little better. Remember you're not alone. <3",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which could be related to self-harm or other harmful behaviors. The person sought help and feels 'a little better', suggesting an awareness of the problem and a willingness to engage in support, but the presence of urges elevates the risk beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 03:41:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Woke up feeling like I'm walking on eggshells again. Just wish things could be different. Anyone else ever feel trapped in their own home?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of unease and entrapment, but lacks specific details or imminent threats of harm to self or others. The \"walking on eggshells\" metaphor suggests a stressful environment, but not necessarily one involving immediate danger.",
    "detected_category": "other",
    "timestamp": "2025-12-18 03:40:30"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside the grocery store. Shook me up. Made me realize how easily things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't directly indicate imminent danger to the person writing or others. It expresses feeling shaken and on edge, suggesting anxiety rather than a direct threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 03:39:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... rough. Walking on eggshells constantly. Anyone else ever feel trapped? Feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, feelings of being trapped, and loneliness, suggesting potential for escalation. 'Walking on eggshells' hints at a stressful or potentially abusive environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 03:38:27"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the bus stop. Dude just snapped. Scared the hell out of me. Is this normal now? Feeling really shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A fight broke out, indicating a potential for physical harm to those involved or nearby. While the reporter wasn't directly involved, their shaken-up state suggests a level of distress and potential vulnerability.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 03:37:25"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy get shoved on the train platform today. Scared me half to death. Is this normal now? Feel like I'm on edge all the time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the author was not directly harmed, witnessing a violent act (being shoved) can be traumatizing and increases anxiety/fear of future violence. The phrase \"Scared me half to death\" and \"feel like I'm on edge all the time\" suggests a significant impact on their well-being. There is a potential for future, similar events. While not indicating direct involvement in violence themselves, the observation of violence is a safety concern. The shoving itself, however, represents an act of violence that *could* have resulted in significant harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 03:36:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, thank God. Makes you realize how fragile life is. Learn CPR & overdose signs, please. It could save someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential risk of overdose in the area and highlights the fragility of life, prompting action (learning CPR and overdose signs).",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 03:35:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. Walking on eggshells constantly. Anyone else feel like they're losing themselves? Feeling trapped.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 87 (char 112)",
    "detected_category": "unknown",
    "timestamp": "2025-12-18 02:51:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, but shook me up. Makes you realize how fragile life is. Anyone else feel helpless sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes an overdose event that was averted, the mention of feeling helpless suggests a degree of emotional distress and potential vicarious trauma. The event could increase vulnerability in the individual who witnessed it.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 02:50:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside my building. Called the cops. Shaking. Never know what to do in those situations. Hope she's okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Observed violence (assault) indicating potential for further harm to the victim. While the immediate threat is being addressed by law enforcement, the situation carries a risk of escalation or continued abuse.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 02:49:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Glad they got help in time. Makes you realize how easily things can go wrong. Know the signs, folks. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person received help, a drug overdose occurred in a public space, indicating a potential ongoing risk of overdose events and associated health consequences. The text also implies a need for awareness and preparedness, suggesting a potential for future incidents.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 02:48:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm finally out. It's terrifying and lonely, but I'm done being controlled. Anyone else feel like they're starting from scratch? #abuse #domesticviolence\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential escape from an abusive situation, which can be a high-risk time. The individual expresses feelings of terror and loneliness, suggesting vulnerability. While not explicitly suicidal or homicidal, the situation described warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 02:47:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD. Makes me sick. Lost a friend last year. Please, if you're struggling, reach out. There are people who care. I'm here if you need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about overdoses and acknowledges personal loss, suggesting awareness and potential risk for others who may be struggling with substance use. The mention of being there to talk indicates potential for immediate support but also implies an ongoing problem.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 02:45:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nSaw someone OD downtown today. Scariest thing. Narcan saved them, but it shook me up. Makes you realize how fragile things are. Anyone else feel this way? Be safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potential for similar events in the area and highlights the risk of drug use, which can have severe consequences. While the individual was saved, the event is still serious.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 02:44:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Lost a friend last night. OD. Feels so unreal. Please, if you're struggling, reach out to someone. Anyone. This hurts too much.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Indicates recent overdose death of a friend, which can significantly increase risk of suicidal ideation or substance use relapse in the person posting.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 02:43:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Reaching out because I don't know where else to turn. Any advice on finding mental health support?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and a need for mental health support, which suggests distress and a potential risk of escalation if left unaddressed.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 02:42:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad. Constant yelling, put-downs... I feel so small. Anyone else been through this? How did you find the strength to leave? #abuse #domesticviolence #help",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes ongoing verbal abuse, feelings of diminished self-worth, and a desire to escape the situation, indicating potential for escalation and significant psychological harm. The hashtags #abuse and #domesticviolence confirm a serious situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 02:41:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...not good. Walking on eggshells constantly. Is this normal? Feeling lost. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 89 (char 114)",
    "detected_category": "unknown",
    "timestamp": "2025-12-18 01:46:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, but it shook me up. Makes you think. Please, if you're struggling, reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even one where the person survived, indicates a significant risk environment related to drug use. The event caused emotional distress to the reporter, highlighting the impact of the situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 01:45:25"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Narcan saved them, but shook me up bad. Makes you realize how fragile life is. Anyone else dealt with this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event that can cause significant emotional distress. While the person survived, the original poster (OP) expresses feeling \"shook up bad\" and \"lost,\" indicating a need for support and potential mental health concerns arising from the event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 01:44:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like nothing matters. Reaching out because I know I need help. Anyone else been through this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The statement expresses feelings of hopelessness and a lack of motivation, suggesting possible depression. While not explicitly mentioning self-harm or suicide, the request for help indicates a level of distress that warrants concern and further assessment. The phrasing 'like nothing matters' is concerning.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 01:43:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to a therapist tomorrow, hoping it helps. It's exhausting pretending I'm okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, coupled with the exhaustion of pretending to be okay. Indicates emotional distress that warrants monitoring. While not explicitly suicidal, the language suggests a level of despair that requires attention.",
    "detected_category": "other",
    "timestamp": "2025-12-18 01:42:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of distress and isolation but doesn't contain explicit threats or plans for self-harm. It is a general cry for help and shared experience.",
    "detected_category": "other",
    "timestamp": "2025-12-18 01:41:18"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on my street last night. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel unsafe in the neighborhood lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates witnessing a fight, causing unease and raising concerns about neighborhood safety. While concerning, it doesn't directly imply imminent or severe harm to the author or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 01:40:17"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight break out downtown last night. So scary. Makes you realize how quickly things can escalate. Anyone else feel like things are getting more tense lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a concerning event, but it does not indicate imminent danger to the author or others. It expresses fear and a general observation about increasing tension, but lacks specifics to suggest a high level of risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 01:39:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "My brother almost didn't wake up yesterday. Scariest day of my life. Please, if you're struggling, reach out. Don't let pride or fear stop you. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text implies a serious health event or potential self-harm/suicide attempt ('almost didn't wake up'). While the outcome was positive, the risk is still present, suggesting ongoing struggle and vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 01:38:14"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Everything's just... heavy. Reaching out because I don't know what else to do. Talking feels impossible.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of numbness, heaviness, and a sense of being overwhelmed. The individual is reaching out for help, indicating they are aware of their distress. While there is no explicit mention of self-harm or suicide, the underlying emotional state suggests a potential risk that warrants further assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 01:37:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Terrifying. Narcan worked, thank god. Carrying it now. Everyone should. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests potential for future occurrences and highlights the presence of drug use in the area. While the immediate situation was resolved, the risk of future overdoses and potential harm to others remains.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 00:42:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Walking on eggshells constantly. Anyone else feel like they're losing themselves in their relationship? Feeling trapped.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, a feeling of being trapped, and a potentially unhealthy relationship dynamic. While not explicitly mentioning harm, the phrases \"walking on eggshells\" and \"losing themselves\" suggest a stressful and potentially controlling environment. This raises concern for potential escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 00:41:47"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight outside my kid's school today. Shook me up. Makes you wonder what we can do to stop the anger, y'know?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text doesn't indicate direct threat, imminent danger, or targeting. The concern is generalized anxiety about violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 00:40:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "I finally left. Packing was terrifying, but I'm safe at my sister's. Still feel like I'm walking on eggshells. Anyone else experience this? How do you start to feel normal again?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially dangerous situation ('packing was terrifying', 'walking on eggshells'). While the person is currently safe, the fear suggests a past or potential future risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 00:39:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and isolation but does not contain explicit mentions of self-harm, suicide, or violence. It appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-18 00:38:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of depression and acknowledges the need for help, indicating some awareness and help-seeking behavior, but the depth of distress suggests a need for support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 00:37:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nSaw someone OD last night. Scary stuff. Narcan saved them, but it was too close. Learn the signs, carry Narcan if you can. It could save a life. Really shaken up today.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent, near-fatal overdose incident requiring Narcan intervention, indicating a high risk of immediate harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 00:36:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant yelling, walking on eggshells... I feel so small. Anyone else been through this? Feeling really lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 86 (char 111)",
    "detected_category": "unknown",
    "timestamp": "2025-12-18 00:35:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my friend OD last night. Scariest moment of my life. They're okay now, thankfully. Please, everyone, be careful and look out for each other. Naloxone saves lives. Know how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose victim is now okay, the event indicates a significant risk of future overdose incidents for the individual and potentially others in their social circle. The text highlights a recent, direct experience with a life-threatening overdose.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 00:34:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He yells, then apologizes, then... I just don't know what to do anymore. Anyone else feel this way? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and feelings of isolation and helplessness, which could escalate to more serious risks over time. While not explicitly stating harm, the implied yelling and unpredictable behavior raises concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 00:33:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about overdose deaths again. It hits different now. Lost a friend last year. Please, if you're struggling, reach out. There's help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references overdose deaths and a personal loss due to overdose, suggesting potential risk, especially if the writer is struggling with similar issues or grief. While not explicitly suicidal, the mention of struggling and the implicit understanding of the context raise concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-17 23:17:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. Makes me sick. Lost a friend last year, & it's still so raw. If you're struggling, please reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and sadness related to an overdose death, and mentions a past loss, indicating potential vulnerability. While it encourages seeking help, the personal connection to the issue elevates the risk beyond just general awareness.",
    "detected_category": "overdose",
    "timestamp": "2025-12-17 23:16:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home have been...scary lately. I feel so isolated. Anyone else ever feel like they're walking on eggshells all the time?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially unsafe home environment and feelings of fear, hinting at possible abuse or violence. The phrase \"walking on eggshells\" suggests a volatile and unpredictable situation. Isolation is also a risk factor.",
    "detected_category": "abuse",
    "timestamp": "2025-12-17 23:15:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so overwhelmed lately. Like I'm underwater. Reaching out to a friend, but it's hard to explain. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and struggling, but lacks specific suicidal ideation, self-harm plans, or threats to others. Reaching out to a friend indicates a coping mechanism.",
    "detected_category": "other",
    "timestamp": "2025-12-17 23:14:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. The urge to self-harm is strong. Trying to distract myself with music. Anyone else get this way? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating a potential risk, although the person is actively trying to cope.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-17 23:13:41"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is back. It's like a really bad itch I can't scratch. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions the return of the urge to self-harm, indicating a significant escalation of risk. While the person has reached out to a friend, the intensity of the urge suggests a crisis situation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-17 23:12:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"I feel so lost. Things at home have been getting worse, and I don't know who to turn to. Is there anyone who understands what it's like to feel trapped like this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, trapped, and a worsening home situation, suggesting potential emotional distress and a lack of support. While not explicitly suicidal or violent, the intensity of the negative emotions and sense of isolation raise concern.",
    "detected_category": "other",
    "timestamp": "2025-12-17 23:11:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but it lacks specific details about suicidal ideation, self-harm plans, or any intention to harm others. It seems more like a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-17 23:10:36"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard yelling next door again last night, then a loud crash. I hate feeling helpless, like I should do something but don't know what. Anyone else been through this? What did you do?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential domestic violence next door. The yelling, loud crash, and the author's feeling of helplessness suggest a potentially escalating situation where someone might be at risk of harm. While not directly referencing violence against the author, the proximity and potential for harm to others justifies a medium severity rating.",
    "detected_category": "violence",
    "timestamp": "2025-12-17 23:09:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of things back home. Anyone else feel anxious after witnessing violence? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which can be distressing, but does not express immediate danger to self or others. It expresses anxiety and seeks coping mechanisms.",
    "detected_category": "violence",
    "timestamp": "2025-12-17 23:08:33"
  }
]