[
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, thank god. Carry it, learn how to use it. You never know. #staysafe #overdoseprevention",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual survived, the text describes an overdose event which carries a high risk of fatality. The call to action highlights the potential for encountering similar life-threatening situations.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 23:17:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "```\nBeen feeling so overwhelmed lately. The urge to self-harm is getting stronger. Reached out to a friend, but it's still tough. Anyone else relate? Just looking for some support.\n```",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk of harm. While the individual has reached out for support, the strength of the urge suggests immediate concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 23:16:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Constantly walking on eggshells. Anyone else feel this way? Feeling really lost and unsure what to do next.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a distressed mental state and a potentially unsafe home environment. Walking on eggshells suggests fear and anxiety, increasing the risk of negative outcomes. While no specific threat is mentioned, the overall tone warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 23:15:33"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scared me senseless. Narcan saved them. Please, learn CPR and how to use it. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived due to Narcan, the event highlights the ongoing risk of overdose, which can be fatal. The writer expresses fear, indicating a significant emotional impact.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 23:14:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Just reaching out. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, which could indicate a mental health crisis or suicidal ideation. The user is reaching out for help, suggesting they are struggling. While not explicitly suicidal, the underlying distress warrants a medium severity assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 23:13:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Just wanted to say I'm having a rough time. Urges are strong. Reached out to a friend, feels a little better. Remember you're not alone. 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges, suggesting a potential risk of self-harm or other negative behavior. Reaching out to a friend is a positive coping mechanism, but the strength of the urges warrants a medium severity level.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 23:12:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so lost. Has anyone else experienced this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional abuse and controlling behavior, leading to feelings of being lost. While it doesn't explicitly mention physical harm, the pattern of controlling behavior and put-downs can escalate and have serious psychological effects. There is a risk the situation will deteriorate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 23:11:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Constant put-downs, feeling isolated... I'm starting to think this isn't normal. Anyone else been through this? Need to talk.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse and isolation, potentially leading to mental health deterioration. The user expresses a need to talk, suggesting they are struggling.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 23:10:25"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Been walking on eggshells lately. Partner's anger is getting scary. Is this normal? Feeling so alone and confused. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a partner's anger escalating to a 'scary' level, indicating potential for harm and distress, and mentions feeling alone and confused, which are risk factors. While there's no explicit mention of violence, the situation warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 23:09:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head. Hard to explain. Just wanted to say if you feel like hurting yourself, you're not alone. Please reach out to someone. I'm trying to. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses internal distress and acknowledges suicidal ideation, although it encourages seeking help.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 23:08:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling? Could use a lifeline.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, uses metaphorical language indicative of distress and a desire for help (\"lifeline\"). While not explicitly suicidal, the language suggests potential for escalation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 22:17:28"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Felt sick. Should I have said something? Now I just feel guilty for walking away. Is there anything I can even do after the fact?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault indicates a potential for further violence or escalation. While not directly involving the reporter, the severity is raised due to the observed act of violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 22:16:27"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing loudly on the street, escalating fast. Reminded me of my parents. Feeling anxious. Anyone else get triggered by stuff like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes feeling anxious after witnessing an argument. While it evokes negative emotions, it does not indicate immediate harm or danger to the author or others. The question about coping mechanisms suggests a desire to manage the feelings constructively.",
    "detected_category": "other",
    "timestamp": "2026-01-18 22:15:25"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Froze. Wish I'd said something, anything. Now I just feel sick. Has anyone else dealt with this? How do you react in the moment? Need advice.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an act of violence (shoving). While the direct harm to the original poster is low, the potential for escalation of violence and the impact on the victim make it a medium severity situation. The poster's emotional distress indicates potential for further action or inaction that could affect their well-being or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 22:14:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"I keep making excuses for him. He says he's stressed, but then yells and breaks things. Is this normal? Starting to feel really scared and alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential escalation of violence and the individual expresses fear, suggesting a risk of harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 22:13:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so incredibly low lately. Like I'm trapped. Reaching out to a friend, but it's hard to talk about. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped and low mood, which can indicate a risk of self-harm or suicidal ideation. Reaching out to a friend is a positive step, but the difficulty in talking about it suggests the feelings are intense.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 22:12:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm just going through the motions. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and going through the motions, indicating potential emotional distress but lacks explicit mentions of self-harm, suicide, or harm to others. It seems like a general expression of feeling down and seeking connection.",
    "detected_category": "other",
    "timestamp": "2026-01-18 22:11:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor being carried out on a stretcher. Narcan saved his life. Scared me so bad. This stuff is real. Please be careful out there, folks.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the neighbor survived, the text describes a near-fatal overdose requiring Narcan, indicating a significant risk of death associated with the 'stuff' mentioned. The fear expressed also suggests a high level of impact.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 22:10:18"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been rough. Constant put-downs, controlling behavior... I feel so trapped. Has anyone else gone through this? Need to feel less alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and a feeling of being trapped, which can escalate to more dangerous situations if not addressed. While there's no explicit mention of physical harm, the controlling behavior and put-downs suggest a potentially harmful dynamic.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 22:09:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice or just someone to listen?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating emotional distress and a lack of coping mechanisms. While not explicitly suicidal, the mention of 'not knowing what else to do' warrants concern and further assessment. Could escalate without support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 22:08:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough. Constant yelling, put-downs. Feeling so small. Anyone else been through this? How do you even start to get out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse (yelling, put-downs, feeling small) and expresses a desire to escape the situation, suggesting potential escalation of the abuse or development of mental health issues. While not explicitly stating immediate danger, the distress and need for help warrant concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 21:16:53"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on the way home. Two guys just going at it. Makes you wonder what's going on in their lives to get to that point. Feeling uneasy about it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling and create a feeling of unease, but there's no indication of immediate or direct threat to the safety of the author or others. The author expresses concern but isn't directly involved or threatened.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 21:15:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Walking on eggshells constantly. I feel so isolated. Has anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 82 (char 107)",
    "detected_category": "unknown",
    "timestamp": "2026-01-18 21:14:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Narcan saved him. Scariest thing ever. Learn the signs of OD, please. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 21:13:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... feels like I'm walking on eggshells. Anyone else been through this? How did you find the strength to leave?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, indicating a potentially abusive situation. While not explicitly stating physical violence, the psychological impact and feeling of being unsafe suggests a concerning level of risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 21:12:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, thank god. Makes you realize how fragile life is. Be safe out there, everyone. Know your limits.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, can be psychologically distressing and indicates a significant safety risk in the environment. It suggests potential for future overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 21:11:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just existing is exhausting. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of low mood, exhaustion, and helplessness. While there's no explicit mention of self-harm or suicide, the statement \"Just existing is exhausting\" suggests a significant level of distress and a need for support. The individual reaching out indicates a willingness to seek help, but the depth of their despair warrants a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 21:10:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Trying to resist, but it's hard. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a clear urge to self-harm (cutting), indicating a potential risk. While the individual is trying to resist, the presence of the urge and the difficulty in resisting elevate the severity.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 21:09:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Like there's no air. Reaching out before I completely lose it. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and being overwhelmed, indicating potential for escalation. The phrase \"before I completely lose it\" suggests a loss of control.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 21:08:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD today. Shook me up bad. Narcan worked, thank God. Learn how to use it, seriously. It could save a life. Wish I knew him better.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose indicates a high-risk situation potentially involving illegal substances and life-threatening medical emergencies. The overdose itself is a severe health risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 21:07:39"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. People just stood there filming. Makes you wonder what's wrong with the world. Feeling shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be disturbing and cause emotional distress ('feeling shaken'), but the text doesn't indicate immediate danger to the speaker or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 20:18:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Narcan saved them. Makes you realize how close it is. Learn CPR, carry Narcan. It can save a life. #overdose #naloxone #awareness",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potential risk of overdose in the area and proximity to the user. While the person was saved, the event highlights a significant health risk and the potential for future incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 20:17:35"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. Really fighting the urge to relapse. Reached out to my therapist, but the wait is killing me. Anyone else get this feeling? Just trying to get through the next hour.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual is experiencing a strong urge to relapse, which suggests a potential for self-harm or harmful behavior. While they've reached out for help, the waiting period increases the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 20:16:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scary stuff. Narcan saved them, but shook me up bad. If you're using, please carry it. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event that required Narcan intervention, indicating a significant and immediate threat to life. The author's shaken state also suggests the potential for vicarious trauma or increased anxiety related to substance use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 20:15:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before things get worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 82 (char 107)",
    "detected_category": "unknown",
    "timestamp": "2026-01-18 20:14:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The constant put-downs are wearing me down. Anyone else ever feel this way? Feeling trapped.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being worn down and trapped, suggesting emotional distress and potential for escalation. While not explicitly suicidal, the underlying sentiment warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 20:13:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Please, if you're struggling, reach out. There are people who care and want to help you get through this. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a potential suicide attempt or serious self-harm incident involving the friend, although it is not explicitly stated. The phrase 'almost didn't wake up' is a strong indicator.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 20:12:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Clean for 3 weeks, then relapsed last night. Feeling so ashamed. Reaching out before it gets worse again. Anyone know good distraction techniques?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety can increase the risk of overdose or further harmful behavior. The individual is expressing shame, which can be a precursor to escalating distress.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 20:11:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming. Just wanted to say, if you're struggling with self-harm, you're not alone. It's okay to reach out for help. Talking about it is the first step.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text directly mentions self-harm, indicating a potential risk. While it encourages seeking help, the acknowledgement of struggling with self-harm elevates the severity beyond simply expressing feeling overwhelmed.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 20:10:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's so exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a high level of distress and immediate risk. While the individual has reached out to a friend, the intensity of the urge necessitates immediate concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 20:09:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. Urges were strong. Didn't give in, though. Small victory. Reaching out for support feels scary, but I know I need it. #selfharmrecovery\"\n\nI have removed the hashtag, and instead have added that the person is feeling scared but is wanting to reach out. I have also made it clear that this is a personal struggle they are facing.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges related to self-harm, suggesting active risk. While the individual reports resisting the urges and expresses a desire to seek support, the intensity of the urges elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 19:16:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor OD last night. Terrifying. Narcan saved him. Learn CPR, carry Narcan. It could save someone you know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose event implies a high risk of further overdose incidents in the community and highlights the potential for fatal outcomes. The event was only averted by the use of Narcan.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 19:15:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel trapped. Anyone else been through this? Where do I even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a potentially abusive situation with controlling behavior and constant put-downs, suggesting a risk to the individual's well-being and safety. While there's no immediate threat mentioned, the feeling of being trapped warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 19:14:39"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Wish I'd said something, done something. Anyone else ever freeze like that? Feeling awful.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence and expressed distress. While not directly involved or targeted, the incident is concerning and suggests a potential risk of escalating violence or future similar incidents.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 19:13:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another overdose. Makes me sick. Lost a friend last year. If you're struggling, PLEASE reach out. There are people who care and want to help you get better. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose and a past loss of a friend, indicating a potential for current struggle and vulnerability. While the message promotes seeking help, the context suggests a real risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 19:12:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Just wanted to say if you're struggling too, you're not alone. Reaching out feels impossible, but it's worth it. There are people who care. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and encourages seeking help, indicating distress but not explicitly mentioning self-harm or suicidal intent. While the mention of struggling suggests a negative emotional state, the message is ultimately supportive and hopeful.",
    "detected_category": "other",
    "timestamp": "2026-01-18 19:11:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up bad. Makes you realize how easily things can escalate. Anyone else feel like anger's just simmering everywhere lately? Feeling anxious.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight caused anxiety and a feeling of unease, but there's no indication of direct threat, self-harm, or intent to harm others.",
    "detected_category": "other",
    "timestamp": "2026-01-18 19:10:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Walking on eggshells constantly. I feel so alone. Anyone else been through this? Need to know I'm not crazy.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home environment and feelings of isolation. While not explicitly mentioning harm, the 'walking on eggshells' phrase suggests potential emotional or psychological abuse and the feeling of being alone raises concern for mental well-being. More context would be needed to determine the exact nature and severity of the risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 19:09:32"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. My heart is racing. Said something, hope I didn't make it worse. Anyone know resources for domestic violence in the city? Feeling shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed potential domestic violence, indicating an immediate risk of harm to the girlfriend. The observer also reports feeling shaken, suggesting potential escalation or danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 19:08:30"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw two guys fighting on my street last night. Actually scared me. Called the cops, but still shaken up. Anyone else ever witness something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potentially dangerous situation, but the individual's reaction is primarily fear and being shaken up. There's no indication of direct harm or imminent danger to the individual or others. The call to the police indicates a responsible action.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 19:07:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Please, if you're using, have someone with you. Narcan saves lives. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event, indicating an immediate and serious risk of death or severe health consequences for individuals using drugs.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 18:20:18"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw two guys fighting outside my building last night. Shook me up bad. Didn't know what to do. Still feel anxious today. Anyone else ever witness something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is upsetting but doesn't indicate immediate danger to the poster or others. The anxiety reported is a normal reaction.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 18:19:16"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, rough day. The urge to self-harm is so strong tonight. Trying to distract myself but it's hard. Anyone else feel this way sometimes? Just feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating a potential risk. While the individual is attempting to distract themselves, the intensity of the urge warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 18:18:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm finally out. It's terrifying and empowering all at once. Years of walking on eggshells... I don't know where to start rebuilding. Any advice for finding affordable therapy?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 61 (char 86)",
    "detected_category": "unknown",
    "timestamp": "2026-01-18 18:17:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed (like being underwater), and a reaching out for help. While there's no direct mention of self-harm or suicide, the depth of distress suggests a need for support and monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 18:16:11"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shaken up. Makes you realize how quickly things can escalate. Anyone else feel like aggression is just…everywhere lately? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling shaken, but doesn't express intent to harm self or others. It primarily expresses a feeling of unease and anxiety.",
    "detected_category": "other",
    "timestamp": "2026-01-18 18:15:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. The yelling, the put-downs... it's chipping away at me. Anyone else been through this? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being worn down by negative interactions (yelling, put-downs) and feeling lost. While not explicitly stating suicidal intent, the distress level and mention of being 'chipped away' indicate potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 18:14:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about another overdose. Scared. My brother's been struggling lately. How do you even start getting someone help? I'm so worried.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and worry about a brother who is struggling, referencing a recent overdose news story. While it doesn't explicitly state an overdose is imminent, the concern about the brother's struggles, coupled with the mention of overdose, elevates the risk beyond low. Intervention and support should be considered.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 18:13:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, days like today are so hard. The urge to just... hurt is so strong. Trying to distract myself, but it's a battle. Anyone else relate? How do you cope? Feeling so alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to hurt oneself, indicating potential self-harm. While there is no explicit plan or method mentioned, the intensity of the urge and the feeling of being alone elevate the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 18:12:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are strong, but I'm trying to resist. Reached out to a friend, which helped a bit. Just gotta keep taking it one day at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges and a rough time, indicating distress. While the person is resisting and has reached out for help, the presence of strong urges necessitates a moderate level of concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 18:11:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Just a reminder to be kind to yourself, and that you're not alone if you're struggling. Reaching out feels impossible, but it's worth it. 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text mentions struggling and feeling overwhelmed, but it also encourages self-compassion and reaching out for help. There's no explicit mention or direct indication of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2026-01-18 17:17:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Terrifying. Please, if you're struggling, reach out. There are people who care and want to help you stay safe. Naloxone saves lives. Carry it if you can.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While not directly involving the user, witnessing an overdose suggests a potential for indirect trauma and highlights the risk of overdose in the community. The text also promotes safety resources, indicating an awareness of potential harm.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 17:16:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Terrifying. Narcan saved them, but damn. Learn the signs, please. It can happen to anyone. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing a friend's overdose is a highly distressing event with potential for lasting psychological impact on the individual. The event involved a life-threatening situation requiring emergency intervention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 17:14:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I feel like I need to feel *something* else. Scared to admit it, but the urges are strong lately. Talking to my therapist tomorrow, hoping that helps. Anyone else been there?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges to feel *something* else, which could indicate self-harm. The individual acknowledges being scared to admit it and is seeking help, but the intensity of the urges raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 17:13:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Reminded me of things at home. Anyone else feel like violence is just... everywhere lately? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing distress and prompting a discussion about coping mechanisms. While concerning, it doesn't indicate imminent danger to the individual or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 17:12:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, stronger than before. Reached out to a friend, hoping it helps. Just trying to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges and feelings of being overwhelmed, which suggests an escalation of risk. While the individual has reached out to a friend, the phrase 'just trying to get through tonight' indicates immediate distress and vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 17:11:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen having a really rough time lately. Urges are strong. Reached out to a crisis line, which helped a bit. Just trying to get through today. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and a rough time, suggesting distress. Reaching out to a crisis line shows help-seeking behavior, but the continued struggle implies ongoing risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 17:10:52"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up. Makes you realize how quickly things can escalate. Anyone else ever witness something like that? Feeling kinda disturbed.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault involving serious injury (knocked out cold) suggests a medium level risk. While the author is not directly involved or threatened, the event's impact and the mention of escalation warrant attention.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 17:09:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw another news story about an OD. Makes me think of my cousin...it happened so fast. Please, if you're struggling, reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a fatal overdose and expresses concern for others struggling with similar issues, suggesting potential risk for vulnerable individuals. While it encourages seeking help, the direct mention of a sudden overdose death elevates the severity.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 17:08:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Terrifying. Narcan saved their life. Carry it, learn how to use it. You could save someone's life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose, which is a life-threatening medical emergency with potentially fatal consequences.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 17:07:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing on the street, escalated so fast. Really shaken up. Makes you realize how quickly things can turn violent. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing an argument that escalated but doesn't directly indicate an immediate threat to the author or others. It expresses unease and anxiety rather than a specific violent act or intention.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 16:18:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good lately. Constant put-downs and control... I feel trapped. Has anyone else experienced this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a feeling of being trapped due to controlling and verbally abusive behavior at home. While there's no explicit mention of physical harm or suicidal ideation, the described situation could escalate and poses a risk to the individual's mental health and well-being.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 16:17:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Clean for a month and then I relapsed. Feeling so ashamed and alone. Anyone else been there? Just need to know I'm not the only one fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety, coupled with feelings of shame and isolation, indicates a potential risk for increased substance use and potential for self-harm or suicidal ideation due to distress. While no explicit mention of self-harm or suicide is present, the feelings described warrant concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 16:16:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Thankfully, paramedics got there fast. Please, if you're struggling, reach out. There are people who care. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates potential risk for others struggling with similar issues. The text highlights the availability of help, which can mitigate the severity, but the initial event is still concerning.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 16:15:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on where to start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed ('underwater'), coupled with a difficulty in seeking help, suggesting potential emotional distress that could escalate if unaddressed.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 16:14:35"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, having a really rough night. The urges are strong. Trying to distract myself but it's hard. Just need to make it through. Anyone else been there? Any tips that actually help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and difficulty coping, suggesting a potential for escalation. While there's no explicit mention of intent, the struggle implies a moderate level of risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 16:13:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling? Need to remember I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, suggesting potential mental distress. The phrase 'like I'm underwater' could indicate feelings of suffocation or helplessness. While not explicitly mentioning self-harm or suicidal ideation, the overall tone and reaching out for connection suggest a need for support and a possible vulnerability. The statement 'need to remember I'm not alone' implies a struggle with isolation, which is a risk factor for more serious mental health issues.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 16:12:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so heavy lately. Just reaching out, has anyone else felt like they're drowning? Hard to see a way out right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a sense of hopelessness ('drowning,' 'hard to see a way out'). While not explicitly suicidal, the language suggests significant distress and a potential risk for escalation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 16:11:30"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside my building. One was bleeding bad. Shook me up. Called 911 but still feel sick. Anyone else ever witness something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Report of a violent altercation with significant bleeding, indicating potential for serious injury or even fatality. The original poster also exhibits signs of distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 16:10:29"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "```\nRough day.  Felt that familiar urge to hurt myself again.  Instead, I'm reaching out.  Anyone else been there?  What helps?  Trying to stay strong.\n```",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a recent urge to self-harm, which suggests an active struggle with these thoughts. While the individual is reaching out for help, the presence of the urge elevates the risk beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 16:09:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling so drained and empty. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being drained and empty, and reaching out for advice. While concerning, it doesn't indicate immediate danger or specific plans for self-harm.",
    "detected_category": "other",
    "timestamp": "2026-01-18 15:17:03"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get jumped downtown last night. Shook me up. Is there anywhere to report something like that anonymously, even if I just saw it?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports witnessing a violent assault (jumping), indicating a risk of further violence or potential danger to others in the area. While the witness wasn't directly harmed, the event suggests a breakdown in public safety.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 15:16:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. The urges were strong, but I distracted myself with a movie. Small win, I guess. Anyone else relate? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges' without specifying what they are, suggesting a potential risk of self-harm or other harmful behavior. While the person distracted themself, the intensity of the urges warrants attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 15:15:00"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. My heart is racing. Wish I'd said something. Anyone else ever freeze up like that? Feeling awful.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be distressing and may indicate an ongoing or escalating situation. While the reporter is not directly in danger, the incident points to a potential risk for the victim of the assault. Further escalation is possible.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 15:13:59"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out at the bus stop. Shaken up. Makes you realize how quickly things can escalate. Anyone else feel like violence is just...everywhere lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is upsetting, but the text doesn't indicate direct harm or imminent danger to the author or others. It expresses general unease and reflection rather than immediate threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 15:12:57"
  },
  {
    "title": "User Story: Abuse",
    "content": "Ugh, another fight. Walking on eggshells constantly. Is this normal? Feeling so isolated and lost. Is there anyone else who understands this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of isolation, being lost, and questioning the normalcy of the situation, suggesting potential emotional distress and a need for support. While not explicitly stating intent, the context of 'walking on eggshells' and frequent fights implies a potentially volatile or unsafe environment. ",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 15:11:56"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm drowning. Reaching out because I don't know where else to turn. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost and drowning, indicating significant distress and a need for support. While there's no explicit mention of self-harm or suicide, the intensity of the emotions warrants concern and further assessment to determine if safety measures are needed.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 15:10:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain any explicit suicidal ideation, self-harm, or threats of violence. It's a general expression of distress and a request for coping mechanisms.",
    "detected_category": "other",
    "timestamp": "2026-01-18 15:09:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get too much. Relapsed after a few months clean. Feeling so ashamed and lost. Anyone else been there? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety, coupled with feelings of shame and loss, indicates increased vulnerability and potential for negative coping mechanisms. While not explicitly suicidal, the expressed distress warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 15:08:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Lost my friend last week. Overdose. So messed up. Please, if you're struggling, reach out. Don't let it get this far. There are people who care.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Indicates potential risk for individuals struggling with similar issues following a friend's overdose. Grief and shared circumstances can heighten vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 15:07:50"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Reminded me of things back home. Anyone else get triggered by stuff like that? Feeling anxious and on edge.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates anxiety and being triggered by a fight, but does not suggest immediate danger to self or others. The individual is expressing their feelings and seeking connection, not necessarily planning harmful actions.",
    "detected_category": "other",
    "timestamp": "2026-01-18 14:16:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain explicit threats or plans for self-harm, suicide, or harm to others. The individual is reaching out for help, which suggests a desire for support rather than immediate self-destructive action.",
    "detected_category": "other",
    "timestamp": "2026-01-18 14:15:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Like I'm underwater. Reaching out to a friend, hoping it helps. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being overwhelmed, but it also shows the individual reaching out for support. This indicates a protective factor and suggests they are not immediately at risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 14:14:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, walking on eggshells... Feeling trapped. Anyone else been through this? How did you get out? Need to find my strength.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling trapped and mentions 'constant put-downs' and 'walking on eggshells', which suggests a potential abusive situation. The user is seeking help to 'find my strength' to 'get out', indicating a desire for change and escape from the situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 14:13:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Relapsed after 6 months clean. Feeling so ashamed and alone. Reaching out because I don't know what else to do. Anyone been there?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety can be a trigger for severe mental health crises. The feelings of shame and isolation, combined with the individual explicitly stating they don't know what else to do, indicate increased vulnerability and potential for escalating distress. While no immediate threat is stated, the risk of self-harm or accidental overdose is elevated.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 14:12:49"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a significant risk of harm to the individual. Reaching out to a friend is a positive step, but the presence of the urge itself elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 14:11:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on Elm St. I froze. Should I have done something? Feel sick about it. What would you have done?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed physical assault (shoving). While the description is brief, it suggests potential for escalation and harm to the victim. The observer also expresses distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 14:10:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Walking on eggshells constantly. I feel so isolated. Is there anyone else who understands this? I don't know where to turn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, isolation, and a difficult home environment. While there is no explicit mention of self-harm, suicide, violence, or abuse, the phrase 'walking on eggshells' suggests a potentially volatile or abusive situation, and the feeling of isolation raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 14:09:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of hopelessness and being overwhelmed, which can be precursors to more serious mental health issues. The individual is actively reaching out for help, suggesting they are distressed. While no explicit mention of self-harm or suicide is present, the depth of feeling warrants concern and further assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 14:08:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Things got dark last night, and I relapsed. Day 1 again. Just reaching out... anyone else understand this? Need some hope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse and feelings of hopelessness after a dark period, suggesting vulnerability and potential for self-harm. While not explicitly suicidal, the relapse and reaching out for hope indicate a need for support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 14:07:41"
  }
]