[
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Terrifying. Narcan saved their life. Learn the signs, please. It could save someone you love. Resources are out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Friend experienced a life-threatening overdose event requiring emergency intervention (Narcan).",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 09:21:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Narcan saved him, thank god. Makes you think, you know? Check on your friends, people. It's closer than you think.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was administered successfully, the text describes a recent overdose, indicating a potential ongoing risk of overdoses in the community and highlights the importance of vigilance and support among friends.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 09:20:18"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get jumped on my way home. Shook me up. Called the cops, but still feel sick. Anyone else ever witness something like that? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault can cause significant distress and psychological impact, even without direct physical harm. The user expresses feeling \"sick\" and shaken, indicating a potential need for support.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 09:19:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Paramedics got there fast, thank god. Makes you realize how fragile life is. Learn CPR and carry Narcan, people. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a stressful event indicating potential risk in the community. While the person survived due to intervention, the event highlights the presence of a life-threatening situation and potential for future occurrences.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 09:18:14"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a guy shove his girlfriend on the street. Froze. Should I have done something? Feel sick about it now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be traumatizing and lead to feelings of distress. While the text doesn't indicate immediate danger to the person writing, it suggests a significant emotional impact and potential for vicarious trauma. The act of shoving someone is also inherently violent.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 09:17:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD...it hits different now. Lost my cousin last month. Please, if you're struggling, reach out. There are people who care and want to help. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a recent overdose death and expresses concern about others struggling, suggesting a potential risk of overdose or self-harm in the target audience. While it encourages seeking help, the personal connection to loss elevates the severity.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 09:16:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad brain day. Really fighting the urge to relapse. Just reaching out instead. Anyone else been there? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with urges to relapse, implying a potential risk of self-harm or substance use. Reaching out is a positive coping mechanism, but the presence of strong urges elevates the risk beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 09:15:08"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Constant put-downs are wearing me down. Anyone else experience this? Feeling so alone. Need to figure out how to cope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes persistent emotional distress and feelings of isolation due to ongoing negative treatment ('constant put-downs'). While not explicitly stating intent to harm self or others, the mention of needing to 'figure out how to cope' suggests a vulnerability and potential for escalation if the situation continues or worsens. The request for shared experiences indicates a search for validation and support, highlighting the individual's distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 09:14:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm underwater. Reaching out in case anyone else knows this feeling. It's heavy.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but lacks explicit details about self-harm, suicide, violence, abuse, or overdose. While concerning, it doesn't present an immediate threat.",
    "detected_category": "other",
    "timestamp": "2026-01-16 09:13:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my apartment. Shook me up. Makes you realize how easily things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and causes anxiety, but there's no indication of direct threat to the individual or others. The post expresses feeling 'on edge' which suggests mild distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 09:12:03"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. Constant yelling, then the silent treatment. I feel like I'm walking on eggshells. Is this normal? Anyone else experience this? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with emotional distress, suggesting potential for escalation. While not explicitly stating intent of harm, the feelings of isolation and walking on eggshells raise concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 08:22:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor OD last night. Scariest thing ever. Narcan saved him. Learn the signs, keep it handy. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event and indicates the presence of overdose risk in the community. While the person survived, the potential for future occurrences and the emotional impact on the witness justify a medium severity rating.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 08:20:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post that addresses suicidal feelings without glorifying or promoting suicide, and focuses on seeking help:\n\n\"Been feeling so low lately, like nothing matters. It's scary. Reached out to a friend, and I'm looking into talking to someone professional. Just gotta keep moving forward, one step at a time.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post directly mentions feeling 'so low' and acknowledges the feeling is 'scary,' which indicates suicidal ideation. While it also mentions seeking help, the presence of suicidal thoughts warrants a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 08:19:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get punched outside the bar. Shook me up. Called the cops but still feel sick. Anyone else witness that? Need to vent.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault can cause significant distress and potential psychological harm. While the user was not directly involved, the event was upsetting enough to prompt a call to the police and feelings of sickness.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 08:18:55"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Frozen. Didn't know what to do. Feeling sick about it. Is there ever a right way to intervene?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can cause psychological distress and the potential for escalation exists if intervention is attempted without proper training or support. The shove, while not described as severe, indicates a risk of further abuse.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 08:17:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Never seen anything like it. Shaken up. Makes you wonder what's going on with people. Wish I knew how to help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence but does not indicate the author is in imminent danger or planning violence themselves. It expresses concern and a desire to help, but lacks specific threats or immediate harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 08:16:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He says he loves me, but then he yells & controls everything. I feel so trapped. Is this normal? I don't know what to do anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a potential abusive relationship, feelings of being trapped, and a lack of understanding of what constitutes normal behavior. These factors suggest significant emotional distress and a potential risk of escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 08:15:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling really overwhelmed lately. Urges are back. Anyone know good coping mechanisms that actually work? Just need something to get through tonight.\n\n**Option 2 (Sharing Experience):**\n\n> Scars are a reminder of a dark time. Healing isn't linear, and that's okay. Be kind to yourself, always.\n\n**Option 3 (Raising Awareness):**\n\n> It's not about attention. It's about pain. Let's talk about self-harm openly so people know they're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates active urges, suggesting potential risk. While not explicitly suicidal, the need for immediate coping mechanisms raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 08:14:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved their life. Everyone should know how to use it. It's easier than you think. #overdose",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, which is a serious health event with potential for fatality. While Narcan was administered and saved the person's life, the inherent risk of overdose remains significant.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 08:13:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. They're okay now, thankfully. Makes you realize how fragile life is. Anyone know resources for learning about naloxone? Want to be prepared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event. While the person survived, the text indicates emotional distress and a desire for preventative action (naloxone training) which points to ongoing risk of future overdose exposure. The experience may lead to increased anxiety or fear related to drug use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 08:12:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. Feeling trapped and scared. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feeling trapped and scared at home, suggesting a potentially unsafe situation. While it doesn't explicitly mention violence, abuse, or self-harm, the user expresses distress and seeks validation, warranting concern. The lack of specifics keeps it from being high severity, but it is more than just low.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 07:21:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Relapsed after a few months clean. Feeling so ashamed. Reaching out to my therapist tomorrow. Just need to get through tonight.\n\n**Option 2 (Raising Awareness):**\n\n> Scars are stories, not weaknesses. Sending love to anyone fighting battles unseen. You're not alone.\n\n**Option 3 (Personal Story):**\n\n> It's been a rough week. The urge is strong, but I'm trying to use my coping skills instead. One day at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse mentioned, strong urges described, indicates potential for self-harm to cope but actively seeking help and using coping skills.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 07:20:07"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Did I do the right thing by calling the cops? Feel sick about it. Hope she's okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence indicates potential for escalation and harm to the victim. While the immediate threat might be over, the risk of further violence exists.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 07:19:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Terrifying. Please, if you're using, have someone with you or Narcan nearby. It could save a life. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Observed overdose suggests potential for further overdoses and highlights immediate life-threatening risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 07:18:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved their life, thankfully. Learn the signs, people. Could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, the event involved a life-threatening overdose, indicating a significant risk of harm.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 07:17:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown last night. Scary stuff. Narcan saved them, but it shook me up. Please, if you're struggling, reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a potentially traumatic event, indicating a risk of harm to the individual who witnessed it (psychological distress). The overdose itself represents a high-risk situation, but the reported outcome (Narcan saved them) mitigates some of the immediacy of the risk. The message encourages seeking help, implying a general awareness of risk within the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 07:16:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, feels a little better to not be alone with it. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential for self-harm. Reaching out to a friend is a positive coping mechanism, but the presence of urges warrants a moderate level of concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 07:14:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the bus stop. Shook me up bad. Reminded me of my brother. Wish there was something I could do to stop the anger, you know? Feels so pointless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and expressing feelings of distress and helplessness. While concerning, it does not explicitly express intent to harm oneself or others. The reference to past trauma suggests potential vulnerability, but immediate risk is not apparent.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 07:13:57"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a guy get shoved on the train today. Shook me up. People just watched. Makes you wonder, y'know? Is everyone okay? Feeling pretty raw rn.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, even without direct harm to the reporting individual, can be distressing and suggest a potential for further violence. The phrase \"shook me up\" and \"feeling pretty raw\" indicate a significant emotional impact.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 07:12:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Terrifying. Narcan saved them, but it shook me up bad. Please, everyone be careful out there and look out for each other. It can happen so fast.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a traumatic event with potentially lasting psychological effects for the witness. The overdose itself represents a severe and immediate health risk to the victim and the witness's distress suggests potential for vicarious trauma.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 07:11:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Relapsed after 6 months clean. Feeling so ashamed and lost. Reaching out to my therapist tomorrow. Just needed to say it somewhere.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of recovery can be a trigger for more severe actions. The feelings of shame and loss increase the risk. The user is reaching out for help, which is a positive sign, but the immediate risk is still elevated.",
    "detected_category": "other",
    "timestamp": "2026-01-16 06:23:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Thankfully, they're okay now. Narcan saves lives. Learn how to use it. You never know when you might need it. Please be safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, posing a significant health risk, though the individual survived due to Narcan. The potential for future occurrences remains.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 06:22:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt that familiar urge again tonight. Reached out to a friend instead. Still shaky, but glad I didn't give in. It's a tough battle.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a strong urge which suggests potential harm, but the person reached out for help and resisted the urge, indicating a degree of protective factors. This suggests ongoing risk, but not an immediate crisis.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 06:21:39"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Didn't know what to do. Wish I'd said something. Is there a right way to intervene in those situations? Feeling guilty.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault (shoving) indicates potential for escalation and further violence. While not directly involving the reporting individual, the potential for harm to the girlfriend is present, and the emotional distress of the witness is also a factor.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 06:20:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Everything feels heavy, and I'm not sure how much longer I can carry it. Reaching out for help feels impossible, but I know I need to. Any advice on where to start?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed, indicating potential mental health distress. While there is no explicit mention of self-harm or suicide, the statement \"not sure how much longer I can carry it\" suggests a concerning level of burden and potential risk. The individual acknowledges needing help but finds it difficult to reach out, which underscores the need for intervention.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 06:19:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad lately. Constant yelling, and last night... physical stuff. I don't know what to do. Feeling lost and scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates physical abuse and feelings of being scared and lost, suggesting immediate danger and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 06:18:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "I keep making excuses for him. Saying it was just the alcohol, just the stress. But the yelling is getting worse. Starting to feel scared. Is this normal?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates escalating yelling and a feeling of fear, suggesting a potential for harm. While physical violence isn't explicitly mentioned, the situation warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 06:17:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before it gets worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, hinting at potential mental health distress and a desire for help before things escalate. The phrase \"before it gets worse\" indicates a recognition of a declining state and a proactive, but concerning, outreach.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 06:16:31"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming. I relapsed last night after a few months clean. Feeling so ashamed and lost. Reaching out for support before it gets worse again. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates potential for escalation. The individual expresses feeling lost and ashamed, which are risk factors. Actively seeking help is a positive sign, but the overall situation warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 06:15:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Narcan worked, thank god. Made me realize how close we all are to the edge sometimes. Please be careful out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived due to Narcan, the overdose event indicates a significant risk to the individual involved. It also highlights the presence of dangerous substances and potential risk to others in the vicinity.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 06:14:28"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a fight break out downtown. Shook me up. Made me realize how much anger is simmering under the surface. Anyone else feel like things are getting more volatile lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text primarily expresses anxiety and observation rather than direct threat or involvement in violence. The commenter expresses worry about volatility but doesn't mention specific intent.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 05:21:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scariest thing ever. They're okay now, thankfully. Please, if you're struggling, reach out. There are people who care and want to help you. It's not worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, an overdose is a life-threatening event indicating significant risk. The text also suggests potential ongoing struggles that warrant attention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 05:20:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Talking to someone feels impossible right now, but I'm trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 64 (char 89)",
    "detected_category": "unknown",
    "timestamp": "2026-01-16 05:19:28"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed ('drowning'), indicating significant emotional distress and a potential risk of self-harm, although no explicit plans are mentioned.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 05:18:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need help. Talking to a friend later, but it's so hard. Any advice on getting through these moments?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a lack of motivation ('like nothing matters'), coupled with a stated need for help. While there's no explicit mention of self-harm or suicide, the depth of the negative feelings and the active reaching out suggest a significant level of distress that warrants concern and further assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 05:17:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Hard to keep going.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and struggling to keep going, suggesting emotional distress and potential for suicidal ideation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 05:16:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough lately. Constant put-downs, isolating me from friends... feels like I'm walking on eggshells. Has anyone else experienced this? I'm not sure what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, which can significantly impact mental health and potentially escalate. While not explicitly mentioning harm, the walking on eggshells feeling and seeking advice suggest a distressed state.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 05:15:22"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Cutting again after a long time clean. Hurts to admit it. Reaching out here feels like a start, I guess. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions self-harm ('cutting again after a long time clean'), indicating an immediate risk to the individual's safety and well-being.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 05:14:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a kid OD at the park yesterday. Scared me so bad. Narcan saved him, but damn. Makes you realize how close we all are to the edge. Please look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event requiring Narcan, indicating a serious, potentially life-threatening situation. While the child survived, the proximity to death and the impact on the observer suggest a significant level of risk and emotional distress.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 05:13:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Clean for a week and then relapsed. Feeling so ashamed. Anyone else get stuck in this cycle? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of shame and a relapse, indicating distress, but doesn't contain explicit threats or plans for self-harm or harm to others. It primarily seeks connection and validation.",
    "detected_category": "other",
    "timestamp": "2026-01-16 05:12:17"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a guy punch his girlfriend outside the bakery today. Frozen. Didn't know what to do. Still feeling sick about it. Anyone else ever witness something like that? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, especially domestic violence, can be psychologically distressing and potentially dangerous if intervention is attempted without proper training or support. While the poster wasn't directly involved, witnessing the event has caused them distress, indicating a potential impact on their mental wellbeing.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 04:32:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Constant yelling, and now...other things. Feeling lost and scared. Is there anyone else who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential abuse ('other things') and expresses feelings of fear and being lost, suggesting a significant level of distress and potential danger.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 04:31:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary stuff. Narcan worked, thank god. Makes you think, you know? Anyone know where to get training around here?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose incident, indicating a potential for severe health consequences and possible death. While Narcan was administered successfully, the event signifies a significant risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 04:30:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so heavy lately, like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way? Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and seeking help, but there is no explicit mention or direct indication of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2026-01-16 04:29:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, thankfully. Please, if you're struggling, reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a dangerous situation with potential for fatality, even though the person survived. It also highlights the presence of drug use and potential for future overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 04:28:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Narcan saved them, but it really shook me up. Learn how to use it, folks. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, indicates a public health risk and potential for future occurrences. The call to action to learn Narcan suggests awareness of ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 04:27:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so heavy lately, like I'm underwater. Reaching out 'cause I don't know what else to do. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and reaching out for help, suggesting potential distress and a need for support. The mention of feeling 'underwater' can be interpreted as a metaphor for suffocation or feeling trapped, which warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 04:26:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street. Really escalated fast. I froze. Wish I'd done something, anything. Feeling sick about it. Anyone else ever feel this helpless?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the text describes a potentially violent situation, the author expresses feelings of helplessness and regret rather than indicating imminent danger to themselves or others. There's no direct threat or call for help.",
    "detected_category": "other",
    "timestamp": "2026-01-16 04:25:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. Narcan worked, thank god. Please, people, be careful out there. Know where to get Narcan. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event, while Narcan was successful, indicates a significant immediate risk in the community. The event was traumatic for the witness and highlights the potential for future overdose events.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 04:24:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs and control... I feel trapped. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a situation of emotional abuse and feeling trapped, suggesting potential for escalating distress. While not explicitly mentioning self-harm or suicide, the feeling of being 'trapped' is a significant risk factor for mental health deterioration.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 04:23:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, feeling trapped... Anyone else been through this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential abuse (constant put-downs, feeling trapped), suggesting a need for intervention. The user is actively seeking help, which can be a positive indicator, but the situation still warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 03:47:19"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He isolates me from friends, and lately, his words are like knives. Anyone else experience this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional and psychological abuse, including isolation and verbal aggression. While there's no explicit threat of physical harm or intent to self-harm, the situation suggests a deteriorating relationship and the author's increasing distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 03:46:17"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been walking on eggshells lately. Constant criticism, isolating me from friends... Is this normal in a relationship? Starting to feel really small.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse (criticism, isolation) which can escalate over time. While not explicitly stating intent to harm self or others, feeling 'really small' suggests a decline in mental well-being and vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 03:45:16"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so heavy, I just want the noise to stop. Scared to admit I've been cutting again. Reaching out before it gets worse. Any advice that isn't just \"stop\"? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions self-harm (cutting) and expresses a desire for the 'noise to stop' along with feeling lost, indicating a significant risk of further self-harm or suicidal ideation. The plea for help before things 'get worse' suggests an awareness of the escalating danger.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 03:44:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. Walking on eggshells all the time. Feeling trapped. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling trapped and walking on eggshells, suggesting potential emotional or psychological abuse. While no direct threats are made, the feeling of being trapped raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 03:43:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. Things at home have been...rough lately. Constant yelling, walking on eggshells. I feel so small. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a stressful and potentially abusive home environment. While there's no explicit mention of self-harm, violence, or suicidal ideation, the feelings of being 'small' and the description of constant yelling and 'walking on eggshells' indicate a potentially harmful situation that warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 03:42:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD at the park. Narcan saved them, thank god. Scared me senseless. Learn CPR & carry Narcan, it can save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a serious health crisis and potential danger to others if further overdoses occur in the area. The need for Narcan implies a prevalence of opioid use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 03:41:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost, with a plea for help, suggesting potential emotional distress and a lack of coping mechanisms. While not explicitly suicidal, the language indicates significant psychological distress.",
    "detected_category": "other",
    "timestamp": "2026-01-16 03:40:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about someone ODing. Scared me. Happened to a friend last year. Always carry Narcan now. You never know. Learn the signs, please. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose and a past fatal overdose of a friend, indicating a real and present danger of overdose. The user's fear and carrying Narcan further suggest a perceived high risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 03:39:05"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm drowning and no one sees it. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, uses the metaphor of drowning which can indicate significant emotional distress and a cry for help.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 03:38:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scary stuff. Narcan saved their life, thank god. Always keep it on you, you never know. Learn how to use it. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose event requiring Narcan intervention, indicating a life-threatening situation. This suggests a high potential for severe harm or death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 02:57:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so heavy. Just need to remind myself I've gotten through tough times before. Reaching out for help feels scary but it's worth it, right? Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and acknowledges past struggles, suggesting potential mental health distress. While it mentions reaching out for help, the overall tone indicates a vulnerability that warrants concern. The phrase \"things get so heavy\" implies a significant emotional burden.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 02:56:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, things got bad again last night. Scared I'm backsliding. Anyone know of any good distraction techniques that actually work? Feeling so alone rn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses distress, fear of backsliding, and feelings of loneliness, suggesting potential mental health challenges. While not explicitly stating intent for self-harm or suicide, the negative emotional state warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 02:55:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my neighbor unresponsive. Narcan saved him. Terrifying reminder how easily this happens. Check on your people, keep Narcan close. Could be the difference.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Neighbor was found unresponsive and required Narcan, indicating a life-threatening overdose situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 02:54:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater and can't find the surface. Just reaching out... has anyone else felt this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but lacks specific suicidal ideation or intent. It's a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2026-01-16 02:53:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately, like I'm drowning. Reaching out because I don't know what else to do. Any advice or support would be appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, using the metaphor of drowning, which suggests significant emotional distress and a potential risk of harm. The individual is reaching out for help, indicating a level of awareness, but the depth of distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 02:52:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so overwhelmed lately. Urges are back. Talking to my therapist tomorrow, but tonight is rough. Just need to get through it. Anyone else been there?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a recurrence of urges and feelings of being overwhelmed, suggesting a potential risk of self-harm or other harmful behaviors. While the person is seeking help from a therapist, the immediate situation is described as 'rough,' indicating a need for support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 02:51:41"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Relapsed after 6 months clean. Feeling so much shame. Reached out to my therapist, gotta keep fighting this. It's a struggle, but not the end.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety is a serious event that can increase risk. While the individual is expressing intent to continue fighting and has reached out to a therapist, the shame and struggle associated with relapse can be precursors to more severe outcomes.",
    "detected_category": "other",
    "timestamp": "2026-01-16 02:50:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling so drained and overwhelmed. Reaching out because I don't know what else to do. Any advice for getting through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses distress and a feeling of being overwhelmed, but it doesn't contain any explicit mentions of self-harm, suicidal ideation, violence, abuse, or overdose. It reads as a general cry for help and advice.",
    "detected_category": "other",
    "timestamp": "2026-01-16 02:49:37"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Scary how quickly things escalated. Makes you wonder what people are going through. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text reports witnessing a fight, which suggests a potential risk of violence, but it's an observation, not a threat or direct involvement. The tone is anxious, but not indicative of immediate danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 02:48:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scared me senseless. Narcan worked, thank god. We gotta do better, people are dying out here. Where can I learn how to help if it happens again?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose event indicates a significant and immediate risk to life. The successful use of Narcan highlights the life-threatening nature of the situation. The post expresses concern about the prevalence of overdoses and a desire to learn how to help in the future, reflecting an ongoing risk in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 01:47:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Thankfully, they're ok. Narcan saves lives. Learn how to use it, please. You never know when you might need it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, a drug overdose occurred, indicating a potentially life-threatening situation and ongoing risk in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 01:46:25"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out at the bus stop. Shook me up. Reminded me of things back home. Anyone else feel triggered by sudden violence like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potentially dangerous situation. However, the individual's reaction seems primarily emotional (feeling shaken and triggered) rather than indicating imminent danger or participation in the violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 01:45:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good lately. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, leading to feelings of isolation. While not explicitly stating intent to harm self or others, the mention of needing help suggests a potentially escalating situation and warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 01:44:22"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, feeling so overwhelmed lately. Just want the noise to stop. Reached out to a friend, hoping it helps. It's been a rough week.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and a desire for peace, but does not contain explicit or direct statements of intent to harm self or others. The individual reached out to a friend for support, which is a positive coping mechanism.",
    "detected_category": "other",
    "timestamp": "2026-01-16 01:43:20"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan worked, thank god. Makes you realize how fragile life is. Learn CPR, carry Narcan. You could save someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived due to Narcan, a drug overdose occurred, indicating a significant risk to life. The availability of Narcan mitigated the potential for fatality, but the event itself represents a serious health and safety risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 01:42:18"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight outside the bar last night. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling and cause anxiety, but the text doesn't indicate direct involvement, threats, or intent of violence from the author.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 01:41:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Finding it hard to cope lately and the urges are back. Reached out to a friend, hoping it helps. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions difficulty coping, returning urges (unspecified), suggesting potential for self-harm or a mental health crisis. Reaching out is a positive sign, but the presence of urges elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 01:40:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scariest thing ever. Thank god for Narcan. Learn the signs, people. It can happen to anyone. Know where to get help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose indicates a high-risk situation involving potential fatality and immediate need for intervention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 01:39:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Constant yelling, put-downs... feeling so small. Anyone else go through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment involving emotional abuse, potentially leading to feelings of worthlessness. While not explicitly stating intent to harm self or others, the mention of 'feeling so small' and the need for validation suggests significant emotional distress that could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 01:38:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD in the bathroom today. Scared me senseless. Glad they're okay, but it hit me hard. Learn CPR, carry Narcan. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and highlights a potential risk of overdose in the environment. While the person survived, the event caused significant distress to the reporter and indicates a need for preventative measures.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 00:47:51"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD in the park today. Scary stuff. Narcan saved them, but it shook me up. Know where to get it, folks. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the immediate danger was averted by Narcan, an overdose occurred, indicating potential ongoing risk of further overdoses in the area. The witness also expresses distress, suggesting a psychological impact.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 00:46:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good lately. Walking on eggshells constantly. Anyone else feel like they're losing themselves in their relationship? Seriously considering my options.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional distress and consideration of ending the relationship, which could escalate depending on the individual's coping mechanisms and the nature of the relationship dynamics. Walking on eggshells suggests a stressful and potentially unhealthy environment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 00:45:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad. Constant yelling, put-downs... I feel so small. Anyone else go through this? How do you cope? I need to feel less alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse and a feeling of helplessness, which can escalate to more serious mental health concerns if left unaddressed. The individual is seeking support and expressing distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 00:44:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, but it shook me up. Reminded me how close we all are sometimes. Please look out for each other. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with successful intervention, indicates a situation with potential for harm and highlights the presence of a life-threatening event in the community. The call to 'know the signs' suggests awareness of ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 00:43:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant yelling, walking on eggshells. I feel so trapped. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and potentially volatile home environment with constant yelling and feeling trapped. While not explicitly stating intent to harm self or others, the described situation implies significant emotional distress and a potential for escalation to harmful behaviors. 'Walking on eggshells' suggests a fear of triggering negative reactions, characteristic of abusive or violent environments. Asking for coping mechanisms suggests a struggle to manage the situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 00:42:43"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So messed up. Makes you wonder what's going on with people. Anyone else feel like things are getting more volatile lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text reports witnessing a fight, suggesting a potential for violence, but doesn't indicate direct involvement or imminent threat to the user or others. It's more of an observation and expression of concern.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 00:41:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Woke up feeling sick again after last night. I hate that I keep making excuses for him. Anyone else been through this? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 47 (char 72)",
    "detected_category": "unknown",
    "timestamp": "2026-01-16 00:40:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about ODs. Scared me. A friend almost didn't make it last year. Please, if you're struggling, reach out. There are people who care. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a near-fatal overdose experienced by a friend, suggesting potential risk for others in similar situations and highlighting the seriousness of the issue.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 00:39:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been feeling so isolated lately. He always puts me down, says I'm worthless. It's getting harder to brush it off. Anyone else experience this? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of isolation and worthlessness due to being put down, indicating emotional distress and potential for escalation. The user is actively seeking coping mechanisms, suggesting they are struggling.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 00:38:36"
  }
]