[
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so incredibly alone lately. Everything feels heavy. Reaching out because I don't know what else to do. If you've been there, how did you get through it?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of isolation and heaviness, and a plea for help. While not explicitly suicidal, it suggests a significant emotional burden and potential vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 23:18:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so numb lately. Cutting again. Not looking for attention, just...how do you stop the need to feel *something*? Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions self-harm (cutting) and expresses a strong sense of emotional distress and a desire to feel something, indicating a significant risk of further self-harm or suicidal ideation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 23:17:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another overdose is heartbreaking. Lost a friend last year. If you're struggling, please reach out. There are people who care and want to help you find a path forward. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about overdoses and mentions the loss of a friend, indicating a potential risk of overdose for someone struggling with addiction. While it encourages seeking help, the implicit acknowledgment of the problem raises the severity.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 23:16:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. The urge to self-harm is strong. Scared and don't know what to do. Anyone else feel this way? Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 23:15:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my neighbor unresponsive. Narcan saved him. Scary reminder how close we are to losing people. Please, learn the signs of OD. It's not always what you think.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a recent overdose event requiring intervention, indicating an ongoing risk within the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 23:13:58"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, seeking help through conversation. No explicit mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2025-12-18 23:12:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just need to vent. The yelling is getting worse. Feels like walking on eggshells all the time. Anyone else deal with this? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile environment with escalating yelling, causing significant emotional distress ('walking on eggshells'). While not explicitly stating violence, the increased yelling suggests a potential for escalation and creates a stressful and potentially psychologically harmful situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 23:11:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Just trying to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk of immediate harm to oneself.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 23:10:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Talking feels impossible, but I know I need to.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, with an inability to communicate easily. This indicates distress and a need for support, but lacks explicit suicidal ideation or plans.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 23:09:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. It's heavy.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but lacks specific details or immediate threats. While indicative of distress, it doesn't suggest imminent harm to self or others.",
    "detected_category": "other",
    "timestamp": "2025-12-18 23:08:49"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary how quickly things escalated. Shaking. Is there anywhere safe to walk around here anymore? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight can be traumatic and cause anxiety, indicating a moderate level of distress and potential safety concerns about the environment. While there's no direct threat stated, the feeling of being unsafe and lost requires attention.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 22:17:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so lost lately. Just reaching out. Has anyone else felt like they're just... going through the motions?  Could use an ear.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and going through the motions, indicating a possible need for support but does not directly mention self-harm, suicide, violence, abuse, or overdose. The user is reaching out for connection, which suggests they are not immediately imminently at risk.",
    "detected_category": "other",
    "timestamp": "2025-12-18 22:16:42"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got clocked HARD. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Describes a violent incident (fight) that resulted in a person being seriously injured (\"clocked HARD\"). While not directly threatening further violence, it suggests a potential for escalation and expresses concern about current events.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 22:15:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just realized yelling & controlling who I talk to *is* abuse. Thought it was just stress. Feeling so lost. Anyone else been through this? How do you even start to heal?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the individual is realizing they are experiencing abuse (yelling and controlling behavior). While they are reflecting on the situation and seeking help, the realization of being abused can be a significant emotional trigger. The level of immediacy of the risk is unclear but the acknowledgement of abuse warrants a 'medium' level of concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 22:14:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post addressing suicide, aiming for authenticity and help-seeking:\n\n\"Been feeling so lost lately.  Like I'm underwater.  Hard to explain. Talking to someone feels impossible, but I know I need to.  Any advice on finding help? Feeling really alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post expresses feelings of being lost, overwhelmed (feeling underwater), isolation (feeling really alone), and acknowledges the need for help. While it doesn't explicitly mention suicide, the combination of these factors suggests a moderate risk of self-harm or suicidal ideation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 22:13:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Terrifying. Narcan worked, thank god. Makes you realize how close we all are to losing someone. Where can I learn more about overdose prevention? Feeling shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, indicating a serious risk of harm, though Narcan was effective in this instance, mitigating the immediate danger.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 22:12:35"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scariest thing ever. Narcan saved them. Please, if you're struggling, reach out. There's help. Don't want anyone else to go through that.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose indicates a potentially life-threatening situation and a significant risk in the immediate environment, even though the person survived due to Narcan. This suggests a high prevalence of drug use and related risks.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 22:11:33"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Narcan saved him. Please, learn the signs of an overdose. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event averted by Narcan, indicating a high risk situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 22:10:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, suggesting a potential mental health crisis. The phrase 'underwater' could be interpreted as a metaphor for suffocation or being overwhelmed by negative emotions. Reaching out for advice indicates a desire for help, but the lack of specific details makes it difficult to assess the immediate risk level. More information is needed to determine if this is a cry for help related to suicidal ideation or another mental health concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 22:09:29"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It helps. If you're struggling too, please don't go through it alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential escalation of risk. While the individual reached out for support, the presence of urges warrants a 'medium' severity assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 22:08:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scary stuff. Narcan saved them, but damn. Learn the signs, carry it if you can. It can happen to anyone. Please be safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing and describing an overdose event suggests a high potential for severe harm and potential for recurring events or secondary trauma for the witness.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 21:18:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Seeing someone actually get hurt like that...makes you realize how fragile things are. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and expressing emotional distress, but there is no indication of immediate danger to the author or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 21:17:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is strong. Reached out to a crisis line, which helped a bit. Just trying to take it one hour at a time. It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk. While the individual reached out to a crisis line, the urge remains present, necessitating immediate concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 21:16:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so lost lately. Like I'm drowning. Anyone know of good resources for when you just... don't want to be here anymore?\n\n**Option 2 (Sharing Experience):**\n\n> Been there. The dark place. Talking about it helped me find a glimmer of light. Don't be afraid to reach out. You're not alone.\n\n**Option 3 (Raising Awareness):**\n\n> Just a reminder to check in on your loved ones. You never know what someone might be going through. A little kindness can go a long way.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Option 1 explicitly mentions not wanting to be here anymore, indicating suicidal ideation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 21:14:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, which suggests distress. Acknowledges a need for help but feels unable to seek it, increasing the risk of the situation worsening.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 21:13:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Scary stuff. Please, if you're using, even occasionally, carry Narcan. It saves lives. I'm ordering more today.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a friend almost died from an implied overdose and emphasizes the life-saving potential of Narcan. This suggests a high risk of severe health consequences or death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 21:12:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my kid's school. Shook me up. Makes you wonder what's going on with people. Is anyone else noticing more aggression lately? Worried about the kids.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes a fight witnessed, causing concern but does not directly indicate imminent danger to the writer or others. It expresses worry about increased aggression, but lacks specific details suggesting a planned or ongoing violent act.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 21:11:54"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to stay strong and remember why I stopped. Reaching out instead. Anyone else been there? What helps?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges after a period of cessation, suggesting a potential for relapse into harmful behaviors. While the individual is actively seeking support, the presence of urges elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 21:10:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...scary lately. Walking on eggshells constantly. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a volatile and frightening home environment ('scary lately,' 'walking on eggshells'). While it doesn't explicitly mention violence or abuse, the description suggests a potentially unsafe situation and significant emotional distress.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 21:09:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's so hard to fight this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a high level of immediate risk. While the person has reached out for help, the intensity of the urge warrants serious concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 21:08:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post that addresses suicide in a way that aims to be authentic and encourage help-seeking:\n\n\"Been feeling really low lately, like I'm drowning. Reached out to a friend, and it helped to just talk. If you're struggling, please don't stay silent. There's support out there.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The post acknowledges feeling low and encourages help-seeking behavior, which is a positive approach. While it mentions feeling 'like I'm drowning,' it also highlights the benefit of talking to someone and emphasizes the availability of support. It does not contain graphic details or promote suicide.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 20:18:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. It's a daily struggle. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 20:17:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't explicitly mention self-harm, suicide, violence, abuse, or overdose. It indicates a desire to connect and talk, suggesting a willingness to seek support.",
    "detected_category": "other",
    "timestamp": "2025-12-18 20:16:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough lately. He's been isolating me from my friends & family. I feel so alone. Is this normal in a relationship? Starting to think it's not...\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes isolation from friends and family, which is a common tactic in abusive relationships. While not explicitly stating violence or harm, the isolation and questioning of relationship normalcy suggest a potential for escalation and emotional distress.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 20:15:47"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard shouting next door again last night, then things breaking. Called the non-emergency line, but feel like I'm not doing enough. Anyone else experience this? Makes me sick to my stomach.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential violence next door (shouting, breaking things) which caused the poster distress and fear. While it doesn't directly threaten the poster, the proximity and potential escalation raise concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 20:14:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...bad. Walking on eggshells constantly. Anyone else feel like they're losing themselves? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a stressful and potentially harmful home environment (\"walking on eggshells\"). The user expresses feeling lost and seeks help, suggesting a negative impact on their well-being.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 20:13:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, potentially indicating distress and a need for support. The metaphor of being 'underwater' suggests feeling suffocated or trapped. Reaching out is a positive sign but indicates the individual is struggling.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 20:12:42"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get punched outside the bar. Shook me up. Makes you realize how quickly things can escalate. Anyone else ever witness something like that? Feeling kinda anxious.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence is disturbing and can cause anxiety, but the text doesn't indicate ongoing threat or direct personal harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 20:11:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, thank god. Makes you think. Learn the signs, carry naloxone if you can. It really does save lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a significant event that indicates a potential risk of further overdoses in the area and highlights the presence of substance abuse. While the person survived, the incident suggests a potential public health concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 20:10:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "* * *\nBeen feeling so low lately, like I'm drowning. Reached out to a friend, just talking helped a little. Remember you're not alone. 988 is there if you need it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being overwhelmed but indicates help-seeking behavior and mentions a support resource, suggesting the individual is not immediately at risk. The language isn't explicitly suicidal.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 20:09:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on finding the strength to reach out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed ('underwater'), and difficulty reaching out, suggesting significant distress and a potential need for support. While not explicitly suicidal, the feelings of hopelessness and isolation warrant concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 19:17:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got clocked hard. Shook me up. Is there anywhere to report stuff like that anonymously? Feel helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes a single instance of violence that has already occurred, the description suggests a potentially serious injury ('clocked hard') and the reporter's distress ('Shook me up. Feel helpless.') indicates a level of concern that goes beyond a minor incident.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 19:16:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. We gotta look out for each other, people. Know the signs. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports an overdose event requiring Narcan, indicating a life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 19:15:53"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel like the city's getting more aggressive lately? I'm on edge.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning, but there's no indication of direct involvement, immediate danger to the speaker, or specific threats. It expresses anxiety and observation of perceived increased aggression in the city. Escalation to 'medium' would require evidence of direct threat or vulnerability.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 19:14:51"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about the overdoses downtown is scary. My brother struggled for years. Narcan saved his life once. Learn the signs, please. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions overdoses and the potential need for Narcan, indicating a risk of severe health consequences and possible death. While not explicitly stating an overdose in progress, the urgency and mention of a past life-saving event suggest a significant risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 19:13:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Please, if you're using, carry it. It can save a life, literally.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a witnessed overdose event requiring Narcan intervention, indicating a critical and life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 19:12:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel like violence is just getting worse?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, but doesn't indicate any direct involvement or immediate threat. It expresses concern about increasing violence in general, but doesn't suggest imminent harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 19:11:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad lately. Constant yelling, put-downs... I feel so small. Has anyone else gone through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile and emotionally abusive home environment with constant yelling and put-downs, which can significantly impact mental health and potentially escalate. The user expresses feeling \"small\", indicating a potential loss of self-worth and increased vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 19:10:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just reaching out to see if anyone else has felt this way and has any advice. It's been tough.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and difficulty, but does not contain any explicit mentions or indications of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2025-12-18 19:09:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant yelling, put-downs... I feel so small. Is this normal? Anyone else go through this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional distress and a potentially abusive environment. While not explicitly stating intent, the user expresses feeling 'small' and 'lost' due to 'constant yelling, put-downs', indicating a potential for escalating risk if the situation continues or worsens. Further investigation would be needed to assess the true severity.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 19:08:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Didn't know what to do, froze. Wish I'd said something. Anyone else experience this? Makes you feel helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault indicates a potential for escalation of violence and poses a risk to the victim. While the text doesn't indicate ongoing or direct threat to the original poster, the witnessed act is concerning.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 18:22:04"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight outside my kid's school. Shaking. Called the cops, but feeling so unsafe. Anyone else witness it? Need to talk.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight outside a school is a potentially violent situation causing distress and a feeling of unsafety. While the fight is external to the individual, the proximity and emotional response elevate the risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 18:21:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He screamed again last night, broke a glass. It's getting worse. Anyone know resources for help? I feel trapped.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates escalating violence (breaking glass) and a feeling of being trapped, suggesting potential for harm to self or others. The request for resources implies a recognition of a problem and a desire for help.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 18:20:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. It's terrifying. Lost a friend last year. If you're struggling, please reach out. There's help available, you don't have to go through it alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports an overdose death and expresses fear, indicating a risk of potential contagion or increased distress in the community. Personal loss due to overdose increases the emotional impact.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 18:18:58"
  },
  {
    "title": "User Story: Abuse",
    "content": "I feel so lost. He says he loves me, but then he screams and breaks things. Is this normal? I'm starting to think I deserve it. Anyone else been through this? #abuseawareness #domesticviolence #helpme",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a pattern of abuse including verbal abuse (screaming) and physical intimidation (breaking things), coupled with the victim questioning their self-worth and potentially accepting blame. This indicates a significant and immediate risk of further harm and potential escalation of violence.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 18:17:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after ODing. Scared, tbh. Never thought it would happen to me. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual has recently overdosed, indicating a potential ongoing risk of relapse or further self-harm. While they express fear and loneliness, there's no explicit mention of current suicidal intent, but the recent overdose elevates the risk beyond 'low'.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 18:16:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Narcan saved him, thankfully. Made me realize how close we all are to the edge. Know the signs, carry Narcan if you can. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be traumatizing and highlights the risk of overdose in the community. While the person survived, the event indicates a real and present danger.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 18:15:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so overwhelmed lately. Urges are back. Anyone know good coping mechanisms that actually work? Scared I'll relapse.\n\n**Option 2 (Sharing a Personal Story):**\n\n> 5 months clean from self-harm. Still a daily battle, but proving to myself I can get through this. One day at a time.\n\n**Option 3 (Raising Awareness):**\n\n> Just a reminder that self-harm isn't attention-seeking. It's a sign of deep pain. Please be kind and offer support.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses a fear of relapse and the return of urges, suggesting a potential escalation of risk. Option 2, while positive, highlights an ongoing daily battle. Option 3 is supportive and informational.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 18:14:50"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw two guys fighting outside my building last night. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel like that lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't indicate an immediate or direct threat to the person writing.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 18:13:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming I just want to feel *something* else. Scared I'll go too far one day. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses a desire for a different feeling and fear of going too far, suggesting potential for escalation. While not explicitly suicidal, the feeling of being overwhelmed and the search for coping mechanisms indicate a need for support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 18:12:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough night. Urges were really strong. Made it through without hurting myself, but feeling drained. Anyone else relate? Just trying to feel less alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports strong urges, indicating a potential risk of self-harm. While the individual reports not harming themselves, the intensity of the urges and feelings of being drained suggest a need for support and monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 17:20:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He yelled again last night, then apologized. I don't know what to do anymore. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential pattern of abuse, with escalating verbal aggression followed by apologies. The statement \"I don't know what to do anymore\" suggests feelings of hopelessness and a lack of coping mechanisms, raising concern for the individual's well-being and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 17:19:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...not good. Walking on eggshells constantly. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a potentially unsafe home environment and emotional distress, but doesn't specify the nature of the threat. \"Walking on eggshells\" implies fear and tension, warranting further investigation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 17:18:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling really overwhelmed lately. Like I'm drowning. Reaching out before things get worse. Anyone know good resources?\n\n**Option 2 (Personal Story):**\n\n> Lost a friend to suicide last year. Still feels unreal. Please check in on your loved ones, even the ones who seem okay.\n\n**Option 3 (Raising Awareness):**\n\n> It's okay to not be okay. Talking about suicidal thoughts is brave, not weak. Let's break the stigma.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While not explicitly stating suicidal intent, the phrase \"drowning\" and reaching out \"before things get worse\" in Option 1, combined with the discussion of suicide in Option 2, indicates potential risk. Option 3 also relates to suicide indirectly. This warrants a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 17:17:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Please, if you're struggling, reach out. There are people who care and want to help you get better. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, indicating a potential risk of serious harm or death, although it affected someone else.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 17:16:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough few weeks. Feeling so drained and empty. Reaching out because I know I need to talk to someone. Any advice on finding affordable therapy?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of being drained and empty, and the individual is reaching out for help, suggesting potential mental health distress. The mention of needing to talk to someone and seeking affordable therapy indicates an awareness of a problem and a willingness to seek help, but the severity is elevated by the expressions of feeling \"drained and empty.\"",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 17:15:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Narcan saved his life. Please, learn the signs of OD and carry it if you can. It's not worth losing someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a high risk situation. While the immediate risk has passed, the event underscores the significant potential for future incidents and the severity of overdose events.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 17:14:21"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his girlfriend on the street today. Froze. Wish I'd said something, done something. Feeling sick about it now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence implies potential for escalation and harm to the victim. While the reporting person is safe, the incident itself and the potential for future violence justify a medium rating.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 17:13:18"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight downtown last night. Shook me up. Just random, out of nowhere. Makes you wonder what's going on with people. Anyone else feel like things are getting more volatile lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text doesn't indicate imminent danger or direct involvement. It expresses concern and observation rather than active participation or threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 17:12:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park yesterday. Scary stuff. Narcan saved him, but it really shook me up. Anyone else dealt with something similar? Makes you realize how fragile life is.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome (Narcan reversal), indicates a situation with potential for severe health consequences and psychological impact on the witness. The proximity to a fatal event elevates the risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 17:11:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to distract myself but it's hard. Anyone else get this way? Just feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, feelings of being overwhelmed, and loneliness, suggesting a potential for escalation if support is not received. While not explicitly suicidal or self-harming, the presence of 'urges' warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 16:20:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home aren't good. Constant yelling, control... I feel trapped. Has anyone else been through this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling trapped in a controlling and verbally abusive environment. While there is no explicit mention of physical harm or intent to self-harm, the feeling of being trapped and the mention of control are indicators of potential escalation and warrant concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 16:19:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking help):**\n\n>  Things are bad at home again. Walking on eggshells constantly. Anyone know of resources for emotional abuse? Feeling so lost.\n\n**Option 2 (Sharing a story):**\n\n>  Finally out of that situation. Took years to realize yelling & control IS abuse. Healing is hard, but freedom is worth it.\n\n**Option 3 (Raising awareness):**\n\n>  Don't normalize toxic behavior! Gaslighting, isolation, threats - these are red flags. Protect yourself & your loved ones.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 suggests a current emotionally abusive situation causing distress. While not explicitly stating suicidal intent or physical harm, the mention of \"things are bad at home again\" and \"walking on eggshells constantly\" indicates a potentially escalating situation. Option 2 describes a past abusive situation, implying potential long-term trauma. Option 3 serves as a warning, but indirectly reinforces the severity of abuse. Together, these indicate elevated risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 16:18:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things aren't good at home. Constant put-downs, isolating me... Feels like I'm losing myself. Anyone else been through this? How did you find help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, which can significantly impact mental health and potentially escalate to more dangerous situations. The user is actively seeking help, indicating awareness of the problem's severity.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 16:17:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just reached out to a crisis line. Talking helped, even a little. If you're struggling, please don't give up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feeling \"lost\" and reaching out to a crisis line, suggesting significant distress and potential for self-harm or suicide. While the text notes that talking helped, the initial need for crisis intervention warrants a medium severity assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 16:16:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to hide the bruises. He says he's sorry after, but... I don't know what to do anymore. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions bruises and apologies, indicating physical abuse. The victim also expresses feeling alone and uncertain, suggesting potential escalation of the situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 16:15:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nScared. Found my brother unresponsive last night. Narcan saved him, but it was close. Please, learn the signs of an OD. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Brother experienced a near-fatal overdose, requiring Narcan intervention. Indicates a high risk situation already occurred.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 16:14:27"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Scary how fast things escalated. Makes you realize anything can happen. Shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potentially dangerous situation, but doesn't directly indicate ongoing harm to the author or others. The author expresses feeling shaken up, suggesting emotional distress, but no explicit threat or harm. The risk is low as it is a past observation and the author is reacting emotionally, not instigating further action.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 16:13:25"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on Elm St. I yelled, he ran. Shaking. Called the cops, but feel like I should've done more. Anyone else seen stuff like this around lately? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a physical assault (shoving) which indicates a potential for escalation and further harm. While the immediate threat is gone, the incident highlights a potential ongoing risk of violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 16:12:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Please, if you're struggling, reach out. There are people who care and want to help. Don't be afraid. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential suicide attempt or serious self-harm incident involving the author's friend. While not explicitly stated, the phrase 'almost didn't wake up' suggests a life-threatening situation. The urging to seek help reinforces this concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 16:11:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after 6 months clean. Disappointed but trying not to spiral. Reached out to my therapist, just need to get through today. It's a struggle, but I'm still here.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety, while the individual is reaching out for help, indicates a potential vulnerability and requires monitoring. The mention of 'struggle' and 'trying not to spiral' suggests emotional distress that could escalate.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 15:19:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about another OD. Makes me sick. Lost a friend last year. If you're struggling, please reach out. There are people who care & want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and mentions a friend's overdose, and encourages reaching out for help which suggests awareness of potential danger to self or others struggling with similar issues. While not explicitly stating suicidal intent or immediate risk, the mention of overdose and urging help-seeking behaviors elevates the concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 15:18:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, thank goodness. Please, if you're using, have it with you. And know how to use it. It can save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was used successfully, the text describes a recent overdose, indicating ongoing risk of further overdoses and potential fatalities.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 15:16:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling really overwhelmed lately. Urges are back. Reaching out for help before things get worse. Any advice?\n\n**Option 2 (Personal Story):**\n\n> 6 months clean. It's a struggle some days, but knowing I can get through it is what keeps me going. You can too.\n\n**Option 3 (Raising Awareness):**\n\n> Just a reminder to check in on your friends. You never know what someone might be going through silently. Be kind.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates a return of urges and feeling overwhelmed, suggesting a potential risk of relapse or worsening mental state. Reaching out is positive, but the presence of urges elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 15:15:57"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight break out downtown today. Scared the crap out of me. Is there anywhere I can learn some basic self-defense around here? Feeling really vulnerable now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The individual witnessed a fight and is now feeling vulnerable, but there is no indication they were directly involved or are in immediate danger. They are seeking self-defense training, which suggests a desire to proactively address potential future threats.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 15:14:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just need to vent. Things got physical again last night. Feeling so lost and scared. Is this really my life now? Anyone been through something similar? How do you even start to get out?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a situation where physical violence has occurred repeatedly, causing fear and a sense of hopelessness. The question of 'how to get out' implies a desire to escape a dangerous situation, but also a feeling of being trapped. The physical violence, fear, and entrapment suggests a potentially escalating dangerous situation and possible intent to self-harm or be harmed further.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 15:13:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Talking to someone feels impossible, but I'm trying. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of depression and a desire to reach out, suggesting the individual is struggling but also seeking help. The difficulty in talking to someone is a concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 15:12:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Walking on eggshells constantly. Anyone else feel trapped and not know where to turn?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a feeling of being trapped and walking on eggshells, suggesting potential domestic abuse or a highly stressful home environment. While no explicit threats or intentions are mentioned, the feeling of being trapped increases the risk of escalation. The inquiry to others suggests a desire for help and validation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 15:11:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "**(Option 1: Seeking Help)**\n\n> Been feeling so lost lately. Like I'm underwater. Reaching out... anyone know good resources for when you just need to talk?\n\n**(Option 2: Sharing a Story)**\n\n> Lost a friend last year. Still doesn't feel real. Please check in on the people you care about. You never know what they're going through.\n\n**(Option 3: Expressing Feelings)**\n\n> Just having a really hard time. Overwhelmed and don't know where to turn. Trying to take it one minute at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The texts express feelings of distress, being overwhelmed, and seeking help, indicating potential mental health struggles. While not explicitly suicidal, the intensity of the feelings and need to reach out warrant a medium severity level.",
    "detected_category": "other",
    "timestamp": "2025-12-18 15:10:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got seriously hurt. Makes you wonder what's going on with people. Anyone else feel like things are getting more volatile lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Report of a serious physical assault suggests potential for escalation of violence and raises concern about public safety, though not directly involving the reporter.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 15:09:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just want to know if anyone else feels this way sometimes? It's hard to explain.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and difficulty explaining those feelings. While it indicates emotional distress, there is no explicit mention of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2025-12-18 14:19:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately. Just finding it hard to cope. Reaching out to a helpline now. Needed to say it somewhere. Hope things get better.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being low, difficulty coping, and reaches out to a helpline. This suggests distress and a potential risk, but immediate danger is not explicitly stated.",
    "detected_category": "suicide",
    "timestamp": "2025-12-18 14:18:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so heavy. Relapsed after a few months clean. Feeling really ashamed and lost. Anyone else been there? Just need to know I'm not alone rn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of being clean, coupled with feelings of shame and being lost, indicates a potential for increased vulnerability and risk. While there's no explicit mention of self-harm or suicide, the emotional distress warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 14:17:42"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good lately. Constant put-downs, controlling behavior... I feel trapped. Has anyone else been through this? How did you find the strength to leave?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, indicating a potential abusive situation and emotional distress. While not explicitly stating physical harm, the feeling of being 'trapped' suggests a significant impact on the individual's well-being and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-18 14:16:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, just need to get through tonight. It's so hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm and feelings of being overwhelmed, indicating a high level of immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-18 14:15:38"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on the street. Shaken up. Reminded me of when my brother used to lash out. Anyone else have experience with family violence? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the author wasn't directly involved in the fight and is not reporting current abuse, the mention of a public fight and past family violence indicates potential trauma and emotional distress, raising the risk level beyond 'low'. The question about coping mechanisms suggests they may be struggling. It does not rise to 'high' as there's no immediate threat or active abuse being described.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 14:14:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant put-downs, walking on eggshells... I feel so lost. Anyone else been through this? Need to feel less alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 92 (char 117)",
    "detected_category": "unknown",
    "timestamp": "2025-12-18 14:13:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Learn the signs, carry it if you can. Could save a life. Seriously shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event indicates a significant risk, though the individual survived. The event was described as 'scary' and left the person 'seriously shaken up,' suggesting a moderate psychological impact.",
    "detected_category": "overdose",
    "timestamp": "2025-12-18 14:12:32"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight downtown. Dude got knocked out cold. Shook me up. Makes you realize how quickly things can escalate. Anyone else ever witness something like that? Still feel sick to my stomach.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence occurred resulting in someone being knocked unconscious. While the poster wasn't directly involved, witnessing such an event can be traumatic and indicates a potential risk of further violence in the area.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 14:11:30"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Dude got decked, just like that. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate ongoing danger to the speaker or others. It expresses a feeling of unease, but lacks specific threats or imminent harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-18 14:10:28"
  }
]