[
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, and a desire for help. While no direct threats are made, the heavy feelings and reaching out suggest potential for escalation if not addressed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-10 01:47:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital. My friend almost didn't make it. Please, if you're struggling, reach out. There are people who care and want to help. Don't let this happen to someone you love, or yourself.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text suggests a recent suicide attempt (or near-fatal self-harm event) of a friend, indicating a high risk of contagion and potential for further harm to the original poster or others.",
    "detected_category": "suicide",
    "timestamp": "2025-12-10 01:46:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nJust got out of the hospital after OD'ing. Scared straight. This can't happen again. Anyone know of good local support groups? Really need to talk to someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual recently overdosed and is seeking support, indicating a continued risk. While they express a desire to avoid future incidents, the recent overdose and need for support suggest vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 01:45:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Trying to distract myself, but it's hard. Anyone else relate? Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges and feelings of isolation, which suggests a potential for self-harm or other risky behaviors. While there is no explicit mention of intent, the feelings described warrant concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 01:44:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to talk to someone. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of persistent sadness and a desire to seek help, indicating a potential mental health concern. While not explicitly suicidal, the statement suggests a level of distress that warrants attention and support. The request for advice on finding help suggests a degree of insight and a desire for improvement, but also an acknowledgement of needing external assistance to manage their mental state.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 01:43:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to remember my coping skills. It's a daily battle. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges and feelings of being overwhelmed, suggesting a potential escalation of risk. While not explicitly stating suicidal intent, the mention of urges necessitates a moderate level of concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 01:41:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD hit way too close to home. Lost a friend last year. Please, if you're struggling, reach out. There are people who care & want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a friend's overdose death and encourages reaching out for help, indicating potential struggles with substance use or mental health. While not explicitly suicidal, the context suggests a heightened risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 01:40:58"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out to a friend, hoping it helps. It's hard to keep going sometimes.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and difficulty coping, suggesting potential for self-harm but doesn't indicate immediate intent.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 01:39:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank goodness. Reminded me how fragile life is. Learn the signs, folks. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, which is a life-threatening event, although the person survived due to Narcan. This indicates a potential risk for others in the area.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 01:38:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank God. Please, if you're using, have someone with you and have Narcan. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a witnessed opioid overdose, a life-threatening situation requiring immediate intervention. While Narcan was effective, the risk of death or serious harm was very present.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 01:37:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Thankfully, medics got there fast. Makes you realize how fragile life is. Learn the signs, people. Could save someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While medics intervened, a potentially fatal overdose occurred, indicating a moderate risk level to the individual who overdosed and potentially others present in the park.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 00:46:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary. Naloxone saved their life, thank goodness. Makes you think... everyone should carry it. Learn how to use it, seriously. Could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose, indicating a significant health risk. While the person survived, the event highlights a serious potential for fatal outcomes.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 00:45:11"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Said something, but feel like I should've done more. Anyone else ever witness something like that? What did you do? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, especially domestic violence, can be psychologically distressing and indicates a potential safety risk for the victim. While the immediate physical threat to the witness is low, the event suggests a possible escalation of violence and potential for further harm to the girlfriend.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 00:44:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad. Constant yelling, walking on eggshells... I don't know where to turn. Anyone else been through this? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home situation with constant yelling and feeling lost. While it doesn't explicitly mention violence or self-harm, the phrase \"walking on eggshells\" and the overall tone suggest a potentially volatile and emotionally harmful environment, increasing the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 00:43:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after OD'ing. Scared straight, I guess. Never thought it would happen to me. Anyone know good resources for recovery in [city/area]? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual recently overdosed and is seeking resources, indicating ongoing vulnerability even though they express a desire for recovery. The risk of relapse exists.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 00:42:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Feeling so lost. Things escalated again last night. I don't even know who I am anymore. Is this normal? I feel like I'm going crazy.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a significant level of distress, feeling lost and questioning sanity. The phrase 'escalated again last night' suggests a pattern of negative events, while 'I don't even know who I am anymore' points to identity crisis and potential emotional instability. While not explicitly suicidal or violent, the level of distress warrants concern.",
    "detected_category": "other",
    "timestamp": "2025-12-10 00:41:05"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Scary how quickly things escalated. Makes you think, y'know? Is there anywhere safe anymore?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight but does not indicate direct involvement or threat to the speaker, nor does it suggest specific plans for violence or harm. The question about safety is rhetorical and expresses concern rather than imminent danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 00:40:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is getting strong again. Reached out to a friend, hoping it helps. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a strong urge to self-harm, suggesting active distress. While the person has reached out for help, the immediate risk needs to be taken seriously.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 00:39:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. It's a reminder that addiction is a disease, not a choice. If you're struggling, please reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports an overdose event, indicating potential for harm or death, but doesn't directly involve or threaten the user.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 00:38:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a crisis line, and just talking helped a little. Remember you're not alone. There's help available.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating an immediate risk. While the person reached out for help, the persistence of the urge necessitates a high severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 00:36:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scary stuff. Narcan saved their life. Learn the signs and carry it if you can. It really works.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests potential for copycat behavior or emotional distress in the observer. While Narcan was effective, overdoses are inherently dangerous.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 23:17:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking feels impossible. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit suicidal or self-harm ideation. It is a general expression of distress and a request for shared experiences.",
    "detected_category": "other",
    "timestamp": "2025-12-09 23:16:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Terrifying. Narcan saved them. Carry it if you can, it’s so important. Where can I get trained?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, an overdose is a life-threatening event. The event highlights potential drug use in the area.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 23:15:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> Things are bad at home. Walking on eggshells constantly. Anyone know of resources for emotional abuse? Feeling so lost.\n\n**Option 2 (Sharing Experience):**\n\n> Never thought it would happen to me. Gaslighting is real. It messes with your head. Finally getting out.\n\n**Option 3 (Raising Awareness):**\n\n> My friend is being controlled by her partner. So worried. Subtle things, but adding up. How can I help her see it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional and psychological abuse, including gaslighting and controlling behavior. While not explicitly detailing physical harm, the situation could escalate, and the user is expressing distress and concern for themselves and a friend.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 23:14:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to stay strong & remember why I stopped. Anyone else feel this way? Just looking for some support.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, implying a struggle with something the person previously stopped. While not explicitly stated, this could be related to self-harm, substance use, or another harmful behavior. The request for support suggests awareness and a desire to cope, but the presence of urges elevates the risk beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 23:13:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but there is no explicit mention of self-harm, suicide, or harm to others. It appears to be a cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-09 23:12:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a bit. Remember, you're not alone. Talking can make a difference.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a high risk of potential harm. While the person reached out to a friend, the intensity of the urge necessitates immediate concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 23:11:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about another OD. Scared me. My brother's been struggling lately and I don't know what to do. Anyone have advice on how to talk to him about getting help? Really worried.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes concern for a brother who is struggling and the mention of an overdose suggests a potential risk. While not directly expressing suicidal intent or a current overdose, the brother's struggles and the expressed worry warrant attention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 23:10:29"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a lack of coping mechanisms. While not explicitly stating suicidal ideation, the metaphor of being 'underwater' and the plea for help suggest significant distress and a potential risk that needs further assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 23:09:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD…it's terrifying. Happened to my cousin last year. Please, if you're struggling, reach out. Don't let shame win. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While not explicitly stating intent, the text expresses fear and alludes to the risk of overdose (OD), a potentially fatal event. It also references a personal connection to a fatal overdose, suggesting a possible increase in vulnerability for the author or those they are addressing.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 23:08:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor OD last night. Scariest thing ever. Called 911, thankfully they made it. We gotta look out for each other. Learn the signs, carry Narcan. It saves lives. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing a neighbor's overdose indicates a critical, life-threatening situation. The text highlights the immediate need for emergency intervention (911 call) and suggests proactive measures to prevent future occurrences (carrying Narcan).",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 22:18:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were bad, but I distracted myself with a movie. Small victory, I guess. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges' which are unspecified but implied to be negative and difficult to manage, suggesting potential self-harm or suicidal ideation. While the person distracted themselves, the presence of these urges necessitates further assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 22:16:59"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight outside my kid's school. Shook me up bad. Makes you wonder what's going on with people, you know? Feeling really uneasy tonight.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing emotional distress. While unsettling, it doesn't indicate immediate danger to the author or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 22:15:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Naloxone saved them. Carry it, learn how to use it. It could save a life. Wish more people knew.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a safety risk in the environment and highlights the potential for further overdose events. While the individual was saved, the underlying issue and potential for future incidents raise the severity.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 22:14:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a memorial for someone lost to overdose. Hits hard. Addiction's a beast. If you're struggling, please reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text acknowledges the dangers of addiction and the tragedy of overdose but focuses on offering support and encouraging people to seek help. It doesn't express imminent harm or a specific plan.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 22:13:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just... heavy. Reaching out to a friend, but it's hard to explain. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of being lost, heaviness, and difficulty explaining emotions. While not explicitly stating suicidal intent, the combination of these factors suggests emotional distress that could escalate. Reaching out to a friend is a positive sign, but further assessment is needed to determine the level of risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 22:12:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad lately. Constant put-downs, controlling behavior... I feel so isolated. Has anyone else gone through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes experiencing emotional abuse and isolation, indicating potential for escalating distress and mental health issues. While not explicitly suicidal or violent, the situation warrants attention and support.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 22:11:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Been walking on eggshells lately. Partner's mood swings are exhausting. Is this normal in relationships? Starting to feel trapped. Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Feeling trapped and the potential for escalating emotional distress indicate a need for support and a risk of further harm, although immediate danger is not explicitly stated.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 22:10:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after ODing. Scared. Never thought it would happen to me. Reaching out for help is hard, but staying silent almost killed me. If you're struggling, please, please tell someone. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Recent overdose indicates a very high risk of recurrence and potential fatality.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 22:09:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. He's been isolating me from my friends and I'm scared. Is this normal in a relationship? I feel so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional and/or psychological abuse due to isolation from friends, coupled with fear and uncertainty, which poses a significant risk to the individual's well-being.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 22:08:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough night. The urges were strong, but I managed to distract myself. Small victory, I guess. Anyone else feel this way sometimes?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions strong urges that were difficult to manage, suggesting a potential risk. While the person claims to have distracted themselves, the nature of the urges is unclear and warrants concern. The open-ended question seeking similar experiences could indicate a need for support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 21:16:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming I just want to feel *something* else. Scared myself last night. Reaching out for help today. It's not a solution, I know that now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a desire to escape overwhelming feelings and a frightening action ('Scared myself last night'). While the person is reaching out for help and acknowledges the action wasn't a solution, the mention of self-scaring raises concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 21:15:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like I'm underwater. Reaching out before it gets worse. Anyone else feel this way? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of depression and hopelessness (\"feeling so low, like I'm underwater\") and indicates a desire to cope before the situation deteriorates (\"Reaching out before it gets worse\"). This suggests some awareness and help-seeking behavior, but the underlying feelings warrant concern and further investigation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 21:14:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been really bad lately. Walking on eggshells constantly. Is there anyone else who understands this feeling? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a distressed mental state and a potentially unsafe home environment, characterized by constant tension and feeling alone. While not explicitly mentioning self-harm or violence, the 'walking on eggshells' suggests a potentially volatile situation that requires further investigation to determine the extent of the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 21:13:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just left. Finally. My hands are shaking so bad. Is it normal to feel this lost even though I know it was the right thing? Any advice appreciated.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates emotional distress and anxiety (shaking hands, feeling lost) but lacks explicit mentions of self-harm, suicide, violence, or abuse. The user is seeking advice, suggesting a desire to cope healthily.",
    "detected_category": "other",
    "timestamp": "2025-12-09 21:12:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a bit. Just trying to get through tonight. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a serious and immediate risk to the individual's safety. While the person reached out for help, the intensity of the urge suggests a need for urgent intervention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 21:11:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Anyone else been through this?\n\n**Option 2 (Personal Story):**\n\n> Thinking about my friend today. Wish he'd known how much he mattered. Please check in on your loved ones.\n\n**Option 3 (Raising Awareness):**\n\n> It's okay to not be okay. Talking about it is the first step. There's help out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and heavy, and encourages seeking help and checking in on loved ones. While there is mention of a friend and wishing they knew how much they mattered, it does not explicitly express suicidal ideation or intent. It primarily focuses on seeking support and raising awareness.",
    "detected_category": "other",
    "timestamp": "2025-12-09 21:10:45"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend in the street. Froze. Someone called the cops, but I feel sick. Is there anything else I could have done? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be traumatizing and lead to psychological distress. The text indicates the person feels \"sick\" and \"helpless,\" suggesting a significant emotional impact.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 21:09:42"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Dude got knocked out cold. Makes you think, ya know? Is there anywhere safe anymore? Scared to walk alone now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent event can cause distress and fear, suggesting a potential impact on mental well-being and feelings of safety. The statement 'Scared to walk alone now' indicates a tangible change in behavior due to the event.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 21:08:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, walking on eggshells... Anyone else experience this? Feeling so alone. Need to figure out next steps.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive environment with emotional distress. The user expresses feeling alone and needing to figure out next steps, implying a desire for change and potential escalation if the situation worsens.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 21:07:39"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his partner on the street today. Broad daylight. Shook me up. Anyone else witness something similar? Feel so helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a single incident of violence between partners is concerning, but without further context or escalation, it's classified as low severity. It could be an isolated incident. However, it warrants attention and possible follow-up for resources.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 20:18:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm stuck in a dark hole. Reaching out because I don't know what else to do. Any advice or just someone to listen?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a desire for help, suggesting potential risk of self-harm or suicide. While there isn't explicit mention of intent, the 'dark hole' metaphor and reaching out in desperation warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 20:17:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Relapsed after a rough week. Feeling so ashamed and alone. Reaching out to my therapist tomorrow. Just need to get through tonight. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse after a difficult period, feelings of shame and isolation, and a stated plan to contact a therapist. While there's no explicit mention of self-harm or suicide, the combination of these factors, especially \"need to get through tonight,\" suggests elevated distress and a potential risk that requires monitoring. ",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 20:16:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. I keep making excuses for the yelling, but it's escalating. Anyone else feel like they're walking on eggshells all the time? Is this normal? #abuse #domesticviolence #help",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates escalating yelling, feeling like walking on eggshells, and uses hashtags related to abuse and domestic violence, suggesting a high risk of harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 20:15:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling so lost and overwhelmed. Reaching out because I don't know what else to do. Any advice or support is appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't indicate any immediate plans or intent to harm oneself or others. It's a general cry for help and support.",
    "detected_category": "other",
    "timestamp": "2025-12-09 20:14:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Reached out to a friend, just talking helps. Remember you're not alone. 💜 If you're struggling too, please find someone to talk to.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions feeling overwhelmed and the return of urges, which suggests a potential for self-harm or a relapse in a harmful behavior. While the person has reached out for help, the presence of urges elevates the risk beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 20:12:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Terrifying. Narcan saved them, but shook me to the core. Learn the signs, please. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a friend's overdose, a life-threatening situation requiring immediate intervention (Narcan). While the friend survived, the event indicates a significant risk of future overdoses and potential fatalities within the social circle.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 20:11:57"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Some dude got seriously hurt. Shaken up. Is there anywhere to report this anonymously? Feel like I should do something.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Someone was 'seriously hurt' indicating potential for significant injury. The witness is 'shaken up', suggesting a violent event with potential for lasting psychological impact.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 20:10:55"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you think, ya know? How do you even process something like that? Feel kinda shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence, which can be distressing, but does not indicate direct involvement, immediate danger, or specific threats to the individual or others. The phrase 'kinda shaken' indicates emotional distress but not necessarily a severe safety risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 20:09:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else feels this way. It's exhausting pretending to be okay. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost, exhaustion, and struggling to maintain a facade. While not explicitly stating suicidal ideation, the metaphor of being \"underwater\" and the request for help suggest significant emotional distress and potential risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 20:08:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel trapped. Has anyone else dealt with this? Need to know I'm not alone. #abuseawareness #domesticviolence\"\n\nI have included the hashtags to follow the directions in the prompt.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a situation involving constant put-downs and controlling behavior, which are indicators of abuse. The feeling of being 'trapped' suggests a significant impact on the individual's well-being and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 19:16:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, feeling like I can't do anything right... Is this normal? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential emotional abuse (put-downs, feeling inadequate). While not explicitly stating harm, the feeling of being 'lost' and the question of normalcy suggest a vulnerability that could escalate.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 19:15:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "I feel so lost. He says he loves me, but then screams and breaks things. Is this normal? I'm starting to think it's not. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a potential situation of domestic abuse, which can escalate to serious physical and psychological harm. The mention of screaming and breaking things suggests a volatile and potentially dangerous environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 19:14:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Reaching out because I don't know what else to do. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed (\"drowning\"). The individual is reaching out for help, indicating they are struggling but haven't explicitly stated intent to harm themselves. The mention of feeling \"low\" suggests a possible depressive state, requiring intervention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 19:13:23"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good lately. Constant put-downs are wearing me down. Is this normal? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential emotional abuse ('constant put-downs'). While there's no explicit mention of self-harm or suicide, the feelings of being 'lost' and worn down, combined with the uncertainty of whether the situation is 'normal,' suggest a need for support and monitoring. This could escalate if left unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 19:12:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them. Please, learn the signs. Could save a life. Check your local health dept for training.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event, which is a life-threatening medical emergency. While Narcan was used successfully, the potential for fatal outcome elevates the risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 19:11:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after OD'ing. Scared. Didn't think it would happen to me. If you're struggling, please reach out. There's help. I'm proof you can survive this. #overdose #recovery #addiction #mentalhealth",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user recently overdosed, indicating a significant risk factor. While they are expressing fear and encouraging others to seek help, the recent overdose suggests ongoing vulnerability and potential for future incidents.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 19:10:17"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street. He shoved her, hard. I froze. Wish I'd done something. Feeling sick about it now. Anyone else ever feel that helpless?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence (shoving) occurred, indicating a potential for escalation or further harm. While the reporter was not directly involved, the witnessed violence indicates a risk to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 19:09:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, had a rough night. Feeling that familiar urge again. Reached out to a friend instead. Small victories, right? Trying to stay strong.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with a recurring urge that could potentially be harmful. While the person reached out for help, the presence of the urge and the acknowledgment of a 'rough night' suggests a moderate level of risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 19:08:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need to. Talking to someone feels impossible, but I'm trying. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a lack of motivation, potentially indicative of depression or suicidal ideation. While not explicitly stating intent, the admission of needing help and the difficulty in reaching out suggest a significant emotional struggle and potential risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 19:07:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Walking on eggshells constantly. Is this normal? Feeling lost and scared. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential for emotional distress and fear within the home environment, suggesting possible abuse or domestic conflict. The phrases \"walking on eggshells\" and \"lost and scared\" indicate a significant negative impact on the individual's well-being.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 18:20:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, suggestive of emotional distress and a need for help. The metaphor of being 'underwater' implies difficulty coping and potential risk of escalation if unaddressed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 18:19:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a bit. Just taking it one day at a time. If you're struggling too, you're not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a strong urge to self-harm, indicating a significant risk. The person has reached out for help, which is a positive sign, but the intensity of the urge warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 18:18:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost died last night. OD. Scary as hell. Please, if you're struggling, reach out. There are people who care and want to help. Don't go through this alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a near-fatal overdose, indicating a significant risk of recurrence and potential for fatality.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 18:17:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park yesterday. Scariest thing ever. Narcan saved him. Makes you realize how fragile life is. Learn CPR, carry Narcan. It could save someone you love. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual survived, the text describes a life-threatening overdose situation requiring emergency intervention (Narcan). Overdoses carry a significant risk of death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 18:16:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my brother unresponsive. Narcan saved him. Terrified. Learn the signs, carry it. It could be anyone you love. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Report of an overdose event requiring Narcan intervention, indicating a life-threatening situation. The mention of unresponsiveness highlights the potential for fatal outcome without immediate action.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 18:15:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want to feel *something* different. Does anyone else get that? Trying to find healthier ways to cope. It's hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses a desire for a different feeling and acknowledges difficulty coping, but lacks specific plans or intentions for self-harm or suicide.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 18:14:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD. Makes me sick. Lost my cousin last year. Please, if you're struggling, reach out. There are people who care and want to help. It's not worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and concern about overdose deaths, indicating awareness of the issue and urging others to seek help. While not explicitly suicidal, the mention of a lost cousin and the plea for help suggest a potential for vulnerability in the audience.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 18:13:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's getting harder to pretend everything's okay. He's been isolating me from my friends and family... I don't know what to do anymore. Is this normal? Feels like I'm losing myself.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, isolation from support systems, and a feeling of losing oneself, which suggests a potential for escalation. While not explicitly mentioning harm, the isolation and loss of self can be precursors to more severe risks.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 18:12:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but shook me up. Knowing how close it was… please, if you're struggling, reach out. There's help available.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event, which carries a high risk of death or serious harm. Even though Narcan was used and the person survived, the proximity to death indicates high severity.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 18:11:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about overdose deaths lately is scary. My brother almost didn't make it last year. Narcan saves lives. Please, learn how to use it, just in case. It could be someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses overdose deaths and a personal near-fatal experience, highlighting the potential for immediate and severe harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 17:18:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Wish I'd said something. Feeling sick about it. Anyone else ever experience this? What do you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault indicates potential for escalation and further harm to the victim. The poster is also experiencing emotional distress, suggesting the impact of the event.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 17:17:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. Little things keep escalating. I feel so alone and scared. Is this normal? Where do I even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates escalating distress, feelings of isolation and fear, and a question about normality and help-seeking. This suggests a potential for harm to self, although immediate action is not explicitly stated.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 17:16:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, suggesting a potential for self-harm or suicidal ideation, though no explicit plans are mentioned. Seeking help indicates a degree of self-awareness and a desire to cope.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 17:15:48"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. My neighbor's been screaming at his wife again all night. I don't know what to do. Called the cops last time, but it just made things worse after they left. Anyone else deal with this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates ongoing domestic abuse which could escalate. The victim is expressing fear and previous intervention (police) has worsened the situation, suggesting a pattern of behavior and potential risk to the wife.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 17:14:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just wanted to say if you're struggling, you're not alone. Reaching out is scary, but it can make a difference. Talking helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and encourages seeking help, indicating distress but not explicitly mentioning self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2025-12-09 17:13:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Scared. Found my brother unresponsive last night. Narcan saved him. Please, if you're using, carry it. Know the signs. It's not worth the risk.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an opioid overdose situation where the brother was found unresponsive and required Narcan to be revived. This indicates a life-threatening event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 17:12:42"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Woke up feeling like I'm walking on eggshells again. It's exhausting trying to predict the next outburst. Anyone else relate? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation where the individual feels they are constantly anticipating someone's 'outburst,' suggesting a potentially volatile and emotionally unsafe environment. While not explicitly mentioning physical violence, the feeling of 'walking on eggshells' points towards a pattern of behavior that causes anxiety and emotional distress. The lack of details makes it difficult to assess the exact nature or frequency of the outbursts, but the indicated distress warrants a medium severity level.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 17:11:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just talking about it feels like a huge weight lifted. If you're struggling, please reach out to someone. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and encourages seeking help, indicating a potential struggle but no immediate or explicit plan for self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 17:10:38"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his partner on the street today. Frozen. Wish I'd said something, anything. Feeling sick about it now. Anyone else ever experience this? How do you react?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence is a risk factor for mental health distress, and the poster expresses feeling unwell and seeking support after observing a physical altercation. The shove, while seemingly minor, could indicate a pattern of abuse and potential for escalation.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 17:09:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about someone OD'ing. Scares me. Been there, barely made it. If you're struggling, please reach out. There are people who care. It doesn't have to end like that.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a recent overdose and the author's personal history with near-fatal overdose, indicating potential vulnerability and heightened risk, even though the user is encouraging help-seeking.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 16:20:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The statement expresses feelings of being overwhelmed and lost, which could indicate a decline in mental wellbeing and potential for self-harm if left unaddressed. The act of reaching out suggests a desire for help, but the specific nature of the distress is unclear.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 16:19:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He isolates me, then says I'm too dependent. Anyone else experience this? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and isolation, which can escalate. The user expresses feeling \"lost\" which suggests a potential decline in mental wellbeing.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 16:18:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it feels like the only way to quiet them is to hurt. I know it's not right, but it's hard to stop. Anyone else feel this way? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses thoughts of self-harm as a coping mechanism, indicating a potential crisis situation and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 16:17:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back and stronger. Reached out to a friend, feels a little better to not be alone with it. Taking it one hour at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual is experiencing strong urges, indicating a potential risk. While they reached out to a friend, suggesting some coping mechanisms, the intensity of the urges raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 16:16:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about the rise in ODs lately is scary. Lost a friend last year & it still hurts. Please, if you're struggling, reach out. There are people who care. You're not alone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a friend's overdose death and acknowledges personal struggle, suggesting potential vulnerability to overdose or related issues. While it promotes seeking help, the underlying issue is serious.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 16:15:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Felt so overwhelmed last night. Old coping mechanisms resurfaced. Reaching out for help feels scary, but I know I need it this time. Any advice?\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Cutting-free for 3 weeks. Some days are still a massive struggle, but I'm getting there. Small victories, right?\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Just a reminder that self-harm isn't always about suicide. Sometimes it's about feeling *something* when you feel numb. Be kind to yourself and others.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates a potential relapse in coping mechanisms and a recognized need for help, suggesting current distress. Option 2 highlights ongoing struggles with self-harm even amidst progress. Option 3, while raising awareness, acknowledges the function of self-harm as a means of experiencing sensation, indicating a risk factor.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 16:14:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. The urge to self-harm is strong. Trying to distract myself, but it's hard. Anyone else feel this way sometimes? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating a risk of potential harm. While the individual is attempting to distract themselves, the intensity of the urge elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 16:13:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. Urges were strong, but I distracted myself. One hour at a time, right? Talking helps, even just typing this out.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the presence of strong urges and feelings of being overwhelmed, suggesting a potential risk. While the individual is employing coping mechanisms (distraction, talking), the intensity of the urges warrants a medium severity assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 16:11:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. Narcan worked, thank God. Please, learn CPR and how to use it. Could save a life. Seriously shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event, indicating potential psychological distress for the individual who wrote the text. While Narcan was successful, the event highlights the presence of a life-threatening situation and the potential for future overdoses in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 16:10:57"
  }
]