[
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Taking it one hour at a time. Anyone else been there? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating active risk. While the person has reached out for help, the urge is still present, requiring monitoring and support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 04:32:49"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Okay, here's a short, realistic post focusing on seeking help:\n\n\"Felt so overwhelmed today. Almost relapsed. Reached out to a friend instead. Still shaky, but glad I didn't go through with it. Talking helps. #recoveryispossible\"\n\nI have added the hashtag #recoveryispossible to show positivity and hope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling overwhelmed and a near relapse, indicating a significant vulnerability. While the individual sought help and avoided relapse, the risk of future incidents remains.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 04:31:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD today. Scary stuff. Narcan saved him, but it shook me up. If you're using, please be careful. Reach out if you need help. It's out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event. While the individual survived due to Narcan, the event highlights the presence of a life-threatening situation and the risk of future overdoses. The advice to be careful and seek help indicates awareness of ongoing danger.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 04:30:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Narcan saved him. Learn the signs of an overdose. It's real.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Friend experienced a near-fatal overdose requiring Narcan, indicating a significant risk of death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 04:29:44"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Didn't know what to do. Wish I'd said something. Anyone else ever freeze like that? Feeling awful about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence (shoving) indicates a potential risk to the girlfriend. While the immediate danger might have passed, the risk of further abuse or escalation exists. The witness is also experiencing distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 04:28:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Relapsed after 6 months clean. Just trying to get through today. Anyone else know this feeling? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety coupled with feelings of overwhelm and loneliness suggests increased vulnerability and potential for harm. While not explicitly suicidal, the relapse indicates a breakdown in coping mechanisms and elevated risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 04:27:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are strong. Reached out to a crisis line, feels like a tiny step. Anyone else relate? Just feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges and feelings of isolation, indicating a potential risk for self-harm. Reaching out to a crisis line is a positive step, but the ongoing struggle suggests the individual requires further support and monitoring.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 04:26:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing loudly on the street. Escalated so fast. He shoved her, hard. I froze. Wish I'd done something. Feeling sick about it. What do you even do in that situation?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Physical violence (shoving) was observed, indicating a risk of serious harm to the victim.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 04:25:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the ambulance lights last night scared me. Friend OD'd. They're okay now, thank God. This stuff is too real. Please, be careful out there and know your limits.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A friend overdosed, indicating potential for repeated or increased risk of overdose among the social circle.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 04:24:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD in front of the store yesterday. Scariest thing ever. They’re okay now thanks to Narcan, but it shook me up bad. Made me realize how close we all are to losing someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual survived due to Narcan, witnessing an overdose indicates a risk of future overdoses in the area and potential psychological distress for the witness. The statement 'how close we all are to losing someone' suggests a heightened awareness of vulnerability and potential for future incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 04:23:35"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the gas station. Scariest thing ever. Narcan saved them, but it shook me up. Anyone know where I can get trained to use it? Feeling like I need to be prepared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing an overdose, not experiencing one directly. The individual is seeking training to help others, indicating a desire to be prepared rather than expressing current self-harm or suicidal ideation. While witnessing the event was distressing, the user is expressing a desire to help and does not indicate immediate risk to themself or others.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 03:46:57"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside my building. Shaking. Called the cops, but still feel sick. Anyone else deal with this? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent altercation can be traumatizing, leading to emotional distress. While the original poster (OP) doesn't appear to be in immediate physical danger, the feeling of sickness and seeking coping mechanisms suggests a significant emotional impact and potential for escalating anxiety. The risk of further violence is also present until police arrive.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 03:45:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Just had a really rough night. Feeling so overwhelmed and like I'm backsliding. Reached out to a friend, hoping it helps. Remember to be kind to yourselves, everyone. It's okay to not be okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses distress and feelings of being overwhelmed, but doesn't contain explicit threats or indications of immediate danger. Reaching out to a friend is a positive coping mechanism.",
    "detected_category": "other",
    "timestamp": "2026-01-13 03:44:53"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his car mirror after arguing with someone on the phone. Scared me. Makes you wonder what's going on in people's lives, you know? Hope they're okay, and nobody got hurt.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "An individual exhibited anger by damaging property. While potentially indicative of distress, it doesn't directly threaten the safety of the observer or others, though there is an indirect concern for the individual's well-being and the person they were arguing with.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 03:43:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Okay, here's a short, realistic social media post about self-harm, aiming for authenticity and help-seeking:\n\n\"Rough day.  Felt the urge to relapse, but called a friend instead. Still struggling, but I'm here.  Anyone else relate?  Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The post expresses feelings of struggle and urges to self-harm, but crucially, it describes coping mechanisms (calling a friend) and seeking connection. The user acknowledges the struggle but is actively working to avoid relapse. This indicates help-seeking behavior and a degree of self-awareness.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 03:42:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "Ugh, still reeling from that fight. Said some truly awful things. It's becoming a pattern. Anyone else experience verbal abuse like this? How do you cope? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a pattern of verbal abuse, which can escalate over time and lead to significant emotional distress. While it doesn't explicitly mention immediate danger, the feeling of being 'lost' suggests a potential decline in mental well-being.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 03:41:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... It's terrifying. Lost a friend last year. Please, if you're struggling, reach out. There are people who care. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions overdose and loss of a friend, indicating potential distress and highlighting the dangers. Includes a message of support, but the initial statement suggests a vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 03:40:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Woke up again feeling like I'm walking on eggshells. It's exhausting trying to predict what will set him off. Anyone else feel this way? Is this normal in a relationship?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a feeling of walking on eggshells and trying to predict what will set someone off, indicating potential emotional abuse or a volatile relationship. While not explicitly stating violence, the situation creates a stressful and potentially harmful environment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 03:39:44"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting on the street. Made me freeze. Brings back bad memories. Anyone else feel totally helpless witnessing stuff like that? Wish I knew what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling helpless, but doesn't indicate immediate danger to the speaker or others. It expresses distress and a desire for guidance, but lacks specific threats or actions suggesting imminent harm.",
    "detected_category": "other",
    "timestamp": "2026-01-13 03:38:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy and I don't know how to cope anymore. Reaching out because I need to know I'm not alone. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and an inability to cope, which are risk factors for self-harm or suicidal ideation, even though no specific plan is mentioned.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 03:37:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street. Loud, scary. Didn't know what to do. Wish I'd intervened but froze. Feeling guilty and shaken. Anyone else ever been in that situation?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes a situation witnessed by the author and does not directly involve harm to the author, the street fight presents a potential risk of violence escalating and affecting bystanders. The author also expresses emotional distress (guilt and feeling shaken) which warrants some concern.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 02:55:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Just reaching out to see if anyone else feels this way? Talking helps, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and lack of motivation, which could be indicative of depression or suicidal ideation, although there's no explicit plan or intent mentioned. Reaching out for help suggests a desire to connect and potentially mitigate further decline.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 02:54:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. How do you guys deal with seeing stuff like that? Feeling anxious and on edge now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is upsetting, and the author expresses anxiety. While unpleasant, the text does not indicate an immediate or severe threat to the author's or others' safety.",
    "detected_category": "other",
    "timestamp": "2026-01-13 02:53:33"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy and I don't know what to do. Reaching out because I don't want to feel like this anymore. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness, being lost, and a desire for the feelings to stop. While not explicitly suicidal, the statement indicates significant emotional distress and a plea for help.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 02:52:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm starting to realize maybe it's not normal to feel this scared all the time. He yells, then says he didn't mean it. I'm so confused. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 72 (char 97)",
    "detected_category": "unknown",
    "timestamp": "2026-01-13 02:51:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Just trying to find a way to quiet them that isn't... that. Anyone else get this? Any tips that actually help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses mental distress and seeks coping mechanisms, specifically mentioning wanting to avoid a certain unspecified negative behavior. The vagueness and the mention of 'that' implies a potentially harmful coping mechanism they're trying to avoid.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 02:50:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it feels like the only way to turn the volume down is... well, you know. Trying to find other ways. Talking helps a little. Anyone else get this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to alleviate overwhelming thoughts, implying self-harm ideation, although not explicitly stated. The phrase '...well, you know' suggests a harmful coping mechanism. Seeking alternative coping strategies is a positive sign, but the initial impulse is concerning.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 02:49:26"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. Walking on eggshells constantly. Is this... normal in a relationship? Feeling like I can't do anything right anymore. I just want it to stop. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped, helpless, and a desire for the situation to end, suggesting potential emotional distress and a possible precursor to more severe outcomes. While not explicitly stating suicidal ideation or intent to harm, the language warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 02:48:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Where do you even start to find air again?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, metaphorically drowning, and seeking help, suggesting potential for escalation if unaddressed.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 02:47:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan worked, thank god. Seriously everyone, carry it. You could save a life. Learn how to use it. #naloxone #overdoseprevention",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was successful, the text describes an overdose, which is a life-threatening event. The outcome could have been fatal.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 02:46:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm trapped in a dark room with no way out. Reaching out because I don't know what else to do. Is anyone else feeling this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being trapped, which are risk factors for self-harm or suicidal ideation. While there's no explicit mention of suicide or self-harm, the intensity of the feelings warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 01:46:56"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a fight break out downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else ever feel this way after witnessing something like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't indicate imminent danger or severe harm to the poster or others. The post primarily expresses emotional distress and reflection.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 01:45:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scariest thing ever. Narcan saved them. Please, if you're using, keep it on hand. And know the signs. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an actual overdose event that required intervention, indicating a significant and immediate threat to life.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 01:44:53"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw two guys fighting outside my apartment last night. Shook me up. Is there anywhere nearby I can learn some self-defense? Feeling really vulnerable right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight has caused the individual to feel vulnerable and seek self-defense, suggesting a perceived threat and potential for future violence or victimization.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 01:43:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just realized that \"arguments\" shouldn't leave bruises. Scared and confused. Is this... normal? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a possible instance of physical abuse and emotional distress, expressing fear and isolation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 01:42:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head. It's like I just need a release. I know it's not healthy, but it's hard to stop. Talking to someone feels impossible. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses distress, a need for release, difficulty communicating, and an acknowledgment that their coping mechanism is unhealthy. While there's no explicit mention of specific self-harm or suicidal intent, the overall tone suggests a level of internal struggle that warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 01:41:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Like I'm underwater. Reaching out before I sink further. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and a desire for help before 'sinking further,' suggesting potential suicidal ideation or a mental health crisis.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 01:40:47"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight outside the bar last night. Shook me up. Reminded me of things I'd rather forget. Anyone else feel this way sometimes? Just trying to process.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused emotional distress. While unsettling, it doesn't indicate imminent danger or direct involvement. The mention of past experiences suggests potential underlying trauma, but the user is primarily seeking support in processing their emotions.",
    "detected_category": "other",
    "timestamp": "2026-01-13 01:39:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a friend get Narcan'd. Scariest thing ever. Please, if you're using, have someone with you. And carry Narcan. It saves lives. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing a Narcan administration implies an overdose situation, which is inherently life-threatening. The urgent tone and plea for safety further highlight the severity.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 01:38:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt the urge to self-harm again tonight. It's been a while, and I'm disappointed in myself. Reached out to a friend, though. Small steps, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a recent urge to self-harm, which suggests a potential for escalation. While the individual reached out for help, the presence of the urge itself necessitates a 'medium' severity level.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 01:37:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary. Narcan saved them. Please, learn how to use it, you could save a life. Knowing it gives me a little hope. Be safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a real-world overdose event requiring emergency intervention (Narcan). While the person was saved, the potential for fatal outcome indicates a significant risk. The text also hints at a general lack of safety in the downtown area.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 00:43:20"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight downtown last night. Just spiraled out of nowhere. Makes you think, you know? Is there anything we can actually do to stop that stuff from happening? Feels helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence but doesn't indicate direct involvement, intent to harm, or imminent danger. It expresses concern and helplessness rather than active aggression.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 00:42:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are strong, and I'm trying so hard to resist. Anyone else relate? Just feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions strong urges and feelings of isolation, suggesting a potential escalation risk if support is not received.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 00:41:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Just reaching out... has anyone else felt this way? Need some air.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 74 (char 99)",
    "detected_category": "unknown",
    "timestamp": "2026-01-13 00:40:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Naloxone saved their life. Carry it, learn how to use it. You never know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential risk of further overdoses in the area and the need for immediate intervention, though the individual survived due to naloxone. The advice to carry naloxone and learn how to use it emphasizes the seriousness of the situation and possibility of recurrence.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 00:39:14"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out at the corner store last night. Shook me up bad. Reminded me too much of things back home. Anyone else feel like violence is just... everywhere lately? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses distress and anxiety related to witnessing a fight, but does not indicate immediate danger to the author or others. It's a general observation and a request for coping strategies.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 00:38:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating distress and a potential need for support. The metaphor of being 'underwater' suggests feeling suffocated and unable to cope. Reaching out indicates a desire for help.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 00:37:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, but it shook me up. Anyone else dealt with this? Feels like it's happening way too often now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potential crisis situation and increased risk of future overdoses in the community. While Narcan was used successfully, the increasing frequency mentioned is concerning.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 00:36:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and overwhelmed, comparing it to being underwater. This could indicate a mental health crisis, depression, or suicidal ideation, even though it's not explicitly stated. The fact they are reaching out suggests they are seeking help, which is a positive sign, but the depth of their distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 00:35:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the gas station today. Scary stuff. Narcan worked, thank god. Made me realize how easily it could happen to anyone. Stay safe out there, folks. Look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was effective, the observation of an overdose incident indicates potential risk to others in the community, particularly those with substance use issues.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 00:34:06"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing in the street, got pretty heated. Reminded me of things at home growing up. Feeling anxious now. Anyone else feel triggered by stuff like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes feeling anxious and triggered by an argument, but doesn't explicitly mention intent to harm self or others. While the reference to a difficult childhood is concerning, the immediate risk appears low.",
    "detected_category": "other",
    "timestamp": "2026-01-12 23:16:56"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm underwater. Reaching out to a friend tonight. Just need to breathe.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but explicitly mentions reaching out to a friend and a need to breathe, suggesting coping mechanisms are being employed. There's no direct mention of self-harm, suicide, or other dangerous behaviors.",
    "detected_category": "other",
    "timestamp": "2026-01-12 23:15:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to hide the bruises. Said I was clumsy. Anyone else experience this? Feel so alone. Is this normal?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates potential physical abuse ('bruises', 'said I was clumsy'), emotional distress ('harder to hide', 'feel so alone'), and uncertainty ('Is this normal?'). The combination of these factors suggests a high risk situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 23:14:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urges are back, stronger than ever. Reached out to a friend, hoping it helps. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions feeling overwhelmed with stronger urges, suggesting increased risk. Seeking help is a positive sign, but the phrase \"just need to get through tonight\" indicates immediate concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 23:13:51"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD on the train today. Scariest thing ever. Narcan saved him, but damn. We need more access, more help. Anyone know where to find resources in the city?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Observed overdose event, indicating immediate risk to the individual and potential for similar events impacting others.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 23:12:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... feeling trapped. Anyone else been through this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving controlling behavior and feeling trapped, suggesting emotional abuse which carries potential for escalation and psychological harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 23:11:49"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel more on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling, but the text primarily expresses anxiety and awareness of potential danger rather than immediate threat or intent to harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 23:10:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at a party last night. Scary stuff. Narcan saved them, but shook me up bad. Please, if you're using, have someone with you and know the signs. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates the presence of potentially life-threatening substance use. While Narcan was effective in this instance, the underlying issue of substance use and potential for future overdoses remains a concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 23:09:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scariest thing ever. Narcan saved them. Please, if you're using, keep it on you. It could save a life. Where can I get more info/training?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a recent overdose event involving a friend, indicating a serious risk to individuals using drugs. The user is also seeking information and training, suggesting ongoing concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 23:08:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. I'm walking on eggshells all the time. Anyone else ever feel this trapped? Need to figure out a way out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a feeling of being trapped and walking on eggshells, suggesting a stressful and potentially unsafe home environment. The user is actively seeking a way out, which implies the situation is negatively impacting them and they are trying to find solutions, but there is no overt mention of self-harm, suicide, or violence.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 23:07:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, thankfully. Makes you realize how easily things can go wrong. If you're struggling, please reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, indicates a serious health and safety risk in the individual's environment. The text suggests potential exposure to drug use and its associated dangers.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 22:18:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scary night. Found my roommate unresponsive. Narcan saved them. Everyone, please learn the signs of OD and carry it. It's not just for \"junkies,\" it can happen to anyone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a potentially fatal overdose situation that required immediate intervention (Narcan). While the immediate danger has passed, the underlying risk of future overdose remains.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 22:17:00"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy get shoved on the subway. Everyone just looked away. Makes me sick. Is this normal now?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A physical assault occurred (shoving), indicating potential for injury. While the text doesn't explicitly state severe injury, the act of pushing someone on a subway platform is inherently risky.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 22:15:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, hoping it helps this time. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The return of urges suggests a potential escalation of a previous issue. Reaching out to a friend is a positive coping mechanism, but the statement \"It's exhausting fighting this\" indicates ongoing distress and a struggle to maintain control.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 22:14:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw my friend OD. Terrifying. Narcan saved them, thank god. Scary how easily it happens. Learn the signs, please. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a highly stressful and potentially traumatizing event. Although the person survived, the situation indicates a significant risk of future overdoses for the individual who overdosed and potential psychological distress for the witness.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 22:13:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Just want the noise to stop. Reached out to a friend. Talking helps, even a little. There's gotta be better ways to cope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses a desire for internal noise to stop, suggesting distress. Reaching out to a friend is a protective factor, but the underlying issue needs attention.",
    "detected_category": "suicide",
    "timestamp": "2026-01-12 22:12:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before things get worse. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost, hinting at potential mental health distress and a desire to prevent escalation. The statement \"Reaching out before things get worse\" indicates awareness and a proactive attempt to seek help, but the depth of the distress is unclear.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 22:11:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. Every little thing sets him off. Walking on eggshells constantly. Is this normal? Feeling so isolated. #domesticviolence #emotionalabuse",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse and a potentially volatile situation at home. While not explicitly stating physical violence, the phrase \"walking on eggshells\" suggests fear and control by another person, and the hashtag #domesticviolence raises concerns about escalation. Isolation is also a significant risk factor.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 22:10:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, stronger than before. Reached out to a friend, hoping it helps this time. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of strong urges, suggesting a potential escalation of risk. While the individual reached out for help, the phrase \"stronger than before\" and \"exhausting fighting this\" indicate significant distress and decreased ability to cope.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 22:09:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough week. Feeling so drained and hopeless. Talking to a friend helped a little, but it's still hard. Just putting it out there. Need to remember I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of hopelessness and being drained, but there are no explicit mentions of self-harm, suicide, or harm to others. The individual is seeking support and reminding themselves they are not alone, suggesting a desire for help and connection.",
    "detected_category": "other",
    "timestamp": "2026-01-12 22:08:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. Narcan saved their life, but shook me to the core. Please, if you're struggling, reach out. There's help available. I'm here to listen too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, the text describes an overdose incident, indicating a potential ongoing risk of future overdoses for the individual involved and potentially others in the same environment. The emotional distress expressed by the author also warrants attention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 21:18:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. Walking on eggshells constantly. It's never enough. Anyone else feel like they're losing themselves? Need to figure out how to get out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of being overwhelmed, losing oneself, and a desire to escape. While there isn't explicit mention of self-harm or suicide, the sentiment could escalate.",
    "detected_category": "other",
    "timestamp": "2026-01-12 21:16:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so overwhelmed lately. Relapsed after a few months clean. Just trying to take it one day at a time. Anyone else get through this? Feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety, coupled with feelings of being overwhelmed and alone, suggests increased vulnerability and potential for escalation of substance use. While not explicitly suicidal or harmful, the relapse poses a risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 21:15:57"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a fight outside the bakery today. Guy just snapped. It was scary how fast it escalated. Shaken up. Anyone else witness it? Hoping the victim is okay.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent fight can be traumatizing and indicate a risk of future violence in the area.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 21:14:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so overwhelmed lately. Like I'm drowning. Anyone know resources that actually help? I need to reach out.\n\n**Option 2 (Personal Story/Awareness):**\n\n> Thinking of my friend today. It's been a year. Please check in on the people you love. You never know what they're going through.\n\n**Option 3 (Expressing Feelings):**\n\n> Just having a really dark day. Everything feels pointless. Trying to hold on.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 3 expresses feelings of pointlessness and mentions \"trying to hold on,\" suggesting suicidal ideation though not explicitly stating intent. Option 1 indicates being overwhelmed and seeking help, a positive step, but still indicative of distress. Option 2 highlights loss and the importance of checking on others, which while generally positive, could be related to a personal struggle with mental health.",
    "detected_category": "suicide",
    "timestamp": "2026-01-12 21:13:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary. Makes you realize how quickly things can escalate. Anyone else feel like violence is just getting worse lately? Feeling shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't indicate immediate personal danger or involvement. The text expresses fear and anxiety but not active participation or direct threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 21:12:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> \"I'm having a really rough time. Urges are strong. Anyone know good coping strategies that actually work? Feeling lost.\"\n\n**Option 2 (Sharing Experience):**\n\n> \"It's been [Number] days clean. Still a struggle, but focusing on small wins. You're not alone if you're fighting too.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Just a reminder that self-harm isn't attention-seeking. It's a sign of deep pain. Be kind, always.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates active struggle with strong urges, suggesting a potential for self-harm. While not explicitly suicidal, the feeling of being 'lost' combined with strong urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 21:11:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so numb lately. Like I'm watching my life from behind a glass wall. Reaching out to a friend, feels impossible. Anyone else ever feel this disconnected?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of numbness and disconnection, but lacks explicit suicidal ideation, self-harm plans, or intent to harm others. While concerning, it does not present an immediate or high risk.",
    "detected_category": "other",
    "timestamp": "2026-01-12 21:10:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so heavy, y'know? Like needing to feel *something* else, even if it hurts. Trying to find healthier ways to cope, but it's hard. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to feel something, even if it hurts, and mentions difficulty finding healthy coping mechanisms. This suggests emotional distress and potential risk of self-harm, though not explicitly stated.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 21:09:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIP posts lately. Lost a friend to overdose last week. Scared. Where can I learn how to help someone who's overdosing? I need to know what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and a desire to learn how to help someone overdosing, indicating potential for future overdose situations and a reactive need for knowledge.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 21:08:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired of walking on eggshells. Every little thing sets him off. Is this normal in a relationship? Feeling lost and scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and fear within a relationship, suggesting potential for emotional abuse or escalation. The phrase 'walking on eggshells' and 'every little thing sets him off' suggest a controlling or volatile partner.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 20:19:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs are wearing me down. Anyone else ever feel this way? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post describes feeling worn down by constant put-downs, which suggests emotional distress and a potentially abusive situation. The user is also asking for help, indicating they recognize the need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 20:18:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is anyone else feeling this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, and a cry for help. While it doesn't explicitly mention self-harm or suicide, the metaphor of being 'underwater' suggests a sense of being suffocated or drowning in emotions, which warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-12 20:17:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me. We gotta look out for each other, folks. Knowing how to use it is so important. Be safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event, and while Narcan was effective, the individual's distress and call for vigilance indicates an ongoing risk within their community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 20:16:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's getting harder to pretend everything's okay. The yelling, the constant put-downs... I feel so small. Anyone else ever feel this way? Need to know I'm not alone. #abuse #domesticviolence #mentalhealth\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates ongoing verbal and emotional abuse, which can escalate and significantly impact mental health. While it doesn't explicitly mention immediate physical harm, the constant put-downs and feeling \"small\" suggest a potentially dangerous situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 20:15:33"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately, like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and reaching out for help, suggesting potential distress. The 'underwater' metaphor can imply suffocation or drowning, metaphors sometimes associated with feeling overwhelmed by suicidal ideation. While not explicitly suicidal, the vague nature of the plea warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-12 20:14:31"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get shoved on the train today. Scary how fast things escalate. Made me realize I need to learn some self-defense. Anyone know any good classes in the city?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent act (being shoved) indicates a potential risk of violence in the environment. While the reporter wasn't directly harmed, the incident was impactful and caused concern, suggesting a medium level of severity.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 20:13:29"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Frozen. Didn't know what to do. Feel sick. Anyone else ever witness something like that? What did you do? Need to process this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, even if not directly involved, can be distressing and may indicate an ongoing abusive situation. While the witness is not in immediate physical danger, the psychological impact and potential escalation of the violence warrant concern.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 20:12:27"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Dude got clocked hard. Makes you think, y'know? How close we all are to that kind of thing. Shook me up.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence is disturbing, but the text doesn't indicate ongoing danger or a high probability of immediate harm to the speaker or others. It expresses a sense of unease and reflection rather than direct threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 20:11:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Trying to stay strong and remember why I stopped. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse in urges and a struggle to cope. While not explicitly stating intent, the return of urges increases the risk of acting on them. Seeking connection suggests a desire for support, but the underlying struggle warrants attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 20:10:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Please, if you're struggling, reach out. There are resources. You're not alone. Know your limits and look out for each other. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event, indicating a risk of potential harm and death. While it promotes seeking help, the event itself suggests a tangible and recent safety risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 19:19:03"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Constant yelling, then the silent treatment... I feel so small. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially emotionally abusive environment. While there's no explicit mention of physical harm or immediate danger, the chronic yelling and silent treatment can significantly impact mental health and could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 19:18:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Explicit mention of a strong urge to self-harm indicates a high risk of potential harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 19:17:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Narcan saved his life. Scary reminder this stuff is real & deadly. Please, everyone, look out for each other. Learn the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a high level of immediate danger and potentially ongoing risk for the individual involved.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 19:15:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel extra anxious after witnessing something like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight caused anxiety, but there is no indication of direct threat, intent to harm self or others, or ongoing danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 19:14:57"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been feeling so isolated lately. Constant put-downs from my partner... is that normal? Starting to feel like I'm losing myself. Anyone else experience this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress due to isolation and put-downs from a partner, suggesting a potential for escalation of emotional or psychological abuse. The feeling of 'losing myself' hints at a diminished sense of self-worth and could lead to further mental health decline.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 19:13:55"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside my building. Shaking. Called the cops, but still feel sick. Anyone else ever witness something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can cause distress and anxiety, indicating a moderate level of risk to mental well-being. While not directly involved, the individual is experiencing negative psychological effects.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 19:12:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Paramedics got there fast, thank god. Makes you realize how easily it can happen to anyone. Is there anything we can do to help prevent this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event indicating potential harm and risk to others in the community, but it doesn't directly indicate immediate danger to the person reporting.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 19:11:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? How did you find help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, leading to feelings of isolation. While not explicitly stating physical harm, the situation indicates a potentially escalating risk for the individual's mental and emotional well-being.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 19:10:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It helps. If you're struggling too, please don't go through it alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, implying a potential for self-harm. Reaching out is a positive coping mechanism, but the presence of urges elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 19:09:48"
  }
]