[
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Just senseless. Makes you wonder what's going on in people's heads. Scared me, honestly. Anyone else see it?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling and frightening, but the text doesn't indicate ongoing threat or direct involvement of the poster. The emotional response expressed suggests distress but not necessarily immediate danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 19:18:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells lately. Is it normal to feel this scared all the time around someone you're supposed to love? Starting to think this isn't healthy. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling constantly scared and unsafe in a relationship, suggesting possible emotional or psychological abuse. The user acknowledges the unhealthiness of the situation, indicating a level of awareness and potential risk. While there's no explicit mention of physical harm, the consistent fear raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 19:17:29"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so incredibly lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain specific suicidal ideation, self-harm plans, or threats of violence.",
    "detected_category": "other",
    "timestamp": "2026-01-16 19:16:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming. Just wanted to say if you're struggling, you're not alone. Talking helps, even if it's just a little. Reach out to someone. I'm trying to.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and struggling, suggesting potential mental health distress. While it encourages seeking help, the initial statement indicates a possible risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 19:15:26"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just had a fight with my partner. Again. Feeling so lost. Is it normal to feel this scared all the time? Starting to think maybe it's not just \"a bad patch\".",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential for escalation due to repeated conflict and persistent fear. While not explicitly stating intent to harm self or others, the emotional distress warrants concern and further investigation. Could escalate to violence or self-harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 19:14:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's getting harder to hide the bruises. Said I deserved it for talking back. Feeling so alone. Anyone else been through this? I need to know I'm not crazy.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes physical abuse and feelings of isolation, indicating a significant risk of harm and potential escalation of the situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 19:13:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a thing about overdose deaths rising again. Scared me. Lost a friend last year. If you're struggling, please reach out. There are people who care. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text expresses concern and encourages seeking help, the mention of overdose deaths rising and losing a friend suggests potential distress and proximity to the issue, elevating the severity beyond simply low.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 19:12:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up yesterday. Scariest moment of my life. Narcan saved him. Please, learn the signs of an overdose. It could save someone you love. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event requiring Narcan intervention, indicating a severe and immediate threat to life.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 19:11:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown last night. Scary stuff. Narcan saved them, but it was too close. Please, if you're using, have someone with you and carry Narcan. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose incident requiring emergency intervention (Narcan). While the person survived, the phrase 'too close' indicates a significant risk of death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 19:10:18"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough at home. Walking on eggshells constantly. I feel so isolated. Has anyone else dealt with controlling behavior from their partner? Feeling lost and don't know where to turn.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and isolation, increasing the risk of mental health deterioration. The mention of 'controlling behavior' and 'walking on eggshells' suggests a potentially harmful dynamic. While not explicitly mentioning self-harm or suicide, the feeling of being lost and isolated warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 19:09:16"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been so angry lately, and I feel like I'm walking on eggshells. Anyone else deal with this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation with escalating anger and fear, suggesting potential emotional or verbal abuse. While not explicitly stated, the phrase 'walking on eggshells' often indicates an environment where any misstep could trigger a negative reaction from the angry individual. The risk of escalation to physical violence or other forms of abuse cannot be ruled out.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 18:22:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming. It's like my brain is screaming. Just trying to get through the day without giving in. Anyone else feel this? Talking helps, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and struggling to cope, indicating potential mental health distress. The phrase \"without giving in\" suggests a struggle against something negative, and while not explicitly stated, it could be interpreted as self-harm or suicidal ideation. Seeking help through talking is a positive sign, but the underlying distress warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 18:21:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scared me so bad. Narcan worked, thank god. But it's happening way too much. Anyone know where to get free training around here?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event, while resolved by Narcan, suggests a potential for future overdose incidents and reflects a dangerous situation present in the community. The user expresses fear and concern, indicating emotional distress.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 18:20:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel trapped. Has anyone else been through this? How did you find the strength to leave?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, indicating a potential for emotional abuse. While not explicitly stating physical violence, the feeling of being 'trapped' suggests a serious and potentially escalating situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 18:19:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been... rough. Constant yelling, walking on eggshells. I feel so isolated. Anyone else been through this? How do you cope? I just want it to stop.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with emotional distress and a desire for the situation to end, suggesting potential for escalation. While not explicitly stating suicidal or violent intent, the sense of isolation and desperation warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 18:18:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD in the bathroom today. Scariest thing ever. Narcan worked, thankfully. Please, if you're using, carry it. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A person overdosed, indicating a serious risk of death or severe health consequences. While Narcan was effective in this instance, the situation highlights the potential for future, possibly fatal, overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 18:17:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Need to find a way back up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, using the metaphor of being underwater and needing to find a way back up. While not explicitly stating suicidal intent, the language suggests distress and a desire for help, indicating a potential risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 18:16:33"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Narcan saved his life. Learn how to use it, please. You could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose situation requiring Narcan, indicating a high risk to life.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 18:15:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after a close call. Scared me straight. Narcan saves lives. Please, if you're using, have it around. Learn how to use it. It's not worth the risk. #HarmReduction #OverdoseAwareness #Recovery (edited to remove hashtags and lengthen to meet prompt requirements after previous bot rejection)",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event requiring hospitalization and Narcan, indicating a high risk situation involving potential death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 18:14:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. The urge to self-harm is strong. Reached out to a friend, but it's still hard. Anyone else feel this way sometimes? Just trying to get through it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating active risk. While the person has reached out for help, the urge persists, suggesting a need for further support and monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 18:13:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad. Really bad. Walking on eggshells constantly. I feel so alone. Is there anyone else who understands this? Just need to know I'm not crazy.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a highly stressful and isolating home environment, suggesting potential for escalating distress. The phrase \"walking on eggshells\" indicates a tense and potentially abusive dynamic. While not explicitly mentioning self-harm or suicide, the intensity of the negative feelings warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 17:21:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to someone feels impossible, but I know I need to. Any advice on where to start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and isolated, suggesting potential distress and a need for support. The statement 'Talking to someone feels impossible, but I know I need to' indicates awareness of needing help but also a barrier to seeking it. While there's no explicit mention of self-harm or suicide, the described emotional state warrants a medium severity rating due to the potential for escalation.",
    "detected_category": "other",
    "timestamp": "2026-01-16 17:20:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "Sometimes I feel so small. He yells, then apologizes, says he didn't mean it. It's a cycle. Anyone else experience this? Starting to think I deserve it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a cycle of verbal abuse followed by apologies, suggesting emotional manipulation. The phrase 'Starting to think I deserve it' indicates potential internalization of the abuse and a negative impact on self-worth, which elevates the risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 17:18:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a strong urge to self-harm (cutting) and feelings of being overwhelmed. While the individual has reached out for help, the presence of a strong urge to self-harm indicates a high level of immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 17:17:57"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Should I have done something? Feeling sick about it now. Anyone else experience this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence suggests a potential risk of escalation or further harm to the victim. While the observer is not directly at risk, the event itself indicates a safety concern.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 17:16:55"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Walking on eggshells constantly. Anyone else feel like they're losing themselves trying to keep the peace? Feeling so isolated. Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of isolation, walking on eggshells, and losing oneself, suggesting a potentially harmful situation. The user is also actively seeking help.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 17:15:54"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Been having a really rough time lately, urges are strong. Reached out to a helpline, feels like a small step. Anyone else relate?\"\n\n**Option 2 (Sharing Experience):**\n\n> \"It's been [Number] days clean. Still hard, some days harder than others. Just taking it one day at a time.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Sometimes it feels like no one understands. Self-harm isn't attention-seeking, it's a sign of deep pain. Let's be kinder to each other.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 explicitly mentions strong urges, indicating potential risk. While seeking help is positive, the presence of strong urges necessitates a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 17:14:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "I used to think the constant put-downs were just \"teasing.\" Now I realize it's been chipping away at me for years. Anyone else experience this kind of thing? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and the realization of long-term emotional harm, suggesting a potential decline in mental well-being and possible vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 17:13:49"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a guy get shoved on the subway. Scary how fast things escalate. Reminded me of my brother, dealing with anger issues. Any advice on getting someone to seek help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be traumatizing. The mention of the brother with anger issues suggests a potential for further violence or harm, though not directly stated as imminent. The writer is also seeking advice, indicating concern and potential for intervention.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 17:12:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Okay, here's a short, realistic post focusing on seeking help:\n\n\"Felt so overwhelmed today. Urges were really strong. Reached out to a friend, and just talking helped. Still shaky, but getting through it. Remember you're not alone. There are people who care.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges, implying a potential risk of self-harm or suicide. While the person reached out for help and it helped, the continued shakiness suggests the risk hasn't completely subsided and requires continued monitoring.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 17:11:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. The urge to self-harm is strong. Trying to distract myself, but it's hard. Anyone else feel this way? How do you cope? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a potential risk. While the person is attempting to cope, the strength of the urge elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 16:20:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. It's like walking on eggshells constantly. Never know when things will explode. Anyone else feel trapped? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped and a sense of unpredictability (\"things will explode\"). While not explicitly stating intent to harm self or others, the language suggests a potentially volatile situation and a need for support. The mention of \"walking on eggshells\" implies a stressful and possibly abusive environment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 16:19:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved their life, thankfully. Makes you realize how fragile things are. Anyone know where to get trained on using it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived due to Narcan, an overdose occurred, indicating a potentially life-threatening situation. The user is also seeking Narcan training which suggests the problem is ongoing and not an isolated incident.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 16:18:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I used to think yelling didn't count as abuse. Now I realize it's worn me down just as much. Feeling lost and unsure how to even start fixing this.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse and its impact on the person's mental state, leading to feelings of being lost and unsure. While not explicitly stating intent for self-harm or suicide, the prolonged effect of abuse can increase vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 16:17:43"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside my apartment. One was bleeding bad. Shook me up. Called 911, but still... feels like I should do more. Anyone else ever deal with something like this? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the original poster (OP) is not directly involved in the violence, the event described involved a significant injury (bleeding badly) indicating potential for serious harm. The OP's distress and desire to do more suggests a level of emotional impact beyond witnessing a minor incident. The situation has been handled by calling 911.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 16:16:42"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight outside the bar last night. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel like violence is getting worse lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning, but doesn't indicate immediate danger to the author or others. It expresses a general feeling of unease.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 16:15:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Just existing is exhausting. Talking to my doctor tomorrow, hope things start looking up. 😞",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of exhaustion and heaviness, but includes a proactive step of talking to a doctor. While concerning, it doesn't indicate immediate danger.",
    "detected_category": "other",
    "timestamp": "2026-01-16 16:14:38"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside my building. One was on the ground, not moving. Called 911, but I'm shaking. Is there anything else I should do? Feel helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A person is reported to be on the ground and not moving, indicating a potentially life-threatening situation. This requires immediate medical intervention and possibly police investigation.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 16:13:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Woke up this morning realizing I deserve better than the constant put-downs. It's exhausting. Anyone else feel like they're walking on eggshells all the time? Where do you even start to fix this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being emotionally drained and possibly in a verbally abusive or controlling environment. However, it lacks explicit mentions of self-harm, suicidal ideation, violence, or substance abuse. It seems more focused on emotional well-being and a desire for change.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 16:12:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "*   \"Been feeling so numb lately, like I'm watching my life from behind a glass wall. Reaching out to a friend tonight. Hope it helps.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses emotional distress and feelings of disconnection, but indicates help-seeking behavior by reaching out to a friend. No immediate threat is stated.",
    "detected_category": "other",
    "timestamp": "2026-01-16 16:11:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't explicitly mention self-harm, suicide, or violence. The person is reaching out for support, indicating a desire to connect rather than a plan for harm.",
    "detected_category": "other",
    "timestamp": "2026-01-16 15:19:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel trapped. Has anyone else experienced this? Need to know I'm not alone and maybe find resources.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, which indicates potential emotional abuse. While not explicitly stating physical harm, the feeling of being 'trapped' suggests a significant negative impact on mental well-being and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 15:18:33"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Just reaching out... anyone else ever feel this way? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 87 (char 112)",
    "detected_category": "unknown",
    "timestamp": "2026-01-16 15:17:31"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Guy was bleeding bad. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel more on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Report of a violent fight with significant bleeding suggests a potential risk of serious injury or further violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 15:16:30"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Reminded me of things I try to forget. Anyone else feel triggered by stuff like that? How do you cope? Feeling really anxious.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes experiencing anxiety and being triggered by witnessing a fight. While distressing, it doesn't express intent to harm self or others.",
    "detected_category": "other",
    "timestamp": "2026-01-16 15:15:28"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a guy get shoved on the subway. My heart's still racing. Is everyone okay? Makes you wonder what's going on with people lately.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While concerning, the text describes a single instance of assault and doesn't suggest ongoing or widespread violence. The focus is on the observer's emotional reaction.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 15:14:26"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary. Makes you realize how quickly things can escalate. Anyone else feel like things are getting more volatile lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Reports observation of a fight, but no direct threat or indication of imminent danger to the author or others. Expresses general concern about increasing volatility.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 15:13:24"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's an attempt at a short, realistic post, focusing on seeking help and sounding authentic:\n\n\"Feeling really overwhelmed lately. Like I'm drowning. Reaching out because I don't know what else to do. Anyone know good resources for when things feel hopeless?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed, which could indicate a risk for self-harm or suicidal ideation. The user is actively seeking resources, suggesting an awareness of their distress, but the depth of despair warrants a medium severity assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 15:12:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to see if anyone else knows this feeling. Need to find a way back to the surface.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, potentially indicating a struggle with mental health. The metaphor of being underwater and needing to surface suggests a desire to escape a difficult situation. While not explicitly suicidal, the language indicates distress and a need for support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 15:11:21"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been feeling so isolated lately. Things at home are...rough. Walking on eggshells constantly. Is this normal? Just need to feel less alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of isolation and distress due to a difficult home environment, described as \"walking on eggshells.\" While it doesn't explicitly mention harm, the language suggests potential emotional abuse or a highly stressful situation, increasing the risk of negative coping mechanisms or escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 15:10:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Reached out to a friend, but it's still hard. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating a significant risk. While the individual has reached out to a friend, the urge persists, suggesting the coping mechanism is not fully effective. This puts them at immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 14:19:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm starting to realize the yelling and insults aren't normal in a relationship. Feeling lost and unsure what to do next. Anyone been through this? Need some advice.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Acknowledges abusive behavior (yelling, insults) in a relationship, indicating emotional distress and seeking advice. While not explicitly stating suicidal ideation or immediate harm, the feeling of being \"lost and unsure\" in an abusive situation warrants a medium risk assessment due to the potential for escalation or long-term psychological harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 14:18:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Things got dark again last night. Trying to find healthy coping mechanisms. It's a struggle. Anyone else been there? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions feeling overwhelmed, things getting 'dark,' and struggling to find healthy coping mechanisms. This suggests a potential for self-harm or suicidal ideation, although it's not explicitly stated. The user is reaching out for help, indicating some awareness and a desire to cope, but the mention of 'dark' feelings warrants a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 14:17:35"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed yesterday, almost relapsed. Reached out to a friend instead. Still struggling, but one day at a time, right? Anyone else feel this way sometimes?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a near relapse, which suggests a significant struggle and potential vulnerability. While the individual reached out for help, the risk remains present due to the ongoing struggle.",
    "detected_category": "other",
    "timestamp": "2026-01-16 14:16:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger than ever. Trying to stay strong, but it's exhausting. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges, potentially for self-harm or other negative coping mechanisms. While the individual is trying to stay strong, the exhaustion suggests they are struggling and at increased risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 14:15:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of intense distress and being overwhelmed ('incredibly lost,' 'underwater'). While not explicitly suicidal, the sense of desperation and reaching out for help suggests a potential risk that needs further assessment.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 14:14:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, controlling behavior... I feel so small. Anyone else been through this? Where do you even start getting help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and feelings of being controlled, which can escalate into more serious situations. The individual is seeking help, suggesting a potential desire to change the situation, but also indicating they feel trapped and diminished.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 14:13:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about the rise in ODs lately is scary. My friend nearly died last month. It's real. Please, if you're struggling or know someone who is, reach out. There's help out there. Don't be afraid.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text discusses a near-fatal overdose experienced by the author's friend, and mentions a general rise in overdoses, indicating a serious and current threat of overdose. It shows risk is not just hypothetical, but impacting individuals.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 14:12:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating potential emotional distress. The statement 'I don't know what else to do' suggests a lack of coping mechanisms and a need for support. While there is no explicit mention of self-harm or suicide, the overall tone and content warrant concern and further assessment.",
    "detected_category": "other",
    "timestamp": "2026-01-16 14:11:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, but shook me up bad. Please, learn how to use it. It could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates the presence of significant risk to others in the community (overdose). The individual is also expressing being shaken up, which could indicate potential for negative mental health impacts.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 14:10:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan worked, thank god. Makes you realize how fragile life is. If you're struggling, please reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with successful intervention, indicates potential exposure to harmful substances and the inherent risk of fatal outcomes. The mention of 'fragile life' suggests emotional distress and the potential for vicarious trauma.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 13:29:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my friend almost OD last night. Terrifying. Narcan saved his life. Learn the signs and carry it, please. It's real.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A friend experienced a near-fatal overdose, requiring Narcan intervention. This indicates a severe risk of harm and potential death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 13:28:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, walking on eggshells... I don't know what to do anymore. Feeling so lost. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential verbal abuse, creating a harmful environment. The user expresses feeling lost and hopeless, which suggests a need for support and intervention to prevent escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 13:27:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough patch lately. Feeling so drained and like nothing matters. Reaching out because I know I need to. If anyone has felt this way, how did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being drained, and indicates the individual is seeking help. While there is no explicit mention of self-harm or suicide, the overall sentiment suggests a moderate level of distress and potential risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 13:26:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want to feel *something* different. Scared I'll go too far one day. Anyone else feel this way? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to feel something different due to feeling overwhelmed and a fear of going too far. While not explicitly suicidal, it suggests potential self-harm risk and a need for help.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 13:25:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Scary stuff. Narcan saves lives. Learn how to use it, please. You could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a near-fatal event involving a friend who required Narcan, suggesting a significant risk of overdose and potential future occurrences.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 13:24:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been so angry lately, and I just... don't know what to do to make it stop. Is this normal? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of helplessness and fear in response to someone's anger, suggesting potential for escalating conflict or abuse. The uncertainty about the situation and the question of normality indicate a need for support and intervention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 13:23:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get too much, and I don't know how to cope. Just want to feel something other than numb. Talking to someone feels impossible rn. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses difficulty coping, numbness, and feeling overwhelmed, suggesting potential for self-harm or suicidal ideation. Lack of direct threat, but indicates significant distress.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 13:22:10"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel more on edge lately? Wish there was something we could do to make our streets safer.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Reports a fight, causing unease, but no direct threat or indication of active harm to self or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 13:21:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is back. It's scary. Reached out to a friend, hoping it helps. Anyone else relate? Need some strength right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a current urge to self-harm, indicating a high risk of potential harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 13:20:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. They're ok now, thank goodness. Makes you realize how easily things can go wrong. Look out for each other, folks. Naloxone saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event that indicates a risk of overdose in the community. While the individual survived, the potential for fatality is present and highlighted by the need for Naloxone.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 12:24:49"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing on the street, yelling escalated so fast. Made me so anxious. Happened to me once, still gives me shivers. Anyone else feel triggered by public fights?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes anxiety and being triggered by public arguments, but doesn't indicate imminent danger or harm. Past experience is mentioned, but current safety is not severely threatened.",
    "detected_category": "other",
    "timestamp": "2026-01-16 12:23:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Narcan worked, thank god. Learn the signs and carry it if you can. Could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential public health issue and the risk of repeated occurrences. While the individual survived, the situation highlights the accessibility of drugs and the potential for fatal outcomes. This also suggests the person writing this text might be exposed to risk of overdose.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 12:22:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just need to vent. Things escalated again last night. Feeling so lost and alone. Is this really my life now? Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, feelings of isolation, and a possible escalation of a negative situation. While not explicitly mentioning harm, the feeling of being \"lost and alone\" coupled with the question \"Is this really my life now?\" suggests potential hopelessness and requires further investigation to determine the nature and intensity of the situation. \"Things escalated again last night\" is vague but concerning.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 12:21:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Didn't want to, but I relapsed. Day 1 again. Reaching out for support this time. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse suggests potential for negative health outcomes. Expressing overwhelm and reaching out for support indicate distress and a possible need for immediate assistance.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 12:20:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and heavy, indicating emotional distress and a desire for support, but does not contain explicit mentions of self-harm, suicide, or harm to others. The person is reaching out, which suggests a willingness to seek help.",
    "detected_category": "other",
    "timestamp": "2026-01-16 12:19:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a glass wall. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of numbness and detachment, coupled with a plea for help, suggesting potential emotional distress and a lack of coping mechanisms.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 12:18:38"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend in the street. Froze. Called the cops after. Still shaking. Anyone else ever witness something like that? How do you even process it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the original poster is safe, the text describes a violent act (assault) occurring in public, indicating potential risk of harm to the victim and the possibility of escalating violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 12:17:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to stay strong and remember why I stopped. Reaching out to my therapist tomorrow. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential for relapse or self-harm, but the individual is actively seeking help from their therapist and trying to remember their reasons for stopping, which suggests protective factors are present.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 12:16:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm drowning. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost and drowning, indicating significant emotional distress and a cry for help. While not explicitly mentioning self-harm or suicide, the intensity of the feelings and seeking connection suggest a potential risk that needs to be monitored. The absence of specific plans or intent prevents it from being classified as high severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 12:15:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good lately. Walking on eggshells constantly. Anyone else ever feel completely drained by their relationship? Starting to think this isn't normal...\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a potentially unhealthy and draining relationship, possibly involving emotional abuse or a stressful environment ('walking on eggshells'). This could escalate into a more dangerous situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 11:18:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after a month clean. Disappointed but trying not to spiral. Reaching out to my therapist today. It's a process, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a vulnerability and increased risk, although the individual is actively seeking help and trying to manage the situation. The disappointment could escalate if not addressed.",
    "detected_category": "other",
    "timestamp": "2026-01-16 11:17:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Narcan worked, thank goodness. Please, learn the signs and carry it if you can. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, an overdose is a serious medical emergency with potentially fatal consequences. The message encourages preparedness, implying a risk of future incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 11:16:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. If you've been there, any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, suggesting potential distress and a need for support. While there's no explicit mention of self-harm or suicidal ideation, the phrase \"I don't know what else to do\" indicates a possible escalation of negative emotions.",
    "detected_category": "other",
    "timestamp": "2026-01-16 11:15:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved their life. Seriously, please learn how to use it. It's not hard and it can save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose event, which is a life-threatening situation requiring immediate intervention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 11:13:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my neighbor unresponsive. Narcan worked. Terrifying. Please, if you're struggling, reach out. There are people who care. Don't let it get to this point. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a neighbor found unresponsive and requiring Narcan, indicating a life-threatening overdose event that could have been fatal.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 11:12:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Trying to stay strong, but it's hard. Anyone else relate? Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges and feelings of isolation, which are risk factors for self-harm or suicide. While there is no explicit mention of intent or plan, the stated difficulty in staying strong warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 11:11:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got really bad last night, and I relapsed. I'm trying to stay safe now. Just needed to say it somewhere. Anyone else been there? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse and a desire to \"stay safe,\" suggesting potential risk, though the specific nature and immediacy are unclear. The feeling of loneliness also elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 11:10:55"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street, yelling & shoving. Made me remember things I try to forget. Anyone know resources for dealing with past trauma? Feeling really shaky.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes feeling \"shaky\" due to witnessing a fight, triggering past trauma. While concerning, it doesn't indicate immediate danger to self or others. The individual is actively seeking resources for dealing with trauma, which is a positive coping mechanism.",
    "detected_category": "other",
    "timestamp": "2026-01-16 11:09:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nUgh, having a really rough night. The urges are strong. Just trying to breathe and remember why I'm fighting this. Anyone else feel this way sometimes? Any tips that actually help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges, suggesting a potential for self-harm or relapse into unhealthy behaviors. While there's no explicit mention of self-harm, the intensity of the urges and the plea for help indicate a significant level of distress.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 11:08:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scary stuff. Narcan saved them, but it shook me up. Makes you realize how close it can be. Anyone know good resources for friends struggling?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, indicates a potential risk of future overdose events in the community and has a significant emotional impact on the observer. The request for resources also suggests concern for others potentially at risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 10:19:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need help. Talking to someone feels impossible right now. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a need for help, indicating potential risk. The reluctance to talk to someone directly increases the concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 10:18:14"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling shaken, but doesn't indicate direct involvement, intent to harm, or immediate threat. It expresses a general feeling of unease rather than a specific plan or danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 10:17:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just feeling so lost. Things at home have been... rough. Constant yelling, walking on eggshells. Anyone else ever feel like they're suffocating? Really need to talk to someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, suffocating, and needing to talk to someone, indicating emotional distress potentially stemming from a difficult home environment. While not explicitly mentioning self-harm or suicide, the intense feelings and cry for help warrant a medium severity rating.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 10:16:11"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a heavy cloud won't lift. Reaching out because I know I need to. If you've been there, what helped?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and a desire for help, but doesn't contain any explicit suicidal ideation or plans.",
    "detected_category": "other",
    "timestamp": "2026-01-16 10:15:09"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough. Constant yelling, put-downs. Feeling so small. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and feelings of worthlessness, which can escalate to more serious mental health issues if left unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 10:14:08"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing emotional distress but not indicating direct involvement, intent to harm, or immediate danger to the individual or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 10:13:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Reached out to a friend, feels a little better. Remember you're not alone if you're fighting this too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, implying a potential for self-harm or relapse. While the individual has reached out for help, the presence of urges necessitates a moderate level of concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 10:12:05"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just need to vent. Another fight, another broken plate. Walking on eggshells is exhausting. Is this normal? Feeling so lost and alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially volatile situation involving arguments and property damage (broken plate). While it doesn't explicitly mention physical violence directed at a person, the phrase \"walking on eggshells\" suggests a fear of triggering further conflict. The feelings of being \"lost and alone\" raise concern for the individual's mental wellbeing. Escalation of the conflict is possible.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 10:11:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit things aren't okay. He's always so sorry after, but the yelling... the put-downs... I'm starting to think this isn't normal. Anyone else been through this? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (yelling, put-downs) and expresses a feeling of being lost. While not explicitly stating physical harm or suicidal ideation, the described situation indicates potential for escalation and negative impacts on mental health, thus requiring attention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 10:10:02"
  }
]