[
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Walking on eggshells constantly. Anyone else feel like they're losing themselves? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and potentially emotionally harmful home environment. \"Walking on eggshells\" suggests fear and stress, and \"losing themselves\" points to potential mental health decline. The user is also actively seeking help, indicating awareness of a problem.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 05:19:09"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been...rough lately. Walking on eggshells constantly. Anyone else feel like they're losing themselves trying to keep the peace? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and stressful home environment, with phrases like 'walking on eggshells' suggesting potential emotional distress and a loss of self. While it doesn't explicitly state harm, the level of distress warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 05:18:07"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get jumped on my way home. Shook me up bad. Makes you realize how fragile things are. Anyone else feel like violence is getting worse lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault can be traumatizing and increase anxiety about personal safety. While the individual was not directly harmed, the incident caused distress and suggests a potential for future harm in the area.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 05:17:05"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain explicit statements about self-harm, suicide, violence, abuse, or overdose. It seeks connection and shared experience, suggesting a desire for support rather than immediate danger.",
    "detected_category": "other",
    "timestamp": "2025-12-12 05:16:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back and stronger. Reached out to a friend, feels a little better. Remember to be kind to yourselves, you're not alone. ❤️ Talking helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges' that are 'back and stronger,' indicating a potential escalation of distress. While the person reached out to a friend, the presence of these urges suggests an elevated risk compared to a situation with no urges.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 05:15:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after OD'ing. Scared and ashamed. Never thought it would happen to me. Anyone else been through this? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Recently overdosed and is experiencing feelings of fear and shame, indicating a vulnerable state and potential for future relapse. Seeking connection suggests a desire for help but also highlights the ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 05:14:00"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Talking helps, right? Where do I even start getting help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a desire for help. While it doesn't explicitly mention self-harm or suicide, the expression of feeling 'so low' and a 'dark cloud' suggests a level of distress that warrants concern and further assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 05:12:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is getting stronger. Reached out to a friend, hoping it helps. Just trying to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating immediate risk. The person is actively struggling and seeking help, suggesting they are aware of the danger but unable to fully control the impulse.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 05:11:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things are bad again. I feel so trapped. Does anyone know of resources for emotional abuse? I'm scared.\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Took me years to realize it WAS abuse. Constant criticism, isolating me from friends... I'm still healing. You're not alone.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Gaslighting is REAL. My ex made me question my own sanity. Educate yourselves, please. It's a form of control.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses fear and a sense of being trapped, indicating potential immediate distress related to emotional abuse. While not explicitly stating intent for self-harm or suicide, the vulnerability and fear warrant a medium severity rating.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 05:10:55"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my building. Shook me up. Seeing someone get hurt like that... feels too close to home. Is there anywhere to talk about this stuff anonymously? Need to process.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses distress and a need to process a witnessed violent event, but it doesn't indicate imminent danger to the individual or others. The user is seeking support, which is a positive sign.",
    "detected_category": "other",
    "timestamp": "2025-12-12 05:09:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Narcan saved him. Scary stuff. Please, if you're using, have someone with you, and have Narcan available. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan, indicating a high immediate risk to the individual involved and potentially to others.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 04:27:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my brother unresponsive. Narcan worked. Please, if you're using, carry it. It saved his life. I'm so shaken up. Where can I find support for families dealing with this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event requiring Narcan intervention, indicating a life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 04:26:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Felt so overwhelmed last night, relapsed after a few months clean. Feeling incredibly disappointed in myself. Reaching out for support again. It's a tough road.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of being clean indicates a potential struggle with addiction and vulnerability. While not explicitly suicidal or violent, the disappointment and need for support suggest a risk of escalation if support is not received.",
    "detected_category": "other",
    "timestamp": "2025-12-12 04:25:44"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend on Elm St. Froze. Someone else intervened, thankfully. Still shaking. Should I call the cops even though it's over? Feel sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing a violent assault indicates a serious safety risk. While the immediate physical threat may be mitigated by the intervention, the incident involved a violent crime (assault) and poses a potential risk of escalation or further violence from the perpetrator. The emotional distress reported by the witness also warrants concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 04:24:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so lost lately. Like I'm drowning and can't see the surface. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being overwhelmed and lost, using the metaphor of drowning. They are actively seeking help, which indicates some awareness and a desire to improve their situation. However, the intensity of the language suggests significant distress and potential for escalation if not addressed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-12 04:23:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary stuff. Narcan saved them, but it could've been worse. Makes you realize how fragile things are. Anyone know where to get trained on using Narcan? Seriously thinking about it now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports an overdose incident, indicating a potential risk to others in the community. While Narcan was successful, the situation highlights the presence of a life-threatening risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 04:22:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Everything feels pointless. Reaching out because I don't know what else to do. Is there anyone else who understands this feeling?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a lack of purpose, which are risk factors for suicidal ideation. The individual is reaching out for help, suggesting they are struggling to cope.",
    "detected_category": "suicide",
    "timestamp": "2025-12-12 04:21:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Remember we're not alone. 💚 Thinking of calling a helpline.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Strong urge to self-harm indicates a high risk of immediate danger to self.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 04:20:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The constant put-downs are chipping away at me. Anyone else feel like they're slowly disappearing? Need to find my way out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of distress, demoralization (\"chipping away at me\"), and a desire to escape (\"find my way out\"). The feeling of \"slowly disappearing\" suggests a loss of self and potential hopelessness. While there is no explicit mention of self-harm or suicide, the overall sentiment warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 04:19:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post focusing on seeking help:\n\n\"Feeling really overwhelmed lately.  Like, suffocating.  Talking to a friend helped a bit, but it's still there.  Remembering the lifeline is 988.  Gonna try calling tomorrow.  Just putting it out there.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post indicates feelings of being overwhelmed and suffocated, suggesting significant emotional distress. The mention of the lifeline (988) implies the person is considering seeking help for a serious issue, and while they are planning to call, the immediate situation warrants a medium severity level.",
    "detected_category": "suicide",
    "timestamp": "2025-12-12 04:18:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scared. Found my brother unresponsive. Narcan worked, he's breathing. This is the second time. Where do I even begin to get him help? I'm losing it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Brother has overdosed twice, requiring Narcan. Indicates a high risk of future, potentially fatal, overdose. Reporter expresses significant distress and feelings of being overwhelmed.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 03:45:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD. It's scary. Lost a friend last year and still feels like yesterday. If you're struggling, please reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a recent overdose and the loss of a friend, indicating potential distress and increased risk, although it also encourages seeking help.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 03:44:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but it shook me. Knowing how close things can be... Where can I learn more about overdose prevention?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing an overdose, which is a potentially traumatic event, but there is no indication of immediate danger to the author or anyone else. The overdose was reversed with Narcan.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 03:43:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I feel so lost. He says he loves me but then yells & controls everything. Is this normal? I don't even know anymore. Help.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential controlling/abusive behavior, raising concerns for psychological well-being and potential escalation. While not explicitly stating immediate physical danger, the situation warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 03:42:42"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Still reeling from last night. Said things he didn't mean, again. Starting to feel like 'again' is the problem. Anyone else been through this? How did you find the strength to leave?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a pattern of hurtful behavior from a partner and expresses a desire to leave, implying an emotionally abusive or unhealthy relationship. The phrase \"Starting to feel like 'again' is the problem\" and \"How did you find the strength to leave?\" suggest the user is in distress and considering a significant life change to improve their situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 03:41:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside my building. Shook me up. Called the cops, hope she's okay. Makes you realize this stuff is everywhere. Is there anything else I could have done?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Observed violence/abuse; potential for escalation or further harm to the victim. Police intervention initiated.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 03:40:39"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get too much. Hurt myself again last night. Feeling so ashamed and lost. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions self-harm. The individual expresses feelings of shame, loss, and difficulty coping, indicating a high level of distress and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 03:39:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him. We need more access and less stigma. Learn the signs, people. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose and the implicit call to action (learn the signs) suggest potential for repeated exposure and/or impact on the reader's mental health. While Narcan was available, the event itself is a significant safety risk requiring potential intervention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 03:38:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after OD'ing. Scared and ashamed. This is NOT the life I want. Anyone know resources for getting clean in [City/Area]? Please, no judgement.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Recent overdose indicates a significant and immediate risk of repeated overdose, especially considering the individual expresses fear and shame, which are known triggers. The request for help indicates a desire to change, but the potential for relapse is extremely high without immediate intervention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 03:37:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need help. Talking feels impossible, but I'm trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of depression and a need for help. While there's no explicit mention of self-harm or suicide, the feeling of a persistent \"dark cloud\" and the difficulty expressing themselves suggest a level of distress that requires attention and support. The user acknowledging the need for help is a positive sign, but the combination of factors warrants a 'medium' severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 03:36:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in our town. This hits too close to home. If you're struggling, please reach out. There are people who care and want to help you get better. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a recent overdose and encourages people struggling with addiction to seek help. While it doesn't explicitly state suicidal ideation, overdose is a significant risk to life, implying a potential for self-harm or fatal consequences related to substance abuse.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 02:52:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen having a really rough time lately. Urges are strong. Trying to stay safe and remember why I stopped. Anyone else relate? Just feeling really alone rn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and a feeling of loneliness, suggesting a potential risk of relapse into harmful behavior. While not explicitly stating suicidal intent, the combination warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 02:51:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got overwhelming, and I relapsed. I'm safe now, but feeling so ashamed. Reaching out for help again. It's a long road.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse indicates a potential vulnerability and the possibility of future crisis. While the individual states they are safe *now*, the feeling of shame and the acknowledged 'long road' suggest ongoing risk. Needs support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 02:50:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things are bad at home again. Walking on eggshells constantly. Don't know what to do anymore. Anyone else been through this?\"\n\n**Option 2 (Personal Story):**\n\n> \"Finally left. It's terrifying & exhilarating all at once. Years of being told I was worthless...trying to unlearn it all now.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Emotional abuse is real abuse. Just because there are no bruises doesn't mean it doesn't hurt. Don't let anyone minimize your pain.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The texts indicate potential emotional distress and past abuse. While there are no explicit mentions of self-harm or suicidal ideation, the user's vulnerability and need for support suggest a medium level of concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 02:49:29"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy, and I don't know where to turn. Just need to find a little light.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and heavy, but doesn't contain specific threats or plans of self-harm or harm to others. It expresses a desire for help ('need to find a little light').",
    "detected_category": "other",
    "timestamp": "2025-12-12 02:48:27"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train. Everyone just stared. Makes me sick. Is this normal now? Feeling really unsafe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical altercation (shoving) occurred, indicating a potential for escalation or further violence. The observer expresses feeling unsafe, suggesting a perceived threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 02:47:25"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown yesterday. Scary stuff. Made me realize how quickly things can escalate. Anyone else feel like aggression is just...everywhere lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, expressing concern about general aggression. While unsettling, it doesn't indicate imminent danger to the speaker or others, nor does it suggest intent to harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 02:46:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "My cousin almost didn't make it last night. OD. Scariest night of my life. Please, if you're struggling, reach out. There are people who care. Don't let it get this far.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose (OD) incident involving the author's cousin, indicating a life-threatening situation. While the cousin survived, the near-fatal event signals a high level of risk associated with substance abuse and potential self-harm or mental health crisis.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 02:45:22"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. I froze. Wish I'd said something, anything. Feeling sick about it now. Anyone else ever experience this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence can be distressing and cause emotional distress, but the text doesn't indicate imminent danger to anyone. The reporter expresses regret at inaction, suggesting a sense of unease and possible concern for the victim's well-being. However, the event is in the past.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 02:44:20"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on the street today. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel this way sometimes?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be upsetting, but the text doesn't indicate direct involvement, intent to harm, or imminent danger to the author or others. It expresses a general feeling of unease.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 02:43:19"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing outside my building, got physical fast. Shaken up. Called the cops, hope she's okay. Makes you realize how close it is. Anyone else ever witness something like that? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence was witnessed, and the safety of an individual is potentially at risk. Police were called, indicating a serious concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 01:46:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but does not contain explicit mentions of self-harm, suicide, or violence. It's a general expression of emotional distress and a plea for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-12 01:45:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Terrifying. Narcan worked, thank god. Really shook me up. Folks, please look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was effective and the individual survived, the event of an overdose indicates a significant risk of fatality or serious harm. Witnessing this can also cause considerable emotional distress.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 01:44:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Constant yelling, walking on eggshells... feels like I'm losing myself. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult and potentially emotionally damaging home environment. While there's no explicit mention of immediate danger, the feelings of losing oneself and constant stress could escalate to more serious mental health issues.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 01:43:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant yelling, put-downs... feels like I'm walking on eggshells. Anyone else been through this? How do you even start to get out?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with emotional abuse (yelling, put-downs) which can significantly impact mental health and potentially escalate. While not explicitly stating physical abuse or immediate danger, the \"walking on eggshells\" feeling indicates a chronically stressful and potentially volatile situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 01:42:37"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside the diner. I froze. Wish I'd done something, anything. Feeling sick about it now. Anyone else ever experience this? How do you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Direct observation of violence/abuse indicates immediate risk to the victim. The description implies a potentially dangerous situation involving physical assault.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 01:41:35"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight break out on my street last night. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling and cause anxiety, but the text doesn't indicate immediate danger or direct involvement of the author. It expresses a general feeling of unease, not a specific threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 01:40:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt that familiar urge again tonight. Managed to distract myself with a movie, but it's exhausting. Just putting it out there. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a recurring urge that the author finds exhausting to manage. While they've successfully distracted themselves this time, the persistence of the urge suggests a potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 01:39:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. Every day is walking on eggshells. Is this normal in a relationship? I feel so alone and scared. Need to talk to someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of fear, isolation, and walking on eggshells, suggesting potential emotional abuse or an unsafe relationship dynamic. The individual states a need to talk to someone, indicating they are struggling to cope.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 01:38:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it was way too close. Please, if you're using, carry Narcan. It could save a life. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event that nearly resulted in death, indicating a high level of risk and potential for future occurrences.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 01:37:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw my neighbor being taken away in an ambulance. Think it was an OD. This stuff is scary. Please, if you're struggling, reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Neighbor's overdose suggests potential presence of dangerous substances and related risks (e.g., accidental ingestion by others, heightened risk of similar incidents). While the text is reactive, it highlights an ongoing situation with potential for further harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 00:46:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need to. If you've been there, what helped?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a lack of purpose, which are risk factors for self-harm or suicidal ideation. The individual is reaching out for help, suggesting they are aware of their distress but may be struggling to cope. While no specific plan is mentioned, the expression of such intense negative emotions warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-12 00:44:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw on the news about the ODs spiking again. Scared. My brother almost died last year. Please, if you're struggling, reach out. There are people who care. You're worth saving.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a spike in overdoses and a past near-fatal overdose of the author's brother, indicating a potential ongoing risk related to substance use. The author also expresses fear, suggesting emotional distress related to this risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 00:43:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so lost lately. It's hard to explain, but everything feels heavy. Reaching out because I know I need to talk to someone. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and heavy, and a desire to talk. While concerning, there is no direct indication of immediate danger or specific plans for self-harm or harm to others.",
    "detected_category": "other",
    "timestamp": "2025-12-12 00:42:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Ugh, another wave. Feels like I'm drowning. Reached out to the lifeline, just need to keep breathing. It's so hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of drowning and difficulty breathing, suggesting potential distress and struggle to stay afloat (metaphorically or literally). Reaching out to a lifeline indicates awareness and a desire for help, but the overall tone suggests significant distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-12 00:41:54"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Scared. My neighbor's yelling again, sounds like it's getting physical. Called the cops last time but they were gone before they arrived. I don't know what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Potential for escalation of violence and risk of harm to the neighbor(s). While the police were called previously, the issue persists and is potentially escalating.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 00:40:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw another ambulance downtown. Makes me sick. Lost a friend last year to an OD. Please, if you're struggling, reach out. There's help. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a past overdose death and expresses concern about others struggling with addiction, suggesting a potential for future overdoses. While not explicitly stating an imminent threat, the vulnerability of the target group implies a medium risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 00:39:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Walking on eggshells constantly. Is this normal? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home environment characterized by tension (\"walking on eggshells\") and feelings of isolation, which can be indicative of a potentially harmful situation like emotional abuse or escalating conflict.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 00:38:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of distress and isolation but doesn't explicitly mention self-harm, suicidal ideation, or intent to harm others. It's a general expression of emotional distress.",
    "detected_category": "other",
    "timestamp": "2025-12-12 00:37:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my friend OD last night. Scariest thing ever. Narcan saved him. Learn CPR and where to get Narcan, please. You never know when you might need it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event that nearly resulted in death. While the friend survived, the situation highlights the extreme danger of overdose and the potential for fatality.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 00:36:47"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get shoved on the train today. My heart's still racing. Makes you realize how quickly things can escalate. Anyone else ever witness something like that? Feeling kinda shaken.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence can be upsetting, but there's no indication of direct threat to the author or imminent danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 23:17:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing down the street, escalated so fast. Heard a slap. Called the cops. Shaken. Is there anything else I should have done? Feeling sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Report indicates a possible instance of violence (a slap was heard), suggesting immediate danger to at least one individual. The witness is also expressing emotional distress which suggests potential for secondary trauma.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 23:16:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Everything feels pointless. Reaching out before things get worse. Talking to someone tomorrow. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and a desire to reach out \"before things get worse,\" suggesting potential for escalation without intervention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-11 23:15:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad lately. Constant yelling, walking on eggshells... I feel so small. Anyone else gone through this? Feeling really lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with yelling and feeling 'small,' indicating potential emotional abuse and distress. The user expressing feeling 'lost' suggests a lack of coping mechanisms and support.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 23:14:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, but still struggling. Anyone else get this? How do you cope? #mentalhealth #selfharm #coping",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 23:13:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad lately. Walking on eggshells constantly. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a difficult and potentially volatile home environment, characterized by constant tension ('walking on eggshells'). This could indicate emotional abuse or a situation escalating towards physical harm. The feeling of isolation is also a concerning factor.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 23:12:45"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight break out on the bus today. Shook me up. Made me realize how easily things can escalate. Anyone else ever feel completely helpless in those situations?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight on a bus can be upsetting and highlight potential safety concerns, but the text doesn't indicate imminent danger to the author or others. The author expresses feeling shaken up and helpless, suggesting emotional distress but not a direct threat or harmful intent.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 23:11:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, thank goodness. Makes you think... check on your friends, people. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be traumatizing and indicates a potential ongoing risk of overdose in the community. While Narcan was effective in this instance, it highlights the severity of the situation. The mention of checking on friends suggests a broader concern for the well-being of the user's social circle.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 23:10:41"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. The urge to self-harm is so strong tonight. Trying to resist but it's exhausting. Anyone else feel this way sometimes? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 23:09:39"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so overwhelmed lately. Urges are strong. Anyone know good coping mechanisms that actually work? Feeling lost.\n\n**Option 2 (Personal Story):**\n\n> 2 weeks clean. Small victory, but it feels huge. Still a long way to go.\n\n**Option 3 (Raising Awareness):**\n\n> It's not attention-seeking, it's a sign someone's hurting. Please be kind to those struggling.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates strong urges and feeling lost, suggesting potential escalation. While not explicitly stating self-harm or suicide, the intensity of the feelings warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 23:08:38"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you wonder what people are going through to act like that. Hope everyone involved is okay. Scared me.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text reports witnessing a fight, indicating potential violence, but doesn't suggest ongoing danger to the author or others. It expresses concern and fear, but no direct threat or escalation is implied.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 22:17:51"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on my street last night. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate immediate danger to the author or others. The feeling of being 'on edge' suggests anxiety, but without further context, it doesn't rise to a higher severity level.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 22:16:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but lacks specific suicidal ideation, plans, or intent. It's a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-11 22:15:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Still feeling shaken after what happened last night. He didn't hit me, but the yelling... it was terrifying. Is that still abuse? Starting to question everything.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While there was no physical violence, the text describes emotional distress and fear due to yelling, raising concerns about emotional abuse and potential escalation. The questioning of the experience suggests the individual is struggling to process the events and could benefit from support.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 22:14:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> Things have been bad at home lately. Walking on eggshells constantly. Anyone know of resources for verbal abuse? Feeling so lost.\n\n**Option 2 (Sharing Experience):**\n\n> I finally left. Years of being put down, controlled...it's over. Healing is hard, but I'm free.\n\n**Option 3 (Raising Awareness):**\n\n> Emotional abuse leaves no bruises, but the scars are real. Check in on your loved ones. You never know what someone's hiding.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While there's no immediate threat of harm described, the texts indicate a history of abuse and emotional distress, suggesting potential for escalation or long-term negative consequences. 'Walking on eggshells' and 'years of being put down' point to a potentially unsafe environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 22:13:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIPs lately. Lost a friend to overdose. Please, if you're struggling, reach out. There are people who care and want to help. You're not alone. 💔",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and acknowledges loss due to overdose, and encourages seeking help, which suggests awareness of suicidal thoughts or intent to self-harm. The overdose event implies access and availability of potentially dangerous substances.",
    "detected_category": "suicide",
    "timestamp": "2025-12-11 22:12:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit suicidal or self-harm ideation. It is a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-11 22:11:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but it doesn't explicitly mention self-harm, suicide, or harm to others. While concerning, it primarily conveys a general sense of distress and a desire for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-11 22:10:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad. Constant yelling, put-downs... I feel so small. Anyone else gone through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and a feeling of being 'small,' indicating potential for escalation. While there's no explicit mention of self-harm, suicide, or violence, the negative environment and expression of helplessness warrant concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 22:09:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Trying to remember my coping skills, but it's hard. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges and difficulty coping, suggesting increased vulnerability. The mention of struggling and needing to know they aren't alone points to a potential need for support and monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 22:08:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Felt sick. Wish I'd said something, but I froze. Anyone else ever feel that way? How do you react in the moment?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent act (shoving) is concerning. While it's a one-time observation, the potential for escalation and harm to the individual shoved exists. The poster's distress suggests the event had a significant impact.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 21:18:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The yelling is constant, and now... other things. I feel so trapped. Anyone else been through this? How do you even start to get out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 52 (char 75)",
    "detected_category": "unknown",
    "timestamp": "2025-12-11 21:17:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, but it shook me up. Makes you realize how fragile life is. Stay safe out there, everyone. Look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event that indicates the presence of significant health and safety risks in the environment (downtown). The text mentions a life-threatening situation (OD) and the use of Narcan, highlighting the immediate danger and potential for fatalities. While the individual was saved, the event underscores the seriousness of the situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 21:16:52"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight outside the bar last night. Dude got knocked out cold. Scared me. Makes you think, you know? Anyone else feel like things are getting more volatile lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A violent altercation resulting in someone being knocked unconscious was witnessed, indicating a potential threat of violence to the general public.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 21:15:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. OD'd. Scariest thing ever. Please, if you're struggling, reach out. There's help out there. Don't let it get this far.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose, indicating a high risk of death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 21:14:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend, hoping it helps. It's hard to keep going sometimes.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and difficulty continuing, suggesting potential for self-harm or suicidal ideation, though not explicitly stated.",
    "detected_category": "suicide",
    "timestamp": "2025-12-11 21:13:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Finally left. Packing was hell, felt like walking on eggshells the whole time. Scared but also…lighter? Anyone else been through this? How do you start over?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates a stressful situation involving packing and leaving a place while feeling scared. The phrase 'walking on eggshells' suggests a potentially abusive or highly volatile environment, which is now being left behind. While there's a sense of relief, there's also fear and uncertainty about starting over. The risk of immediate harm is low, but the individual may be vulnerable due to the recent stress and the unknown nature of their new circumstances.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 21:12:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after 6 months clean. Disappointed but trying to be kind to myself. Reaching out for support today. It's a day-by-day thing, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of recovery can be a trigger for more severe actions. While the individual is expressing self-compassion and seeking support, the risk of further relapse and potential negative consequences associated with it is present.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 21:11:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after 6 months clean. Disappointed but trying to be kind to myself. Reaching out to my therapist today. It's a process, not a straight line. #recovery\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential vulnerability and increased risk, requiring immediate support. While the individual expresses self-compassion and intends to contact their therapist, the relapse itself warrants a medium risk assessment.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 21:10:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and it's exhausting fighting them. Reached out to a friend, hoping it helps. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which are exhausting to fight. The individual is actively trying to cope by reaching out to a friend, but the statement \"Just need to get through tonight\" suggests a significant level of distress and potential for harm in the immediate future.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 21:09:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so lost lately. Everything feels heavy, and I'm not sure how to cope. Reaching out because I need to remember I'm not alone in this. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain any direct threats of self-harm or suicide. It indicates a desire for support and advice.",
    "detected_category": "other",
    "timestamp": "2025-12-11 20:19:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "i messed up. things got bad again & i relapsed. feeling so ashamed. reaching out to my therapist tomorrow. just needed to say it somewhere.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse, which can be associated with increased risk. The individual expresses shame and is reaching out for help, suggesting awareness of the issue and a desire for support, but the relapse itself warrants a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 20:18:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk. While the person reached out to a friend, the presence of a strong urge necessitates a high-severity classification.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 20:17:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head, it feels like the only way to quiet them is to hurt. I know it's not right, but it's hard to stop. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a clear ideation of self-harm as a coping mechanism, indicating a significant risk to the individual's safety and well-being.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 20:16:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up yesterday. OD'd. Scariest thing ever. Please, if you're using, have someone with you. It's not worth the risk. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose, indicating a high risk of death or serious harm. The user expresses intense fear and shock, highlighting the severity of the situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 20:15:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...not good. Walking on eggshells all the time. Anyone else ever feel this way? Need to talk but scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially unsafe home environment. The phrases \"walking on eggshells\" and \"scared\" suggest emotional distress and possible abuse or a volatile situation. While not explicitly stating violence, self-harm, or suicidal ideation, the level of fear and distress warrants concern and further investigation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 20:14:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so heavy, I feel like I need to feel *something* else, y'know? It's not a solution, I know. Anyone else ever feel this way? Trying to find better ways to cope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a desire to feel *something* else, which could indicate emotional distress and potential for unhealthy coping mechanisms. The acknowledgment that it's \"not a solution\" suggests awareness but also a vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 20:13:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Constant put-downs, isolating me from friends... I feel trapped. Anyone else been through this? How did you find the strength to leave? I'm scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse and a feeling of being trapped, suggesting potential for escalation. The fear expressed raises concerns about immediate safety and ability to cope.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 20:12:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Things got dark last night, but I reached out to a friend. Talking helped. If you're struggling, please don't be afraid to ask for support. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions feeling overwhelmed and things getting 'dark,' suggesting a possible mental health crisis. However, the individual reached out for support, indicating a protective factor. The inclusion of a message encouraging others to seek help is also present.",
    "detected_category": "suicide",
    "timestamp": "2025-12-11 20:11:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Narcan saved him, but it shook me up. Reminded me we gotta look out for each other. Know the signs, carry Narcan if you can. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, is a distressing event with potential psychological impact on the witness. The event also highlights the presence of a serious health risk in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 20:10:34"
  }
]