[
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, but still feels like too much. Any advice on coping in the moment?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm and feelings of being overwhelmed, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-05 03:05:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Relapsed after a few months clean. Just need to remember it's a setback, not a failure. Reach out, don't isolate.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of being clean indicates a struggle with addiction and potential for further relapses, possibly leading to overdose or other health complications. The statement \"Reach out, don't isolate\" suggests an awareness of the risk and a desire for support, but the relapse itself elevates the risk level.",
    "detected_category": "overdose",
    "timestamp": "2026-01-05 03:04:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Narcan saved them. Carry it, learn how to use it. Could save a life. #ODawareness #Narcan #Help",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports an overdose event which is a serious medical emergency and suggests preparedness to respond to similar events. While not an immediate threat, the event's severity and call to action indicate a medium level of risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-05 03:03:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urges are back. Trying to stay strong and remember why I stopped. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a relapse or increased vulnerability. While the individual is trying to stay strong, the presence of urges warrants concern and a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-05 03:02:25"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard yelling next door again last night, sounded like things being thrown. Called the cops before, but I don't know what else to do. Anyone else deal with this? Feeling helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potentially violent behavior next door, including sounds of things being thrown and past police involvement. While the author is not directly threatened, the escalating situation and feelings of helplessness suggest a potential for harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-05 03:01:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. Scared, y'know? Lost my cousin last year. If you're struggling, please reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and grief related to overdose deaths, including a personal loss. While it encourages seeking help, the mention of overdose and loss elevates the severity.",
    "detected_category": "overdose",
    "timestamp": "2026-01-05 03:00:22"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Rough day. Urges are strong. Trying to distract myself with a movie, but it's hard. Anyone else get this way? Just feeling really alone right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and feelings of isolation, which are concerning and could escalate without support.",
    "detected_category": "suicide",
    "timestamp": "2026-01-05 02:59:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm so tired. My partner yelled at me for burning dinner & then said I was worthless. Is this normal? Feeling lost & scared.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, verbal abuse, and feelings of worthlessness, suggesting a potential risk to the individual's well-being. The feelings of being lost and scared further elevate the concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-05 02:58:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a memorial for someone lost to overdose. Hits hard. Addiction is a beast. If you're struggling, please reach out. There's help, you're not alone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text mentions an overdose death, which is a severe consequence, but the text itself is primarily focused on offering support and encouraging help-seeking behavior for addiction. It doesn't indicate immediate risk to the person posting or others.",
    "detected_category": "overdose",
    "timestamp": "2026-01-05 02:57:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Been feeling so overwhelmed lately. The urge to self-harm is strong. Talking to my therapist tomorrow, but tonight is rough. Anyone else relate? Just trying to not feel so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating active ideation, but the individual is also seeking help (therapist appointment). This suggests a willingness to engage in protective factors, but the immediate risk is elevated due to the intensity of the urge.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-05 02:56:17"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been...rough. Walking on eggshells constantly. Is this normal? Feeling really isolated. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult home environment and feelings of isolation, potentially pointing to abuse or domestic issues. The phrase 'walking on eggshells' is a strong indicator of a tense and potentially volatile situation, increasing the risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-05 01:48:34"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside the bakery. Froze. Should I have done something? Feel sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Observed act of violence against another person (domestic abuse), indicating immediate physical harm and potential escalation. The witness is also experiencing distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-05 01:47:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is strong. Trying to resist, but it's exhausting. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Expresses a strong urge to self-harm and acknowledges difficulty resisting the urge, indicating a high risk of acting on these thoughts.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-05 01:46:31"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Makes you realize how quickly things can escalate. Anyone else feel like anger is just simmering everywhere lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, indicating a potential for violence, but doesn't suggest imminent danger to the author or others, nor does it indicate the author's involvement or intent to harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-05 01:45:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get too much & I feel like hurting myself. It's a really bad coping mechanism, I know. Talking to a friend helped a bit today. Anyone else feel this way? How do you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses suicidal ideation (feeling like hurting oneself), which indicates a risk. However, the individual acknowledges it's a bad coping mechanism and that talking to a friend helped, suggesting some protective factors and awareness.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-05 01:44:28"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Froze. Should I have done something? Feeling sick about it now. Wish I knew what to do in those situations.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Observed violence in public. While the observer wasn't directly involved or threatened, the potential for escalation and the observer's distress warrant a medium severity.",
    "detected_category": "violence",
    "timestamp": "2026-01-05 01:43:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but shook me up. Knowing where to get it and how to use it is so important. Please learn. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the person survived, indicates a significant potential for fatal outcome and highlights the risk associated with drug use. The event caused distress to the witness.",
    "detected_category": "overdose",
    "timestamp": "2026-01-05 01:42:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so numb lately. Scratched again last night. It's like the only thing that makes me feel *something*. Trying to find healthier ways to cope, but it's hard. Anyone else relate? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes self-harm (scratching) as a coping mechanism, indicating emotional distress and potential escalation. The user is seeking healthier coping strategies, suggesting some awareness and desire for change, but the ongoing self-harm raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-05 01:41:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Constant put-downs, walking on eggshells... Anyone else experience this? Feeling so alone. #abuseawareness",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse, creating a potentially harmful environment. While not explicitly stating immediate physical danger, the 'walking on eggshells' and 'constant put-downs' suggest a pattern of control and potential escalation. The feeling of isolation exacerbates the risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-05 01:40:22"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight break out at the park today. Shook me up pretty bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling and evokes feelings of unease. While concerning, it doesn't explicitly indicate imminent danger to the person writing or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-05 01:39:21"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just realized controlling behavior isn't love. It's been subtle, but now I see it. Feeling lost & scared. Anyone else been through this? Where do I even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, fear, and a realization of controlling behavior, which suggests potential ongoing or past abuse. While not explicitly stating immediate harm, the feelings of being lost and scared raise concern for the individual's well-being and potential for escalation if not addressed.",
    "detected_category": "abuse",
    "timestamp": "2026-01-05 00:50:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm drowning and no one sees it. Reaching out for help feels impossible, but I know I need to. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed, along with a stated need for help. While not explicitly suicidal, the 'drowning' metaphor and feeling 'lost' indicate significant distress and potential for escalation if support is not received.",
    "detected_category": "suicide",
    "timestamp": "2026-01-05 00:49:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Lost a friend last night. OD. Hurts so bad. Please, if you're struggling, reach out. Someone cares. I wish he had.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Implies a recent overdose death of a friend, suggesting potential for vicarious trauma or increased risk of similar behavior in others or the poster.",
    "detected_category": "overdose",
    "timestamp": "2026-01-05 00:48:09"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got decked. Shook me up. Makes you wonder, what sets people off like that? Anyone else feel like things are getting more volatile lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessed violence but no immediate threat to the user or others is indicated. The user expresses concern and unease but doesn't suggest involvement or further danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-05 00:47:07"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shaken up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Describes a violent event with potential for serious injury. While not directly threatening, it indicates a potential risk of violence in the area and resulting harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-05 00:46:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Day 3 clean, taking it one hour at a time. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates active urges for self-harm (cutting), suggesting a potential risk of acting on those urges despite being clean for 3 days. The individual is seeking support, which indicates awareness and a desire to cope, but the presence of strong urges elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-05 00:45:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Please, if you're using, carry it. Could save a life. & consider getting help. I am too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessed overdose event indicates a serious and immediate risk to individuals using substances, despite successful Narcan administration. The text also suggests the person writing it is considering seeking help, which could indicate a personal struggle with substance use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-05 00:44:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown yesterday. Scary stuff. It can happen to anyone. Please look out for each other, and know where to get help if you or someone you know needs it. Naloxone saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Observed overdose indicates potential for further overdose incidents and the text highlights the serious and potentially fatal consequences. The urgency to seek help and awareness of naloxone implies a recognized risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-05 00:43:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you wonder what's going on in people's lives that leads to that. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling and induce anxiety, but the text does not suggest imminent harm to self or others. The user is expressing feeling shaken and on edge, but it lacks specific threats or intentions.",
    "detected_category": "violence",
    "timestamp": "2026-01-05 00:41:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so incredibly low lately. Like I'm underwater. Reaching out to a friend, but it's hard. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and isolation, but does not contain explicit mentions of self-harm, suicide plans, or intent to harm others. The person is reaching out for help, which is a positive sign.",
    "detected_category": "other",
    "timestamp": "2026-01-05 00:40:58"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to a friend helped a little, but the weight is still there. Just trying to make it through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed ('underwater'), and a significant burden ('weight'). While there's no explicit mention of self-harm or suicide, the described emotional state suggests a potential risk that warrants monitoring and further assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 23:17:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home haven't been good. Walking on eggshells constantly. Is this normal? Feeling lost and alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially volatile home environment ('walking on eggshells') and expresses feelings of isolation and distress, suggesting a risk for negative mental health outcomes. While not explicitly mentioning harm, the situation described warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 23:16:32"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get punched outside the bar last night. Shook me up. Is there anywhere to learn self-defense around here that's actually good?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence is unsettling and prompts a desire for self-defense, but there is no indication of immediate danger or direct threat to the individual or others. The incident already occurred.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 23:15:30"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel more on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused the person to feel shaken and on edge. While concerning, it doesn't indicate imminent danger or direct involvement of the person in a dangerous situation. The feeling of being 'on edge' is a general anxiety response to the event.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 23:14:29"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back, and I hate feeling this way. Reached out to a friend, gonna try to get through this. It's so hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The return of urges suggests a potential risk of self-harm or relapse. While the person has reached out for help, the difficulty expressed indicates a need for continued support and monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 23:13:28"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up. Never seen anything like that before. Makes you realize how fragile things are.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused distress but doesn't indicate direct involvement, intent to harm self or others, or immediate danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 23:12:26"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling unsettled, but doesn't indicate direct involvement, intent to harm, or being in imminent danger. It mainly expresses anxiety and awareness of potential violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 23:11:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just wanted to say if you're struggling too, you're not alone. Talking to someone helped me see a tiny bit of light. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and struggling, but also indicates that talking to someone helped and that there are people who care. While concerning, it does not contain explicit suicidal ideation or intent.",
    "detected_category": "other",
    "timestamp": "2026-01-04 23:10:23"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been so angry lately, and I don't know what I'm doing wrong. Just need to vent somewhere I guess. Anyone else feel this lost?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being targeted by anger, potential emotional abuse, and a sense of being lost and needing to vent. While there's no explicit mention of physical violence or self-harm, the escalation of anger in another person towards the author and the author's expressed distress warrants a medium severity level.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 23:09:22"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his dog in the park. Shaken up. Reported it, but feeling helpless. Anyone know what else I can do? It was a black lab, near the fountain.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the text describes animal abuse which is concerning, it doesn't directly indicate immediate or severe risk to human safety. The witness is shaken but has reported the incident.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 23:08:20"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Thank god for Narcan. Learn how to use it, seriously. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potential risk for others in the vicinity and highlights the presence of a serious health crisis. While the person survived due to Narcan, the situation indicates ongoing drug use and the potential for future, possibly fatal, overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 22:17:32"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on my street last night. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel like things are getting more tense lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning, but doesn't indicate immediate danger to the author or others. It expresses unease and a feeling of increasing tension.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 22:16:30"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Dude got clocked hard. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence can be distressing, but there's no indication of immediate danger to the author or others, nor any indication of intent to harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 22:15:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Scared. Found my brother unresponsive last night. Narcan saved him. Please, if you're struggling, reach out. Don't let it get that far. I almost lost him.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a significant and immediate risk to life.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 22:14:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing a friend OD last night was terrifying. Narcan saved them. Learn the signs, please. It could save someone you love. I'm still shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a traumatic event and indicates a high risk situation due to potential for bystander trauma, the immediacy of a life-threatening event, and the mention of Narcan implying opioid involvement. The 'still shaken up' suggests ongoing distress.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 22:13:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw my neighbor being taken away in an ambulance. Overdose suspected. Scared me senseless. Please, if you're struggling, reach out. Don't become a statistic. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a suspected overdose incident, indicating a severe and potentially life-threatening situation requiring immediate medical intervention. It also highlights the broader risk of overdose in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 22:12:25"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scariest thing ever. They're okay now, thankfully. Please, if you're using, have someone with you. It can happen to anyone. Resources are out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose indicates a significant risk of harm, and the mention of 'OD' and 'using' suggests ongoing substance use which can lead to further overdose events. The friend is 'okay now' but that does not negate the inherent risks of future use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 22:11:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are strong. Reached out to a friend, feels a little better. Remember it's okay to ask for help. 988 is there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges, which suggests an elevated risk. The mention of 988 and reaching out to a friend shows awareness and coping mechanisms, but the presence of strong urges keeps the severity at medium.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 22:10:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but it lacks specific details about suicidal ideation, self-harm, or intent to harm others. It appears to be a general expression of distress and a call for connection with others who might be experiencing similar feelings.",
    "detected_category": "other",
    "timestamp": "2026-01-04 22:09:20"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scared. Found my roommate unresponsive this morning. Narcan worked, but it was close. Learn the signs of overdose. Please. It can save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Roommate experienced a near-fatal overdose requiring Narcan, indicating a significant risk to life.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 22:08:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It helps. If you're struggling too, you're not alone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential escalation of distress. While the person reached out for support, the presence of urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 21:17:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Walking on eggshells constantly. I'm starting to feel like I'm losing myself. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a stressful and potentially abusive home environment where the individual feels they are losing themselves. While there is no explicit mention of violence, self-harm, or suicide, the 'walking on eggshells' and 'losing myself' phrases indicate a significant negative impact on mental health and emotional well-being, suggesting potential for escalation. The lack of direct threat places it below 'high' severity.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 21:15:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the gas station today. Scary stuff. Narcan worked, thank God. Makes you realize how fragile life is & how many are struggling. Reach out if you need help, please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event indicates a potential risk of overdose in the community, even though the individual survived. The fragility of life is highlighted, indicating the potential for life-threatening situations.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 21:14:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "My neighbor just OD'd. Narcan saved him, thankfully. It's scary how easily this happens. Anyone know resources for families dealing with this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A neighbor overdosed, requiring Narcan. While the immediate crisis is averted, the incident highlights the risk of future overdoses and the need for support resources, indicating a potential for escalation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 21:13:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want to feel *something* different. Trying to stay strong, but it's hard. Anyone else ever feel this way? Where do you turn?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a desire for a different emotional state, coupled with difficulty staying strong. This suggests emotional distress and a potential vulnerability. While not explicitly suicidal, the desire to feel \"something different\" could indicate a risk of engaging in unhealthy coping mechanisms.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 21:12:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been feeling so isolated lately. Constant put-downs are really getting to me. Is this normal in a relationship? Starting to think maybe it's not just \"jokes.\" Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential emotional abuse within a relationship. While it doesn't explicitly state intent for self-harm or harm to others, the constant put-downs and feelings of isolation raise concerns about the individual's well-being and potential escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 21:11:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking help):**\n\n> \"Things are rough at home. Walking on eggshells all the time. Anyone know where to find resources in [City]? Feeling lost.\"\n\n**Option 2 (Sharing a personal story):**\n\n> \"Never thought it would happen to me. Gaslighting is real. Starting to question everything I know.\"\n\n**Option 3 (Raising awareness):**\n\n> \"Emotional abuse leaves scars you can't see. Check in on your friends, even the 'strong' ones.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The texts indicate potential emotional distress and possible abuse (gaslighting, walking on eggshells). While there's no explicit mention of immediate danger, the feelings of being 'lost' and 'questioning everything' raise concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 21:10:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nJust got out of the hospital after a scare. A friend OD'd last night. Narcan saved their life. Scariest night of my life. Learn how to use it, please. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Recent overdose event requiring Narcan indicates a high risk of future overdose and potential fatality. The event highlights the immediate danger and widespread potential for harm.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 21:09:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home have been... not good lately. Walking on eggshells constantly. Is this normal? Feeling lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates emotional distress and a difficult home environment, but doesn't explicitly mention self-harm, suicide, violence, abuse or overdose. 'Walking on eggshells' suggests potential conflict or tension, but more information is needed to assess the level of risk.",
    "detected_category": "other",
    "timestamp": "2026-01-04 21:08:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Walking on eggshells constantly. Is this normal? Feeling lost and scared. Need to talk to someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a potentially unsafe home environment, requiring further assessment to determine the exact nature and extent of the risk. The phrase 'walking on eggshells' suggests potential abuse or a volatile situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 21:07:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen having a really rough time lately. Urges are back and stronger. Reached out to a crisis line, feeling a little better just talking. Remember you're not alone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of strong urges, suggesting a potential for self-harm or suicidal ideation. While the person reached out for help and feels a little better, the intensity of the urges warrants a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 20:18:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Finally left. Heart's pounding. So scared but also... lighter? Don't know what to do next. Any resources for women leaving abusive relationships?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual is leaving an abusive relationship and is experiencing fear and uncertainty, which are risk factors for potential harm, particularly if they return to the abuser or lack adequate support.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 20:17:42"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Made me realize how easily things can escalate. Is there anywhere to learn de-escalation techniques? Feeling pretty helpless right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight caused distress, but no direct threat to the individual or others is mentioned. The individual is seeking de-escalation techniques, indicating a desire to prevent future violence, rather than participate in it.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 20:16:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Walking on eggshells constantly. Is this normal? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a stressful and potentially harmful home environment ('walking on eggshells') leading to feelings of being lost. While not explicitly stating harm, it hints at a situation that could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 20:15:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of isolation and being overwhelmed, but doesn't contain direct threats or explicit plans for self-harm or harm to others. It seems like a general expression of distress and a desire for connection.",
    "detected_category": "other",
    "timestamp": "2026-01-04 20:14:37"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shaken up. Makes you realize how quickly things can escalate. Anyone else witness it? Kinda need to vent.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates the user witnessed a fight and is shaken, but there's no direct threat to themselves or others. It expresses a need to vent, suggesting distress but not an immediate danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 20:13:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nJust saw a post about someone OD'ing. Scared me. Happened to a friend last year. Narcan is crucial, people. Carry it if you can. It saves lives. Learn how to use it. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports an overdose incident (friend last year, recent post), highlighting risk, especially for those with substance use issues or in proximity to it.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 20:12:34"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on my street last night. Shook me up. Called the cops but still feeling uneasy. Anyone else ever witness something like that? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't directly indicate immediate danger to the author or others. Unease and seeking coping mechanisms suggest distress, but not an imminent crisis.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 20:11:33"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain any explicit threats, plans, or ideation related to self-harm, suicide, or violence. The individual is reaching out for support, which is a positive sign.",
    "detected_category": "other",
    "timestamp": "2026-01-04 20:10:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "My brother almost didn't wake up yesterday. Scariest day of my life. Please, if you're struggling, reach out. There's help out there. Don't let this happen to your family. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-death experience which implies a significant safety risk to the brother. The mention of struggling and encouragement to seek help further suggests a potential suicide attempt or serious self-harm event.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 20:09:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like nothing matters. Reaching out to a friend, but it's hard. Anyone else ever feel this empty? Just looking for some support.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of emptiness and low mood, suggesting potential depression or suicidal ideation. The individual is reaching out for support, indicating they are aware of their distress, but the passive phrasing suggests a degree of hopelessness.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 19:16:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Trying to stay strong and reach out instead. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions the urge to cut, indicating active self-harm ideation. While the person is reaching out, the presence of the urge signifies a high risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 19:15:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Relapsed after 6 months clean. Feeling ashamed, but reaching out for support. Anyone else been there? It's so hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety combined with feelings of shame increases vulnerability and the risk of further unhealthy coping mechanisms. The individual is reaching out for support, which is a positive sign, but the relapse itself indicates a struggle and potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 19:13:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Didn't know what to do, just kept walking. Feeling guilty now. Anyone else ever freeze like that? What *should* you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an act of violence (shoving) which could escalate. While it doesn't directly involve the author, it indicates a potential risk of harm to another person.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 19:12:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan worked, thank god. Really makes you think. If you're struggling, please reach out. There's help out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event indicating a potential risk of future overdoses in the area or among the individual's associates. While the person survived, the event itself points to a broader risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 19:11:56"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on the bus. Dude got shoved, then swung. Shook me up pretty bad. Is there anywhere safe to report stuff like that happening?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A physical altercation occurred, indicating a risk of injury. While the observer wasn't directly involved, they express being shaken up, suggesting potential psychological distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 19:10:54"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is back. It's scary. Reached out to a friend, hoping it helps. Anyone else relate? Just feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions the urge to hurt oneself, indicating active suicidal ideation or self-harm ideation. This requires immediate attention and support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 19:09:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It helps, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential risk. While the person reached out for help, the presence of urges necessitates monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 19:08:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just need to vent. After another fight, he smashed my phone. Said it was my fault. I feel so isolated. Is this normal? I don't know what to do anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a pattern of abuse (physical violence, blaming) and expresses feelings of isolation and desperation. The smashed phone indicates potential for escalation of violence.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 19:07:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just wanted to reach out and say if you're struggling too, you're not alone. Talking helps. I'm trying to find the strength to keep going.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and struggling, but it also shows a desire to find strength and encourages talking as a coping mechanism. There are no explicit mentions of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2026-01-04 19:06:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like too much. Scared to admit I relapsed. Trying to get back on track. Anyone else been there? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse, which carries potential health risks depending on the nature of the relapse. While there's no explicit mention of self-harm or suicide, the feelings of being overwhelmed and scared suggest vulnerability and potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 18:20:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. If anyone has felt this way and found help, please share.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 82 (char 107)",
    "detected_category": "unknown",
    "timestamp": "2026-01-04 18:19:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating emotional distress and a need for support. While not explicitly suicidal, the feelings of hopelessness warrant concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 18:18:42"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight outside my kid's school today. Shook me up. Makes you wonder what's going on with people. Anyone else dealing with this in their neighborhood?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't directly indicate imminent danger to the author or others. It expresses concern and a desire for shared experiences, but lacks details suggesting escalation or direct threats.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 18:17:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling really lost and alone. Reaching out to a friend tomorrow. Hoping it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates feelings of loneliness and being lost, but it also shows an active coping mechanism by reaching out to a friend. There is no explicit mention of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2026-01-04 18:16:39"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train for bumping into someone. Escalated so fast. Makes you wonder what's going on with people. Anyone else notice more aggression lately? Feeling anxious.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a physical altercation (shoving) in a public place, suggesting a risk of injury to the victim and potential escalation to more serious violence. The observer also expresses anxiety, indicating the event was distressing.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 18:15:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD downtown. Scariest thing ever. Narcan saved them, but it really shook me. Makes you realize how easily it can happen. Learn CPR, carry Narcan. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event. While Narcan was effective, the potential for fatality exists, and the text emphasizes the ease with which an overdose can occur, leading to a moderate level of concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 18:14:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking help):**\n\n> Feeling lost. Things at home are... not good. Is there anyone who can recommend resources? I'm scared.\n\n**Option 2 (Sharing a story):**\n\n> I used to think it was normal to be constantly yelled at. It's not. It's abuse, and I'm finally getting out.\n\n**Option 3 (Raising awareness):**\n\n> Emotional abuse leaves invisible scars. Don't dismiss it. It's real and it hurts.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While not explicitly stating intent to harm self or others, the text indicates distress, fear, and potentially ongoing abuse. Option 1 expresses feeling 'scared' and things at home 'not good', suggesting an unsafe environment. Option 2 confirms a past of abuse. This warrants a medium severity due to the potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 18:13:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The constant put-downs are chipping away at me. Anyone else feel like they're walking on eggshells all the time? Is this normal?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being worn down, feeling vulnerable ('walking on eggshells'), and questioning the normalcy of the situation, suggesting emotional distress. While not explicitly stating suicidal ideation or self-harm, the language indicates a potentially escalating situation that requires attention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 18:12:32"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Two guys just went at it. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate immediate danger to the original poster or others. There's no mention of injuries or weapons. The poster expresses being 'shook up' and 'on edge', indicating emotional distress but not an imminent threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 18:11:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank goodness. Makes you realize how close we all are to the edge. Learn CPR, carry Narcan. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event requiring Narcan intervention, indicating a potentially life-threatening situation. While Narcan was effective, the risk of overdose is a serious concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 17:16:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary. Naloxone saved them, thank goodness. Knowing how to use it is so important. Anyone else feel helpless sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a recent overdose event, indicating the presence of a potentially life-threatening situation and highlighting the importance of emergency intervention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 17:15:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Really struggling tonight. Urges are strong. Anyone else feel this way? Just need to know I'm not alone.\n\n**Option 2 (Sharing a small victory):**\n\n> Managed to distract myself instead of giving in. Small win, but it feels huge right now.\n\n**Option 3 (Raising Awareness):**\n\n> Just a reminder to be kind. You never know what someone's going through. Scars aren't always visible.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates active struggle with strong urges, suggesting a potential for self-harm. While not explicitly stated, the combination of struggling and strong urges warrants a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 17:14:38"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Punches thrown, guy on the ground. Shaken up. Is it just me, or is everyone on edge lately? Makes you wonder what sets people off.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A physical altercation occurred, resulting in injury. While not directly involving the reporter, it indicates a potential for violence and a feeling of unease in the environment.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 17:13:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the ambulance lights last night shook me. ODs are hitting our block hard. Know Narcan. Carry Narcan. It saves lives. Please look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a high prevalence of overdoses in the immediate area, requiring immediate action of carrying/using Narcan, signalling a notable risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 17:12:35"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a bit. Just taking it one hour at a time. If you're struggling too, you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk. While the person has reached out for help, the urge is still present, suggesting the situation requires continued monitoring and support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 17:11:34"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Scary stuff. Makes you realize how quickly things can escalate. Anyone else feel on edge lately? Stay safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which suggests a potential risk of violence but doesn't indicate a specific threat or target. The general warning to 'stay safe' implies awareness of potential danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 17:10:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Things got really dark last night. I hurt myself again. I'm so tired of this cycle. Reaching out to my therapist today. Wish me luck.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates self-harm, a recurring cycle of distress, and seeking help. While actively reaching out is positive, the mention of self-harm escalates the risk beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 17:09:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. He's been isolating me from my friends, and the constant put-downs... I feel so lost. Anyone else been through this? How did you find the strength to leave?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes isolation and emotional abuse (put-downs), indicating a potentially dangerous situation. The question about finding the strength to leave suggests the person recognizes the need to escape but may lack the resources or support to do so. This combination elevates the risk beyond 'low' due to the potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 17:08:29"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got decked, and no one helped. Makes you wonder what's wrong with people. Shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent altercation can be traumatizing and indicates a risk of potential violence in the area.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 17:07:27"
  }
]