[
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, and reaching out for help suggests a potential for escalating distress if support is not received. The metaphor of being 'underwater' can indicate feelings of suffocation and hopelessness.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 10:17:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just need to vent. He yelled again, smashed a plate. I hate this. Feels like walking on eggshells constantly. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a pattern of controlling, angry behavior including yelling and property destruction, causing the writer to feel anxious and unsafe. While there's no explicit threat of physical harm, the mention of 'walking on eggshells' suggests emotional abuse is occurring and escalation is possible.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 10:16:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Walking on eggshells all the time. Anyone else feel like they're losing themselves? Is there help out there?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional distress and a difficult home environment, possibly involving abuse. The phrase 'walking on eggshells' is a common indicator of a strained or volatile situation. Asking for help suggests the individual recognizes they are struggling.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 10:15:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Please, if you're using, have someone with you and Narcan. It saves lives. Learn the signs of an OD. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event. The urgency in the plea for Narcan and awareness of overdose signs indicates a high level of immediate danger and potential for repeated occurrence.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 10:14:28"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Scary how quickly things escalated. Made me realize I need to learn some self-defense. Any recommendations for classes in the city?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potential safety risk, but the individual's response focuses on learning self-defense rather than indicating immediate danger or involvement. It's a reaction to a situation rather than a current threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 10:13:26"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel so trapped. Anyone else been through this? How did you find the strength to leave?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation with controlling behavior and put-downs, indicating possible emotional abuse and feelings of being trapped. While not explicitly stating physical harm, this environment can significantly impact mental health and increase the risk of escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 10:12:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Just trying to get through it minute by minute. Anyone else relate? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges and feelings of loneliness, suggesting a potential for self-harm or other negative coping mechanisms. While there's no explicit mention of suicide or self-harm, the return of urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 10:11:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get too much, y'know? Like the only way to quiet the noise is to hurt. I'm trying really hard to stop, but it's so hard. Anyone else feel this? Any tips that actually help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a desire to self-harm as a coping mechanism and indicates difficulty in stopping. The user is actively seeking help but admits to struggling, suggesting a high risk of self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 10:10:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but it shook me. We need more resources, more help. Is anyone else feeling helpless about this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Observed overdose incident suggests potential for future occurrences and highlights a lack of resources, indicating a continuing risk. While Narcan was effective in this instance, it points to an ongoing issue.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 10:09:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking help):**\n\n> \"Things are rough at home. Walking on eggshells all the time. Anyone know where I can find local resources for domestic abuse?\"\n\n**Option 2 (Sharing a personal story):**\n\n> \"Never thought it would happen to me. Gaslighting is real. I'm slowly starting to see things for what they are.\"\n\n**Option 3 (Raising awareness):**\n\n> \"Emotional abuse leaves invisible scars. Check in on your friends, you never know what someone's going through behind closed doors.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions potential domestic abuse and gaslighting, indicating a risk of ongoing harm. The user is actively seeking resources, suggesting an awareness of the situation and a desire for help.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 10:08:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Narcan saved him. Please, if you're using, keep it close. It could save a life. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a high risk situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 09:18:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The constant put-downs are chipping away at me. Anyone else feel like they're walking on eggshells all the time? Is this normal in relationships? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, feelings of being undermined, and questioning the normalcy of the relationship dynamic. While there's no explicit mention of self-harm or suicide, the expressed feeling of being 'lost' and the description of a potentially abusive environment (constant put-downs, walking on eggshells) suggests a need for intervention and monitoring.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 09:16:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it feels like the only way to quiet them is to hurt. Trying to find other ways to cope. Anyone else feel this? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to hurt oneself as a way to cope with overwhelming thoughts, indicating a potential risk of self-harm. While the person is seeking alternative coping mechanisms, the explicit mention of self-harm elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 09:15:57"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of things at home. Anyone else feel on edge after witnessing something like that? Need to vent.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be upsetting and trigger negative emotions or memories, but the text doesn't suggest imminent harm to self or others.",
    "detected_category": "other",
    "timestamp": "2026-01-04 09:14:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on where to start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, coupled with a recognition of needing help but feeling unable to reach out. This suggests a potential for escalating distress if left unaddressed.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 09:13:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. I feel so stupid for letting it. Walking on eggshells constantly. Does anyone know resources for emotional abuse? I need to get out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of emotional abuse and a desire to escape the situation, indicating potential for escalation and negative mental health outcomes. The phrase \"walking on eggshells constantly\" is a common indicator of a strained or abusive relationship. The request for resources suggests an awareness of the problem and a desire for help, but also highlights the seriousness of the situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 09:12:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... Scares me. Lost a friend last year. If you're struggling, please reach out. There are people who care & want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern and fear related to overdoses and losing a friend. While it doesn't indicate immediate danger to the author or anyone else, the mention of a past loss and the plea for help suggest a heightened vulnerability to overdose or related mental health struggles within the author's social circle. This warrants a 'medium' rating due to the potential risk and encouragement of seeking help.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 09:11:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so overwhelmed lately. Just reaching out to see if anyone else has felt this way and has any advice. It's hard to explain, but I'm just feeling really lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and lost, but does not contain any specific indications of self-harm, suicidal ideation, violence, abuse, or overdose. It appears to be a general expression of distress.",
    "detected_category": "other",
    "timestamp": "2026-01-04 09:10:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing way too many RIP posts lately. Lost another friend to an OD. Please, if you're struggling, reach out. There are people who care. I'm here to listen too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about a friend's death due to overdose and mentions others. This indicates a potential for further overdose events and highlights the presence of struggle and vulnerability within the social circle.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 09:09:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things aren't good at home. Walking on eggshells all the time. Is this normal? Anyone else go through this? I just feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially unsafe home environment and emotional distress. While not explicitly stating violence or abuse, the phrase 'walking on eggshells' suggests fear and tension, raising concern for potential harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 09:08:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD. It's terrifying. Happened to my cousin last year. Narcan saved his life. Learn the signs, folks. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a personal experience with overdose (OD) and highlights the potential for it to happen to anyone, suggesting a real and present danger. While Narcan was successful in this instance, the mention of a cousin's OD and the term 'terrifying' point to a significant impact and potential for future risk to others related to drug use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 08:20:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy and I don't know where to turn. Talking to someone feels impossible, but I know I need help. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and a desire for help, suggesting emotional distress and potential for escalation if support is not received. The inability to talk to someone is a concerning barrier.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 08:19:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, walking on eggshells... Feels like I'm losing myself. Anyone else been through this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (put-downs, walking on eggshells) which indicates a potentially unsafe environment and negative impact on mental well-being. The user is seeking help, suggesting a desire to change the situation, but the level of immediate danger is unclear.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 08:18:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Reached out to a friend, just need someone to listen. It helps, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The return of stronger urges indicates increased risk. Reaching out is a positive coping mechanism, but the persistence and intensity of urges suggest ongoing vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 08:17:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. So much anger... Anyone else feel like things are getting more volatile lately? Need to process this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling shaken, but does not indicate direct involvement or imminent threat to self or others. It expresses a feeling of increased volatility and a need for processing, which suggests distress but not necessarily a high-risk situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 08:16:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm drowning. Reaching out before it's too late. Anyone else feel this way? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses feelings of hopelessness, a desire for help before it's \"too late,\" and a sense of isolation, all indicators of potential suicidal ideation and imminent risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 08:15:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so numb lately. The urge to feel *something* is overwhelming. I know it's not healthy, but it's hard to resist. Anyone else ever feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to feel *something*, coupled with an acknowledgement that the urge is unhealthy and hard to resist. This suggests a potential for risky behavior to achieve that feeling, although the exact nature is unclear.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 08:14:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scary stuff. Called 911, they're gonna be ok. Makes you think... know the signs, carry Narcan. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A drug overdose occurred, requiring emergency intervention. While the person will be ok, the situation presents a significant health risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 08:13:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just reaching out to see if anyone else understands. It's hard to keep going sometimes.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and difficulty coping, but lacks specific intent or plan for self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 08:12:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but does not explicitly mention self-harm, suicide, or violence. It's a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2026-01-04 08:11:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Trying to resist, but it's hard. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating a significant risk, even though the person is trying to resist. The phrase 'it's hard' suggests the individual is struggling to maintain control.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 07:19:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Taking it one hour at a time. If you're struggling too, you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk of harm to self. While the individual reached out to a friend, the intensity of the urge signifies a serious situation requiring immediate attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 07:18:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Just constant pressure and can't see a way out. Talking to a therapist, but it's slow going. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, constant pressure, and no way out. While mentioning therapy is a positive, the intensity of negative feelings suggests a risk of escalation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 07:17:41"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a fight break out on the bus. Shook me up. Reminded me of things back home. How do you guys deal with feeling unsafe in public?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and can trigger negative emotions, but the individual is primarily expressing feeling shaken and unsafe, not actively planning or engaging in violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 07:16:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs & feeling like I'm walking on eggshells. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with emotional abuse (put-downs) and chronic stress (walking on eggshells), indicating a potential for escalating distress and negative mental health outcomes. The feeling of isolation exacerbates the risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 07:15:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "I feel so lost. Things at home have been bad for a while, but last night... I don't even know what to do anymore. Is this normal? How do I get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feeling lost, overwhelmed, and a desire for help, suggesting potential distress and need for support. The reference to 'things at home being bad' is concerning.",
    "detected_category": "other",
    "timestamp": "2026-01-04 07:14:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are strong. Trying to distract myself, but it's hard. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and difficulty coping, suggesting an elevated risk of acting on those urges. While it doesn't explicitly mention self-harm or suicide, the intensity of the distress warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 07:13:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been feeling so isolated lately. Constant put-downs disguised as \"jokes\" are really getting to me. Is this normal in relationships? Starting to doubt myself.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress due to ongoing belittling behavior in a relationship, leading to self-doubt. While not explicitly stating intent to harm self or others, the isolation and emotional impact suggest a potential escalation if the situation persists.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 07:12:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. Constant yelling, put-downs. I feel so small. Anyone else been through this? How do you even start to fix it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 66 (char 91)",
    "detected_category": "unknown",
    "timestamp": "2026-01-04 07:11:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so overwhelmed lately. Just talking about it feels like a weight lifted. If you're struggling too, please reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and encourages seeking help, indicating a struggle but not explicitly mentioning self-harm, suicide, or harm to others.",
    "detected_category": "other",
    "timestamp": "2026-01-04 07:10:30"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got decked, right in front of me. Shook me up. Is it just me, or is everyone on edge lately? Makes you wonder.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Reports witnessing an isolated act of violence. While concerning, it doesn't indicate an ongoing or widespread threat to the reporter or others. The emotional distress is noted, but there's no specific threat implied.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 06:22:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nSaw someone OD downtown today. Scary stuff. Narcan saved them, thank god. Reminds me why we gotta look out for each other & know the signs. Is there naloxone training nearby? Need to get certified again.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential public health crisis and direct risk to individuals using drugs. While Narcan was administered successfully, the event highlights the ongoing danger and the need for preparedness.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 06:21:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is getting stronger. Reached out to a friend, hoping it helps. It's so exhausting fighting this every day.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates an increasing urge to self-harm, which suggests a worsening situation and potential risk. While the person reached out for help, the intensity of the urge warrants a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 06:20:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming I just want to feel *something* else. Scared I'll go too far one day. Talking helps, but it's so hard to start. Anyone else feel this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to feel something else due to feeling overwhelmed and a fear of going too far, which suggests potential self-harm. The difficulty in initiating conversation also raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 06:19:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so heavy lately. Like I'm underwater. Reaching out for help feels impossible. Anyone else been there? How did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and difficulty seeking help, which could indicate a risk of escalating distress. The question at the end is a help-seeking behavior that suggests awareness and some level of desire for support, but the initial statements point to a concerning level of emotional burden.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 06:18:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after OD'ing. Scared. Didn't think it would happen to me. If you're struggling, please reach out. There are people who care. #overdoseawareness #recoveryispossible",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The individual recently overdosed, indicating a high risk of future overdose or self-harm.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 06:17:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nScary night. Found my brother unresponsive. Narcan saved him. Please, learn the signs of an overdose. It could save someone you love. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Brother found unresponsive and saved with Narcan, indicating a life-threatening overdose situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 06:15:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found out a friend OD'd. Narcan saved them, thank god. It's scary how easily this happens. Please, carry it if you can. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan intervention was successful, the text describes a recent overdose event involving a friend, indicating a real and present risk, and highlights the ease with which overdoses occur.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 06:14:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scary. Narcan worked, thank god. Makes you realize how fragile things are. Learn CPR and how to use it. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a risk of future overdoses in the area and potential for second-hand trauma. While Narcan was effective, it highlights a serious public health concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 06:13:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Talking feels impossible, but I need to try.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed (\"underwater\"), and a desperate need for help, indicating potential emotional distress and a struggle to cope.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 06:12:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, a potential precursor to more serious ideation. Reaching out is positive, but the intensity of the feeling warrants a medium severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 05:22:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Reached out to a crisis line. Talking helps, even a little. Please, if you're struggling too, don't be alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a return of strong urges and a feeling of being overwhelmed, suggesting a significant risk to the individual's well-being. Reaching out to a crisis line indicates the individual is aware of the seriousness of their situation and seeking help, but the presence of strong urges necessitates a high severity rating.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 05:21:41"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I hate it. Reached out to a friend, just need to get through tonight. It's okay to ask for help, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of being overwhelmed, suggesting a potential risk. The individual has reached out for help, which is a positive sign, but the presence of urges necessitates a 'medium' severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 05:20:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing. Please, if you're struggling, reach out. Don't become a statistic. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event. While the message promotes seeking help, the event itself indicates a potential risk of overdose in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 05:19:38"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight downtown last night. Guy got knocked out cold. Really shook me up. Is there somewhere I can report this anonymously? I just want to make sure he's okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A violent act resulting in incapacitation occurred, requiring potential medical attention for the victim. While the reporter isn't directly involved or threatened, the witnessed violence and concern for the victim elevate the severity.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 05:18:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my neighbor unresponsive. Narcan worked, thank god. Scary reminder how close we are to losing people. Learn CPR, carry Narcan. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Neighbor was found unresponsive and required Narcan, indicating a potential overdose situation. While intervention was successful, the event demonstrates a significant risk of death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 05:17:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on Elm St. Shook me up. Called the non-emergency line, but feeling helpless. Hope she's okay. Anyone else see anything?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Report of potential violence, specifically physical assault. While the extent of injury is unknown, the act of shoving constitutes a risk to the victim's safety.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 05:16:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is getting strong again. Reaching out for support before I give in. Anyone else been there? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a significant risk of self-inflicted harm. The individual is reaching out for help, which is a positive sign, but the presence of strong urges elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 05:15:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Narcan saved him, thank god. Makes you realize how close we all are to losing someone. Learn CPR, carry Narcan if you can. It makes a difference.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event indicates potential for serious harm and highlights the presence of dangerous substances in the environment. Although the individual survived, the event underscores a risk to others who might experience a similar crisis.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 05:14:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Remember we're not alone in this. ❤️ If you're struggling too, please talk to someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 05:13:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Narcan saved them. Scariest night of my life. Please, learn the signs of OD. It can happen to anyone. Check on your friends.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event, indicating a high risk to life.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 04:37:05"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out to a friend, but it's hard. Anyone else ever feel this way? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but shows help-seeking behavior by reaching out to a friend. No explicit mention of self-harm or suicide.",
    "detected_category": "other",
    "timestamp": "2026-01-04 04:36:03"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been... rough. Constant yelling, walking on eggshells. Is this normal? Feeling so lost and alone. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home environment with yelling and fear, suggesting potential emotional abuse or neglect. The user expresses feelings of isolation and being lost, which could escalate if unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 04:35:02"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. Small things, but they escalate. I feel so trapped. Anyone know any resources for emotional abuse? I'm scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a pattern of escalating emotional abuse, causing the user to feel trapped and scared. While not explicitly mentioning physical harm, the fear and feeling of being trapped suggest a potential for further escalation and psychological damage. The user is actively seeking resources, indicating an awareness of the severity of the situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 04:34:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling, but doesn't indicate direct involvement, imminent threat, or specific targeting. It expresses general unease rather than a concrete plan or immediate danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 04:32:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, which could indicate a potential mental health crisis. The phrase \"I don't know what else to do\" suggests a lack of coping mechanisms and a need for support.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 04:31:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get punched outside my apartment. Shook me up bad. Called 911, but still feel sick. Anyone else ever witness something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can cause emotional distress and anxiety. While the original event is over, the individual is still experiencing negative psychological effects which could escalate if unaddressed.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 04:30:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Finally left. Apartment's a mess but it's *my* mess. Head's still spinning. Anyone know good therapists in the city? Feeling lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feeling lost and seeking a therapist, suggesting emotional distress but not an immediate safety risk. The reference to a messy apartment and spinning head implies recent stressful events, but no specific threat or intent is mentioned.",
    "detected_category": "other",
    "timestamp": "2026-01-04 04:29:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, thankfully. Makes you realize how fragile life is & how easily it can be lost. If you're struggling, please reach out. There's help out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a drug overdose incident, indicating a potential risk of future overdoses or related health crises within the individual's social circle or community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 04:28:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, walking on eggshells... Feels isolating. Anyone else been through this? Where did you find support?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and a feeling of isolation, which can escalate into more severe mental health issues if not addressed. 'Walking on eggshells' and 'constant put-downs' are indicative of a potentially harmful environment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 04:27:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Scratched again. Feeling so ashamed and lost. Anyone else been there? Just need to know I'm not alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of shame, loss, and a past act of self-harm ('scratched again'). While not explicitly suicidal, the admission of repeated self-harm and feelings of isolation raise concerns about potential escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 03:49:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, just need someone to listen. It helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a strong urge to self-harm, suggesting a potential risk. While the person has reached out for help, the intensity of the urge warrants a 'medium' severity level.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 03:48:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but lacks explicit mentions of self-harm, suicide, or other dangerous intentions. It appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2026-01-04 03:47:41"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately, urges are back. Trying to remember my coping skills but it's hard. Anyone else relate? Just feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges and difficulty coping, suggesting an elevated risk. The feeling of loneliness further exacerbates the situation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 03:46:39"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to stay strong and remember why I stopped. Anyone else relate? It's a tough battle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse in urges, suggesting a potential for self-harm. While the individual expresses a desire to stay strong, the return of urges elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 03:45:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He says he's sorry, promises it won't happen again, then it does. Is this normal? Feeling so lost. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a pattern of repeated harmful behavior ('it happens again') and feelings of being lost, suggesting potential emotional distress and a need for support. While not explicitly stating intent for self-harm or violence, the cyclical nature of the situation and expressed feelings warrant concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 03:44:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just... need to feel *something* else. It's not a solution, I know. Anyone else relate? Trying to find healthier coping mechanisms.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates overwhelming feelings and a need to feel something else, which could suggest self-harm as a coping mechanism. Although the person acknowledges it's not a solution and is seeking healthier options, the implicit mention of needing to 'feel *something* else' raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 03:43:35"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nJust saw someone OD downtown. Scariest thing ever. Narcan saved their life. Learn how to use it, could save someone you know. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a risk of potential harm to others in the area due to drug use. The experience can also be psychologically distressing for the witness, potentially impacting their mental health.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 03:42:34"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train. Heart's still racing. Is it just me, or is everyone on edge lately? Makes you scared to even go out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the text describes a violent act (being shoved), it does not indicate serious injury or ongoing threat to the poster or others. The poster expresses fear and anxiety, but there's no indication of immediate danger or intent for further violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 03:41:33"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Everything feels heavy, and I'm not sure how much longer I can keep going. Reaching out to see if anyone else understands. Need to find a glimmer of hope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a desire for help, suggesting potential suicidal ideation, though without explicit plans or intent.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 03:40:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just feeling so lost. Things escalated again last night. Don't know who to turn to anymore. Is this normal? Feels like I'm walking on eggshells all the time.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential escalation of conflict, feelings of being lost, and constant anxiety (\"walking on eggshells\"). While not explicitly mentioning self-harm or suicide, the emotional distress and lack of support suggest a need for intervention and the potential for further escalation. It's important to investigate further.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 03:04:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scary night. Found my roommate unresponsive. Narcan saved him. Please, if you're using, carry it. Could save a life, like it did last night. Learn how to use it. It's not hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a life-threatening overdose situation where the individual was unresponsive and required Narcan to be revived, indicating a significant risk of death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 03:03:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy and I don't know where to turn. Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness, loneliness, and being lost, but lacks specific suicidal ideation, self-harm plans, or threats. It seems like a general cry for help and support.",
    "detected_category": "other",
    "timestamp": "2026-01-04 03:02:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park today. Scariest thing ever. Narcan saved him, thank God. This sh*t is real. Please, if you're struggling, reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a high-severity event. While the person survived due to Narcan, the event indicates a significant risk of fatal overdose in the community and potential trauma for the witness.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 03:01:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... Feels like I'm walking on eggshells. Anyone else been through this? How did you find help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, indicating a potential for emotional or psychological abuse. While not explicitly stating physical violence, the feeling of 'walking on eggshells' suggests a volatile and potentially unsafe environment. The user is actively seeking help, which suggests they recognize the severity of the situation and its negative impact.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 03:00:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got too much last night. Cleaned up now, but feeling so ashamed. Reaching out to my therapist today. Just gotta get through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a past crisis and feelings of shame, suggesting a potential risk of self-harm or suicidal ideation. While the individual is reaching out for help, the initial statement implies a significant emotional distress.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 02:59:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Narcan saved him, thankfully. Makes you realize how fragile life is. If you're struggling, please reach out. There's help out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose was non-fatal, it indicates a serious and immediate health risk. The availability of Narcan mitigated the potential for death, but the event itself points to a significant issue with drug use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 02:58:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor OD last night. Terrifying. Narcan saved him, but it shook me up bad. Folks, please be careful out there. Know the signs, carry Narcan. It really can save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a neighbor's overdose, indicating a potential risk of overdose in the community and highlighting the importance of harm reduction measures. While Narcan was successful, the event was described as 'terrifying' and impactful.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 02:57:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my friend OD last night. Terrifying. Narcan saved him, but it shook me up bad. Anyone else been through this? Feels like I can't breathe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Friend's overdose suggests potential exposure to dangerous substances and associated trauma/stress. The user expresses distress and difficulty breathing, indicating a possible anxiety or panic attack related to the event.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 02:56:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He yells every day, even when I do everything \"right.\" It's never enough. Does anyone else deal with this? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and feelings of isolation, which could escalate to more severe mental health issues if left unaddressed. The phrase \"He yells every day\" and the feeling of it never being \"enough\" suggest a pattern of verbal abuse.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 02:55:26"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy get shoved on the train today. Just trying to get home. Scared the crap out of me. Is everyone okay out there? Feeling so on edge lately.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While a violent act occurred, the text describes a single incident and expresses fear and anxiety but does not indicate ongoing threat or high probability of further violence. The target of the violence was not the author of the text.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 01:47:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is back, and it's scary. Reached out to a friend, and it helped a little. Just trying to get through today. Any advice is welcome.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions the return of urges to self-harm, indicating an active risk. While the person reached out to a friend, the severity remains high due to the presence of self-harm ideation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 01:46:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain any explicit mentions of self-harm, suicide, violence, abuse, or overdose. It is a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2026-01-04 01:45:14"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up bad. Reminded me of things I've been trying to forget. Anyone else get triggered by stuff like that? Need to breathe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes feeling shaken up and triggered by witnessing a fight, but doesn't indicate immediate danger to self or others. It expresses a need to 'breathe,' suggesting a coping mechanism is being employed.",
    "detected_category": "other",
    "timestamp": "2026-01-04 01:44:13"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Just trying to take it one hour at a time. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges are back' suggesting a relapse or increase in distress, and feeling 'overwhelmed' indicates a diminished capacity to cope. While not explicitly stating intent, the mention of 'urges' and seeking support online points to a potential risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 01:43:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Finally left. Scared but free. Years of walking on eggshells... anyone else ever feel like they were losing themselves? Any advice on rebuilding?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text implies a history of abuse or a controlling situation ('walking on eggshells') which can have long-term psychological impacts. The user expresses fear and feeling like they were 'losing themselves', indicating emotional distress and potential vulnerability. The risk of self-harm or other negative outcomes is elevated, but not immediately apparent.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 01:42:10"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Just reaching out to see if anyone else has felt this way and found a way through. Need some hope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed, but does not contain any explicit or imminent plans for self-harm or suicide. It is a general expression of distress and a request for help.",
    "detected_category": "other",
    "timestamp": "2026-01-04 01:41:09"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Scary how quickly things escalated. Makes you think, ya know? Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning, but lacks specific threats or targeted harm. The generalized feeling of being 'on edge' doesn't indicate immediate danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 01:40:07"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Froze. Wish I'd said something. Anyone else ever feel that helplessness? Makes me sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can indicate a potential risk of escalation or repeated incidents, and the author expresses distress related to the event.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 01:39:06"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his partner on the street today. Broad daylight. Frozen. Didn't know what to do. Still shaking. Is there somewhere to report that even if I don't know them?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault, even if a single shove, indicates potential for further harm or escalation. The witness's distress suggests a serious event.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 01:38:05"
  }
]