[
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Dude was yelling, then just *bam*. Scared the crap out of me. Is there anywhere I can report this anonymously?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A physical altercation occurred, suggesting a risk of injury to those involved. While the reporter seems to be safe, the event itself indicates a potential for further violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 15:17:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, thank god. Carry it. Learn how to use it. It can save a life. Please be careful out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Overdose is a serious, life-threatening event, though Narcan was available and effective in this instance. It highlights the potential for severe health consequences.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 15:16:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Like I'm underwater. Reaching out to a friend tonight. Hope it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of loneliness and being overwhelmed ('underwater'). While they are reaching out for help, the language suggests significant emotional distress. The question 'It's okay to not be okay, right?' indicates a need for reassurance and highlights vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 15:15:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, and it helped a little. Just taking it one day at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 15:14:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Narcan saved them, but it shook me up. Learn how to use it, you could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event, indicating the presence of significant safety risks within the community related to drug use. While the individual survived due to Narcan, the potential for fatality and the emotional impact on the witness are concerning.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 15:13:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it feels like the only way to turn down the volume is to hurt. Trying to find healthier ways to cope. Anyone else relate? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to self-harm as a coping mechanism, indicating a potential for harm. While the individual is seeking healthier coping strategies, the active thought of self-harm elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 15:12:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, indicating significant distress. The phrase 'like I'm underwater' suggests feelings of suffocation and helplessness. Reaching out for advice indicates a desire for help, but also suggests the individual may be struggling to cope. While not explicitly suicidal, the intensity of the distress warrants a medium severity rating.",
    "detected_category": "other",
    "timestamp": "2025-12-25 15:11:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing so many gone lately. Narcan saves lives, please learn how to use it. Lost a friend last week and wish I'd known more. Don't want anyone else to go through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses grief and loss related to overdose deaths, indicating a heightened risk for potential overdose or exposure to overdose situations. While not explicitly stating intent, the strong emotional distress and call for Narcan use suggest a vulnerable environment.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 15:10:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Narcan saved him, but it shook me up. If you're struggling, please reach out. There's help out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event that indicates a potential risk to the individual who overdosed, though immediate harm was averted by Narcan. It also highlights a broader community risk of drug use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 15:09:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIP posts lately. OD is scary real. Found my brother barely breathing last month. Narcan saved him, but damn. Learn the signs, please. Could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses overdose (OD), a life-threatening event, and the use of Narcan to reverse it, indicating a serious safety risk is present. While it mentions a specific instance where Narcan was successful, the overall tone is concerning due to the high number of overdose-related deaths and near-death experiences.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 15:08:36"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Scared. Heard shouting next door again last night, then a crash. Called the non-emergency line but they said it's just a 'domestic'. Feels like someone should do *something*.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports of shouting, crashing noises, and a feeling that someone should intervene suggest potential domestic violence. While the non-emergency line dismissed it as 'domestic', the escalating nature (shouting, then crashing) indicates a possible risk of harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 14:17:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so overwhelmed lately. Like I'm underwater. Reaching out because I don't know what else to do. Has anyone else felt this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being overwhelmed and seeking help. While concerning, there is no explicit mention of self-harm, suicide, or harm to others.",
    "detected_category": "other",
    "timestamp": "2025-12-25 14:16:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but it does not contain explicit mentions of self-harm, suicide, violence, or abuse. It's a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-25 14:15:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Narcan worked, thank god. Learn how to use it, people. Could save a life. Seriously shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event with the potential for psychological impact on the witness. While the immediate danger was averted by Narcan, the event indicates the presence of a life-threatening situation and could trigger secondary issues.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 14:14:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Scared me half to death. Reminded me of my brother... Anyone else feel like things are getting more volatile lately? Feeling really anxious now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the individual expresses anxiety and fear, there's no direct threat or mention of violence against themselves or others. The observation of a fight is the trigger for their anxiety.",
    "detected_category": "other",
    "timestamp": "2025-12-25 14:13:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Narcan saved him. Please, learn the signs of overdose. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A friend experienced a life-threatening overdose requiring Narcan intervention, indicating a significant and immediate safety risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 14:12:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. If you've been there, what helped?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a desire for help, suggesting a potential risk of self-harm or suicidal ideation. The user's willingness to reach out is a positive sign, but the presence of a 'dark cloud' and feelings of being 'low' warrant attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 14:11:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the ambulance on my block again. Another OD. This is getting too close to home. Is there anyone out there who knows how to help someone? I'm scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and concern about overdoses happening nearby, suggesting potential exposure to the risk of overdose for themselves or loved ones, along with a desire to learn how to help. While there's no direct threat to the author, the proximity of the overdoses elevates the risk from low to medium.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 14:10:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Like I'm underwater. Reaching out before I sink further. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of isolation and being overwhelmed ('underwater', 'sink further') which are potential indicators of a mental health crisis. The explicit act of 'reaching out' suggests a need for help but the intent remains ambiguous.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 14:09:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Felt so overwhelmed last night, almost relapsed. Reached out to a friend instead, and just talking helped. Still struggling today, but taking it one hour at a time. It's exhausting.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a near relapse, suggesting a potential escalation of a harmful behavior. While the individual reached out for help, the continued struggle and exhaustion indicate ongoing vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 14:08:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but there is no direct mention of self-harm, suicide, violence, or abuse. It's a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-25 13:26:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were strong, but I distracted myself with a movie. Small victory. Anyone else find specific things that help in those moments?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text mentions urges (potentially self-harm or substance related) but the person successfully distracted themselves. While a positive step, the presence of strong urges indicates a potential risk that needs monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 13:25:36"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of things I'd rather forget. Anyone else ever feel like violence just lingers, even when you're not involved? Need to process.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and experiencing emotional distress as a result. While unsettling, there's no indication of immediate danger to the author or others. The author is expressing a need to process the event, suggesting self-awareness and a desire to cope healthily.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 13:24:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. OD is real. Scariest night of my life. Learn the signs, carry Narcan. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose incident experienced by the author's friend, indicating a high risk event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 13:23:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. They're okay now, thank god. Makes you realize how fragile life is. Learn CPR, carry Narcan. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived the overdose, the event represents a significant health risk and potential for fatality. The suggestion to learn CPR and carry Narcan indicates an awareness of the ongoing potential for future similar incidents.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 13:22:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"He's been getting angry over nothing lately, then says I'm too sensitive. It's exhausting. Anyone else deal with this? Feels like I'm walking on eggshells.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional abuse and a feeling of being unsafe ('walking on eggshells'). While no explicit threats are mentioned, the pattern of anger and dismissiveness raises concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 13:21:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... rough. Walking on eggshells constantly. Anyone else ever feel like they're losing themselves in their own relationship? Feeling trapped. Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling trapped, which can escalate to more serious risks. The mention of \"walking on eggshells\" suggests a potentially abusive or volatile environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 13:20:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"It's hard to admit, but things at home have been rough. Constant put-downs, walking on eggshells... Feels like I'm losing myself. Anyone else been through this? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional distress and a potentially abusive environment, suggesting a risk of escalating mental health issues and potential for harm, although immediate danger isn't explicitly stated.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 13:19:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to resist, but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and difficulty resisting them, suggesting a potential for escalation. While not explicitly stating intent, the presence of urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 13:18:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend today, hope it helps. It's exhausting pretending to be okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost, overwhelmed ('underwater'), and exhausted from pretending to be okay. This suggests potential emotional distress and a possible risk of self-harm or suicidal ideation, although there is no explicit mention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 13:17:24"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out before it gets worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, hinting at a potential mental health crisis. The phrase 'reaching out before it gets worse' suggests an awareness of escalating distress and a desire for help, indicating a potential risk that requires attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 12:24:05"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing on the street, got really heated. Made me think of my sister. Scared for her sometimes. Anyone know good resources for DV help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text doesn't describe direct violence, it expresses concern for a sister potentially experiencing domestic violence, suggesting a risk of abuse. The question about resources implies a perceived need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 12:23:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw another ambulance downtown. Makes me sick. Lost my cousin last year to an OD. Please, if you're struggling, reach out. There's help. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a past overdose death, which is a significant health and safety risk. While not explicitly suicidal, the context of loss due to overdose and the plea for help suggest potential vulnerability in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 12:22:02"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Walking on eggshells constantly. Is this normal? Starting to feel like I'm losing myself. Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, a potentially unhealthy and unstable home environment ('walking on eggshells'), and a feeling of losing oneself. The user is also actively seeking help, suggesting they recognize the seriousness of the situation. While not explicitly stating harm, the situation described could escalate.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 12:21:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, but it was close. Please, if you're using, carry it. And look out for each other. It can happen to anyone. #overdoseprevention",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A person overdosed and nearly died, requiring Narcan. This indicates a life-threatening situation occurred.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 12:19:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Ugh, another wave of feeling completely overwhelmed. Trying to remember I've gotten through this before. Reach out, brain, reach out...",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates feelings of being overwhelmed but lacks specific details about self-harm, suicide, violence, abuse, or overdose. It expresses a desire to cope and remember past successes.",
    "detected_category": "other",
    "timestamp": "2025-12-25 12:18:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park yesterday. Scary stuff. Narcan saved him. Makes you think. Learn CPR, learn Narcan. You could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event that can be traumatic and highlights the presence of a dangerous situation requiring intervention. While the individual was saved, the risk of future overdoses in the area remains.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 12:17:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Been having a rough time lately. Urges are strong. Reached out to the crisis text line. It helped a little. Just trying to get through tonight.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and a recent attempt to seek help, suggesting a potential for self-harm or suicide. While help-seeking is positive, the continued struggle indicates ongoing risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 12:16:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed ('underwater'), and a lack of coping mechanisms. While not explicitly suicidal, the sense of desperation and reaching out indicates distress and a potential risk that requires attention.",
    "detected_category": "other",
    "timestamp": "2025-12-25 12:15:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, just need to get through tonight. It's a struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant and immediate risk to the individual's safety.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 12:14:51"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD...it's terrifying. Lost a friend last year. Please, if you're struggling, reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about overdoses and mentions the loss of a friend. While it doesn't explicitly state suicidal ideation or intent, the connection to overdose deaths and the call for help suggest a potential risk for individuals struggling with substance use or mental health issues.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 11:17:25"
  },
  {
    "title": "User Story: Abuse",
    "content": "> Been walking on eggshells lately. Partner gets so angry over nothing. Is this normal? Feeling trapped. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially abusive relationship, characterized by unpredictable anger and a feeling of being trapped. While not explicitly stating violence, the mention of 'walking on eggshells' and feeling 'trapped' raises concerns about emotional abuse and potential escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 11:16:24"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Froze. Wish I'd said something, anything. Feeling sick about it now. Anyone else ever witness something like that? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, even without direct personal harm, can create emotional distress and potential for escalation. The event itself is an act of violence (assault). While the poster is not directly threatened, the potential for future violence and the emotional impact warrant a 'medium' rating.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 11:15:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but it was too close. Please, everyone be careful out there and look out for each other. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A witnessed overdose requiring Narcan indicates a serious and immediate risk to life. While the individual survived, the phrase 'too close' suggests a near-fatal event, highlighting the severe and potentially lethal consequences associated with the situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 11:14:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking help):**\n\n> Been feeling so isolated lately. My partner's controlling behavior is getting worse, and I don't know what to do. Anyone else been through this? Need advice.\n\n**Option 2 (Sharing experience):**\n\n> Finally left. Years of emotional abuse chipped away at me. It's terrifying starting over, but I deserve better. There *is* a way out.\n\n**Option 3 (Raising awareness):**\n\n> People often think abuse is just physical. Gaslighting, isolation, financial control – it's all abuse. Know the signs. It matters.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates potential escalation of abuse and feelings of isolation, suggesting increased vulnerability. Option 2, while positive, implies past significant harm. Option 3 is general awareness.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 11:13:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to feel *something* is to hurt myself. I know it's not healthy, but it's hard to stop. Talking to someone feels impossible, but I know I need help. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes active self-harm ideation and behavior, along with a stated inability to stop and feelings of hopelessness regarding seeking help. This suggests a high risk of continued self-harm or escalation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 11:12:17"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports witnessing a violent assault resulting in unconsciousness. While the individual is not directly involved or threatened in the text, the event is concerning and could indicate a broader issue of violence in the area.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 11:11:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but shook me up. Learn how to use it, please. It can really save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was used successfully, an overdose occurred, indicating a potential ongoing risk of further overdose events in the community. The text also conveys significant emotional distress in the witness.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 11:10:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, and just taking it one hour at a time. It's hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 11:09:13"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel like anger's just simmering everywhere lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A violent altercation resulting in unconsciousness occurred, indicating a potential for serious injury. While not directly involved, the observer expresses feeling shaken, suggesting the event was impactful and potentially distressing.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 11:08:11"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight break out on my street last night. Scared me half to death. Makes you realize how quickly things can escalate. Anyone else feel like their neighborhood's changed lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning, but doesn't indicate direct involvement or ongoing threat to the author. The fear expressed suggests a negative experience, but the overall risk level appears low.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 10:18:42"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up. Is this normal now? Feel sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be traumatizing and trigger emotional distress. While the text doesn't indicate direct harm to the speaker, it shows significant emotional impact (shaken, sick) and raises a concern about increasing violence in the area.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 10:17:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. The yelling is constant, and now there's shoving. Feeling so alone. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes escalating physical violence (shoving) and emotional distress (constant yelling, feeling alone). While not explicitly stating intent to harm self or others, the escalation and feeling of isolation raise concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 10:16:39"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Just wanted to say if you're struggling too, you're not alone. Reaching out for help is okay, even if it feels impossible. 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and encourages seeking help, but does not contain any explicit mentions or direct indicators of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2025-12-25 10:15:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Again. Cleaned it, bandaged. Feels like I'm drowning. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a repeated self-harm incident ('messed up again', 'bandaged'), and expresses feelings of despair and hopelessness ('drowning'). This combination suggests a high level of distress and potential for further self-harm or suicidal ideation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 10:14:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is back and it's scary. Reached out to a friend, but it's still tough. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a current urge to self-harm, indicating an immediate risk to the individual's safety. Although the person has reached out for help, the struggle continues, highlighting the severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 10:13:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Just talking about it feels like a weight lifted. If you're struggling too, you're not alone. Reach out, please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of heaviness and encourages reaching out for help, suggesting emotional distress but no explicit intent of self-harm or suicide.",
    "detected_category": "other",
    "timestamp": "2025-12-25 10:12:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately, urges are back. Trying to distract myself but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges, suggesting a potential for self-harm. The individual is seeking connection and support, implying they are struggling to cope.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 10:11:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "> It's so hard to admit, but things at home have been bad. Constant yelling, put-downs... I feel so small. Anyone else gone through this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional distress (feeling small, lost) stemming from a potentially abusive home environment (constant yelling, put-downs). While not explicitly stating intent to harm self or others, the sustained negative emotional state and description of abuse warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 10:10:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but also indicates proactive coping by reaching out to a friend. No explicit mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2025-12-25 10:09:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad lately. Constant put-downs, isolating me from friends... Is this normal? Feeling lost and scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional abuse and isolation, leading to feelings of being lost and scared. While not explicitly stating harm, the situation warrants concern and further investigation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 09:19:48"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out downtown. So shaken up. Makes you realize how quickly things can escalate. Anyone else feel extra on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing the author to feel shaken. While unsettling, it doesn't indicate imminent danger to the author or others. The feeling of being \"on edge\" is concerning but not explicitly linked to a specific act of violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 09:18:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Seriously, learn how to use it. Could save a life. It did.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, requiring intervention. While the person survived, the situation highlights a significant risk of a life-threatening event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 09:17:45"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Never seen anything like that in person before. Feeling really anxious now. Anyone else ever experience something similar? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses anxiety and being shaken up after witnessing a fight, but doesn't indicate immediate danger to self or others. It's a reaction to a stressful event.",
    "detected_category": "other",
    "timestamp": "2025-12-25 09:16:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Things got really dark last night. Didn't think I'd make it through. Reached out to a friend, talking helped a little. Still feeling raw. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of not being able to make it through the night and feeling raw, indicating a potential crisis, although support was sought.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 09:15:42"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shaken. Makes you realize how quickly things can escalate. Anyone else feel on edge lately? Need to vent.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling shaken, but does not indicate direct involvement or immediate threat of violence towards the author or others. It expresses general anxiety and a need to vent, suggesting a desire for emotional support rather than an active safety risk.",
    "detected_category": "other",
    "timestamp": "2025-12-25 09:14:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank god. Makes you realize how close we all are to the edge. Anyone know where to get trained on how to use it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual who overdosed was saved, the text highlights a serious situation (overdose) and the potential for fatal consequences. The proximity to 'the edge' suggests a broader sense of vulnerability and risk within the community. The request for Narcan training indicates a concern for future overdose events.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 09:13:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"I keep making excuses for him. Said he was stressed, tired. But the yelling is getting worse, and last night... I'm scared. Anyone been through this? Feeling so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates escalating yelling, potential for physical abuse (last night...), and fear, suggesting a potentially dangerous situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 09:12:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, almost relapsed. Reached out to a friend instead. Still shaky, but glad I did. It's a daily battle, but gotta keep fighting. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a near relapse, implying a significant struggle with a potentially harmful behavior. While the person reached out for help, the risk is still present and requires monitoring.",
    "detected_category": "other",
    "timestamp": "2025-12-25 09:11:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He says he's sorry, it won't happen again, but then it does. Is this normal? I feel so alone. #domesticviolence #abuse #help",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a pattern of abuse and feelings of isolation, which are significant risk factors for escalation and potential harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 09:10:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a heavy cloud won't lift. Reaching out because I know I need to. Talking to someone feels impossible, but I'm trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a stated need for help, indicating a potential risk. While it doesn't explicitly mention suicidal ideation or self-harm, the significant distress and difficulty reaching out warrant a 'medium' severity assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 08:21:07"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so overwhelmed lately. Like I'm drowning. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feeling overwhelmed and like they are drowning, suggesting a potential mental health crisis and a need for support. The phrase 'don't know what else to do' indicates helplessness and elevates concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 08:20:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's a tough battle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating an immediate and significant risk to the individual's safety.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 08:19:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been yelling more, and last night... I don't even want to say it. Is this really normal? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes escalating yelling and an unspecified event the speaker is unwilling to describe, implying potential violence or abuse. The feelings of isolation exacerbate the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 08:18:02"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's getting harder to pretend everything's okay. The constant put-downs are chipping away at me. Anyone else feel like they're walking on eggshells all the time? Is this normal in a relationship?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling emotionally worn down by put-downs and walking on eggshells, indicating potential emotional abuse and distress. While not explicitly stating self-harm or suicidal ideation, the feelings of being worn down and questioning the normalcy of the relationship suggest a need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 08:17:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Frozen. Wish I'd said something, anything. Feeling sick about it now. Is there a right way to intervene in situations like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an act of violence (shoving) which could escalate and cause physical harm. While the text doesn't indicate immediate severe injury, the potential for escalation and the clear act of aggression warrant a medium severity rating.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 08:15:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just...heavy. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed, suggesting a potential mental health crisis. While not explicitly suicidal, the user is reaching out for help, indicating a need for support and intervention to prevent escalation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 08:14:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my apartment. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel unsafe in the neighborhood lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling and evokes feelings of unsafety. However, it doesn't indicate imminent or direct personal danger to the author. The event is in the past ('saw'), and the feeling of unsafety is general, not a specific threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 08:13:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Seeing someone actually get hurt... makes you realize how easily things can escalate. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence, but doesn't express any direct threat, intent to harm, or involvement in the violence. It primarily expresses a feeling of being shaken up and a general observation about escalation.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 08:12:55"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, feeling isolated... Is this normal? Starting to think I need help figuring this out. Anyone been through similar?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional distress, potential emotional abuse (\"constant put-downs\"), and feelings of isolation. While there's no explicit mention of self-harm, suicide, or violence, the distress and request for help indicate a need for intervention and further assessment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 08:11:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Just need to vent. Things escalated again last night. I'm starting to feel like I'm losing myself. Has anyone else been through this? How did you find the strength to leave?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of losing oneself and a desire to leave a situation, hinting at potential distress and a possible abusive relationship. While there's no explicit mention of harm, the escalation and loss of self warrant concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 07:19:55"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy get punched outside my work. Shook me up. Called the cops, but still feel sick. Anyone else ever witness something like that? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence is distressing, but the text doesn't indicate ongoing danger or immediate threat to the author or others. The author is shaken and seeks coping strategies.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 07:18:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "My neighbor just OD'd. Narcan saved him. Scared me straight. If you're using, please carry it. It could save a life, maybe even yours.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a recent overdose event requiring Narcan intervention, indicating an immediate risk and a vulnerable individual within the user's proximity.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 07:17:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. The urge to cut is back and stronger than ever. Trying to resist, but it's exhausting. Anyone else relate? Any tips for coping? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating a potential risk. While the individual is trying to resist, the intensity of the urge and feeling of exhaustion suggest a need for support and intervention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 07:16:51"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Just senseless. Makes you wonder what's going on with people. Feeling pretty shaken up today.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't directly indicate immediate danger to the individual or others. The speaker expresses feeling shaken up, suggesting psychological distress, but not an active safety risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 07:15:50"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside my building. Shook me up bad. Called the cops, but I feel so helpless. Anyone else witness something like this? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A violent assault has occurred, posing immediate physical danger to the victim and potentially ongoing risk if the perpetrator is not apprehended. The witness is also emotionally distressed.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 07:14:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Just trying to breathe and remember this feeling will pass. Reached out to a friend. Hope I can get through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a relapse in coping mechanisms and increased distress. While the person is actively seeking support, the presence of urges elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 07:13:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, with a call for help indicating potential distress. While not explicitly suicidal, the metaphor of being 'underwater' suggests a feeling of being suffocated and unable to cope, warranting concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 07:12:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, but it shook me up bad. Anyone else experienced this? Just feeling really raw and need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event that can lead to psychological distress and potential vicarious traumatization. While the person survived, the witness is exhibiting signs of needing support and processing the experience.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 07:11:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 74 (char 99)",
    "detected_category": "unknown",
    "timestamp": "2025-12-25 07:10:43"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. People just stood there filming. Is this normal now? Feeling sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is upsetting but does not indicate imminent danger or direct threat to the individual or others. The feeling of sickness is a reaction to the event, not necessarily a sign of severe risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 06:22:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Reaching out to a friend, but it's hard. Just need someone to listen, I think.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and a desire for connection. While distressing, it doesn't explicitly mention self-harm, suicide, or violence. The individual is reaching out, which suggests help-seeking behavior.",
    "detected_category": "other",
    "timestamp": "2025-12-25 06:21:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out before it gets worse. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 65 (char 90)",
    "detected_category": "unknown",
    "timestamp": "2025-12-25 06:20:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant yelling, controlling behavior... I feel trapped. Has anyone else gone through this? How did you find help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential for escalation due to ongoing emotional abuse and a feeling of being trapped. While not explicitly stating intent for self-harm or violence, the description suggests a high level of distress and a potential need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 06:19:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Just reaching out, hoping someone understands. Are there any resources that have helped you get through tough times?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of being overwhelmed and 'drowning,' suggesting significant emotional distress. While there isn't explicit mention of self-harm or suicide, the user is reaching out for help, which implies a need for support to cope with their current situation. The vague language necessitates caution.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 06:18:25"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Makes you think, ya know? Is it just me, or is everyone on edge lately? Wish people could just chill.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, indicating a potential for violence but not a direct threat or high likelihood of severe harm to the author or others. It expresses concern and unease rather than active participation or planning.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 06:17:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n\"Things got really bad last night. Reached out to a friend, but still feeling shaky. Anyone know good resources for when you're in crisis?\"\n\n**Option 2 (Sharing a small victory):**\n\n\"Urges were strong today, but I managed to distract myself with a movie. Small win, but it's something.\"\n\n**Option 3 (Raising Awareness):**\n\n\"It's not about attention. It's about pain. Please be kind to those who are struggling.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates a recent crisis and ongoing shaky feelings. While not explicitly stating suicidal intent, it suggests significant distress and need for immediate support. Option 2 shows progress but doesn't negate potential risk. Option 3 shows broader distress and emotional suffering.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 06:16:22"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is getting stronger. Reached out to a crisis line. Talking helps, even a little. If you're struggling too, please don't be alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a significant risk. While the person reached out for help, the active urge elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 06:15:20"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you wonder what people are going through to get to that point. Feeling really shaken. Anyone else witness it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be upsetting, but the text doesn't indicate immediate danger to the poster or others. The user expresses feeling shaken but not suicidal or intent to harm others.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 06:14:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Like I'm underwater. Reaching out before I sink further. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of isolation, being overwhelmed ('underwater'), and a request for help before the situation worsens, indicating potential suicidal ideation or self-harm risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 06:13:17"
  }
]