[
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. This is getting scary. Lost a friend last year... Please, if you're struggling, reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose death in the town and the author's personal loss of a friend, indicating a potentially escalating situation and heightened risk of further overdose incidents within the community. While not explicitly stating suicidal ideation, the reference to struggling and encouragement to reach out suggests potential mental health concerns.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 20:17:49"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Just trying to take it one day at a time. If anyone knows good coping mechanisms, please share. Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of being lost, suggesting a potential struggle with mental health and possibly a risk of acting on those urges. The vagueness requires caution.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 20:16:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicative of distress and potential mental health concerns. The phrase 'underwater' can suggest a feeling of being suffocated or unable to cope. Reaching out for help is a positive sign, but the underlying distress warrants attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 20:15:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just reaching out. If anyone knows what it's like to feel completely alone, please share how you got through it. Need some hope right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of loneliness and hopelessness but lacks specific ideation or plans for self-harm.",
    "detected_category": "other",
    "timestamp": "2025-12-13 20:14:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but lacks explicit mentions of self-harm, suicidal ideation, or harm to others. It reads more as a cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-13 20:13:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD. Makes me sick. Lost a friend last year. If you're struggling, please reach out. There's help available. Don't become a statistic. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose and the loss of a friend, suggesting potential emotional distress and vulnerability related to substance use. While not explicitly suicidal, the context implies risk for individuals struggling with addiction.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 20:12:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head, it feels like the only way to quiet them is to turn the volume up on the outside. I know it's not healthy. Trying to find better ways to cope. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with overwhelming thoughts and a potential reliance on unhealthy coping mechanisms to quiet them. The individual acknowledges the behavior isn't healthy and seeks alternative coping strategies, suggesting awareness but also a current inability to manage the internal distress effectively. This indicates a potential escalation if healthier coping mechanisms are not found.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 20:11:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Never thought I'd see something like that in person. Anyone else feel like things are getting more aggressive lately? Trying to process it all.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be disturbing, but the text doesn't indicate imminent danger to the author or others. The author expresses being shaken up but is mainly processing the event.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 20:10:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... Scares me, tbh. Lost my cousin last year. If you're struggling, please reach out. There are people who care. It's not worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear of overdose, referencing a personal loss (cousin) which indicates the issue is impactful and present. While not explicitly suicidal, it highlights vulnerability and the potential for self-harm related to substance use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 20:09:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just want to feel okay again. Talking to someone feels impossible, but I know I need to. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and a need for help, indicating potential mental health distress. Reluctance to seek help is a concerning factor.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 20:08:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Guy got knocked out cold. Shook me up. Makes you realize how quickly things can escalate. Anyone else ever witness something like that? Still processing it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was physically assaulted and knocked unconscious, indicating a potential for serious injury.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 19:16:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it's hard to breathe. Scared I might slip back to old coping mechanisms. Reaching out instead. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling overwhelmed and a fear of reverting to 'old coping mechanisms,' suggesting potential self-harm. The individual is reaching out for help, which is a positive sign, but the underlying distress indicates a moderate level of risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 19:15:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Woke up feeling anxious again. Still dealing with the emotional fallout from my last relationship. Gaslighting does a number on your head. Anyone else been through this? How do you start trusting your own judgment again?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes emotional distress and the aftermath of a potentially abusive relationship (gaslighting). While the individual is experiencing anxiety and difficulty trusting their judgment, there's no explicit mention or implication of self-harm, suicidal ideation, violence, or overdose. The user is reaching out for support, suggesting a desire to cope with the situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 19:13:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. If you've been there, what helped?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a call for help, suggesting potential risk of self-harm or suicidal ideation. While there is no explicit mention of self-harm or suicide, the persistent low mood and acknowledgement of needing help raise concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 19:12:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about another overdose. It hits hard, man. Lost my cousin last year. If you're struggling, please reach out. There are people who care. You're not alone in this fight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a recent overdose news story and the loss of a family member to overdose, which indicates potential for triggering or normalizing overdose behavior, especially for those already struggling with substance use. It also implicitly acknowledges the potential for overdose within the audience.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 19:11:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Please, if you're using, carry it. You could save a life. I'm still shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose, a life-threatening situation, even though Narcan was administered successfully. Witnessing an overdose also suggests a high-risk environment.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 19:10:54"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back, feels like I'm losing control. Reached out to a friend, just needed to vent. It helps to not keep it all inside.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and a feeling of losing control, suggesting a potential risk. Reaching out to a friend is a positive coping mechanism, but the intensity of the initial statement elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 19:09:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been so angry lately, and I'm always walking on eggshells. Is this normal? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests potential emotional abuse and a feeling of isolation, which could escalate to more severe outcomes if unaddressed. The mention of anger and 'walking on eggshells' indicates a potentially volatile situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 19:08:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before it gets worse. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost with a stated concern about escalation, suggesting potential but not imminent harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 19:07:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been feeling really isolated lately. My partner's been controlling who I talk to, and it's getting scary. Has anyone else dealt with this? Feeling lost and alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and controlling behavior by the partner, which can escalate. The mention of feeling 'scary' elevates the concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 19:06:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Everything feels pointless. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and pointlessness, and a lack of coping mechanisms. While not explicitly suicidal, the statement indicates significant distress and a vulnerability that warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 18:19:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is getting strong again. Reached out to a friend, but just needed to say it somewhere. It's a struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a high risk of potential harm. While the individual has reached out to a friend, the intensity of the urge requires immediate attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 18:18:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Relapsed again. Feels like I'm back at square one. Anyone know any good coping mechanisms that actually work? Feeling so lost.\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Scars are a reminder of a past I'm trying to leave behind. It's a daily battle, but I'm still here. You can be too.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"It's not attention-seeking. It's a sign of deep pain. Let's be kinder and more understanding to those struggling.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions relapse, feeling lost, and deep pain which suggests a potential risk to mental health and well-being, although not immediately life-threatening.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 18:17:54"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. The urge to cut is so strong. Trying to distract myself with music, but it's not really working. Anyone else been there? Just feeling so alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating a potential risk. While the individual is attempting distraction, its ineffectiveness and feelings of loneliness raise concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 18:16:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on Elm St. Shook me up. Called the cops, hope she's okay. Makes you realize how quickly things can escalate. Anyone else witness anything?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence was witnessed. While the extent of injury is unknown, the act of shoving someone constitutes a risk of harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 18:15:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is back. Reaching out to my therapist tomorrow, but tonight is rough. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses an urge to self-harm, indicating a potential risk. While the user is reaching out for help, the 'rough' night suggests immediate distress.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 18:14:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "Ugh, finally left. My head's a mess. Walking on eggshells for so long... anyone else feel totally lost after escaping? Just trying to breathe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates emotional distress and disorientation after leaving a difficult situation, but there's no explicit mention or direct indication of immediate danger to self or others.",
    "detected_category": "other",
    "timestamp": "2025-12-13 18:13:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm stuck in a hole. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being stuck, but doesn't contain any explicit mention of self-harm, suicide, or harm to others. It's a general cry for help and advice.",
    "detected_category": "other",
    "timestamp": "2025-12-13 18:12:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling pretty hopeless lately. Reaching out to a friend today, hoping it helps. Remember to check in on your loved ones.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of hopelessness but indicates reaching out for help, suggesting resilience and mitigating immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 18:11:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but it was way too close. Please, if you're struggling, reach out. There's help. I wish I knew how to help more.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potential for future incidents and indicates a risk in the community, even though the individual survived.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 18:10:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD at the park. Scariest thing ever. Narcan worked, thank god. Makes you realize how fragile life is. Learn CPR & how to use Narcan, please. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A person overdosed requiring Narcan, indicating a life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 17:16:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Old coping mechanisms came creeping back. Reached out to a friend instead, and it helped. Still shaky, but getting through it. There is hope.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of old coping mechanisms, suggesting a potential for self-harm or other negative behaviors. While the individual reached out for help and is 'getting through it,' the 'shaky' feeling and reference to old coping mechanisms warrant a medium severity assessment. The exact nature of the coping mechanisms is unknown, making it difficult to definitively categorize.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 17:15:17"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Finally left. Packing is terrifying, but staying was worse. Feel so lost and scared. Anyone know resources for leaving an abusive relationship? I'm in [State].\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the person has left an abusive relationship and feels lost and scared, seeking resources. This suggests a potential for increased vulnerability and risk of harm from the abuser or potential mental health crisis. While not explicitly stated, the situation warrants a 'medium' severity due to the increased risk factors associated with leaving an abusive situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 17:14:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm finally out. It's terrifying, but I can't go back. Anyone know resources for women escaping domestic violence in [City]? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual is in a vulnerable situation having just escaped domestic violence. The text indicates fear and a lack of resources, increasing the risk of further harm or a return to the abusive situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 17:13:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to a friend helped a bit, but it's still there. Gonna try to find a therapist. Hope things get better.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates feelings of being lost and overwhelmed, but also shows proactive steps to seek help (talking to a friend, seeking therapy). There is no explicit mention of self-harm or suicidal ideation, though the feeling of being 'underwater' could be metaphorically linked to distress.",
    "detected_category": "other",
    "timestamp": "2025-12-13 17:12:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Getting yelled at constantly, being told I'm worthless... I feel so trapped. Anyone else been through this? How did you get out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (yelling, verbal belittling) and feelings of being trapped, which can escalate to self-harm or suicidal ideation if unaddressed. While there's no explicit mention of those actions, the significant emotional distress warrants a medium severity rating.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 17:11:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Reached out to a friend, just feeling really overwhelmed. It helps to talk, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The resurgence of urges suggests a potential escalation of risk, but reaching out to a friend indicates a protective factor and active coping mechanism. Still, the feeling of being overwhelmed warrants concern and further assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 17:10:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank goodness. Makes you realize how close we all are to losing someone. Learn the signs, carry Narcan if you can. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, the text describes an overdose event, indicating a significant risk. The mention of Narcan suggests a potentially life-threatening situation was averted.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 17:09:05"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good lately. Constant put-downs, walking on eggshells... Feels like I'm losing myself. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of emotional distress and potential emotional abuse ('constant put-downs, walking on eggshells'). While not explicitly mentioning physical harm, the feeling of 'losing myself' and seeking help suggests a significant impact on the individual's well-being. The lack of specific details makes it difficult to assess the immediate risk, but the situation warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 17:08:04"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly low lately. Just reaching out because I don't know what else to do. If anyone has felt this way and found something that helped, I'm open to suggestions.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being 'incredibly low' and not knowing what else to do, suggesting distress and a potential for escalation. While it doesn't explicitly mention self-harm or suicide, the depth of negative emotion warrants a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 17:07:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just need to vent. Said he was sorry, promised it wouldn't happen again. It did. I feel so stupid for believing him. Anyone else been through this cycle? How did you break free?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a cycle of apologies and repeated harmful behavior, suggesting emotional distress and potential for escalation. The poster is seeking advice on breaking free, implying they feel trapped and potentially unsafe.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 16:18:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. The urges are strong. Trying to distract myself but it's hard. Anyone else get through this? Just need to know I'm not alone rn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual is experiencing strong urges and seeking support, suggesting potential self-harm or suicidal ideation. The phrasing 'bad day' and 'hard to distract' indicates distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 16:17:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like a dark cloud won't lift. Reaching out because I know I need to. Talking to someone feels impossible, but I'm trying. Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of sadness and low mood, with an indication of seeking help. No explicit mention of self-harm or suicide is present.",
    "detected_category": "other",
    "timestamp": "2025-12-13 16:16:51"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. My neighbor's been yelling for hours, things are being thrown. I called the non-emergency line, but they said they'd send someone 'when available'. Feeling helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The yelling and throwing of objects suggests a potential for violence. The neighbor is experiencing distress and potentially harming someone in their household, creating a potential safety risk for them and others. The slow response from authorities elevates the risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 16:15:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "Ugh, another fight. Walking on eggshells is exhausting. Is it always gonna be like this? Starting to think I need help... but where do you even begin?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of helplessness, exhaustion, and a desire for help within the context of conflict. This suggests potential emotional distress and a possible need for intervention, though there's no explicit mention of self-harm or suicidal ideation. The user is clearly struggling and contemplating seeking help, which warrants a medium severity assessment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 16:14:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. The urge to hurt myself is strong. Trying to resist, but it's exhausting. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating immediate risk. The individual is struggling to resist these urges and is seeking help, but the presence of the urge itself signifies a significant threat.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 16:13:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough lately. Constant yelling, and now he's started grabbing me. I feel so lost and scared. Has anyone else dealt with this? How did you find help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes escalating physical abuse (grabbing) and a feeling of being scared and lost, indicating a significant risk of harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 16:12:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Terrifying. Called 911, they're okay now. This needs to stop. Where can I learn how to help if it happens again?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event. While the person survived, the risk of future overdoses in the area, and the potential for the witness to experience psychological distress, indicates a medium severity.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 16:11:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me up. Please, if you're using, have someone with you & have Narcan. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose event indicates a high risk situation involving potential for death or serious harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 16:10:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scariest thing ever. They're okay now, thankfully. Please, if you're struggling, reach out. There are people who care. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Direct mention of an overdose incident suggests potential for further overdose events in the community or among individuals with similar struggles. While the person is reported as okay, the event highlights an immediate risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 16:09:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just wanted to say if you're struggling too, you're not alone. Reaching out feels impossible, but maybe we can find a little light together.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and struggling, but does not contain explicit mentions or direct indications of self-harm, suicide, violence, abuse, or overdose. It expresses a desire for connection and finding light together, suggesting a potential for seeking support rather than acting on negative thoughts.",
    "detected_category": "other",
    "timestamp": "2025-12-13 15:17:08"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Feeling so lost. Things escalated again last night, and I don't know what to do anymore. Is there anyone who understands this? I feel so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a possible escalation of negative events. The user expresses feeling lost, alone, and unsure of what to do, suggesting a potential crisis. While not explicitly stating suicidal or self-harm intentions, the escalation and feeling of being lost warrant concern.",
    "detected_category": "other",
    "timestamp": "2025-12-13 15:16:06"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Constant yelling, controlling behavior... I feel trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional and psychological distress due to controlling behavior and a feeling of being trapped at home. While there's no explicit mention of physical harm or suicidal ideation, the feeling of being trapped and the need to know they're not alone suggest a need for support and a potential escalation of the situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 15:15:05"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Finally left. Scared, but free. 10 years of walking on eggshells is enough. Anyone know resources for starting over with nothing?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a significant life change potentially involving a vulnerable situation (starting over with nothing) after a period of fear and stress (walking on eggshells). While not explicitly stating immediate danger, the vulnerability and emotional state suggest a potential for escalating risk if support is not found.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 15:14:03"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just needed to vent. Things got physical again last night. I feel so lost and alone. Does anyone know where I can find help? I'm scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates physical violence, fear, and a feeling of being lost and alone, suggesting a potentially dangerous situation. The phrase 'things got physical again' suggests a pattern of abuse. The user is actively seeking help because they are scared, indicating a high level of immediate risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 15:13:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, suggesting distress and a potential need for support. Reaching out indicates a willingness to seek help, but the intensity of the feelings warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 15:11:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. Yelling, then shoves. I feel so trapped. Anyone know resources for emergency housing? I need to get out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates escalating violence (yelling, shoves) and a feeling of being trapped, suggesting an immediate need to escape a potentially dangerous situation. The mention of emergency housing further reinforces the urgency and potential severity of the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 15:10:57"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's a struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a strong urge to self-harm, suggesting a high level of distress and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 15:09:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got bad again and I relapsed. I'm trying to get back on track, but it's hard. Anyone else been there? Just feeling so alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse and feelings of isolation can increase risk of self-harm or other negative outcomes. While not explicitly suicidal, the statement indicates a significant struggle and vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 15:08:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but it shook me up. Where can I learn to use it, just in case?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and suggests the presence of drug use in the area. While the individual survived, the potential for future overdoses exists, and the user is seeking to learn how to administer Narcan, indicating a perceived ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 15:07:52"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Wish I'd said something, anything. Feeling sick about it. Anyone else ever experience this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault indicates potential for escalation and further violence. While the original poster is safe, the victim is at risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 14:16:55"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his car mirror after a road rage thing. Scared me. Makes you wonder what's going on in people's heads. Anyone else feel like anger's just… everywhere lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes an isolated act of property damage due to road rage. While unsettling, it doesn't indicate imminent danger to the author or others, and the focus is more on the observer's fear and concern about general anger levels than a specific threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 14:15:54"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Day 3 clean, trying to focus on breathing. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 98 (char 123)",
    "detected_category": "unknown",
    "timestamp": "2025-12-13 14:14:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I feel so lost. Things escalated again last night. I don't even know who I am anymore. Has anyone else felt this way? How do you even start to get out?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, escalated conflict, and questioning identity, indicating distress and potential for self-harm or suicidal ideation, although no explicit plans are mentioned.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 14:13:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just needed to vent. Things got physical again last night. I feel so lost and ashamed. Is this normal? How do you even start to get out of this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates physical violence, a feeling of being lost and ashamed, and a desperate plea for help. The escalation to physical violence suggests a significant and immediate risk of further harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 14:12:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Constant put-downs, controlling behavior... I feel so trapped. Has anyone else experienced this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, suggesting a potential for escalating emotional abuse. The feeling of being 'trapped' also raises concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 14:11:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been...not good lately. Constant yelling, controlling behavior. Feels like walking on eggshells. Anyone else been through this? How did you cope? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive home environment characterized by yelling, controlling behavior, and a feeling of being trapped. While there's no explicit mention of physical harm, the described emotional distress and controlling behavior indicate a risk of escalation and potential harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 14:10:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Narcan saved them, but it shook me. Folks, please be careful out there. Know the signs, carry Narcan if you can. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the immediate crisis was averted, the text reports a drug overdose, indicating ongoing risk in the described environment and potential for future incidents. The call for caution and Narcan suggests the user recognizes a continuing threat.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 14:09:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just needed to vent. Things got physical again last night. I'm so tired of this. Does anyone know any resources for help? I feel so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 66 (char 89)",
    "detected_category": "unknown",
    "timestamp": "2025-12-13 14:08:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so lost lately. Everything feels heavy. Reaching out before things get worse. Anyone know good resources?\n\n**Option 2 (Sharing a Story):**\n\n> Was close to the edge once. Therapy & meds saved me. It DOES get better. Please don't give up.\n\n**Option 3 (Raising Awareness):**\n\n> Check in on your friends, even the \"strong\" ones. You never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses feeling lost and that things could get worse, indicating potential for escalation. Option 2 alludes to a past suicidal ideation. Option 3 promotes mental health awareness. While there is no explicit statement of intent for self-harm or suicide, the language in option 1 warrants a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 14:07:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude was getting pummeled. Makes you sick, you know? Called 911 but still feel awful. Anyone else see it? Hope he's okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violent assault. While the event is over, the description suggests a potentially serious physical injury to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 13:23:15"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his partner on the street today. Shook me up. Didn't know what to do. Is there a safe way to intervene in situations like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Observed violence. The witness is shaken but unharmed and unsure how to react, indicating no immediate danger to self or others. Severity is low because the incident has already occurred and the individual is seeking information.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 13:22:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He yelled again last night, said I was worthless. It's getting worse. Anyone know where to find help? I feel so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a possible escalation of verbal abuse. The feeling of being 'lost' and seeking help suggests potential for harm or self-harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 13:21:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately.  Little urges coming back.  Trying to distract myself, but it's hard.  Anyone else relate?  Just need to know I'm not alone.  #mentalhealth #selfharmrecovery",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of self-harm urges, suggesting a potential risk. While the person is attempting to distract themselves and seeking support, the presence of urges elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 13:20:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, but trying really hard to resist. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with urges, suggesting a potential risk. While the individual is actively resisting and seeking support, the presence of urges warrants a medium severity rating due to the potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 13:19:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Just reaching out... has anyone else felt like they're drowning? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and drowning, suggesting significant emotional distress and potential for self-harm ideation, although lacking explicit intent.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 13:18:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Relapsed after 6 months clean. Just need to remember I'm not alone and this feeling will pass. Taking it one day at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates increased vulnerability and potential for escalating substance use. While the individual expresses a desire to cope, the relapse itself is a significant risk factor.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 13:17:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. Scared, y'all. Lost a friend last year. If you're struggling, please reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and grief related to a recent overdose and a past loss. While not explicitly suicidal, the mention of overdose and the encouragement to seek help suggest vulnerability and potential risk within the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 13:16:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad. Walking on eggshells constantly. Is this normal? Feeling so lost and alone. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive environment ('walking on eggshells') and feelings of isolation, which can escalate to more serious safety risks if unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 13:15:02"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up. Dude just wouldn't stop, even when the other guy was down. Makes you wonder what's going on in people's heads. Anyone else feel this way sometimes?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence, which can be upsetting, but does not indicate immediate danger to the author or others. It expresses a general feeling of unease rather than a specific threat or intention.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 13:14:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being lost, which are risk factors for self-harm or suicidal ideation. The individual is reaching out for help, indicating a potential need for support and intervention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 12:22:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Trying to distract myself, but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges' returning and feeling overwhelmed, suggesting a potential risk of acting on those urges. While the individual is trying to distract themselves, the difficulty in doing so raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 12:21:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Please, if you're struggling, reach out. There's help available. Don't let it get that far. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a near-lethal event, although the exact cause is unclear. The phrases \"almost didn't wake up\" and \"Don't let it get that far\" indicate a potentially serious situation. The vulnerability of the author is shown through: \"Scariest thing ever. I'm still shaking\"",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 12:20:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scared me to death. Narcan saved them, but it shook me up. Where can I learn how to use it? Want to be ready if it happens again.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a significant event with potential for psychological distress. While the individual survived, the text indicates the observer was significantly shaken and is now actively seeking training to respond to future overdose events. This suggests a heightened awareness and concern about the possibility of future incidents, indicating a medium level of risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 12:19:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but shaken up. Learn CPR & how to use it, please. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, requiring Narcan intervention, indicating a significant health risk even though the person survived. Witnessing the event has caused emotional distress.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 12:18:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in our town. Scared me. Almost lost a friend last year. Narcan saves lives. Learn how to use it. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a recent overdose and a past near-fatal overdose of a friend, highlighting the potential for future overdose events. The call to learn how to use Narcan indicates an anticipation of future need.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 12:17:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is back. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a direct urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 12:16:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain any explicit mentions of self-harm, suicidal ideation, violence, abuse, or overdose. It appears to be a general expression of emotional distress and a request for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-13 12:15:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Makes you realize how easily things can go wrong. Please, if you're struggling, reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while not directly indicating imminent harm to the author, suggests potential exposure to traumatic events and highlights the prevalence of substance abuse issues. The call to reach out implies awareness of personal or community struggles.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 12:14:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs and yelling... I feel so small. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a negative home environment with emotional abuse, indicating potential for psychological harm. While not explicitly stating intent for self-harm or suicide, the feeling of being 'small' and asking for help suggests distress that warrants attention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 12:13:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a screen. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of numbness and detachment, indicating potential emotional distress and a need for support. While not explicitly suicidal, the plea for help suggests a significant decline in mental well-being and warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 11:16:02"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough. Walking on eggshells constantly. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 92 (char 117)",
    "detected_category": "unknown",
    "timestamp": "2025-12-13 11:15:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after 6 months clean. Disappointed in myself, but trying to remember recovery isn't linear. Gonna reach out to my therapist today.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential escalation of risk. While the individual expresses disappointment and intends to seek support, the relapse itself warrants a medium severity assessment.",
    "detected_category": "other",
    "timestamp": "2025-12-13 11:13:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Talking to my therapist tomorrow, but tonight feels so long. Anyone else relate? Just trying to get through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses a strong urge to self-harm and feelings of being overwhelmed, indicating immediate distress. Seeking therapy is a positive sign, but the immediate risk requires attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 11:12:57"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n\"Felt really low lately. Urges are back. Reached out to a friend, but it's still hard. Anyone else relate? How do you cope?\"\n\n**Option 2 (Sharing Experience):**\n\n\"Scars are a reminder of a dark time. Healing isn't linear, but I'm trying to be kinder to myself each day.\"\n\n**Option 3 (Raising Awareness):**\n\n\"It's not attention-seeking, it's a cry for help. Let's be more understanding and supportive of those struggling.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 mentions urges, indicating a potential risk of self-harm. While help is being sought, the persistence of urges elevates the severity. Option 2 mentions 'scars', implying past self-harm. Option 3 advocates for understanding cries for help, indirectly acknowledging a potential issue.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 11:11:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Punches thrown, yelling. Shook me up. Makes you wonder what's going on with people. Anyone else see it? Hope everyone's okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessed a fight, but no specific mention of serious injuries or escalation to a level suggesting widespread danger. More a description of a disturbing event.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 11:10:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Shook me up. Didn't know what to do. Wish I'd said something. Anyone else ever freeze like that? Feeling awful.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a violent act is disturbing, but the text describes witnessing, not experiencing, the violence. No immediate threat to the author or others is indicated, although the situation could escalate if the assault continues.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 11:09:53"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on the street. Shook me up bad. Reminded me of things I'd rather forget. Anyone else get triggered by stuff like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes being shaken up and triggered by a fight, but doesn't express intent to harm self or others. It seeks coping mechanisms, indicating a desire to manage distress.",
    "detected_category": "other",
    "timestamp": "2025-12-13 11:08:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is getting strong again. Reached out to a friend, hoping it helps this time. It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating an immediate risk to the individual's safety and well-being. While the individual has reached out for help, the intensity of the urge warrants a high severity assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 11:07:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so numb lately, like I'm watching life from behind glass. Reaching out because I don't know what else to do. Has anyone else felt this way? Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of numbness and detachment from life, indicating potential emotional distress and a need for support. While not explicitly suicidal, the feeling of being disconnected and reaching out for help suggests a moderate level of concern.",
    "detected_category": "other",
    "timestamp": "2025-12-13 11:06:48"
  }
]