[
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary. Narcan saved them. Please, learn how to use it, you could save a life. Knowing it gives me a little hope. Be safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a real-world overdose event requiring emergency intervention (Narcan). While the person was saved, the potential for fatal outcome indicates a significant risk. The text also hints at a general lack of safety in the downtown area.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 00:43:20"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight downtown last night. Just spiraled out of nowhere. Makes you think, you know? Is there anything we can actually do to stop that stuff from happening? Feels helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence but doesn't indicate direct involvement, intent to harm, or imminent danger. It expresses concern and helplessness rather than active aggression.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 00:42:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are strong, and I'm trying so hard to resist. Anyone else relate? Just feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions strong urges and feelings of isolation, suggesting a potential escalation risk if support is not received.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 00:41:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Just reaching out... has anyone else felt this way? Need some air.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 74 (char 99)",
    "detected_category": "unknown",
    "timestamp": "2026-01-13 00:40:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Naloxone saved their life. Carry it, learn how to use it. You never know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential risk of further overdoses in the area and the need for immediate intervention, though the individual survived due to naloxone. The advice to carry naloxone and learn how to use it emphasizes the seriousness of the situation and possibility of recurrence.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 00:39:14"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out at the corner store last night. Shook me up bad. Reminded me too much of things back home. Anyone else feel like violence is just... everywhere lately? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses distress and anxiety related to witnessing a fight, but does not indicate immediate danger to the author or others. It's a general observation and a request for coping strategies.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 00:38:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating distress and a potential need for support. The metaphor of being 'underwater' suggests feeling suffocated and unable to cope. Reaching out indicates a desire for help.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 00:37:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, but it shook me up. Anyone else dealt with this? Feels like it's happening way too often now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potential crisis situation and increased risk of future overdoses in the community. While Narcan was used successfully, the increasing frequency mentioned is concerning.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 00:36:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and overwhelmed, comparing it to being underwater. This could indicate a mental health crisis, depression, or suicidal ideation, even though it's not explicitly stated. The fact they are reaching out suggests they are seeking help, which is a positive sign, but the depth of their distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 00:35:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the gas station today. Scary stuff. Narcan worked, thank god. Made me realize how easily it could happen to anyone. Stay safe out there, folks. Look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was effective, the observation of an overdose incident indicates potential risk to others in the community, particularly those with substance use issues.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 00:34:06"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing in the street, got pretty heated. Reminded me of things at home growing up. Feeling anxious now. Anyone else feel triggered by stuff like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes feeling anxious and triggered by an argument, but doesn't explicitly mention intent to harm self or others. While the reference to a difficult childhood is concerning, the immediate risk appears low.",
    "detected_category": "other",
    "timestamp": "2026-01-12 23:16:56"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm underwater. Reaching out to a friend tonight. Just need to breathe.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but explicitly mentions reaching out to a friend and a need to breathe, suggesting coping mechanisms are being employed. There's no direct mention of self-harm, suicide, or other dangerous behaviors.",
    "detected_category": "other",
    "timestamp": "2026-01-12 23:15:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to hide the bruises. Said I was clumsy. Anyone else experience this? Feel so alone. Is this normal?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates potential physical abuse ('bruises', 'said I was clumsy'), emotional distress ('harder to hide', 'feel so alone'), and uncertainty ('Is this normal?'). The combination of these factors suggests a high risk situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 23:14:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urges are back, stronger than ever. Reached out to a friend, hoping it helps. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions feeling overwhelmed with stronger urges, suggesting increased risk. Seeking help is a positive sign, but the phrase \"just need to get through tonight\" indicates immediate concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 23:13:51"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD on the train today. Scariest thing ever. Narcan saved him, but damn. We need more access, more help. Anyone know where to find resources in the city?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Observed overdose event, indicating immediate risk to the individual and potential for similar events impacting others.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 23:12:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... feeling trapped. Anyone else been through this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving controlling behavior and feeling trapped, suggesting emotional abuse which carries potential for escalation and psychological harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 23:11:49"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel more on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling, but the text primarily expresses anxiety and awareness of potential danger rather than immediate threat or intent to harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 23:10:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at a party last night. Scary stuff. Narcan saved them, but shook me up bad. Please, if you're using, have someone with you and know the signs. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates the presence of potentially life-threatening substance use. While Narcan was effective in this instance, the underlying issue of substance use and potential for future overdoses remains a concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 23:09:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scariest thing ever. Narcan saved them. Please, if you're using, keep it on you. It could save a life. Where can I get more info/training?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a recent overdose event involving a friend, indicating a serious risk to individuals using drugs. The user is also seeking information and training, suggesting ongoing concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 23:08:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. I'm walking on eggshells all the time. Anyone else ever feel this trapped? Need to figure out a way out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a feeling of being trapped and walking on eggshells, suggesting a stressful and potentially unsafe home environment. The user is actively seeking a way out, which implies the situation is negatively impacting them and they are trying to find solutions, but there is no overt mention of self-harm, suicide, or violence.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 23:07:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, thankfully. Makes you realize how easily things can go wrong. If you're struggling, please reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, indicates a serious health and safety risk in the individual's environment. The text suggests potential exposure to drug use and its associated dangers.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 22:18:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scary night. Found my roommate unresponsive. Narcan saved them. Everyone, please learn the signs of OD and carry it. It's not just for \"junkies,\" it can happen to anyone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a potentially fatal overdose situation that required immediate intervention (Narcan). While the immediate danger has passed, the underlying risk of future overdose remains.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 22:17:00"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy get shoved on the subway. Everyone just looked away. Makes me sick. Is this normal now?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A physical assault occurred (shoving), indicating potential for injury. While the text doesn't explicitly state severe injury, the act of pushing someone on a subway platform is inherently risky.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 22:15:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, hoping it helps this time. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The return of urges suggests a potential escalation of a previous issue. Reaching out to a friend is a positive coping mechanism, but the statement \"It's exhausting fighting this\" indicates ongoing distress and a struggle to maintain control.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 22:14:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw my friend OD. Terrifying. Narcan saved them, thank god. Scary how easily it happens. Learn the signs, please. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a highly stressful and potentially traumatizing event. Although the person survived, the situation indicates a significant risk of future overdoses for the individual who overdosed and potential psychological distress for the witness.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 22:13:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Just want the noise to stop. Reached out to a friend. Talking helps, even a little. There's gotta be better ways to cope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses a desire for internal noise to stop, suggesting distress. Reaching out to a friend is a protective factor, but the underlying issue needs attention.",
    "detected_category": "suicide",
    "timestamp": "2026-01-12 22:12:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before things get worse. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost, hinting at potential mental health distress and a desire to prevent escalation. The statement \"Reaching out before things get worse\" indicates awareness and a proactive attempt to seek help, but the depth of the distress is unclear.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 22:11:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. Every little thing sets him off. Walking on eggshells constantly. Is this normal? Feeling so isolated. #domesticviolence #emotionalabuse",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse and a potentially volatile situation at home. While not explicitly stating physical violence, the phrase \"walking on eggshells\" suggests fear and control by another person, and the hashtag #domesticviolence raises concerns about escalation. Isolation is also a significant risk factor.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 22:10:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, stronger than before. Reached out to a friend, hoping it helps this time. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of strong urges, suggesting a potential escalation of risk. While the individual reached out for help, the phrase \"stronger than before\" and \"exhausting fighting this\" indicate significant distress and decreased ability to cope.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 22:09:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough week. Feeling so drained and hopeless. Talking to a friend helped a little, but it's still hard. Just putting it out there. Need to remember I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of hopelessness and being drained, but there are no explicit mentions of self-harm, suicide, or harm to others. The individual is seeking support and reminding themselves they are not alone, suggesting a desire for help and connection.",
    "detected_category": "other",
    "timestamp": "2026-01-12 22:08:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. Narcan saved their life, but shook me to the core. Please, if you're struggling, reach out. There's help available. I'm here to listen too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, the text describes an overdose incident, indicating a potential ongoing risk of future overdoses for the individual involved and potentially others in the same environment. The emotional distress expressed by the author also warrants attention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 21:18:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. Walking on eggshells constantly. It's never enough. Anyone else feel like they're losing themselves? Need to figure out how to get out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of being overwhelmed, losing oneself, and a desire to escape. While there isn't explicit mention of self-harm or suicide, the sentiment could escalate.",
    "detected_category": "other",
    "timestamp": "2026-01-12 21:16:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so overwhelmed lately. Relapsed after a few months clean. Just trying to take it one day at a time. Anyone else get through this? Feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety, coupled with feelings of being overwhelmed and alone, suggests increased vulnerability and potential for escalation of substance use. While not explicitly suicidal or harmful, the relapse poses a risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 21:15:57"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a fight outside the bakery today. Guy just snapped. It was scary how fast it escalated. Shaken up. Anyone else witness it? Hoping the victim is okay.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent fight can be traumatizing and indicate a risk of future violence in the area.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 21:14:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so overwhelmed lately. Like I'm drowning. Anyone know resources that actually help? I need to reach out.\n\n**Option 2 (Personal Story/Awareness):**\n\n> Thinking of my friend today. It's been a year. Please check in on the people you love. You never know what they're going through.\n\n**Option 3 (Expressing Feelings):**\n\n> Just having a really dark day. Everything feels pointless. Trying to hold on.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 3 expresses feelings of pointlessness and mentions \"trying to hold on,\" suggesting suicidal ideation though not explicitly stating intent. Option 1 indicates being overwhelmed and seeking help, a positive step, but still indicative of distress. Option 2 highlights loss and the importance of checking on others, which while generally positive, could be related to a personal struggle with mental health.",
    "detected_category": "suicide",
    "timestamp": "2026-01-12 21:13:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary. Makes you realize how quickly things can escalate. Anyone else feel like violence is just getting worse lately? Feeling shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't indicate immediate personal danger or involvement. The text expresses fear and anxiety but not active participation or direct threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 21:12:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> \"I'm having a really rough time. Urges are strong. Anyone know good coping strategies that actually work? Feeling lost.\"\n\n**Option 2 (Sharing Experience):**\n\n> \"It's been [Number] days clean. Still a struggle, but focusing on small wins. You're not alone if you're fighting too.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Just a reminder that self-harm isn't attention-seeking. It's a sign of deep pain. Be kind, always.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates active struggle with strong urges, suggesting a potential for self-harm. While not explicitly suicidal, the feeling of being 'lost' combined with strong urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 21:11:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so numb lately. Like I'm watching my life from behind a glass wall. Reaching out to a friend, feels impossible. Anyone else ever feel this disconnected?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of numbness and disconnection, but lacks explicit suicidal ideation, self-harm plans, or intent to harm others. While concerning, it does not present an immediate or high risk.",
    "detected_category": "other",
    "timestamp": "2026-01-12 21:10:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so heavy, y'know? Like needing to feel *something* else, even if it hurts. Trying to find healthier ways to cope, but it's hard. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to feel something, even if it hurts, and mentions difficulty finding healthy coping mechanisms. This suggests emotional distress and potential risk of self-harm, though not explicitly stated.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 21:09:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIP posts lately. Lost a friend to overdose last week. Scared. Where can I learn how to help someone who's overdosing? I need to know what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and a desire to learn how to help someone overdosing, indicating potential for future overdose situations and a reactive need for knowledge.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 21:08:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired of walking on eggshells. Every little thing sets him off. Is this normal in a relationship? Feeling lost and scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and fear within a relationship, suggesting potential for emotional abuse or escalation. The phrase 'walking on eggshells' and 'every little thing sets him off' suggest a controlling or volatile partner.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 20:19:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs are wearing me down. Anyone else ever feel this way? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post describes feeling worn down by constant put-downs, which suggests emotional distress and a potentially abusive situation. The user is also asking for help, indicating they recognize the need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 20:18:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is anyone else feeling this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, and a cry for help. While it doesn't explicitly mention self-harm or suicide, the metaphor of being 'underwater' suggests a sense of being suffocated or drowning in emotions, which warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-12 20:17:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me. We gotta look out for each other, folks. Knowing how to use it is so important. Be safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event, and while Narcan was effective, the individual's distress and call for vigilance indicates an ongoing risk within their community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 20:16:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's getting harder to pretend everything's okay. The yelling, the constant put-downs... I feel so small. Anyone else ever feel this way? Need to know I'm not alone. #abuse #domesticviolence #mentalhealth\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates ongoing verbal and emotional abuse, which can escalate and significantly impact mental health. While it doesn't explicitly mention immediate physical harm, the constant put-downs and feeling \"small\" suggest a potentially dangerous situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 20:15:33"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately, like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and reaching out for help, suggesting potential distress. The 'underwater' metaphor can imply suffocation or drowning, metaphors sometimes associated with feeling overwhelmed by suicidal ideation. While not explicitly suicidal, the vague nature of the plea warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-12 20:14:31"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get shoved on the train today. Scary how fast things escalate. Made me realize I need to learn some self-defense. Anyone know any good classes in the city?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent act (being shoved) indicates a potential risk of violence in the environment. While the reporter wasn't directly harmed, the incident was impactful and caused concern, suggesting a medium level of severity.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 20:13:29"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Frozen. Didn't know what to do. Feel sick. Anyone else ever witness something like that? What did you do? Need to process this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, even if not directly involved, can be distressing and may indicate an ongoing abusive situation. While the witness is not in immediate physical danger, the psychological impact and potential escalation of the violence warrant concern.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 20:12:27"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Dude got clocked hard. Makes you think, y'know? How close we all are to that kind of thing. Shook me up.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence is disturbing, but the text doesn't indicate ongoing danger or a high probability of immediate harm to the speaker or others. It expresses a sense of unease and reflection rather than direct threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 20:11:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Trying to stay strong and remember why I stopped. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse in urges and a struggle to cope. While not explicitly stating intent, the return of urges increases the risk of acting on them. Seeking connection suggests a desire for support, but the underlying struggle warrants attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 20:10:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Please, if you're struggling, reach out. There are resources. You're not alone. Know your limits and look out for each other. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event, indicating a risk of potential harm and death. While it promotes seeking help, the event itself suggests a tangible and recent safety risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 19:19:03"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Constant yelling, then the silent treatment... I feel so small. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially emotionally abusive environment. While there's no explicit mention of physical harm or immediate danger, the chronic yelling and silent treatment can significantly impact mental health and could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 19:18:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Explicit mention of a strong urge to self-harm indicates a high risk of potential harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 19:17:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Narcan saved his life. Scary reminder this stuff is real & deadly. Please, everyone, look out for each other. Learn the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a high level of immediate danger and potentially ongoing risk for the individual involved.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 19:15:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel extra anxious after witnessing something like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight caused anxiety, but there is no indication of direct threat, intent to harm self or others, or ongoing danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 19:14:57"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been feeling so isolated lately. Constant put-downs from my partner... is that normal? Starting to feel like I'm losing myself. Anyone else experience this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress due to isolation and put-downs from a partner, suggesting a potential for escalation of emotional or psychological abuse. The feeling of 'losing myself' hints at a diminished sense of self-worth and could lead to further mental health decline.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 19:13:55"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside my building. Shaking. Called the cops, but still feel sick. Anyone else ever witness something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can cause distress and anxiety, indicating a moderate level of risk to mental well-being. While not directly involved, the individual is experiencing negative psychological effects.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 19:12:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Paramedics got there fast, thank god. Makes you realize how easily it can happen to anyone. Is there anything we can do to help prevent this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event indicating potential harm and risk to others in the community, but it doesn't directly indicate immediate danger to the person reporting.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 19:11:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? How did you find help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, leading to feelings of isolation. While not explicitly stating physical harm, the situation indicates a potentially escalating risk for the individual's mental and emotional well-being.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 19:10:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It helps. If you're struggling too, please don't go through it alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, implying a potential for self-harm. Reaching out is a positive coping mechanism, but the presence of urges elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 19:09:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad lately. Constant yelling, walking on eggshells... I feel so isolated. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home environment with potential for emotional distress, isolation, and a desire for help. While not explicitly stating harm, the situation described can escalate if unaddressed. Walking on eggshells and constant yelling are indicators of potential abuse.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 18:22:29"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw two guys fighting outside my building last night. Scared the crap out of me. Made me realize how quickly things can escalate. Anyone else feel like there's been more anger lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't indicate immediate danger to the person reporting. It raises a general concern about increased anger in the community.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 18:21:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scariest thing ever. Narcan saved them, thank god. Makes you realize how fragile life is. Learn CPR/Narcan training. It can save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a significant event and indicates the presence of substance use and potential for future overdoses. The victim in this case was saved, but the risk of recurrence exists.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 18:20:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm underwater. Just reaching out. Anyone else ever feel this way? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not explicitly mention self-harm, suicide, or harm to others. It is a general expression of distress and a request for coping mechanisms, suggesting a desire to improve the situation rather than indicating immediate danger.",
    "detected_category": "other",
    "timestamp": "2026-01-12 18:19:23"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw two guys fighting outside my work today. Shook me up bad. Reminded me of my dad. Anyone else get triggered by stuff like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The individual expresses being shaken up and triggered by a fight, but there's no direct indication of self-harm, suicidal ideation, intent to harm others, abuse, or overdose. The trigger is related to a past experience (father), suggesting emotional distress but not immediate danger.",
    "detected_category": "other",
    "timestamp": "2026-01-12 18:18:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing I've ever witnessed. Narcan saved their life. Please learn the signs and carry it if you can. You never know when you might need it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event, indicating the presence of a potentially life-threatening situation. While the individual survived due to Narcan, the risk of future overdoses in the area, and the potential for encountering similar situations, warrants a 'medium' severity rating.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 18:17:20"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his girlfriend on the street today. Felt sick. Wish I'd said something, but I froze. Anyone else ever feel that helpless? What can you even DO?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence indicates potential for escalation and poses a risk to the girlfriend and potentially the witness.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 18:16:18"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Feeling so lost. He keeps saying it's my fault, that I make him angry. Is that...normal? I don't even know anymore. Hurts too much to talk to my friends about it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being blamed, potentially within an abusive relationship. The statement \"Hurts too much to talk to my friends about it\" suggests isolation and potential escalation of the situation. While not explicitly stating violence, self-harm, or suicidal ideation, the distress and isolation raise concerns.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 18:15:16"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back, stronger than before. Reached out to a friend, but feeling so alone. Any advice on coping when you feel like you're drowning?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of strong urges and feelings of being alone, suggesting a potential risk of self-harm or suicidal ideation. While the individual has reached out for help, the feeling of 'drowning' implies significant distress.",
    "detected_category": "suicide",
    "timestamp": "2026-01-12 18:14:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Glad they're okay, but it shook me up. Please, if you're struggling, reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates potential risk for the person who overdosed, although they are currently okay. The poster expresses distress, suggesting potential secondary trauma. It also indicates the presence of substance abuse within the poster's social circle.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 18:13:12"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a fight downtown last night. Dude got jumped. Scary how fast it escalated. Makes you think, y'know? Stay safe out there, everyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Describes a violent assault, implying potential for significant injury. While it doesn't threaten anyone specific, it highlights a real-world danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 17:20:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Paramedics got there fast, thankfully. Learn to recognize the signs & carry Narcan. It saves lives. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests potential psychological impact on the witness and highlights the risk of overdose in the community. While the paramedics responded quickly, the incident itself indicates a significant safety risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 17:19:27"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his car after getting a ticket. Scared me. Is that normal? Makes me worry about what happens behind closed doors, you know?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing an isolated act of anger directed at property, not a person. While concerning, it doesn't directly indicate imminent harm to self or others, but raises a general concern about potential for violence or abuse.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 17:18:25"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my kid's school. Shaking. Makes you wonder what's going on at home for some kids to act like that. Hurts to see. Anyone else feel helpless sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which indicates a potential for violence, but it's reported as a past event and doesn't directly involve the reporter or their child. The emotional distress expressed is personal and doesn't imply immediate danger to anyone.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 17:17:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I hate it. Trying to stay strong, but it's exhausting. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions the return of urges and feeling overwhelmed, suggesting a potential risk of self-harm or unhealthy coping mechanisms. While not explicitly suicidal, the feeling of exhaustion and seeking coping strategies indicates a need for support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 17:16:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan worked, thank God. This sh*t is too common. Learn CPR & how to use naloxone. It can save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred requiring Narcan intervention, indicating a significant health risk and potential for fatal outcome. While the person survived, the event highlights the presence of a dangerous situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 17:15:20"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a friend almost OD last night. Scary stuff. Naloxone saved their life. Carry it, learn how to use it. It really makes a difference. Please be safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing a near-fatal overdose indicates a high risk of potential harm to others in the friend group or community, and highlights the prevalence of dangerous drug use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 17:14:18"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy shove his partner on the street. Shook me up. Didn't know what to do. Wish I'd said something. Anyone else ever freeze like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the text describes an act of violence (shoving), it's a single, isolated incident reported by an observer. The observer expresses being shaken but doesn't indicate ongoing threat or direct harm to themselves. The immediate risk is low.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 17:13:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm drowning and no one can see me. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and unseen, suggesting potential emotional distress and a cry for help. While not explicitly mentioning self-harm or suicide, the intensity of the feelings and the act of reaching out indicate a need for support and raise concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-12 17:12:14"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately, like I'm underwater. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a lack of coping mechanisms ('don't know what else to do'). While not explicitly suicidal, the metaphor of being 'underwater' and the plea for help suggest significant distress and a potential risk of escalation if left unaddressed.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 17:11:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Thankfully, they were revived. Please, if you're struggling, reach out. There are people who care. It's not worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual was revived, the text describes an overdose incident, which carries significant risk of death or serious harm. The emotional distress expressed also warrants attention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 16:21:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Cutting again after 6 months clean. Feels like such a failure. Reached out to my therapist, waiting to hear back. Just needed to tell someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Relapse of self-harm after a period of abstinence (6 months) indicates a significant escalation of distress and a breakdown in coping mechanisms. The statement conveys feelings of failure and being overwhelmed, suggesting a high level of emotional pain. Although the person reached out to their therapist, the immediate risk remains elevated due to the recent self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 16:20:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Thank god for naloxone. Please, if you're using, have some on hand. It can save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a critical event indicating immediate danger to the individual who overdosed. The text highlights the life-threatening nature of the situation and implies a high risk of future overdose events for others.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 16:19:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n>  Things got really dark tonight.  Just trying to get through.  Anyone know good resources for dealing with urges?  Feeling lost.\n\n**Option 2 (Personal Story/Awareness):**\n\n>  It's been [Timeframe, e.g., 6 months] clean.  Hardest thing I've ever done.  Just a reminder that recovery is possible.  Keep fighting.\n\n**Option 3 (Struggling):**\n\n>  Felt like I was doing better, but the thoughts are back.  So tired of this battle.\n\n**Important Considerations:**\n\n*   **Brevity:** These are very short to fit character limits. Real posts might be longer.\n*   **Trigger Warning:** While I haven't included graphic details, the topic itself can be triggering.\n*   **Not a Replacement for Professional Help:** These are examples only and should not be taken as a substitute for mental health support. If you or someone you know is struggling, please reach out to a crisis hotline or mental health professional.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 directly asks for resources for dealing with urges, indicating active struggle. Option 3 mentions recurring thoughts and being tired of the battle, hinting at potential relapse or escalation. While Option 2 is positive, the overall context suggests a vulnerable state.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 16:18:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so incredibly lost lately. Like I'm drowning and can't find the surface. Reaching out because I don't know what else to do. Any advice or support would be appreciated.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 71 (char 96)",
    "detected_category": "unknown",
    "timestamp": "2026-01-12 16:16:58"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm finally out. It's terrifying & freeing all at once. Years of walking on eggshells... I'm exhausted. Any advice for rebuilding after emotional abuse?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a history of emotional abuse, which can have long-term psychological effects. The user describes feeling 'terrifying' which suggests potential fear for their safety or well-being. While not explicitly stating intent for self-harm or violence, the vulnerability following abuse warrants a 'medium' severity assessment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 16:15:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been walking on eggshells lately. Partner's moods are so unpredictable. I'm starting to feel like I'm losing myself. Anyone else experience this? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling emotionally destabilized and losing a sense of self, which can escalate into mental health issues. Unpredictable partner moods suggest potential emotional abuse or volatility in the relationship.",
    "detected_category": "abuse",
    "timestamp": "2026-01-12 16:14:54"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight break out downtown last night. Shook me up. Just walking home. Makes you realize how quickly things can escalate. Anyone else feel like violence is getting worse lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text doesn't indicate imminent danger to the individual or others. It expresses concern about increasing violence in general but does not mention specific threats or plans.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 16:13:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "Lost a friend last night. OD. Hurts so bad. Please, if you're struggling, reach out. Don't be afraid to ask for help. It's okay to not be okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes the overdose death of a friend, indicating potential grief and emotional distress for the author. While not directly suicidal, the context of overdose and urging others to seek help suggests increased risk for those struggling.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 16:12:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is back, stronger than before. Reached out to a friend, hoping it helps this time. It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly states a strong urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 16:11:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Narcan saved them. Please, learn how to use it. You could save a life. #overdose #Narcan #recovery",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a recent overdose event requiring intervention. While the person survived, the potential for fatal overdose remains a significant risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 15:20:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street. Yelling, shoving. I froze. It brought back bad memories. Anyone else get triggered like that? How do you cope? Feeling really shaky.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes being triggered by witnessing a fight, leading to feeling shaky and seeking coping mechanisms. While distressing, there's no indication of immediate danger or intent to harm self or others. The individual is seeking support, which suggests a proactive approach.",
    "detected_category": "other",
    "timestamp": "2026-01-12 15:19:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately, like I'm underwater. Just reaching out. Anyone else ever feel this way? Need to remember I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of loneliness and being lost, seeking connection. While concerning, there's no explicit mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2026-01-12 15:18:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Felt so overwhelmed lately. Things got dark again and I relapsed. Reaching out for support. Any advice on coping skills that actually work?\"\n\n**Option 2 (Personal Story/Awareness):**\n\n> \"It's been 6 months clean from self-harm. Still have urges, but fighting them. It's a tough journey, but recovery IS possible. You're not alone.\"\n\n**Option 3 (Sharing a Feeling):**\n\n> \"The urge to self-harm is so strong right now. Just trying to breathe through it. It's exhausting to constantly battle your own mind.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Synthetic generation",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 15:17:46"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my building. Makes me sick. How can people be so cruel? Wish I knew what to do to help stop this stuff. Feeling really shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is upsetting, but the text primarily expresses emotional distress rather than direct threat or risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-12 15:16:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scared. Found my roommate unresponsive. Narcan worked, but it was close. Learn the signs of OD, please. It can happen to anyone. Get trained. #naloxone #overdoseprevention",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Roommate found unresponsive and required Narcan, indicating a life-threatening overdose event.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 15:15:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before it gets too dark. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, potentially indicating depression or suicidal ideation. The phrase 'before it gets too dark' suggests a desire to seek help before a potential crisis point.",
    "detected_category": "suicide",
    "timestamp": "2026-01-12 15:14:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend, but it's hard. Just need a reminder that things can get better.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, potentially indicative of depression or a mental health crisis. The phrase 'underwater' suggests a sense of being trapped or suffocated. While not explicitly suicidal, the need for a reminder that 'things can get better' points to a degree of hopelessness requiring attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-12 15:13:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, thankfully. Makes you realize how fragile life is, and how close we all are to the edge. Get trained, carry Narcan, it could save someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, can be psychologically distressing and highlights the risk of drug-related harm in the community. While the individual survived, the event signifies a real and present danger.",
    "detected_category": "overdose",
    "timestamp": "2026-01-12 15:12:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a heavy cloud I can't shake. Reaching out because I know I need to. Talking to someone tomorrow. It's a start.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a need to reach out for help. While not explicitly suicidal, the mention of feeling 'low' and the need to talk to someone indicates a potential risk that needs to be monitored.",
    "detected_category": "suicide",
    "timestamp": "2026-01-12 15:11:33"
  }
]