[
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it feels like the only way to quiet them is to feel something else, even if it hurts. I know it's not healthy. Trying to find better ways to cope. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to self-inflict pain as a coping mechanism for overwhelming thoughts, indicating a potential risk for self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 18:22:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Reached out to a crisis line, just need to get through tonight. It's hard, but I'm trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions the return of the urge to cut (self-harm), indicating a potential escalation of risk. While the person has reached out to a crisis line, the statement of needing to 'get through tonight' suggests immediate and significant distress.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 18:21:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Relapsed after 6 months clean. Just reaching out... anyone else know this feeling? Need to remember I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential crisis. The user is feeling overwhelmed, which can increase the risk of further relapse or other negative coping mechanisms. Reaching out is a positive sign, but the relapse itself elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 18:20:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt that familiar urge again tonight. It's been a while. Reached out to a friend instead. Still shaky, but talking helped. It's a battle, not a defeat.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a recurrence of a potentially harmful urge, although the individual reached out for help and is managing the situation. The 'shaky' feeling suggests the urge was significant.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 18:19:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a friend OD. Scary stuff. Narcan saved their life. Learn CPR & recognize the signs, it could save someone you know. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing a drug overdose and the need for Narcan indicates a severe and potentially life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 18:18:21"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw two guys fighting outside my work today. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel like anger's just... everywhere lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate imminent danger to the speaker or others. It expresses concern about anger but does not imply direct involvement or threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 18:17:19"
  },
  {
    "title": "User Story: Abuse",
    "content": "I used to think it was normal to be yelled at for every little thing. Now I realize it's not okay. It's exhausting. Anyone else feel like they're walking on eggshells all the time? Is there a way out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of being yelled at and feeling like they are constantly walking on eggshells. This suggests a potentially abusive or emotionally volatile environment, which can have significant negative impacts on mental health and well-being. While not explicitly stating suicidal ideation or intent to harm others, the exhaustion and feeling trapped ('Is there a way out?') raises concern for potential escalation of distress. The level of potential harm is substantial, but it is not actively a crisis, and thus rated medium.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 18:16:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary stuff. Narcan worked, thank god. Makes you realize how fragile life is. Anyone know local resources for helping people struggling?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports an overdose event, indicating potential for future overdoses and potential fatalities in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 18:15:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan worked, thank goodness. Makes you realize how easily it can happen. Anyone know where to get trained on using it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose implies a potential for similar events, and the expressed concern about training suggests a perceived risk and desire to be prepared for future emergencies.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 18:14:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential domestic abuse (put-downs, controlling behavior, isolation). While there's no explicit mention of physical harm or suicidal ideation, the feeling of isolation and being in a potentially abusive environment raises concerns.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 18:13:12"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you wonder what people are going through to get to that point. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Reports witnessing a fight and feeling uneasy, but does not express intent or specific threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 17:22:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside the bar. Shook me up. Reminded me of my brother... Anyone else feel like anger's just simmering everywhere lately? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes a witnessed fight, which is a potential safety risk. However, it doesn't indicate imminent danger to the author or anyone else. The emotional distress expressed is likely related to the witnessed event and personal feelings.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 17:21:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Terrifying. Narcan saved them, but it shook me up bad. Anyone else dealt with this? Feeling lost on how to help my community.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event, and while the individual survived due to Narcan, the event indicates the presence of potentially life-threatening drug use in the community and the potential for future overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 17:20:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved their life. Please, learn how to use it. It's so important. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a recent overdose incident requiring Narcan intervention, indicating an immediate risk to individuals in the described environment. While the individual survived, the event signifies the presence of potentially lethal substances and a risk of future overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 17:19:41"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a crisis line, it helped a little. Just trying to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Strong urge to self-harm and feeling overwhelmed indicates a high risk of self-inflicted harm. Although the person reached out to a crisis line, the statement 'Just trying to get through tonight' suggests ongoing and immediate danger.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 17:18:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thank god. Makes you think, you know? Anyone else carry it? It's worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a potentially traumatic event and highlights the ongoing risk of overdose in the area. While the individual survived, the event indicates the presence of a dangerous situation and raises concerns about potential future overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 17:17:37"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on my street today. Guy just snapped. So scary how quickly things can escalate. Makes you wonder what's going on in people's heads, y'know?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is concerning, but the text doesn't indicate immediate danger or severe harm. The person is reflecting on the event rather than expressing intent to harm themselves or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 17:16:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm drowning. Reaching out because I don't know what else to do. If anyone's been through something similar, any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and drowning, indicating significant emotional distress and a lack of coping mechanisms. The phrase 'don't know what else to do' suggests a level of desperation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-14 17:15:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells lately. Partner's temper is getting scary. Anyone else experience this? Feeling so isolated. Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential for escalation of violence or abuse due to a partner's increasing temper and the feeling of being isolated and walking on eggshells. While there's no explicit mention of violence, the escalation and isolation are concerning.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 17:14:31"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Makes you wonder what's going on with people. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate imminent danger or a direct threat to the author or others. The feeling of being 'on edge' suggests anxiety but lacks specific details pointing to a severe risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 17:13:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice or just someone to listen?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating potential distress and a need for support. The statement 'I don't know what else to do' suggests a limited coping capacity.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 16:21:39"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get jumped on my street last night. Shook me up bad. Makes you realize how quickly things can turn. Anyone else feelin' on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes witnessing violence (an assault), it doesn't indicate imminent danger to the speaker or others. However, it expresses heightened anxiety and the potential for increased vigilance or fear, moving it beyond 'low'. The event witnessed was violent and impacted the speaker, indicating a medium level of concern.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 16:20:36"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the subway. Heart's still pounding. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While a violent act occurred (shoving), it appears to be an isolated incident and the reporter is expressing feelings of unease rather than direct involvement or threat. The potential for escalation is noted, but no immediate danger is indicated.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 16:19:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park today. Scariest thing ever. Narcan saved him, thank god. Makes you realize how close to home this is. Be safe, everyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while Narcan was administered successfully, indicates a serious and potentially life-threatening situation occurring in a public space. The emotional impact on the witness suggests the event was significant. While the immediate danger was averted, the presence of overdose is itself a risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 16:18:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get too much. Scratched again last night. Feeling so ashamed. Talking to my therapist tomorrow, I hope it helps. Just need to get through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates self-harm (scratching), feelings of shame, and distress. While the person is seeking help from a therapist, the self-harm behavior suggests a need for concern and monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 16:17:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. I feel trapped and scared. Has anyone else gone through this? How did you find help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feeling trapped and scared at home, which suggests a potentially unsafe environment. While there is no explicit mention of self-harm, violence, or abuse, the feelings of fear and being trapped warrant a medium severity assessment due to the potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 16:16:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Called 911, they're okay now. Learn CPR & Narcan, folks. It can save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose event indicates a high risk of potential fatality and severe health consequences for the individual overdosing, even though they are currently reported as okay.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 16:15:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. urges r strong. remember I'm trying to stay clean, gotta find a distraction. Anyone else feel this way sometimes? What helps?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges, suggesting a potential for relapse or self-harm. While not explicitly suicidal, the struggle is evident and requires attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 16:14:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's getting harder to hide the bruises. He says he's sorry after, but it keeps happening. Is this...is this abuse? I don't know what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes repeated physical harm and emotional distress, indicating a potentially dangerous abusive relationship.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 16:13:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scared me senseless. Narcan saved them, thank god. Makes you realize how close we all are to the edge. Learn CPR, carry Narcan if you can. It matters.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a significant safety risk in the community. While the person survived, the event highlights the potential for fatal outcomes and impacts mental well-being of witnesses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 16:12:21"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street. Yelling turned physical fast. Shook me up bad. Is there anything I can even do in that situation besides call the cops? Feel so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a physical altercation between two people, indicating a risk of harm to those involved. While the writer is not directly involved, the escalating nature of the fight suggests a potential for serious injury.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 15:20:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. Little things keep escalating. Walking on eggshells constantly. Anyone else experience this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes escalating stress and a feeling of being alone, suggesting a potential crisis. While not explicitly stating intent to harm self or others, the escalating nature raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 15:19:31"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Trying hard to resist, but it's tough. Anyone else relate? How do you cope? #selfharmrecovery #mentalhealth",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a current urge to self-harm, indicating a risk, although the individual is attempting to resist. The level of distress is elevated and immediate support is needed.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 15:18:29"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain explicit mentions of self-harm, suicide, violence, abuse, or overdose. The user is reaching out for connection, which suggests a desire for help rather than immediate danger.",
    "detected_category": "other",
    "timestamp": "2026-01-14 15:17:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, leading to feelings of isolation. While there is no explicit mention of physical harm or suicidal ideation, the situation described could escalate to further abuse or mental health crisis. The need for validation ('need to know I'm not alone') suggests significant emotional distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 15:16:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Scratched last night. Again. Feeling so ashamed and lost. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions self-harm (scratching) and expresses feelings of shame, loss, and being overwhelmed. While not explicitly suicidal, the presence of self-harm and these intense emotions indicate a need for concern and potential escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 15:15:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Relapsed after a rough week. Feeling so ashamed and lost. Anyone know good resources for getting back on track? I'm really trying.\n\n**Option 2 (Sharing Experience):**\n\n> Scars are just reminders of battles fought. It doesn't define me, but it's part of my story. Sending love to anyone struggling tonight. You're not alone.\n\n**Option 3 (Raising Awareness):**\n\n> It's not attention-seeking. It's a coping mechanism screaming for help. Let's try to understand instead of judging.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates relapse and feelings of shame and being lost, suggesting vulnerability and potential for increased risk if support is not provided. Option 3 references 'coping mechanism screaming for help' which alludes to possible suicidal ideation or self-harm tendencies.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 15:14:21"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight outside the grocery store today. Shook me up. Reminded me of things I'd rather forget. Anyone else feel like random violence is just... everywhere lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses unease and concern about perceived violence, but does not indicate immediate danger to the author or others. It's more of a generalized feeling of insecurity.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 15:13:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them. Please, learn how to use it. It could save a life, maybe someone you know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose event, a life-threatening situation. Although the person was saved, the event itself indicates a high level of risk for potential future overdose deaths or severe health consequences.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 15:12:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him. Makes you think... Everyone should know how to use it. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests the presence of a potentially life-threatening situation, even though intervention was successful. The statement implies risk to others who may be in a similar situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 15:11:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough lately. Walking on eggshells constantly. Never know what's going to set him off. Feeling so isolated. Anyone else been through this? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of potential emotional abuse and feelings of isolation, suggesting a heightened risk of mental health deterioration. \"Walking on eggshells\" and fear of setting someone off indicate a power imbalance and potential for unpredictable behavior from another person.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 14:20:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it could've been too late. Please, learn the signs. Know how to help. It matters.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a recent overdose event, highlighting the potential for fatal consequences, even though the person was saved. It also encourages awareness and intervention, suggesting that such incidents are not uncommon.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 14:19:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things aren't good at home. I feel so isolated and scared. Has anyone else dealt with this? I don't know where to turn.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of isolation, fear, and not knowing where to turn, suggesting a level of distress that warrants concern and potential need for support. While not explicitly stating suicidal or homicidal intent, the significant emotional distress elevates the risk beyond low.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 14:18:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Constant put-downs... I feel so small. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential verbal abuse, leading to feelings of worthlessness. While not explicitly stating intent to harm self or others, the persistent nature of the put-downs and the expressed feeling of being 'small' suggest a concerning situation that could escalate. The individual is also reaching out for validation, suggesting a need for support.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 14:17:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Narcan saved him, but it shook me up. Knowing it's out there... everyone, please be careful & look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan intervention was successful, the incident indicates the presence of potentially lethal substances in a public space and a person experiencing a life-threatening event. The 'shook me up' suggests a significant emotional impact on the observer as well. The advice to 'be careful' implies a continued risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 14:16:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it gets so loud in my head. Just trying to get through tonight without hurting myself. Anyone else feel this way? Reach out if you do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses a desire to avoid self-harm, indicating current distress and a potential risk. The statement \"trying to get through tonight without hurting myself\" suggests a struggle with self-harm urges.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 14:15:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. I feel trapped and scared a lot. Anyone know of resources in [City Name] that could help? I don't know where to start.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of being trapped and scared, suggesting a potentially unsafe situation at home. While not explicitly stating intent to harm themselves or others, the feelings of distress and seeking resources suggest a need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 14:14:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The statement expresses feelings of being lost and overwhelmed, coupled with a cry for help. While not explicitly suicidal, the feeling of being 'underwater' and not knowing what to do indicates significant distress and potential vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2026-01-14 14:13:24"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Just reaching out to say I'm not doing okay. Trying to find my way back up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and not okay, with metaphorical language suggesting distress ('underwater,' 'finding my way back up'). While not explicitly suicidal, the underlying despair indicates a potential risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-14 14:12:22"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight outside my kid's school. Shaking. Makes you realize how quickly things can escalate. Anyone else feel unsafe in their neighborhood lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and indicates potential for violence, but doesn't directly describe an immediate, high-risk situation for the original poster or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 14:11:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nUgh, rough day. Urges were strong. Managed to distract myself with a movie, but it's exhausting. Anyone else get that \"fight or flight\" feeling beforehand? Just trying to cope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 86 (char 111)",
    "detected_category": "unknown",
    "timestamp": "2026-01-14 13:30:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Glad they're okay now, but it made me realize how fragile things are. Please, look out for each other. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived the overdose, the event indicates a serious health risk and potential for future occurrences or impact on witnesses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 13:29:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but shaken up. Learn the signs, carry it if you can. It could save a life. Really.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was effective, the witnessed overdose indicates a significant risk of overdose in the individual and potentially the surrounding community. The experience was also traumatic for the witness, suggesting possible psychological impact.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 13:28:28"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. My heart is pounding. Didn't know what to do. Called the non-emergency line, but feeling so shaken. Has anyone else witnessed something like this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an act of violence (shoving) which constitutes a potential risk of physical harm to the girlfriend. While it's a single incident, the act itself warrants a 'medium' severity rating due to the potential for escalation or further harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 13:27:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight. Hope it helps. If you're struggling too, please don't give up. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed ('underwater'), which indicates distress. While it includes a message of hope and reaching out, the initial sentiment suggests a potential risk that warrants attention.",
    "detected_category": "suicide",
    "timestamp": "2026-01-14 13:26:25"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's so hard to admit, but things aren't okay at home. I feel trapped and don't know where to turn. Has anyone else been through this? Any advice on getting help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being trapped and not knowing where to turn, suggesting distress and potential risk, although specific actions are not mentioned.",
    "detected_category": "other",
    "timestamp": "2026-01-14 13:25:23"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things aren't good at home. Walking on eggshells constantly. Is this normal? Feeling so isolated. Need to talk to someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and isolating home environment, suggestive of potential emotional abuse or a situation causing significant distress. The phrase \"walking on eggshells\" points to a volatile or unpredictable situation. While not explicitly stating intent, the feeling of isolation and need to talk suggest the person is struggling.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 13:24:21"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Walking on eggshells constantly. Just need to vent somewhere safe. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home situation with the phrase \"walking on eggshells,\" suggesting potential for emotional or psychological distress. While not explicitly stating violence or abuse, the tense environment raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 13:23:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Cutting again after 6 months clean. Reaching out because I don't want this to spiral. Any advice on coping strategies that actually help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Relapse into self-harm after a period of abstinence indicates a significant crisis and potential for escalation. The individual's statement that they don't want it to spiral further emphasizes the need for immediate intervention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 13:22:18"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, walking on eggshells... Is this normal? Feeling so alone. Need to figure out my next step.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive home environment characterized by emotional distress, feelings of isolation, and a need to make a significant decision about the future. The phrase 'walking on eggshells' suggests fear and potential for escalating conflict, while 'constant put-downs' implies emotional abuse. While not explicitly suicidal or self-harming, the emotional distress warrants a 'medium' severity due to the potential for escalation and the expressed need to take action.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 13:21:16"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight on my street. Shaking. It's the third incident this month. Is this normal now? Feeling unsafe walking home. Anyone else experiencing this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing multiple fights in a short period and expressing feeling unsafe indicates a moderate level of risk due to potential exposure to violence and fear for personal safety.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 12:25:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. The urge to hurt myself is so strong. I don't want to, but it feels like the only way to cope. Has anyone else felt this? How do you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk. While the person states they don't *want* to, the urge is overwhelming and they are seeking coping mechanisms. This warrants immediate concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 12:24:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Narcan saved them. Please, if you're using, keep it handy. And look out for your friends. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event requiring Narcan intervention, indicating a serious and potentially life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 12:22:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling really overwhelmed lately. Urges are back. Anyone know any good coping strategies that actually work? Feeling lost.\n\n**Option 2 (Sharing Experience):**\n\n> Scars aren't something to be ashamed of. They're proof you survived something you thought would kill you. Still a long journey ahead.\n\n**Option 3 (Raising Awareness):**\n\n> Please check in on your loved ones, even the ones who seem okay. You never know what someone might be going through. Be kind.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 mentions feeling overwhelmed and having urges, indicating potential self-harm risk. While not explicitly stated, the presence of urges warrants moderate concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 12:21:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. Narcan saved them, but it shook me. If you're using, please have someone with you, and have Narcan. It can happen to anyone. Stay safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose, which is a life-threatening situation, even if the person was saved by Narcan. The event's impact is emphasized by the user's expressed fear and strong advice about safety measures.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 12:20:54"
  },
  {
    "title": "User Story: Violence",
    "content": "I can't sleep. Heard shouting next door again last night. Cops came, but I'm still shaken. Anyone else deal with this? Makes me sick to my stomach.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While there is no explicit threat or indication of immediate harm, the mention of police presence due to shouting next door, coupled with feeling shaken and physically ill, suggests a potentially escalating situation that could lead to future harm or psychological distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 12:19:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw ambulance lights flash. Remembered when my brother OD'd. Scariest night of my life. Please, if you're struggling, reach out. There's help available. Don't go through it alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a past overdose and expresses concern for others who may be struggling, suggesting potential for self-harm or overdose risk in others. While not directly indicating immediate danger, the emotional distress and call for help warrant a 'medium' severity.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 12:18:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my friend OD last night. Scariest thing ever. Narcan saved him. Learn CPR & know the signs, please. Could save a life. Feeling shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a traumatic event and indicates a significant risk of overdose in the person's social circle. While the friend survived, the event highlights the potential for future, possibly fatal, overdoses. The mention of Narcan indicates the user is aware of and potentially exposed to opioid use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 12:17:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Reached out to a friend, which helped a bit. Just trying to get through tonight. It's so hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a renewed urge to self-harm (cutting) and feelings of being overwhelmed. While the individual reached out to a friend, indicating some coping mechanisms, the intensity of the urge and difficulty getting through the night suggest a significant level of distress and ongoing risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 12:16:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's a daily struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a high risk of potential harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 12:15:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Luckily, they're okay now thanks to Narcan. Please, learn how to use it. It can save a life. It almost did.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived due to Narcan, a drug overdose is inherently life-threatening and represents a significant health risk. The statement mentions a close call ('It almost did').",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 11:19:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so incredibly lost lately. Everything feels heavy, and I don't know where to turn. Just reaching out... has anyone else felt this way? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't explicitly mention self-harm, suicide, violence, abuse, or overdose. It's a general expression of distress and a request for coping mechanisms.",
    "detected_category": "other",
    "timestamp": "2026-01-14 11:18:13"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his dog in the park. Shaking. Reported it, but feel sick. Anyone else witness this? Is there anything else I can do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence towards an animal can be emotionally distressing and may indicate a potential for future violent behavior by the perpetrator. The reporter also expresses distress, signaling a need for support.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 11:17:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things at home are getting scary. I don't know who to talk to, but I need help. Feeling so alone.\"\n\n**Option 2 (Sharing a Story):**\n\n> \"Took me years to realize it was abuse. Gaslighting messes you up. Finally free, but the scars are deep.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Control isn't love. It's a warning sign. If someone's isolating you, please know that's not okay.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates immediate distress and a need for help, suggesting a potentially escalating situation. Option 2 describes past abuse with lasting impact. Option 3 raises awareness of controlling behavior which is a precursor to abuse.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 11:16:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. The urge to just... feel *something* else is so strong. I'm trying to resist. Talking helps, even a little. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to feel something else, hinting at self-harm ideation or a desire to engage in risky behavior. While the individual is resisting and seeking support, the intensity of the urge elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 11:15:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Old coping mechanisms keep popping into my head. Trying to stay strong and reach out instead. Anyone else relate? How do you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions feeling overwhelmed and old coping mechanisms returning, which could indicate self-harm or suicidal ideation. The user is reaching out for help, which is a positive sign, but the potential for harm warrants a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 11:14:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Reached out to a crisis line, which helped a bit. Just trying to take it one day at a time. It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports of urges and struggles suggest potential risk. Seeking help from a crisis line is a positive step, but the exhaustion indicates ongoing difficulty.",
    "detected_category": "suicide",
    "timestamp": "2026-01-14 11:13:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Dude got decked, right in front of me. Made me realize how fragile things are. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but does not indicate imminent danger to the individual or others. The poster expresses being shaken, but not directly threatened or planning harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 11:12:03"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary. My hands are still shaking. Anyone else feel like things are getting more volatile lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and can cause anxiety, but the text doesn't indicate immediate danger or direct threat to the individual or others. It expresses fear and concern about general volatility, but doesn't specify further harmful intent.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 11:11:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nUgh, having a really rough night. The urges are strong. Just trying to breathe and remember this feeling will pass. Anyone else relate? Feeling so alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges and feelings of loneliness, suggesting a potential risk of self-harm or suicidal ideation. While there's no explicit mention of intent or specific plans, the intensity of the emotions warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 11:10:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD downtown. Terrifying. Narcan saved them, but it shook me up. Folks, please look out for each other and know the signs. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred requiring Narcan, indicating potential for severe harm or death. Although the person survived, the incident highlights the risk and potential for future occurrences.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 10:19:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. It's getting so bad around here. Makes you wonder if anywhere is safe anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate immediate or direct harm to the speaker or others. The concern about safety is general and not linked to a specific plan or threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 10:18:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary stuff. Narcan saved them, thank god. Makes you realize how easily it can happen. Stay safe out there, friends.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the individual survived, highlights the potential for fatal outcomes and widespread risk within the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 10:17:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, thank god. Seriously considering carrying it myself now. Anyone know where to get training around here?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a risk for potential future overdose exposure for the individual and others in their social circle. The person is also considering carrying Narcan, suggesting awareness of ongoing risk in their environment.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 10:16:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "Sometimes I feel like I'm walking on eggshells. Constant criticism, nothing I do is ever right. Is this normal in a relationship? Starting to feel really isolated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling isolated and experiencing constant criticism, which suggests emotional abuse. While not explicitly stating harm, the feeling of 'walking on eggshells' and isolation raises concern for potential escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 10:15:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Just reaching out to say if you're struggling, you're not alone. Seriously considering calling the hotline.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, and mentions considering calling a hotline, suggesting potential suicidal ideation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-14 10:14:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"It's so hard to admit, but things aren't good at home. Constant put-downs... isolating me from friends. Feels like I'm walking on eggshells. Anyone else been through this? Need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and social isolation, indicating potential for escalation and negative mental health impacts. The feeling of \"walking on eggshells\" suggests a tense and unpredictable environment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 10:13:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Walking on eggshells constantly. Anyone else feel like they're losing themselves trying to keep the peace? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling alone, losing oneself, and constantly walking on eggshells, which suggests a stressful and potentially harmful environment. While it doesn't explicitly mention self-harm or suicidal ideation, the loss of self and sense of isolation warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 10:12:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough. Walking on eggshells all the time. Anyone else been through this? Feeling so alone. 😔",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and potentially stressful home environment, possibly involving emotional or psychological distress. While it doesn't explicitly mention harm, 'walking on eggshells' suggests a potential for unpredictable or volatile situations.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 10:11:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad lately. Constant yelling, and now...other things. Feeling trapped and scared. Anyone know resources that can help? I need to find a way out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a situation involving 'constant yelling' and 'other things' which, combined with feelings of being 'trapped and scared' and a need to 'find a way out,' strongly suggests a potential for domestic violence or abuse. The user is actively seeking help, indicating an escalation of the situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 10:10:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, having a really rough night. The urge to self-harm is so strong. Trying to distract myself, but it's hard. Anyone else feel this way sometimes? Just feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating potential risk. While the individual is attempting to distract themselves, the intensity of the urge warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 09:22:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so heavy lately, like I'm underwater. Just reaching out... has anyone else felt this way? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and reaching out for support. While it indicates distress, there's no explicit mention of self-harm, suicide, or harm to others. It seems more like a general call for help dealing with difficult emotions.",
    "detected_category": "other",
    "timestamp": "2026-01-14 09:21:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant yelling, controlling behavior... I feel so trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a home environment with constant yelling and controlling behavior, indicating potential emotional and/or psychological abuse. The feeling of being 'trapped' suggests a significant level of distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 09:20:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Relapsed after 6 months clean. Just reaching out because I don't know what else to do. Any advice on coping skills that actually work?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety combined with feelings of being overwhelmed suggests increased vulnerability and risk of further negative outcomes. While not explicitly suicidal, the distress and loss of coping mechanisms warrant concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 09:19:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to stay strong and remember why I stopped. Any advice for coping when things feel unbearable?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse in urges, suggesting potential self-harm or coping difficulties that could escalate. While not explicitly suicidal, the feeling of things being 'unbearable' warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 09:18:39"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want the pain to stop. Seeing my therapist tomorrow, gotta remember I'm not alone in this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire for pain to stop, which is a potential indicator of suicidal ideation, though tempered by the mention of therapy and recognizing they are not alone.",
    "detected_category": "suicide",
    "timestamp": "2026-01-14 09:17:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been... not good. Constant yelling, control, and I feel so small. Anyone else been through this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving yelling and controlling behavior at home, leading to feelings of being small and lost. This suggests emotional distress and potential abuse, but lacks immediate threat of self-harm or harm to others. While not explicitly stated, the ongoing nature of the situation elevates the risk level.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 09:16:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but lacks any explicit mention of self-harm, suicide, or harm to others. It is a general expression of distress and a request for advice.",
    "detected_category": "other",
    "timestamp": "2026-01-14 09:15:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me up bad. Knowing how close we all are to the edge... Learn CPR, carry Narcan if you can. It really makes a difference.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose suggests a significant risk of severe harm or death. The proximity to others implied by 'we all' indicates potential widespread risk within the social group.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 09:14:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... it's scary. Lost a friend last year. Please, if you're struggling, reach out. There are people who care and want to help you get through this. It's possible.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about overdoses and mentions the loss of a friend, suggesting potential risk. While it encourages seeking help, the underlying vulnerability to overdose and grief warrants a medium severity assessment.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 09:13:31"
  }
]