[
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan worked, thank god. Makes you realize how fragile life is. If you're struggling, please reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with successful intervention, indicates potential exposure to harmful substances and the inherent risk of fatal outcomes. The mention of 'fragile life' suggests emotional distress and the potential for vicarious trauma.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 13:29:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my friend almost OD last night. Terrifying. Narcan saved his life. Learn the signs and carry it, please. It's real.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A friend experienced a near-fatal overdose, requiring Narcan intervention. This indicates a severe risk of harm and potential death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 13:28:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, walking on eggshells... I don't know what to do anymore. Feeling so lost. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential verbal abuse, creating a harmful environment. The user expresses feeling lost and hopeless, which suggests a need for support and intervention to prevent escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 13:27:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough patch lately. Feeling so drained and like nothing matters. Reaching out because I know I need to. If anyone has felt this way, how did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being drained, and indicates the individual is seeking help. While there is no explicit mention of self-harm or suicide, the overall sentiment suggests a moderate level of distress and potential risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 13:26:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want to feel *something* different. Scared I'll go too far one day. Anyone else feel this way? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to feel something different due to feeling overwhelmed and a fear of going too far. While not explicitly suicidal, it suggests potential self-harm risk and a need for help.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 13:25:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Scary stuff. Narcan saves lives. Learn how to use it, please. You could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a near-fatal event involving a friend who required Narcan, suggesting a significant risk of overdose and potential future occurrences.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 13:24:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been so angry lately, and I just... don't know what to do to make it stop. Is this normal? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of helplessness and fear in response to someone's anger, suggesting potential for escalating conflict or abuse. The uncertainty about the situation and the question of normality indicate a need for support and intervention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 13:23:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get too much, and I don't know how to cope. Just want to feel something other than numb. Talking to someone feels impossible rn. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses difficulty coping, numbness, and feeling overwhelmed, suggesting potential for self-harm or suicidal ideation. Lack of direct threat, but indicates significant distress.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 13:22:10"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel more on edge lately? Wish there was something we could do to make our streets safer.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Reports a fight, causing unease, but no direct threat or indication of active harm to self or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 13:21:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is back. It's scary. Reached out to a friend, hoping it helps. Anyone else relate? Need some strength right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a current urge to self-harm, indicating a high risk of potential harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 13:20:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. They're ok now, thank goodness. Makes you realize how easily things can go wrong. Look out for each other, folks. Naloxone saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event that indicates a risk of overdose in the community. While the individual survived, the potential for fatality is present and highlighted by the need for Naloxone.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 12:24:49"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing on the street, yelling escalated so fast. Made me so anxious. Happened to me once, still gives me shivers. Anyone else feel triggered by public fights?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes anxiety and being triggered by public arguments, but doesn't indicate imminent danger or harm. Past experience is mentioned, but current safety is not severely threatened.",
    "detected_category": "other",
    "timestamp": "2026-01-16 12:23:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Narcan worked, thank god. Learn the signs and carry it if you can. Could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential public health issue and the risk of repeated occurrences. While the individual survived, the situation highlights the accessibility of drugs and the potential for fatal outcomes. This also suggests the person writing this text might be exposed to risk of overdose.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 12:22:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just need to vent. Things escalated again last night. Feeling so lost and alone. Is this really my life now? Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, feelings of isolation, and a possible escalation of a negative situation. While not explicitly mentioning harm, the feeling of being \"lost and alone\" coupled with the question \"Is this really my life now?\" suggests potential hopelessness and requires further investigation to determine the nature and intensity of the situation. \"Things escalated again last night\" is vague but concerning.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 12:21:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Didn't want to, but I relapsed. Day 1 again. Reaching out for support this time. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse suggests potential for negative health outcomes. Expressing overwhelm and reaching out for support indicate distress and a possible need for immediate assistance.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 12:20:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and heavy, indicating emotional distress and a desire for support, but does not contain explicit mentions of self-harm, suicide, or harm to others. The person is reaching out, which suggests a willingness to seek help.",
    "detected_category": "other",
    "timestamp": "2026-01-16 12:19:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a glass wall. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of numbness and detachment, coupled with a plea for help, suggesting potential emotional distress and a lack of coping mechanisms.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 12:18:38"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend in the street. Froze. Called the cops after. Still shaking. Anyone else ever witness something like that? How do you even process it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the original poster is safe, the text describes a violent act (assault) occurring in public, indicating potential risk of harm to the victim and the possibility of escalating violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 12:17:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to stay strong and remember why I stopped. Reaching out to my therapist tomorrow. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential for relapse or self-harm, but the individual is actively seeking help from their therapist and trying to remember their reasons for stopping, which suggests protective factors are present.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 12:16:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm drowning. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost and drowning, indicating significant emotional distress and a cry for help. While not explicitly mentioning self-harm or suicide, the intensity of the feelings and seeking connection suggest a potential risk that needs to be monitored. The absence of specific plans or intent prevents it from being classified as high severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 12:15:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good lately. Walking on eggshells constantly. Anyone else ever feel completely drained by their relationship? Starting to think this isn't normal...\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a potentially unhealthy and draining relationship, possibly involving emotional abuse or a stressful environment ('walking on eggshells'). This could escalate into a more dangerous situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 11:18:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after a month clean. Disappointed but trying not to spiral. Reaching out to my therapist today. It's a process, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a vulnerability and increased risk, although the individual is actively seeking help and trying to manage the situation. The disappointment could escalate if not addressed.",
    "detected_category": "other",
    "timestamp": "2026-01-16 11:17:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Narcan worked, thank goodness. Please, learn the signs and carry it if you can. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, an overdose is a serious medical emergency with potentially fatal consequences. The message encourages preparedness, implying a risk of future incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 11:16:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. If you've been there, any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, suggesting potential distress and a need for support. While there's no explicit mention of self-harm or suicidal ideation, the phrase \"I don't know what else to do\" indicates a possible escalation of negative emotions.",
    "detected_category": "other",
    "timestamp": "2026-01-16 11:15:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved their life. Seriously, please learn how to use it. It's not hard and it can save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose event, which is a life-threatening situation requiring immediate intervention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 11:13:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my neighbor unresponsive. Narcan worked. Terrifying. Please, if you're struggling, reach out. There are people who care. Don't let it get to this point. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a neighbor found unresponsive and requiring Narcan, indicating a life-threatening overdose event that could have been fatal.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 11:12:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Trying to stay strong, but it's hard. Anyone else relate? Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges and feelings of isolation, which are risk factors for self-harm or suicide. While there is no explicit mention of intent or plan, the stated difficulty in staying strong warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 11:11:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got really bad last night, and I relapsed. I'm trying to stay safe now. Just needed to say it somewhere. Anyone else been there? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse and a desire to \"stay safe,\" suggesting potential risk, though the specific nature and immediacy are unclear. The feeling of loneliness also elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 11:10:55"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street, yelling & shoving. Made me remember things I try to forget. Anyone know resources for dealing with past trauma? Feeling really shaky.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes feeling \"shaky\" due to witnessing a fight, triggering past trauma. While concerning, it doesn't indicate immediate danger to self or others. The individual is actively seeking resources for dealing with trauma, which is a positive coping mechanism.",
    "detected_category": "other",
    "timestamp": "2026-01-16 11:09:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nUgh, having a really rough night. The urges are strong. Just trying to breathe and remember why I'm fighting this. Anyone else feel this way sometimes? Any tips that actually help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges, suggesting a potential for self-harm or relapse into unhealthy behaviors. While there's no explicit mention of self-harm, the intensity of the urges and the plea for help indicate a significant level of distress.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 11:08:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scary stuff. Narcan saved them, but it shook me up. Makes you realize how close it can be. Anyone know good resources for friends struggling?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, indicates a potential risk of future overdose events in the community and has a significant emotional impact on the observer. The request for resources also suggests concern for others potentially at risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 10:19:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need help. Talking to someone feels impossible right now. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a need for help, indicating potential risk. The reluctance to talk to someone directly increases the concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 10:18:14"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling shaken, but doesn't indicate direct involvement, intent to harm, or immediate threat. It expresses a general feeling of unease rather than a specific plan or danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 10:17:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just feeling so lost. Things at home have been... rough. Constant yelling, walking on eggshells. Anyone else ever feel like they're suffocating? Really need to talk to someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, suffocating, and needing to talk to someone, indicating emotional distress potentially stemming from a difficult home environment. While not explicitly mentioning self-harm or suicide, the intense feelings and cry for help warrant a medium severity rating.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 10:16:11"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a heavy cloud won't lift. Reaching out because I know I need to. If you've been there, what helped?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and a desire for help, but doesn't contain any explicit suicidal ideation or plans.",
    "detected_category": "other",
    "timestamp": "2026-01-16 10:15:09"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough. Constant yelling, put-downs. Feeling so small. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and feelings of worthlessness, which can escalate to more serious mental health issues if left unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 10:14:08"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing emotional distress but not indicating direct involvement, intent to harm, or immediate danger to the individual or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 10:13:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Reached out to a friend, feels a little better. Remember you're not alone if you're fighting this too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, implying a potential for self-harm or relapse. While the individual has reached out for help, the presence of urges necessitates a moderate level of concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 10:12:05"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just need to vent. Another fight, another broken plate. Walking on eggshells is exhausting. Is this normal? Feeling so lost and alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially volatile situation involving arguments and property damage (broken plate). While it doesn't explicitly mention physical violence directed at a person, the phrase \"walking on eggshells\" suggests a fear of triggering further conflict. The feelings of being \"lost and alone\" raise concern for the individual's mental wellbeing. Escalation of the conflict is possible.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 10:11:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit things aren't okay. He's always so sorry after, but the yelling... the put-downs... I'm starting to think this isn't normal. Anyone else been through this? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (yelling, put-downs) and expresses a feeling of being lost. While not explicitly stating physical harm or suicidal ideation, the described situation indicates potential for escalation and negative impacts on mental health, thus requiring attention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 10:10:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Terrifying. Narcan saved their life. Learn the signs, please. It could save someone you love. Resources are out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Friend experienced a life-threatening overdose event requiring emergency intervention (Narcan).",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 09:21:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Narcan saved him, thank god. Makes you think, you know? Check on your friends, people. It's closer than you think.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was administered successfully, the text describes a recent overdose, indicating a potential ongoing risk of overdoses in the community and highlights the importance of vigilance and support among friends.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 09:20:18"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get jumped on my way home. Shook me up. Called the cops, but still feel sick. Anyone else ever witness something like that? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault can cause significant distress and psychological impact, even without direct physical harm. The user expresses feeling \"sick\" and shaken, indicating a potential need for support.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 09:19:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Paramedics got there fast, thank god. Makes you realize how fragile life is. Learn CPR and carry Narcan, people. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a stressful event indicating potential risk in the community. While the person survived due to intervention, the event highlights the presence of a life-threatening situation and potential for future occurrences.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 09:18:14"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a guy shove his girlfriend on the street. Froze. Should I have done something? Feel sick about it now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be traumatizing and lead to feelings of distress. While the text doesn't indicate immediate danger to the person writing, it suggests a significant emotional impact and potential for vicarious trauma. The act of shoving someone is also inherently violent.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 09:17:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD...it hits different now. Lost my cousin last month. Please, if you're struggling, reach out. There are people who care and want to help. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a recent overdose death and expresses concern about others struggling, suggesting a potential risk of overdose or self-harm in the target audience. While it encourages seeking help, the personal connection to loss elevates the severity.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 09:16:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad brain day. Really fighting the urge to relapse. Just reaching out instead. Anyone else been there? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with urges to relapse, implying a potential risk of self-harm or substance use. Reaching out is a positive coping mechanism, but the presence of strong urges elevates the risk beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 09:15:08"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Constant put-downs are wearing me down. Anyone else experience this? Feeling so alone. Need to figure out how to cope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes persistent emotional distress and feelings of isolation due to ongoing negative treatment ('constant put-downs'). While not explicitly stating intent to harm self or others, the mention of needing to 'figure out how to cope' suggests a vulnerability and potential for escalation if the situation continues or worsens. The request for shared experiences indicates a search for validation and support, highlighting the individual's distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 09:14:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm underwater. Reaching out in case anyone else knows this feeling. It's heavy.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but lacks explicit details about self-harm, suicide, violence, abuse, or overdose. While concerning, it doesn't present an immediate threat.",
    "detected_category": "other",
    "timestamp": "2026-01-16 09:13:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my apartment. Shook me up. Makes you realize how easily things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and causes anxiety, but there's no indication of direct threat to the individual or others. The post expresses feeling 'on edge' which suggests mild distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 09:12:03"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. Constant yelling, then the silent treatment. I feel like I'm walking on eggshells. Is this normal? Anyone else experience this? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with emotional distress, suggesting potential for escalation. While not explicitly stating intent of harm, the feelings of isolation and walking on eggshells raise concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 08:22:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor OD last night. Scariest thing ever. Narcan saved him. Learn the signs, keep it handy. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event and indicates the presence of overdose risk in the community. While the person survived, the potential for future occurrences and the emotional impact on the witness justify a medium severity rating.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 08:20:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post that addresses suicidal feelings without glorifying or promoting suicide, and focuses on seeking help:\n\n\"Been feeling so low lately, like nothing matters. It's scary. Reached out to a friend, and I'm looking into talking to someone professional. Just gotta keep moving forward, one step at a time.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post directly mentions feeling 'so low' and acknowledges the feeling is 'scary,' which indicates suicidal ideation. While it also mentions seeking help, the presence of suicidal thoughts warrants a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 08:19:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get punched outside the bar. Shook me up. Called the cops but still feel sick. Anyone else witness that? Need to vent.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault can cause significant distress and potential psychological harm. While the user was not directly involved, the event was upsetting enough to prompt a call to the police and feelings of sickness.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 08:18:55"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Frozen. Didn't know what to do. Feeling sick about it. Is there ever a right way to intervene?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can cause psychological distress and the potential for escalation exists if intervention is attempted without proper training or support. The shove, while not described as severe, indicates a risk of further abuse.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 08:17:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Never seen anything like it. Shaken up. Makes you wonder what's going on with people. Wish I knew how to help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence but does not indicate the author is in imminent danger or planning violence themselves. It expresses concern and a desire to help, but lacks specific threats or immediate harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 08:16:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He says he loves me, but then he yells & controls everything. I feel so trapped. Is this normal? I don't know what to do anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a potential abusive relationship, feelings of being trapped, and a lack of understanding of what constitutes normal behavior. These factors suggest significant emotional distress and a potential risk of escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 08:15:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling really overwhelmed lately. Urges are back. Anyone know good coping mechanisms that actually work? Just need something to get through tonight.\n\n**Option 2 (Sharing Experience):**\n\n> Scars are a reminder of a dark time. Healing isn't linear, and that's okay. Be kind to yourself, always.\n\n**Option 3 (Raising Awareness):**\n\n> It's not about attention. It's about pain. Let's talk about self-harm openly so people know they're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates active urges, suggesting potential risk. While not explicitly suicidal, the need for immediate coping mechanisms raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 08:14:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved their life. Everyone should know how to use it. It's easier than you think. #overdose",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, which is a serious health event with potential for fatality. While Narcan was administered and saved the person's life, the inherent risk of overdose remains significant.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 08:13:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. They're okay now, thankfully. Makes you realize how fragile life is. Anyone know resources for learning about naloxone? Want to be prepared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event. While the person survived, the text indicates emotional distress and a desire for preventative action (naloxone training) which points to ongoing risk of future overdose exposure. The experience may lead to increased anxiety or fear related to drug use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 08:12:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. Feeling trapped and scared. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feeling trapped and scared at home, suggesting a potentially unsafe situation. While it doesn't explicitly mention violence, abuse, or self-harm, the user expresses distress and seeks validation, warranting concern. The lack of specifics keeps it from being high severity, but it is more than just low.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 07:21:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Relapsed after a few months clean. Feeling so ashamed. Reaching out to my therapist tomorrow. Just need to get through tonight.\n\n**Option 2 (Raising Awareness):**\n\n> Scars are stories, not weaknesses. Sending love to anyone fighting battles unseen. You're not alone.\n\n**Option 3 (Personal Story):**\n\n> It's been a rough week. The urge is strong, but I'm trying to use my coping skills instead. One day at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse mentioned, strong urges described, indicates potential for self-harm to cope but actively seeking help and using coping skills.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 07:20:07"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Did I do the right thing by calling the cops? Feel sick about it. Hope she's okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence indicates potential for escalation and harm to the victim. While the immediate threat might be over, the risk of further violence exists.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 07:19:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Terrifying. Please, if you're using, have someone with you or Narcan nearby. It could save a life. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Observed overdose suggests potential for further overdoses and highlights immediate life-threatening risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 07:18:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved their life, thankfully. Learn the signs, people. Could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, the event involved a life-threatening overdose, indicating a significant risk of harm.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 07:17:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown last night. Scary stuff. Narcan saved them, but it shook me up. Please, if you're struggling, reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a potentially traumatic event, indicating a risk of harm to the individual who witnessed it (psychological distress). The overdose itself represents a high-risk situation, but the reported outcome (Narcan saved them) mitigates some of the immediacy of the risk. The message encourages seeking help, implying a general awareness of risk within the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 07:16:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, feels a little better to not be alone with it. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential for self-harm. Reaching out to a friend is a positive coping mechanism, but the presence of urges warrants a moderate level of concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 07:14:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the bus stop. Shook me up bad. Reminded me of my brother. Wish there was something I could do to stop the anger, you know? Feels so pointless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and expressing feelings of distress and helplessness. While concerning, it does not explicitly express intent to harm oneself or others. The reference to past trauma suggests potential vulnerability, but immediate risk is not apparent.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 07:13:57"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a guy get shoved on the train today. Shook me up. People just watched. Makes you wonder, y'know? Is everyone okay? Feeling pretty raw rn.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, even without direct harm to the reporting individual, can be distressing and suggest a potential for further violence. The phrase \"shook me up\" and \"feeling pretty raw\" indicate a significant emotional impact.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 07:12:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Terrifying. Narcan saved them, but it shook me up bad. Please, everyone be careful out there and look out for each other. It can happen so fast.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a traumatic event with potentially lasting psychological effects for the witness. The overdose itself represents a severe and immediate health risk to the victim and the witness's distress suggests potential for vicarious trauma.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 07:11:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Relapsed after 6 months clean. Feeling so ashamed and lost. Reaching out to my therapist tomorrow. Just needed to say it somewhere.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of recovery can be a trigger for more severe actions. The feelings of shame and loss increase the risk. The user is reaching out for help, which is a positive sign, but the immediate risk is still elevated.",
    "detected_category": "other",
    "timestamp": "2026-01-16 06:23:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Thankfully, they're okay now. Narcan saves lives. Learn how to use it. You never know when you might need it. Please be safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, posing a significant health risk, though the individual survived due to Narcan. The potential for future occurrences remains.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 06:22:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt that familiar urge again tonight. Reached out to a friend instead. Still shaky, but glad I didn't give in. It's a tough battle.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a strong urge which suggests potential harm, but the person reached out for help and resisted the urge, indicating a degree of protective factors. This suggests ongoing risk, but not an immediate crisis.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 06:21:39"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Didn't know what to do. Wish I'd said something. Is there a right way to intervene in those situations? Feeling guilty.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault (shoving) indicates potential for escalation and further violence. While not directly involving the reporting individual, the potential for harm to the girlfriend is present, and the emotional distress of the witness is also a factor.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 06:20:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Everything feels heavy, and I'm not sure how much longer I can carry it. Reaching out for help feels impossible, but I know I need to. Any advice on where to start?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed, indicating potential mental health distress. While there is no explicit mention of self-harm or suicide, the statement \"not sure how much longer I can carry it\" suggests a concerning level of burden and potential risk. The individual acknowledges needing help but finds it difficult to reach out, which underscores the need for intervention.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 06:19:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad lately. Constant yelling, and last night... physical stuff. I don't know what to do. Feeling lost and scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates physical abuse and feelings of being scared and lost, suggesting immediate danger and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 06:18:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "I keep making excuses for him. Saying it was just the alcohol, just the stress. But the yelling is getting worse. Starting to feel scared. Is this normal?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates escalating yelling and a feeling of fear, suggesting a potential for harm. While physical violence isn't explicitly mentioned, the situation warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 06:17:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before it gets worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, hinting at potential mental health distress and a desire for help before things escalate. The phrase \"before it gets worse\" indicates a recognition of a declining state and a proactive, but concerning, outreach.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 06:16:31"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming. I relapsed last night after a few months clean. Feeling so ashamed and lost. Reaching out for support before it gets worse again. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates potential for escalation. The individual expresses feeling lost and ashamed, which are risk factors. Actively seeking help is a positive sign, but the overall situation warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 06:15:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Narcan worked, thank god. Made me realize how close we all are to the edge sometimes. Please be careful out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived due to Narcan, the overdose event indicates a significant risk to the individual involved. It also highlights the presence of dangerous substances and potential risk to others in the vicinity.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 06:14:28"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a fight break out downtown. Shook me up. Made me realize how much anger is simmering under the surface. Anyone else feel like things are getting more volatile lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text primarily expresses anxiety and observation rather than direct threat or involvement in violence. The commenter expresses worry about volatility but doesn't mention specific intent.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 05:21:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scariest thing ever. They're okay now, thankfully. Please, if you're struggling, reach out. There are people who care and want to help you. It's not worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, an overdose is a life-threatening event indicating significant risk. The text also suggests potential ongoing struggles that warrant attention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 05:20:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Talking to someone feels impossible right now, but I'm trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 64 (char 89)",
    "detected_category": "unknown",
    "timestamp": "2026-01-16 05:19:28"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed ('drowning'), indicating significant emotional distress and a potential risk of self-harm, although no explicit plans are mentioned.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 05:18:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need help. Talking to a friend later, but it's so hard. Any advice on getting through these moments?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a lack of motivation ('like nothing matters'), coupled with a stated need for help. While there's no explicit mention of self-harm or suicide, the depth of the negative feelings and the active reaching out suggest a significant level of distress that warrants concern and further assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 05:17:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Hard to keep going.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and struggling to keep going, suggesting emotional distress and potential for suicidal ideation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 05:16:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough lately. Constant put-downs, isolating me from friends... feels like I'm walking on eggshells. Has anyone else experienced this? I'm not sure what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, which can significantly impact mental health and potentially escalate. While not explicitly mentioning harm, the walking on eggshells feeling and seeking advice suggest a distressed state.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 05:15:22"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Cutting again after a long time clean. Hurts to admit it. Reaching out here feels like a start, I guess. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions self-harm ('cutting again after a long time clean'), indicating an immediate risk to the individual's safety and well-being.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-16 05:14:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a kid OD at the park yesterday. Scared me so bad. Narcan saved him, but damn. Makes you realize how close we all are to the edge. Please look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event requiring Narcan, indicating a serious, potentially life-threatening situation. While the child survived, the proximity to death and the impact on the observer suggest a significant level of risk and emotional distress.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 05:13:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Clean for a week and then relapsed. Feeling so ashamed. Anyone else get stuck in this cycle? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of shame and a relapse, indicating distress, but doesn't contain explicit threats or plans for self-harm or harm to others. It primarily seeks connection and validation.",
    "detected_category": "other",
    "timestamp": "2026-01-16 05:12:17"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a guy punch his girlfriend outside the bakery today. Frozen. Didn't know what to do. Still feeling sick about it. Anyone else ever witness something like that? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, especially domestic violence, can be psychologically distressing and potentially dangerous if intervention is attempted without proper training or support. While the poster wasn't directly involved, witnessing the event has caused them distress, indicating a potential impact on their mental wellbeing.",
    "detected_category": "violence",
    "timestamp": "2026-01-16 04:32:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Constant yelling, and now...other things. Feeling lost and scared. Is there anyone else who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential abuse ('other things') and expresses feelings of fear and being lost, suggesting a significant level of distress and potential danger.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 04:31:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary stuff. Narcan worked, thank god. Makes you think, you know? Anyone know where to get training around here?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose incident, indicating a potential for severe health consequences and possible death. While Narcan was administered successfully, the event signifies a significant risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 04:30:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so heavy lately, like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way? Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and seeking help, but there is no explicit mention or direct indication of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2026-01-16 04:29:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, thankfully. Please, if you're struggling, reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a dangerous situation with potential for fatality, even though the person survived. It also highlights the presence of drug use and potential for future overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 04:28:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Narcan saved them, but it really shook me up. Learn how to use it, folks. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, indicates a public health risk and potential for future occurrences. The call to action to learn Narcan suggests awareness of ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 04:27:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so heavy lately, like I'm underwater. Reaching out 'cause I don't know what else to do. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and reaching out for help, suggesting potential distress and a need for support. The mention of feeling 'underwater' can be interpreted as a metaphor for suffocation or feeling trapped, which warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-16 04:26:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street. Really escalated fast. I froze. Wish I'd done something, anything. Feeling sick about it. Anyone else ever feel this helpless?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the text describes a potentially violent situation, the author expresses feelings of helplessness and regret rather than indicating imminent danger to themselves or others. There's no direct threat or call for help.",
    "detected_category": "other",
    "timestamp": "2026-01-16 04:25:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. Narcan worked, thank god. Please, people, be careful out there. Know where to get Narcan. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event, while Narcan was successful, indicates a significant immediate risk in the community. The event was traumatic for the witness and highlights the potential for future overdose events.",
    "detected_category": "overdose",
    "timestamp": "2026-01-16 04:24:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs and control... I feel trapped. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a situation of emotional abuse and feeling trapped, suggesting potential for escalating distress. While not explicitly mentioning self-harm or suicide, the feeling of being 'trapped' is a significant risk factor for mental health deterioration.",
    "detected_category": "abuse",
    "timestamp": "2026-01-16 04:23:35"
  }
]