[
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. But damn, we need more awareness. Know the signs. Learn how to help. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A person experienced a drug overdose, which is a life-threatening medical emergency. While Narcan was effective, the incident indicates a significant risk of future overdoses and potential fatalities.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 02:49:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back, feel so overwhelmed. Reached out to a friend, just need someone to listen. It's a tough day.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of being overwhelmed, suggesting an elevated risk level. While the individual has reached out for support, the presence of urges warrants concern and closer monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 02:48:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Thankfully they're okay now. Please, if you're struggling, reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, the text describes a recent overdose event, indicating a significant risk of harm. The mention of struggling implies a potential for future similar events.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 02:47:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately, urges are back. Reached out to a friend, just needed to say it out loud. It helps, even a little. Remember you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, implying a potential risk of a harmful behavior. The individual has reached out for help, which is a positive sign, but the presence of urges elevates the risk level beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 02:46:42"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing emotional distress, but does not indicate direct involvement or immediate threat to the author or others. While unsettling, it doesn't suggest imminent danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 02:45:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good lately. Walking on eggshells constantly. Is this normal? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 96 (char 121)",
    "detected_category": "unknown",
    "timestamp": "2025-12-13 02:44:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Just going through the motions. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feeling numb and hopelessness, indicating potential emotional distress and a lack of coping mechanisms. Reaching out suggests a desire for help but the depth of the crisis is unclear.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 02:43:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just had another fight with my partner. Walking on eggshells constantly. Is this normal? Feeling so lost and alone. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes relationship conflict and feelings of isolation, but lacks explicit mention of self-harm, suicide, violence, or abuse towards oneself or others. While concerning, the risk is assessed as low without further indicators.",
    "detected_category": "other",
    "timestamp": "2025-12-13 02:42:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got decked, hard. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Reports observation of a fight but expresses feeling shaken. No direct threat or indication of intent to harm self or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 02:41:33"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Lost a friend last night to overdose. Feels like a nightmare. Please, if you're struggling, reach out. There are people who care and want to help you get through this. Don't let it be too late.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Indicates a recent overdose death, highlighting the potential for others struggling with similar issues to be at immediate risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 02:40:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home have been bad. Constant put-downs, controlling behavior... I feel so isolated. Has anyone else experienced this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving emotional abuse and controlling behavior, leading to feelings of isolation. While there is no explicit mention of physical harm or immediate danger, the situation could escalate if not addressed. The user is also seeking help which suggests they recognize it is not a healthy situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 01:46:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like a dark cloud won't lift. Reaching out because I know I need help. If you've been there, what helped you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a stated need for help, suggesting a potential for escalation if support is not received.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 01:45:06"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs & walking on eggshells. Anyone else experience this? Feeling so alone. Need to figure out a way forward.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 88 (char 113)",
    "detected_category": "unknown",
    "timestamp": "2025-12-13 01:44:05"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tomorrow. Hoping things get brighter.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of sadness and being lost, but indicates help-seeking behavior (reaching out to a friend) and hope for improvement. No immediate threats are indicated.",
    "detected_category": "other",
    "timestamp": "2025-12-13 01:43:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm stuck in a hole and can't climb out. Talking to a therapist, but some days are still so dark. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of depression, hopelessness, and being stuck. While the individual is in therapy, the continued presence of 'dark days' suggests the risk is not fully mitigated and warrants monitoring.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 01:42:02"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Constant put-downs, isolating me from friends... feels like I'm walking on eggshells. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (put-downs, isolation) which can escalate to more severe situations. While not explicitly stating suicidal ideation or self-harm, the emotional distress warrants attention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 01:41:00"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So messed up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and the user expresses feeling \"on edge\", indicating some distress but no immediate threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 01:39:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, stronger than before. Trying to resist, but it's exhausting. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges and feelings of being overwhelmed, suggesting a potential risk of acting on those urges. While there's no explicit mention of intent, the statement 'urges are back, stronger than before' warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 01:38:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend, but it's hard. Just need a little light.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and being overwhelmed ('lost,' 'underwater'). Reaching out is positive, but the statement 'hard' indicates difficulty and the need for 'light' suggests a desire to escape a dark situation. While not explicitly suicidal, the language used warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 01:37:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park today. Narcan saved him, thankfully. Scary stuff. Makes you realize how close we all are. Learn CPR, carry naloxone. It could save someone's life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potentially serious health and safety risk within the community. While the individual was saved, the event highlights the prevalence of drug use and the potential for fatal outcomes.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 01:36:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Constant put-downs are wearing me down. Anyone else been through this? How do you even start to feel better?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes consistent emotional abuse (\"constant put-downs\") which can lead to significant psychological distress and potentially escalate to other risks over time.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 00:44:14"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the bus stop. Shook me up. Is there anywhere to report this anonymously? Feel unsafe now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A fight occurred, indicating potential for physical harm to others. The person also expresses feeling unsafe, suggesting a real and present concern, though not explicitly targeting self or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 00:43:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling so overwhelmed lately. Reaching out to a friend tonight, gotta remember I'm not alone in this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and seeking support from a friend. While indicative of emotional distress, it doesn't explicitly mention self-harm, suicide, violence, abuse, or overdose. Reaching out to a friend is a positive coping mechanism.",
    "detected_category": "other",
    "timestamp": "2025-12-13 00:42:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, thank god. Carry it if you can, please. You never know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a serious health crisis and potential risk of future overdoses in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 00:41:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved their life. Learn how to use it, please. You could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a recent overdose incident, highlighting a potential risk of future overdoses in the community and the need for preventative measures.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 00:40:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so lost lately. Like I'm drowning and can't see the surface. Reaching out before it's too late. Anyone know of good resources?\n\n**Option 2 (Sharing a personal story):**\n\n> There was a time I didn't think I'd make it. It's okay to not be okay. Keep fighting. You are worth it.\n\n**Option 3 (Raising Awareness):**\n\n> Checking in on friends. You never really know what someone is going through. A little kindness can go a long way.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses feelings of being overwhelmed and a desire to seek help before it's \"too late,\" suggesting potential suicidal ideation or a crisis situation, meriting medium severity. While the other options are positive, the initial statement indicates a concerning level of distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 00:39:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He says he loves me, but then... the yelling. The control. I feel so lost. Is this normal? I don't know who to turn to.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional and verbal abuse. While there's no explicit mention of physical violence or intent to harm self or others, the increasing control and yelling, combined with the feeling of being lost, raise significant concerns about the individual's safety and well-being. Escalation is possible.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 00:38:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. My heart is still racing. Said something, hope she's okay. Makes me sick. Anyone else ever witness something like that? Feel so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed a physical assault, indicating a potential for escalation and direct harm to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 00:37:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "*   \"Been feeling so lost lately. Just wanted to say if you're struggling too, you're not alone. Reaching out feels impossible, but we gotta try. 💜\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and encourages reaching out for help, suggesting a struggle but not explicitly indicating immediate danger.",
    "detected_category": "other",
    "timestamp": "2025-12-13 00:36:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Should I have said something? Feel sick about it now. Wish I knew what to do in those situations.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a physical assault (shoving), which indicates a risk of further violence and potential injury to the victim. While the text doesn't directly indicate ongoing or escalating violence, the reported incident warrants concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 00:34:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"He yelled again last night, over nothing. I'm starting to feel like I'm walking on eggshells all the time. Anyone else relate? Is this normal in a relationship? I'm so confused.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional abuse (yelling, walking on eggshells) which can escalate to physical violence or significant mental health issues for the victim. The confusion and questioning of normalcy also indicates a vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 23:18:02"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train. Scary how fast things escalate. Reminded me of what happened with my brother last year. Still gives me nightmares. Anyone else deal with lingering anxiety after witnessing violence?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a violent incident (shoving on a train) and the witness experiencing lingering anxiety and nightmares, suggesting a potentially significant emotional impact. While not directly threatened, the trauma of witnessing the violence elevates the risk above 'low'.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 23:17:00"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post about suicide, aiming for authenticity and help-seeking, while staying under 300 characters:\n\n\"Feeling so lost lately. Like I'm underwater.  Talking feels impossible.  Anyone else been there?  How did you get through it?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post expresses feelings of hopelessness and being lost, and indicates difficulty in communicating. While it seeks help, these are all indicators of suicidal ideation. The direct question asking how others got through it suggests active consideration of ending their life.",
    "detected_category": "suicide",
    "timestamp": "2025-12-12 23:15:58"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Finally left. It's terrifying & feels wrong, but staying was worse. Scared but also... lighter? Any advice for navigating this mess? #abuse #domesticviolence\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a recent escape from an abusive situation, suggesting ongoing vulnerability and potential for escalated danger. While immediate harm isn't stated, the fear and uncertainty surrounding the situation, coupled with the abuse context, warrant a medium severity assessment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 23:14:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, rough day. The urge to relapse is so strong. Trying to stay distracted but it's hard. Anyone else feel this way sometimes? Just looking for a little support.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to relapse, which could indicate a potential escalation of risk depending on the substance or behavior involved. The individual is actively seeking support, which suggests they are aware of the danger and trying to cope, but the intensity of the urge raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 23:13:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, suggesting a possible mental health crisis. The user is reaching out for help, indicating they are aware of their distress but may not have the resources to cope. While not explicitly suicidal, the language implies significant emotional distress that could escalate.",
    "detected_category": "suicide",
    "timestamp": "2025-12-12 23:12:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Narcan saved them. Carry it, learn to use it. It could save a life. #overdoseawareness #harmreduction",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event indicating a potential risk of future overdoses in the area and the need for preventative measures.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 23:11:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling overwhelmed. Things got bad again. Reached out to a friend, but still shaky. Anyone know good online resources for dealing with this urge?\n\n**Option 2 (Sharing Experience):**\n\n> 2 weeks clean. Longest streak in months. Still a daily battle, but seeing the numbers go up helps.\n\n**Option 3 (Raising Awareness):**\n\n> It's not attention-seeking. It's a coping mechanism. If you see someone struggling, please just be there for them.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates feeling overwhelmed and struggling with an 'urge' which could be self-harm or substance-related. Options 2 and 3 provide additional context suggesting challenges in recovery and coping mechanisms.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 23:10:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to talk to someone. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a need for help, suggesting a potential risk that requires attention. While not explicitly stating suicidal ideation, the feelings of hopelessness warrant further assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 23:09:43"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Frozen. Didn't know what to do. Still shaking. Anyone else ever witness something like that? How did you react? Feeling so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, specifically a physical assault (shoving), indicates a potential risk of escalation and further harm. While the original poster was not the victim, witnessing such an event can cause significant distress and psychological impact, especially if they feel helpless to intervene.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 23:08:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things aren't good at home. Walking on eggshells constantly. Is this normal? Starting to feel like I'm losing myself. Anyone else been through this? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 99 (char 124)",
    "detected_category": "unknown",
    "timestamp": "2025-12-12 22:17:52"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his dog in the park. I yelled, but he just walked away. Shaking. Is there anyone I can report this to? Feel sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence against an animal can be emotionally distressing and indicates a potential for further violence. While the immediate threat is to the animal, the individual's shaken state and feeling sick suggest a potential psychological impact on the witness.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 22:16:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Just trying to make it through the day. Anyone else relate? Sending love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of being overwhelmed, suggesting a potential risk for self-harm or other harmful behaviors. While not explicitly stating suicidal intent, the mention of 'urges' warrants attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 22:15:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up yesterday. Scariest moment of my life. Narcan saved them. Please, learn how to use it, you could save someone you love. Reach out if you need help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a significant risk to life.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 22:14:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. If you've been there, what helped?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of persistent sadness and a need for help, which could indicate emerging mental health concerns and a potential risk for escalation if unaddressed. The user is actively reaching out, suggesting awareness of their distress, but the depth of the distress is unclear.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 22:13:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before it gets worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, with an implicit request for help before the situation escalates. This suggests a potential for self-harm or suicidal ideation, warranting attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-12 22:12:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them. Carry it, learn how to use it. It can happen anywhere.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event that indicates a potential health crisis in the community. While the person survived, the risk of future overdoses remains, and the event highlights a need for preparedness.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 22:11:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm stuck in a dark hole. Reaching out because I don't know what else to do. Is anyone else going through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being stuck, suggesting potential for self-harm. The individual is reaching out for help, indicating they are aware of their distress but may lack coping mechanisms.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 22:10:38"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train. Everyone just stared. Makes you wonder if anyone would actually help if things escalated. Feeling pretty shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A physical altercation (shoving) occurred, indicating a potential for violence. The observer expresses concern about the lack of intervention, suggesting a risk of escalation should the violence continue or worsen.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 22:09:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Relapsed again. Feels like I'm back at square one. Anyone know of any good coping mechanisms that actually work? Feeling so lost.\n\n**Option 2 (Sharing a personal experience):**\n\n> Scars fade, but the feelings don't always. Working on finding healthier ways to cope, one day at a time. It's a struggle.\n\n**Option 3 (Raising Awareness):**\n\n> Seeing a lot of people struggling lately. Please remember you're not alone and there are resources available. Reach out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses relapse and feeling lost, indicating potential vulnerability. Option 2 mentions scars, implying past self-harm, though currently coping. Option 3 shows concern but does not indicate self risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 22:08:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Ugh, been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to talk to someone. Any advice on finding help? Feeling really lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being 'low', mentions a 'dark cloud' that won't lift, and acknowledges needing to talk to someone due to feeling 'lost'. This indicates potential depression or a mental health crisis requiring support, but does not explicitly mention self-harm or suicidal ideation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 21:17:23"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shaken up. Makes you realize how quickly things can escalate. Anyone else ever witness something like that? Hard to shake it off.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can cause psychological distress and the potential for copycat violence is present.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 21:16:21"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a fight on my way home. Shook me up. Reminded me of my brother... Anyone else feel triggered by stuff like that? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses being shaken up and triggered by witnessing a fight, but doesn't indicate immediate danger to self or others. It is a request for coping mechanisms and support.",
    "detected_category": "other",
    "timestamp": "2025-12-12 21:15:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Didn't want to, but I relapsed. Day 1 again. Reaching out for support this time. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse can indicate a potential escalation of risk if not addressed. The individual is reaching out for support, which is a positive sign, but relapse itself is a concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 21:14:17"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's so hard to admit, but things at home haven't been good. Constant yelling, walking on eggshells... I feel trapped. Has anyone else been through this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home environment with constant yelling and feeling trapped, suggesting emotional distress and potential for escalation. While it doesn't explicitly mention violence or self-harm, the feeling of being trapped and walking on eggshells raises concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 21:13:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so small. Is this normal? Anyone else gone through this? Need to figure out my next step.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and controlling behavior, leading to feelings of diminishment. While not explicitly mentioning physical harm or suicidal ideation, the situation warrants concern and further investigation as it could escalate.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 21:12:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news report about another OD. Makes me sick. Lost my cousin last year. Please, if you're struggling, reach out. There are people who care and want to help. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and concern about overdoses and implies a possible struggle within the reader or their network, raising the risk of overdose or related self-harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 21:11:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Narcan saved them, but it really shook me. Anyone know where to get trained on how to use it around here? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be traumatic and lead to psychological distress. The mention of feeling helpless and seeking Narcan training indicates concern and potential for future encounters. Although the person survived, the incident itself represents a serious health risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 21:10:09"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things are rough. My partner keeps yelling and isolating me from my friends. Feels like I'm walking on eggshells. Anyone else been through this? Is this even abuse?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and social isolation, indicating a potential for escalation and negative mental health impacts. While not explicitly mentioning physical violence, the controlling and demeaning behavior warrants a 'medium' severity rating due to the potential for long-term psychological harm and possible escalation to physical abuse.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 21:09:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Trying to stay strong, but it's exhausting. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges' which suggests a potential for self-harm or other negative coping mechanisms. While not explicitly stated, the feeling of exhaustion and the need for connection suggest a vulnerability and a risk of escalation if support is not received.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 21:08:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIP posts lately. Lost a friend last week. Please, if you're struggling, reach out. There are people who care and want to help. Don't become another statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about recent deaths and encourages people struggling to seek help, indicating a potential risk of suicide or self-harm within the network of the poster. While not explicitly stating suicidal intent, the mention of 'RIP posts' and 'becoming another statistic' implies a heightened risk environment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-12 20:19:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. Narcan saved them, but shook me up. Please, if you're using, carry it. And know how to use it. It can save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose implies a high-risk situation for the person who overdosed and highlights the potential for future incidents. The text emphasizes the importance of Narcan, indicating the seriousness of the situation, even though the individual was saved.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 20:18:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and heavy, but lacks specific intent or plan for self-harm or suicide. Seeking help through conversation is a positive sign.",
    "detected_category": "other",
    "timestamp": "2025-12-12 20:16:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but no explicit mention of self-harm, suicide, or harm to others. Seeking connection suggests a desire for support.",
    "detected_category": "other",
    "timestamp": "2025-12-12 20:15:57"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Scared. My neighbor's been yelling again, sounds like things are getting thrown. Happened last week too. Should I call someone? Don't want to make it worse.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Potential for escalation of violence. Neighbor's yelling and throwing things suggests domestic disturbance which could involve physical harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 20:14:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary stuff. Please, if you're struggling, reach out. There are people who care. Don't let it be too late.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose, which, while not directly threatening immediate harm to the speaker, indicates a serious risk to others and indirectly highlights a potentially unsafe environment and the possibility of future occurrences. The call for help also suggests a broader risk within the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 20:13:54"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. Urges were strong, but I distracted myself. Small victory. Anyone else relate? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions strong urges and feeling overwhelmed, which could indicate a risk of self-harm or other negative behaviors. While the person distracted themselves, the intensity of the urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 20:12:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to a friend helped a bit, but it's still there. Gonna try to find a therapist this week. Wish me luck.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, with a possible inclination towards hopelessness. While actively seeking help, the feelings are persistent.",
    "detected_category": "suicide",
    "timestamp": "2025-12-12 20:11:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved their life, thank god. Makes you think. Learn the signs, carry Narcan if you can. It's not worth losing someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was successful, a person overdosing suggests a potential risk to others who may be experiencing similar issues, and highlights the dangers of drug use in the community. The text is advocating for preventative measures, indicating a level of concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 20:10:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"It's happening again. I feel so trapped. Does anyone know resources for emotional abuse? I need to figure out a way out.\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Just realized my relationship wasn't 'passionate,' it was controlling. Took me years to see it. Healing is HARD.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Gaslighting is REAL. Don't let anyone make you doubt your sanity. Trust yourself. You're not crazy.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates a person is currently experiencing emotional abuse and feels trapped, suggesting a heightened level of immediate risk. Options 2 and 3 are reflective and educational but do not indicate imminent danger.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 20:09:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I keep making excuses for him. Saying it's just stress. But the yelling, the insults... it's getting worse. I feel so lost. Has anyone else been through this? How did you find the strength to leave?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes escalating verbal abuse and the victim feeling lost, suggesting a potentially dangerous situation that could escalate further. The question about finding the strength to leave implies a desire to escape an unsafe environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 19:17:01"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw two guys fighting outside my work today. One was bleeding bad. Shook me up. Anyone else feel like things are getting more aggressive lately? Makes me scared to walk home.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a violent altercation resulting in visible injury (bleeding). While the individual is not directly involved or threatened beyond feeling scared, the observed violence constitutes a potential safety risk. It also expresses fear of future harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 19:15:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to a therapist, but some days are still really dark. Just trying to take it one hour at a time.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 62 (char 87)",
    "detected_category": "unknown",
    "timestamp": "2025-12-12 19:14:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Just reaching out to see if anyone else understands. Talking feels impossible.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and lack of motivation, which could indicate depression or suicidal ideation. While there is no explicit mention of suicide, the statement 'like nothing matters' warrants attention and concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-12 19:13:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary. My hands are still shaking. Is there anything we can do to help people who are struggling like that? Feels so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning, but doesn't indicate direct harm to the author or an immediate, ongoing threat. The author expresses fear and concern, but not an intent to engage in harmful behavior.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 19:12:53"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of things back home. Anyone else feel like violence is just… everywhere lately? How do you guys cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feeling shaken by witnessing a fight and a general feeling of increased violence. While concerning, it does not indicate imminent harm to self or others. It's a general observation and request for coping mechanisms.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 19:11:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly low lately. Like I'm underwater. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and a sense of hopelessness, along with explicitly stating a need for help. While not directly suicidal, the intensity of the distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-12 19:10:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Been feeling trapped lately. My partner's always checking my phone, and it's escalating. Anyone know resources for emotional abuse?\"\n\n**Option 2 (Sharing a Story):**\n\n> \"It took me years to realize yelling and constant put-downs weren't 'normal.' Therapy helped me see it was abuse. You're not alone.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Control isn't love. Gaslighting isn't a joke. Abuse can be subtle, but it's never okay. Know the signs.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, which can escalate to physical violence. The individual is seeking resources, indicating a need for help and a potential risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 19:09:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the park. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing the author to feel shaken and on edge. While unsettling, it doesn't explicitly indicate imminent danger to the author or others, nor does it suggest any direct involvement. It's a reaction to a witnessed event.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 19:08:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scariest thing ever. Narcan saved his life, but I'm still shaken. If you're using, please carry it. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a highly distressing event, and the fact that Narcan was needed indicates a life-threatening situation. While the friend survived, the experience implies a significant risk of future overdoses involving the individual or others in their social circle.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 19:07:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mentions of self-harm, suicide, or harm to others. It seems like a general expression of emotional distress and a request for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-12 18:21:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things aren't good at home. Walking on eggshells all the time. Is this normal? Feeling lost and alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, a feeling of being unsafe ('walking on eggshells'), and social isolation. While it doesn't explicitly mention physical harm, the situation described creates a vulnerable environment that could escalate.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 18:20:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice on finding help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed, and seeking help, suggesting potential for escalation if support isn't received. The phrasing indicates emotional distress and a cry for assistance.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 18:19:47"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown yesterday. Dude was knocked clean out. Shook me up bad. Makes you realize how fragile things are. Anyone else feel this lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault, though not directly experiencing it, can be psychologically distressing and indicate a broader issue of public safety. The phrase 'Makes you realize how fragile things are' indicates distress.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 18:18:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me up. Please, if you're using, have someone with you and carry Narcan. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event indicating potential risk to others. While Narcan was available, the situation highlights the ongoing risk of overdose in the community and the potential for future incidents without intervention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 18:17:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Glad Narcan was there. Learn how to use it, it could save a life. Anyone know where to get training?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potentially serious health crisis and the presence of drug use in the community. While the individual survived due to Narcan, the event highlights a risk to others who may not have access to immediate help.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 18:16:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about overdose deaths... scared. Lost a friend last year. Please, if you're struggling, reach out. There's help, and you deserve to be here. #overdoseawareness (This won't be included)",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear related to overdose deaths and mentions losing a friend, indicating potential vulnerability and emotional distress. While it encourages seeking help, the personal connection to loss elevates the risk compared to a general statement about overdose awareness.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 18:15:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Please, if you're struggling, reach out. There are people who care and want to help. Don't let fear keep you silent.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 61 (char 86)",
    "detected_category": "unknown",
    "timestamp": "2025-12-12 18:14:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Things have been really dark lately. Just feeling so overwhelmed. Talking to a friend helped a little, but it's still hard. Remember to check in on your loved ones.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of darkness and being overwhelmed, suggesting emotional distress. Mentioning difficulty despite talking to a friend indicates the distress is persistent. Includes a general reminder to check on loved ones, implying broader concern about others' well-being.",
    "detected_category": "suicide",
    "timestamp": "2025-12-12 18:13:35"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on the bus. So shaken. Is there anywhere to report this anonymously? Feeling sick about it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be psychologically distressing and may lead to anxiety or panic. The person is 'shaken' and 'feeling sick', indicating a significant emotional impact. The request for anonymous reporting suggests fear of potential repercussions if identified. While the text doesn't indicate direct threat to the individual, the emotional distress and potential fear justify a medium severity rating.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 18:12:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things aren't good at home. Walking on eggshells constantly. Is this normal? Feeling so alone. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and potentially harmful home environment ('walking on eggshells') and feelings of isolation, which could escalate if left unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-12 17:17:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Should I have said something? Feel sick about it now. Anyone else ever witness something like that? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can cause psychological distress and could indicate an escalating situation. While the text doesn't describe direct physical harm to the original poster, the event is concerning and falls into the potential for escalation.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 17:16:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on Elm St. Shook me up. Called the cops, but still feel sick. Anyone else witness it? Hope she's okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, while not directly involving physical harm to the reporting individual, can be psychologically distressing and warrants concern for the victim's safety. Physical violence was inflicted.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 17:15:54"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just needed someone to listen. It helps. If you're struggling too, please don't go through it alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a relapse or worsening of a previous struggle. While the individual reached out for help, the presence of urges elevates the risk beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 17:14:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary. Narcan saved them, thank god. Makes you realize how close to home this is. Anyone know where to get training in case it happens again?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived due to Narcan, the text describes a recent overdose event, indicating a potential ongoing risk of overdose in the area and a personal concern about encountering similar situations. The request for Narcan training further emphasizes this concern and perceived risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-12 17:13:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just reaching out... anyone else ever feel like they're drowning? Talking helps, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and drowning, indicating significant emotional distress and a potential for escalation. The user is reaching out for help, which suggests they are aware of their struggles but may need support.",
    "detected_category": "suicide",
    "timestamp": "2025-12-12 17:12:47"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy get shoved on the train. Everyone just stared. Makes you wonder what's wrong with people. Scared me, tbh. Hope he's okay.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the incident involved violence (a shove), it appears to be a single instance and the victim's condition is unknown but there's no indication of severe injury. The observer expresses fear, but there is no indication the observer is in immediate danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-12 17:11:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. The urge to self-harm is strong. Trying to distract myself, but it's hard. Anyone else feel this way? Any tips that help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating active suicidal ideation with self-harm intent. While there's no explicit plan or method mentioned, the intensity of the urge elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 17:10:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. Urges were strong, but I reached out to a friend instead. Small victory, but it counts. Still struggling, but not giving up.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the presence of strong urges, suggesting a potential risk. Reaching out to a friend is a positive coping mechanism, but the continued struggle implies ongoing vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-12 17:09:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are strong. Reached out to a friend, feels a little better. Remember to be kind to yourselves. <3 Talking helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'strong urges' which suggests a potential risk, although reaching out to a friend is a positive mitigating factor.",
    "detected_category": "suicide",
    "timestamp": "2025-12-12 17:08:40"
  }
]