[
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. The urge to hurt myself was really strong. I'm trying to stay strong and distract myself, but it's hard. Anyone else been there? What helps?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating immediate risk. While the individual is attempting to cope, the intensity of the urge necessitates a high severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 10:17:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about another OD. Makes me sick. Lost my cousin last year. Learn the signs, carry Narcan if you can. It saves lives. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a recent overdose and a past loss due to overdose, indicating potential vulnerability or triggering emotions related to substance use. While it promotes Narcan use (a positive action), the personal connection to loss elevates the risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 10:16:31"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight downtown. Makes you realize how quickly things can escalate. Shaken up. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing the author to feel shaken and on edge. While unsettling, it doesn't indicate direct involvement, imminent danger, or specific threats. The mention of escalation suggests awareness of potential violence, but not necessarily an immediate or personal risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 10:15:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thankfully. Learn the signs and carry it if you can. Could save a life. #overdoseawareness #narcan #staysafe",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, the event involved a potentially fatal overdose, indicating a significant immediate risk. The hashtag #staysafe also implies an acknowledgement of danger.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 10:14:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so overwhelmed lately. Relapsed after a few months clean. Just trying to take it one day at a time. Anyone else been there? It's so hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety can increase the risk of overdose or other negative consequences associated with the previous substance use. The feeling of being overwhelmed also suggests a vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 10:13:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Okay, here's a short, realistic social media post about self-harm, aimed to sound authentic and encourage help-seeking, while avoiding glorification or specific methods:\n\n\"Rough day. Urges were strong. Didn't act on them, but it was close. Feeling drained. Anyone else get this? Just trying to get through it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post describes strong urges related to self-harm, indicating a potential risk even though the individual reports not acting on them. The vulnerability and seeking of connection suggest a need for support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 10:12:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things aren't good at home. Constant put-downs are draining. Anyone else deal with this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress due to constant put-downs, suggesting a potentially harmful environment. While not explicitly stating self-harm or suicidal ideation, the feeling of being 'lost' warrants attention and further assessment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 10:11:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, uses a metaphor of drowning, and explicitly reaches out for help, indicating a potential crisis. While not explicitly suicidal, the language suggests significant emotional distress.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 10:10:21"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just had another fight with my partner. Things got physical again. I feel so lost and ashamed. Is this normal? I don't know what to do anymore.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates physical violence within a relationship, suggesting potential for serious injury or escalation. The individual also expresses feelings of being lost and ashamed, which raises concerns about their emotional well-being and potential for future harmful behaviors.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 10:09:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, a potential precursor to more serious harm. The phrase 'don't know what else to do' indicates a lack of coping mechanisms.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 10:08:19"
  },
  {
    "title": "User Story: Violence",
    "content": "My neighbor's yelling again. Sounds like it's escalating. I'm scared to call, but worried for the kids. Anyone else dealt with this? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The situation involves escalating yelling and concern for children, suggesting a potential risk of violence or abuse. The poster is scared, indicating a genuine threat perception.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 09:18:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "429 Resource exhausted. Please try again later. Please refer to https://cloud.google.com/vertex-ai/generative-ai/docs/error-code-429 for more details.",
    "detected_category": "unknown",
    "timestamp": "2026-01-17 09:17:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Just reaching out...has anyone else felt this way? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, potentially indicating emotional distress and a need for support. The 'reaching out' suggests a desire for connection and help, but the depth of distress is unclear. While not explicitly suicidal, the metaphor of being 'underwater' can be concerning.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 09:16:12"
  },
  {
    "title": "User Story: Violence",
    "content": "Heard shouting next door again last night. Sounded like things were getting thrown. Makes me sick to my stomach. Wish I knew what to do. Feel so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports of shouting and objects being thrown next door suggest a potential escalation of violence or abuse. The reporter's feelings of helplessness and sickness indicate significant emotional distress related to the situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 09:15:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD on the street today. Scary stuff. Narcan saved him, thank goodness. Makes you realize how fragile life is. Anyone know where I can get trained on using it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be psychologically distressing and indicates the presence of immediate and serious health risks (overdose) in the environment. While the person survived due to Narcan, the incident suggests a potential ongoing risk of overdose in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 09:14:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a thing about overdoses and it hit hard. Lost a friend last year. Knowing the signs and having Narcan could've made a difference. Learn about it. It matters.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses overdoses and the potential impact of Narcan, indicating a risk of overdose even though it doesn't apply directly to the author. The mention of a lost friend elevates the risk from low to medium because it suggests a personal connection to the issue and potential for vicarious trauma or heightened awareness of risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 09:13:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is getting strong again. Reached out to a friend, hoping it helps. It's exhausting fighting this battle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The individual expresses a strong urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 09:12:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Like I'm underwater. Reaching out before things get worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a desire to reach out before things worsen, suggesting potential for escalation. The 'underwater' metaphor can indicate feelings of suffocation or being trapped, which can be associated with depression and suicidal ideation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 09:11:05"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just feeling so lost. Things at home keep escalating, yelling turning into... other things. Don't know where to turn. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates escalating conflict at home, possibly involving violence or abuse. The user expresses feeling lost and alone, suggesting emotional distress and a potential risk of harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 09:10:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a guy shove his girlfriend on the street today. Made me sick. Wish I'd said something, but I froze. Anyone else ever feel that helplessness? What can you even do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an act of violence (shoving) and expresses feelings of helplessness, which can be precursors to more serious issues or indicate ongoing abuse. While not directly threatening, it points to a potentially dangerous situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 09:09:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor being carried out by paramedics. OD. Scared. This addiction stuff is real, y'all. Please reach out if you're struggling. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Neighbor overdosed and needed emergency medical attention. While the author expresses fear and concern rather than ideation, the event highlights the potential for fatal consequences related to addiction.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 08:19:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head. Just needed to tell someone I'm struggling today. Reached out to a friend, hoping it helps. It's okay not to be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses internal distress and acknowledges struggling, suggesting a potential mental health crisis. While there's no explicit mention of self-harm or suicide, the intensity of the internal experience ('so loud inside my head') warrants concern and further assessment.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 08:18:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Said something nasty and walked off. Heart's pounding. Should I have done something? Feel sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence suggests potential for escalation or further harm to the victim. While not directly involved, the witness's distress indicates the event's impact and potential for psychological harm to both the victim and observers.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 08:17:49"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside the bar. Makes me sick. Reminded me of things I'd rather forget. Anyone else feel completely drained after witnessing something like that? I just want to feel safe again.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing emotional distress and a desire for safety, but there is no direct threat or indication of immediate danger to the author or others. The severity is low because it primarily reflects emotional impact rather than immediate physical harm or threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 08:16:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary. Narcan saved them, thank goodness. Makes you realize how close we all are to the edge. Get trained, carry it. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was successful, the text describes an overdose event, indicating a significant health risk and potential for fatality. The 'close to the edge' comment suggests a broader context of risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 08:15:46"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out on the bus today. So fast and brutal. Shook me up. Is there anywhere to report something like that anonymously? Feeling really uneasy.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent event can cause significant distress and potentially lead to anxiety or fear for personal safety. The individual is actively seeking anonymous reporting options, indicating a degree of concern. While not directly involved, the witness might be at risk of future incidents or experiencing psychological distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 08:14:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. If you've been there, how did you find your way out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of depression and a desire for help, suggesting potential vulnerability and a need for support. The phrasing \"dark cloud won't lift\" and \"need to\" are concerning.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 08:13:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been...rough. Constantly walking on eggshells. Is this normal? Feeling so lost and alone. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home environment and feelings of isolation, potentially indicating abuse or a stressful situation that could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 08:12:41"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are strong. Reached out to a friend, feels a little better. Remember there are options. Talking helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the presence of strong urges, which suggests a level of distress that requires attention. While reaching out to a friend is a positive coping mechanism, the strength of the urges warrants a 'medium' severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 08:11:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my building. Shook me up. Makes you wonder what people are going through to get to that point. Hope everyone involved is okay. Feeling really uneasy now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and evokes concern for those involved, but there is no indication of immediate danger or severe threat to the author or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 08:10:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post that discusses suicide in a way that aims to be authentic and encourage seeking help:\n\n\"Been feeling really low lately. Like, lower than low. Thinking about things I shouldn't be.  Reaching out because I know I need to talk to someone.  Anyone know good resources?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post expresses suicidal ideation (\"Thinking about things I shouldn't be\") and acknowledges the need for help. While it's phrased vaguely, the explicit mention of considering harmful thoughts elevates the risk beyond just feeling down. The individual is reaching out, which is a positive sign, but the presence of suicidal thoughts necessitates a 'medium' severity rating.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 07:17:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Makes you wonder what's going on in people's lives to make them that angry. Wish there was something I could have done.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text doesn't indicate direct involvement or ongoing threat to the individual.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 07:16:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back, and I hate feeling this way. Anyone else relate? Just trying to get through it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions \"urges,\" implying a potential relapse into a harmful behavior. While the user is reaching out for support, the return of these urges suggests an elevated risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 07:15:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. My heart is still racing. Is it ever okay to intervene? Feeling sick about it. #domesticviolence #witness #help",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence is a potential traumatic event that can cause emotional distress. While the direct threat to the witness is low, the event indicates potential risk to the partner who was shoved, and further escalation is possible.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 07:14:53"
  },
  {
    "title": "User Story: Violence",
    "content": "Heard shouting next door again last night. Sounded bad. Debating calling someone, but I don't want to make things worse. Anyone else ever been in this situation? What did you do? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential violence or abuse occurring next door. While not directly involved or personally threatened, the poster expresses concern and a feeling of helplessness, suggesting the situation is serious enough to warrant considering intervention but uncertainty creates hesitation.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 07:13:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been rough lately. Constantly walking on eggshells. Anyone else been through this? Feeling really lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult home environment, feelings of anxiety (walking on eggshells) and distress (feeling lost). While not explicitly stating intent to harm self or others, the level of stress described warrants a medium severity due to the potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 07:12:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIPs lately. Lost a friend last week. Please, if you're struggling, reach out. Naloxone saves lives, know where to get it. It's okay to ask for help. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions recent deaths (RIPs), the loss of a friend, and encourages seeking help and using Naloxone, suggesting a concern for potential overdose or suicide risk within the author's social circle.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 07:11:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me up. Learn the signs and carry it, please. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event. Although Narcan was administered successfully, the potential for a fatal outcome existed and the emotional impact is significant. The call to action to learn signs and carry Narcan indicates an ongoing risk in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 07:10:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Like I'm underwater. Reaching out before things get worse. Anyone know resources that actually help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and a desire to seek help before things escalate, suggesting potential for self-harm or a crisis but not immediate intent.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 07:09:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice or just someone to listen?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost and overwhelmed ('everything feels heavy') and indicates a lack of coping mechanisms ('don't know what else to do'). While not explicitly suicidal, the expression of distress and help-seeking behavior suggests a potential risk for escalation if support is not provided.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 07:08:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them. Makes you realize how fragile things are. Please, if you're struggling, reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose, indicating a potential risk of serious harm or death. While Narcan was used successfully, the incident highlights the risk associated with drug use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 06:21:29"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up. Anyone else witness that? Hope he's okay. Makes you think.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Report of a violent physical assault resulting in loss of consciousness. While no ongoing threat is specified, the event indicates a potential risk of serious harm to individuals in the area.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 06:20:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after almost losing a friend to an overdose. Scary stuff. Please, if you or someone you know is struggling, reach out. There are resources available. Don't wait.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose of a friend, indicating a high risk of potential future overdose or related harm to others. It implies a serious existing problem.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 06:19:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, but it was way too close. Please, if you're using, carry it. And look out for each other. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose, indicating a life-threatening situation. The fact that Narcan was needed signifies a severe and immediate risk of death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 06:18:25"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home haven't been good. Constant yelling, put-downs... I feel so small. Anyone else been through this? Where do I even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of emotional abuse (yelling, put-downs) and expresses feelings of distress and helplessness. While it doesn't explicitly mention suicidal thoughts or self-harm, the negative emotional impact suggests a potential risk that warrants attention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 06:17:24"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling really lost lately. Like nothing matters. Reaching out before things get worse. Anyone know resources that actually help?\n\n**Option 2 (Sharing Experience):**\n\n> Been there. Dark place. It DOES get better, even when you can't see it. Hold on.\n\n**Option 3 (Raising Awareness):**\n\n> Thinking of a friend today. Suicide is never the answer. Check in on the people you love. You never know who's struggling.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Option 1 expresses feelings of hopelessness and a desire for help before things \"get worse\", indicating potential suicidal ideation. Option 3 mentions suicide directly.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 06:16:22"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Froze. Wish I'd said something. Feeling sick about it. Anyone else ever witness something like that? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be traumatizing and may indicate an ongoing situation. While the original poster is not the target, the situation involves potential escalation and could be a sign of abuse.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 06:15:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park today. Scared me. Luckily, someone had Narcan. We need more people carrying it. Learn how to use it, it could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose and the potential for future overdoses in the community present a moderate risk. While Narcan was available in this instance, future incidents may not have the same outcome.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 06:14:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Everything feels heavy. Reaching out because I know I need to. If anyone has felt this way and found a way through, I could really use some hope right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and heavy, indicating possible depression or distress. The user is reaching out for help, acknowledging a need for support and hope, suggesting they are not coping well on their own.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 06:13:18"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Froze. Should I have intervened? Feel sick about it. Anyone else experienced something like this? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an instance of violence (shoving) and raises concerns about potential escalation and the poster's emotional distress (feeling sick). While the risk is not directly to the poster, it involves potential harm to another person. The poster's indecision could also indicate a lack of resources or support in dealing with such situations, making future interventions less likely.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 06:12:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. Really wanted to relapse, but instead I called a friend. Small victory, but it feels huge right now. Still struggling, but not giving up.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to relapse, indicating a potential risk to the individual's well-being. While the person engaged in a coping mechanism (calling a friend), the struggle persists and the risk of relapse remains present. The severity is moderate because the individual is actively fighting the urge but the urge is strong and relapse can have harmful consequences.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 05:18:40"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Scary how quickly things escalated. Makes you think about how to de-escalate situations, y'know? Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight but doesn't indicate direct involvement, imminent threat, or specific targets. It expresses concern and prompts reflection, rather than signaling an active danger or plan.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 05:17:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good lately. Constant put-downs, feeling trapped. Anyone else ever feel this way? Is this... normal? I'm starting to think I need help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped and constant put-downs, indicating potential emotional abuse. The user also acknowledges needing help, suggesting the situation is impacting their well-being and potentially escalating. While no explicit threats of self-harm or harm to others are present, the situation warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 05:16:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to quiet the noise is to hurt. I know it's not the answer, but the urge is so strong. Talking to someone tomorrow. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a potential immediate risk. While the person mentions seeking help, the intensity of the urge elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 05:15:35"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Relapsed after a few months clean. Just reaching out... anyone else feel like they're drowning? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety coupled with feelings of being overwhelmed and 'drowning' indicates increased vulnerability and potential for self-harm. The individual is reaching out for support, suggesting they are aware of their distress but potentially lacking coping mechanisms.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 05:14:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Called 911, thankfully they're okay now. Scary how quickly it happens. Learn the signs, carry Narcan. Could save a life. #staysafe #ODawareness",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, the text describes an overdose event, indicating a potential for fatality. The call for awareness and carrying Narcan highlights the seriousness of the situation and the risk of future occurrences.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 05:13:33"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. My neighbor's yelling again, worse than before. I heard a crash. Should I call someone? I don't want to get involved, but I'm worried.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The neighbor's escalating yelling, a crash sound, and the user's worry suggest a potential for violence or abuse. The user's hesitation to get involved indicates a perceived real threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 05:12:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The constant put-downs are chipping away at me. Anyone else experience this? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses emotional distress, feelings of being worn down by put-downs, and feeling lost, suggesting potential vulnerability to self-harm or suicidal ideation, though no explicit plans are mentioned.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 05:11:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's hard to admit, but things at home aren't good. Constant put-downs are wearing me down. Anyone else experience this? How did you cope? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 59 (char 84)",
    "detected_category": "unknown",
    "timestamp": "2026-01-17 05:10:28"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his dog in the park. Shaking. Reported it, but feel sick. Anyone know what else I can do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes an act of violence (dog abuse), but doesn't indicate immediate danger to a human, only the emotional distress of the witness.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 05:09:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Just need a way to quiet the noise. Anyone else feel this way? Talking helps, maybe?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses a need to quiet internal noise and seeks connection/communication as a coping mechanism. While concerning, there is no explicit mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2026-01-17 04:25:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "I finally left. It's terrifying and I'm broke, but I'm safe. Still feels surreal. Anyone else been through this? Just feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses fear and uncertainty but explicitly states the person is now 'safe'. While concerning, it doesn't suggest immediate danger or harm.",
    "detected_category": "other",
    "timestamp": "2026-01-17 04:24:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately, like I'm drowning. Reaching out because I don't know what else to do. Is there anyone else who feels this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed ('drowning'), indicating significant emotional distress and a lack of coping mechanisms. The individual is actively seeking support, suggesting they are not yet completely overwhelmed but are struggling significantly.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 04:23:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant yelling, put-downs... I feel so small. Has anyone else dealt with this? I don't know where to turn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (put-downs, creating a feeling of being 'small') and a feeling of helplessness ('don't know where to turn'). While there's no explicit mention of physical violence or suicidal ideation, the situation described represents a risk to the person's mental and emotional well-being and could escalate if not addressed.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 04:22:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**(Option 1: Seeking Help)**\n\n\"Things got really dark last night. I hurt myself again. Reaching out because I know I need help. Where do I even start?\"\n\n**(Option 2: Sharing a Milestone)**\n\n\"One week clean from self-harm. It's been tough, but I'm trying. Small steps, right?\"\n\n**(Option 3: Raising Awareness)**\n\n\"Just a reminder that self-harm isn't attention-seeking. It's a sign of deep pain. Be kind, always.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Option 1 describes a recent self-harm incident and a clear need for help. This indicates immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 04:21:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need help. Any advice on finding a good therapist?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of depression and a desire for help, suggesting a risk of escalation if support is not received. While not explicitly suicidal, the 'dark cloud' metaphor and seeking a therapist point to a significant emotional struggle.",
    "detected_category": "other",
    "timestamp": "2026-01-17 04:20:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs, isolating me from friends... feels like I'm walking on eggshells. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and social isolation, creating a potentially harmful environment. While not explicitly stating suicidal ideation or plans, the situation could escalate if unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 04:19:28"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, I understand. I will generate a short, realistic social media post about suicide that aims for authenticity and either shares a personal story, seeks help, or raises awareness, without using hashtags.\n\nHere's an example:\n\n\"Things have been really dark lately. Just feeling incredibly alone and overwhelmed. Reaching out to see if anyone else has felt this way and found a way through it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a plan to create a social media post about suicide, including an example expressing suicidal ideation (feeling incredibly alone and overwhelmed). While the stated aim is to share a personal story, seek help, or raise awareness, the example provided could be triggering or contribute to contagion effects, especially considering the user's initial prompt involved generating content about suicide.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 04:18:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. The urge was strong, but I distracted myself. Small victory. Anyone else relate? Just feeling really alone right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a strong urge, potentially related to self-harm or suicide, although the individual reports using distraction as a coping mechanism. The feeling of being alone also increases the risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 04:17:24"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so heavy lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being overwhelmed and a sense of helplessness (\"heavy,\" \"underwater,\" \"don't know what else to do\"). While there's no explicit mention of self-harm or suicide, these feelings can be precursors to more severe mental health crises and should be taken seriously.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 04:16:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want to feel *something* different. Scared I'll go too far one day. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses a desire to feel \"something\" different when overwhelmed, coupled with fear of going \"too far.\" This suggests potential for impulsive behavior and a lack of control, which increases the risk of harm. While not explicitly suicidal or self-harming, the potential for escalation warrants a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 03:44:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm stuck in a hole. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being overwhelmed but lacks specific details about self-harm, suicide plans, or other dangerous behaviors. It appears to be a general cry for help and advice.",
    "detected_category": "other",
    "timestamp": "2026-01-17 03:43:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm drowning and can't see any air. Reaching out before things get worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed ('drowning and can't see any air'), and a proactive reaching out 'before things get worse'. This suggests a potential risk, but the individual is also seeking help, mitigating the immediate danger.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 03:42:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scary stuff. Narcan saved them, thank god. Please, if you're using, have someone with you and know how to use it. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose event requiring Narcan intervention, indicating a potentially life-threatening situation. While the person survived, the event underscores the high risk associated with drug use and the potential for fatal consequences.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 03:41:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good lately. Constant put-downs, controlling behavior... Feels like I'm walking on eggshells. Anyone else been through this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional abuse and controlling behavior, which can escalate. The individual is experiencing distress ('walking on eggshells'). While not explicitly stated, the situation presents a risk to mental and potentially physical well-being.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 03:40:44"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Did I do the right thing by just walking away? I froze. Feeling guilty now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Observed violence (shoving) constitutes a potential risk of escalation or further harm to the victim. While the observer is safe, the incident itself indicates a potentially dangerous situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 03:39:43"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight downtown. Dude got knocked out cold. Shaken up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence and the feeling of being on edge suggests a potential for escalation and increased anxiety/fear in the community, though not directed at a specific individual.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 03:38:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm drowning and no one can see it. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being overwhelmed and lost, using the metaphor of drowning. The explicit statement of 'I don't know what else to do' suggests a sense of hopelessness and seeking help, indicating potential distress that warrants further attention.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 03:37:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I hate it. Trying to stay strong and remember why I stopped. Anyone else relate? Talking helps sometimes.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, implying a potential risk of self-harm or relapse into a previous harmful behavior. While the individual is trying to stay strong, the presence of urges elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 03:36:39"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing in the street, got really heated. Reminded me of my parents. Feeling anxious all over again. Anyone else get triggered like this? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes feeling anxious and triggered, but doesn't express intent to harm self or others. It's a reaction to an external event and a request for coping strategies, indicating a desire to manage the distress.",
    "detected_category": "other",
    "timestamp": "2026-01-17 03:35:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scared me so bad. Narcan saved him, but it's a wake-up call. Anyone else feel like this is happening way too often lately? Where can I learn to use Narcan?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was used successfully, the text describes a recent overdose event and expresses concern about increasing frequency, suggesting a potential ongoing risk for others. The individual is also seeking information about Narcan use, indicating a perceived need for intervention in potential future overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 02:51:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. Walking on eggshells constantly. Anyone else ever feel trapped? Need to figure out a way out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a distressed emotional state and potentially a difficult or unsafe home environment. Phrases like \"walking on eggshells\" and \"feel trapped\" suggest ongoing stress and potential abuse or domestic conflict.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 02:50:02"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you wonder what people are going through to get to that point. Is there anywhere safe anymore?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses concern and unease about witnessing a fight, but doesn't indicate imminent danger to the speaker or others. It's a reaction to an event, not a plan or direct threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 02:49:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Lost a friend last week. OD. Please, if you're struggling, reach out. There's help out there. Don't let it be too late.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose death, which indicates a high risk of potential imitative behavior or heightened emotional distress among vulnerable individuals. It also implies an existing problem of drug abuse in the person's circle of aquantances.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 02:47:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Made me realize how quickly things can escalate. Anyone else feel anxious after witnessing something like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning, but doesn't indicate imminent danger to the individual or others. The individual expresses anxiety, but not specific threats or intentions.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 02:46:58"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Just reaching out... has anyone else felt this way? Could really use someone to talk to.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and a desire for connection. While it indicates distress, there's no explicit mention of self-harm, suicide, or harm to others.",
    "detected_category": "other",
    "timestamp": "2026-01-17 02:45:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Scary how fast things escalated. Makes you think, you know? Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a concerning event but doesn't directly indicate immediate danger to the author or others. While it evokes feelings of unease, it lacks specific threats or indications of planned violence or harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 02:44:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just constant sadness. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of constant sadness and hopelessness, indicating a potential for mental health deterioration. They are reaching out for help, suggesting they may be struggling to cope on their own. While not explicitly suicidal, the language suggests a vulnerability that needs attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 02:43:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you wonder what people are going through. Feeling sick about it. Anyone else see it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning but doesn't directly indicate immediate danger to the author or others. The author expresses emotional distress, but no explicit threats or plans are mentioned.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 02:42:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just a heavy cloud all the time. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but does not contain explicit ideation or intent of self-harm or suicide. It is a general expression of distress and a request for connection.",
    "detected_category": "other",
    "timestamp": "2026-01-17 02:41:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so lost lately. Everything feels heavy, and I'm not sure where to turn. Talking to a friend helped a little, but it's still there. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but there is no explicit mention of self-harm, suicide, violence, or abuse. It appears to be a general expression of emotional distress.",
    "detected_category": "other",
    "timestamp": "2026-01-17 01:46:17"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Walking on eggshells all the time. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home environment and feelings of isolation, which could escalate if left unaddressed. \"Walking on eggshells\" suggests potential for volatile interactions or abuse.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 01:45:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are back and stronger. Trying to resist, but it's exhausting. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with strong urges that are exhausting the individual. While not explicitly stating intent for self-harm or suicide, the re-emergence and intensity of the urges raise concern and warrant further investigation to ensure their safety.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 01:44:14"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out downtown last night. It was so sudden and brutal. Shaken up still. Does anyone know of resources for dealing with witnessing violence? Feeling really anxious.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The individual witnessed violence, which is distressing, but there's no indication of direct threat to themselves or others. They are seeking resources for dealing with anxiety related to the event.",
    "detected_category": "other",
    "timestamp": "2026-01-17 01:43:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating distress and a need for support. While not explicitly suicidal, the statement suggests a vulnerability that warrants attention and possible intervention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 01:42:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so overwhelmed lately. Relapsed after 6 months clean. Just reaching out... anyone else know how to cope with the guilt afterwards?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential struggle with addiction, and the expressed guilt suggests emotional distress. While there's no immediate threat, the relapse and negative emotions increase the risk of future harmful behavior.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 01:41:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming I feel like I need to feel *something* else, even if it hurts. Trying to stay strong, but it's hard. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a desire to feel something, even if it's painful, suggesting potential self-harm thoughts or actions as a coping mechanism for feeling overwhelmed. While not explicitly stating intent, the implicit expression of feeling overwhelmed and the urge for painful sensation raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 01:40:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about overdoses is scary. Lost a friend last year, and it still hurts. If you're struggling, please reach out. There are people who care & want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions overdoses and the loss of a friend, indicating potential exposure to risky behaviors and grief. While it encourages seeking help, the connection to overdose makes it more than just general sadness.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 01:39:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just realized yelling & constant criticism isn't normal in a relationship. Feeling lost & confused. Is this abuse? Where do I even start to figure this out?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential abusive relationship. While there's no immediate threat of physical harm mentioned, emotional abuse can escalate and has significant negative impacts. The user's feelings of being lost and confused suggest distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 01:38:05"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard shouting next door again last night, then a crash. Called the non-emergency line, but feel like I should do more? Anyone else experienced this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Potential for violence/abuse next door, unknown if the poster is directly at risk but is clearly concerned for their safety or the safety of others.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 01:37:04"
  }
]