[
  {
    "title": "User Story: Abuse",
    "content": "\"Just realized yelling constantly *is* emotional abuse. Feels stupid admitting it, but it's been years. Anyone else dealt with this? How did you even start to heal?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the writer acknowledges perpetrating emotional abuse (yelling constantly). While the focus is on their healing, the admission suggests a potential for ongoing abusive behavior and the need for intervention to prevent further harm to others. The severity isn't high as it's retrospective and the writer is seemingly remorseful and seeking help, but it's more than low due to the potential for future incidents if the root cause is not addressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 19:18:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are strong. Trying to distract myself, but it's hard. Anyone else feel this way? Just feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges and feelings of isolation, which are risk factors for self-harm or suicide. While there's no explicit plan, the struggle indicates a need for support.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 19:17:16"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the park. Shaken up. My hands are still trembling. Is there anywhere safe to walk around here anymore? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, causing emotional distress (shaking, feeling lost). While distressing, it doesn't indicate imminent danger to the person themselves.",
    "detected_category": "other",
    "timestamp": "2025-12-15 19:16:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Reached out to a friend, feels good to not be alone with it this time. If you're hurting too, please talk to someone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential for self-harm or suicidal ideation. While the person has reached out for support, the presence of urges necessitates a medium severity level.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 19:15:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "I keep making excuses for him. Saying it's just stress. But the yelling is getting worse, and now...the pushing. Is this really happening to me? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes escalating physical abuse (pushing) which is a significant safety risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 19:14:11"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Guy got knocked out cold. Shaken up, honestly. Anyone know good resources for dealing with witnessing violence? Feel sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be psychologically damaging, indicating a potential need for mental health support. While the poster is not directly threatened, the event was impactful and is causing distress.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 19:13:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Scary stuff. Please, if you're using, have someone with you, and Narcan. It saves lives. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event, indicating a high risk of serious harm or death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 19:12:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good lately. Walking on eggshells constantly. Is this normal? Feeling really lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a difficult home environment with potential for abuse or violence, indicated by 'walking on eggshells.' The feeling of being 'lost' raises concern for emotional distress.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 19:11:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Felt so overwhelmed today. Urges were strong, but I reached out to a friend instead. It helped, a little. Still shaky, but I'm here. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and shakiness, suggesting distress and potential for self-harm, even though the person reached out for help. The phrase \"still shaky\" implies the urge hasn't completely dissipated.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 19:10:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been... not good lately. Walking on eggshells constantly. Is this normal? Feeling so lost and alone. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a potentially abusive or volatile domestic situation with the phrase \"walking on eggshells.\" The user expresses feeling lost and alone, indicating emotional distress. While there is no explicit mention of violence, self-harm, or suicide, the description suggests a concerning situation that warrants further investigation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 19:09:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Terrifying. Narcan saved them, but it shook me up. We gotta do better protecting each other. Where can I learn more about helping in these situations?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was administered successfully, a person overdosing represents a significant health risk with potentially fatal consequences. The text also conveys the witness's distress, indicating the impact of the event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 18:22:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is strong. It's scary. Reached out to a friend, hoping it helps. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm and acknowledges fear, indicating a significant and immediate risk. While the person has reached out for help, the intensity of the urge elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 18:21:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Narcan saved them, but it shook me up bad. Is there anywhere to learn how to help if it happens again?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and suggests a potential risk of future overdose incidents in the area. While the individual survived, the situation highlights a public health concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 18:20:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on Elm St. Shook me up. Called it in, hope she's okay. Makes you realize how common this is. Anyone else witness something similar? Feeling sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent act (shoving) suggests potential for escalation and immediate harm to the victim. While the text doesn't describe severe injuries, the act itself is a risk indicator.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 18:18:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Makes you think. My little brother's been acting out lately, getting angry so fast. Anyone dealt with a kid with anger issues? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses concern about a younger brother's anger issues and seeks advice, but does not directly indicate imminent danger to self or others. The observation of a fight downtown is a trigger for reflection, but not a direct threat.",
    "detected_category": "other",
    "timestamp": "2025-12-15 18:17:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Reaching out because I don't know what else to do. Is anyone else going through this? Need to know I'm not the only one.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and a need for connection, but does not contain explicit mentions of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2025-12-15 18:16:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been so angry lately, and I just feel like I'm walking on eggshells. Is this normal? I don't know what to do anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests potential emotional abuse and fear of escalating anger, indicating a risk of harm. The user is feeling helpless and walking on eggshells, signaling a potentially unsafe environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 18:15:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my brother unresponsive. Narcan saved him. Terrified. Learn the signs, people. Please. It can happen to anyone. Where can I get more Narcan for free?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Brother found unresponsive and required Narcan, indicating a life-threatening opioid overdose. While the immediate crisis is averted, the risk of future overdose remains high.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 18:14:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw two guys fighting outside my work today. Scared the crap out of me. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a violent situation, but the author expresses fear rather than intent to harm themselves or others. The general anxiety expressed is not directly indicative of imminent danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 18:13:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Narcan saved them, but it shook me up bad. We need more access & less stigma. Check on your friends, please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event. While Narcan was successful, the event highlights the risk of overdose in the community and the potential for fatal outcomes.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 18:12:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm drowning. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost, using the metaphor of drowning, indicating significant emotional distress and a plea for help. While not explicitly suicidal, the level of distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 17:21:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like a dark cloud won't lift. Reaching out because I know I need to. Talking to a therapist next week. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses low mood and a desire to seek help by talking to a therapist. The individual acknowledges their need for support and has scheduled an appointment.",
    "detected_category": "other",
    "timestamp": "2025-12-15 17:20:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so overwhelmed lately. The urges are back and stronger. Trying to stay strong but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a return of strong urges and a feeling of being overwhelmed, suggesting a potential risk of acting on those urges. The user is seeking support, indicating they are struggling.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 17:19:10"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy get shoved on the train platform today. Scared me half to death. Everyone just walked past. Is that normal now? Feeling really shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent act, even if not directly involved, can be traumatizing. The text indicates emotional distress ('scared me half to death,' 'feeling really shaken') and raises concerns about the normalization of violence ('Is that normal now?'). While the event itself is a single instance and the individual is not the direct victim, the emotional impact and questioning of social norms elevate the risk beyond low.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 17:18:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to a friend helped a little. Trying to take it one day at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, which could be indicative of depression or suicidal ideation. While talking to a friend helped, the overall sentiment suggests potential vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 17:17:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scared. Found my brother unresponsive. Narcan worked, thank God. Please, if you're struggling, reach out. Don't want anyone to go through this. There's help available.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Brother experienced a potentially fatal overdose requiring Narcan. While the immediate crisis is resolved, the underlying issue of substance abuse and potential relapse risk remain a significant threat.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 17:16:05"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a fight outside my building last night. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be upsetting, but the text doesn't indicate imminent danger or direct involvement. The user expresses being shaken up and on edge, suggesting emotional distress but not a direct threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 17:15:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Sometimes it feels like I'm drowning. Just need to remember to breathe and reach out. Talking to a friend later, hoping it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The statement expresses feelings of being overwhelmed and 'drowning,' suggesting significant emotional distress. While the individual mentions coping mechanisms (breathing, reaching out, talking to a friend), the initial expression warrants attention and monitoring. The use of 'drowning' can be a metaphor for suicidal ideation or overwhelming emotional distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 17:14:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... rough. Walking on eggshells constantly. Is this normal? Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home environment, characterized by 'walking on eggshells,' which suggests potential emotional or psychological distress and a possible abusive situation. While not explicitly stating harm, the phrasing indicates a potentially unhealthy and unsafe dynamic.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 17:12:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so incredibly alone lately. Like I'm underwater. Just needed to say it out loud. If anyone's been there, how did you get through it?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and isolation, but does not contain explicit suicidal ideation, self-harm plans, or threats of violence. The person is reaching out for support, which suggests they are not entirely overwhelmed.",
    "detected_category": "other",
    "timestamp": "2025-12-15 17:11:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after a close call. Mixing things is so dangerous. Please be careful, everyone. It's not worth it. Scared straight, for real.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a recent hospitalization due to mixing unspecified substances, implying a significant negative health outcome. The phrase \"scared straight\" suggests a serious, potentially life-threatening, event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 16:21:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Been feeling so low lately.  Urges are back.  Anyone know good coping strategies or where to find help that actually understands?  Feeling lost.\n\n**Option 2 (Sharing Experience):**\n\n> 6 months clean from SH. Some days are still really hard, but I'm trying.  It IS possible to stop.\n\n**Option 3 (Raising Awareness):**\n\n> Just a reminder to check in on your loved ones. You never know what someone's going through.  Be kind.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 mentions urges, indicating current risk. Option 2 suggests a history of self-harm. Option 3 raises awareness of the need to check on others, implying that there may be some cause for concern for someone else's well-being.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 16:20:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a crisis line, hoping it helps this time. It's exhausting.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm and feelings of being overwhelmed, indicating a significant risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 16:19:18"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired of walking on eggshells. Every little thing sets him off. Is this normal in relationships? Feeling trapped.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a potentially volatile relationship dynamic, suggesting possible emotional or psychological abuse. The feeling of being 'trapped' raises concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 16:18:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Lost my cousin last week. OD. So messed up. Please, if you're struggling, reach out. Don't let it get this far. There are people who care.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a recent death due to overdose, indicating a significant risk of imitative behavior or heightened distress in the network of the deceased.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 16:17:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want to feel *something* else. Not proud of it, but it's real. Trying to find healthier ways to cope. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses a desire to feel something different when overwhelmed, but doesn't explicitly mention self-harm, suicide, violence, abuse, or overdose. It also indicates an attempt to find healthier coping mechanisms.",
    "detected_category": "other",
    "timestamp": "2025-12-15 16:16:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor being carried out on a stretcher last night. OD. Scary. Please, if you're struggling, reach out. There's help. Don't let this be you.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a neighbor's overdose, implying a potentially fatal situation and highlighting the risk of similar outcomes for others struggling. The mention of outreach suggests a proactive response, but the underlying risk remains significant.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 16:15:12"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on Elm St. Called the cops, hope she's okay. Makes me sick to my stomach. Anyone know of resources for domestic violence victims in this town?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence (shoving) has occurred, indicating a potential for escalation and further harm. While the immediate risk to life isn't explicitly stated, the act suggests an ongoing or potential pattern of abuse.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 16:14:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found out a friend OD'd. Feels so unreal. Please, if you're struggling, reach out. There are people who care and want to help. Don't be afraid to ask.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose death of a friend, which can be a trigger for others struggling with similar issues. While the text encourages reaching out for help, the mention of overdose suggests a vulnerability and heightened risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 16:13:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head. Scratched again last night. Feels like a release, but I hate it after. Anyone else get this? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates self-harm (scratching) as a coping mechanism, which while not explicitly suicidal, suggests distress and a potential escalation of harmful behaviors.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 16:12:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get too much. Scratched again last night. Feeling ashamed and lost. Talking to my therapist tomorrow, hoping it helps. Anyone else been there?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates self-harm (scratching), feelings of shame and loss, suggesting emotional distress. While the person is seeking help, the presence of self-harm elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 15:20:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Just trying to take it one hour at a time. Anyone else relate? Feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of isolation, suggesting a potential risk of self-harm or other negative coping mechanisms. While not explicitly suicidal, the combination warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 15:19:51"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a fight downtown today. Shook me up. Guy was yelling, then just *bam*. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate imminent danger to the speaker or others. It primarily expresses a feeling of unease.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 15:18:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my brother unresponsive. Narcan saved him. Scariest moment of my life. Learn the signs, please. It could be anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports an opioid overdose requiring Narcan intervention, indicating a life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 15:17:48"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on Elm St. Shook me up. Called the cops, hope she's okay. Makes you realize how messed up things can be.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Report describes a physical assault (shoving), indicating potential for injury and escalating violence. The immediate danger is likely over as the witness called the police, but the situation itself suggests a risk of continued abuse.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 15:16:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get too much. Relapsed after 6 months clean. Feeling so ashamed and alone. Reaching out for support before it gets worse again. Anyone else been there?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety, feelings of shame and isolation, and expressed fear of things getting worse indicate a moderate level of distress and increased vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 15:15:45"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight outside my kid's school. Shaking. This used to be a safe neighborhood. Anyone else feel like things are getting worse? Feeling lost on how to protect my family. \"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight can be disturbing and lead to feelings of unsafety and anxiety about protecting family. While not directly indicating imminent danger, it suggests a potential for future violence and evokes fear.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 15:14:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy, and I'm not sure where to turn. Just needed to say it out loud. ❤️ If you've felt this way, how did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but doesn't explicitly mention self-harm, suicide, violence, abuse, or overdose. It seeks connection and coping strategies, suggesting a desire for help rather than immediate danger.",
    "detected_category": "other",
    "timestamp": "2025-12-15 15:13:41"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy get punched on the train today for bumping into someone. Just walked away after. Shaken up. Is this normal now? Feeling sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault, while not directly impacting the reporter's physical safety, is causing significant distress (shaken up, feeling sick) and raises concerns about the escalation of violence. The perpetrator walking away suggests a potential for further incidents.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 15:12:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Not sleeping again. Keeps replaying in my head. Thought things were getting better, but it happened again last night. Scared to tell anyone. Is this normal? How do you even start to heal?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 72 (char 97)",
    "detected_category": "unknown",
    "timestamp": "2025-12-15 15:11:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Reached out to a friend, just need someone to listen. It's hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges and feelings of being overwhelmed. While the person has reached out for support, the strength of the urges suggests a potential risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 14:20:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things at home have been rough lately. Walking on eggshells constantly. Anyone else ever feel like they're losing themselves trying to keep the peace?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially unsafe home environment with the phrase 'walking on eggshells.' This suggests emotional distress and possible abuse (emotional/verbal). The feeling of 'losing themselves' further amplifies the concern for their well-being. While not explicitly mentioning violence or self-harm, the level of stress described warrants further investigation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 14:18:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Reaching out because I don't know what else to do. Any advice or just someone to listen?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and drowning, indicating significant distress and a potential risk of escalation if not addressed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 14:17:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, but it shook me. Naloxone saves lives. Learn how to use it. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, a drug overdose occurred, indicating a serious health risk. The event caused significant distress to the observer, suggesting the potential for vicarious trauma or increased anxiety related to similar situations.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 14:16:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just... need to feel *something* else. Trying to find healthier ways to cope. Anyone else relate? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates a struggle with overwhelming feelings and a desire to cope, suggesting potential distress. However, it lacks specific details about harmful intentions or actions, and explicitly mentions seeking healthier coping mechanisms. The lack of explicit mention of self-harm, suicide, violence, abuse, or overdose makes it low severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 14:15:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on where to start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, suggesting potential mental health distress. While not explicitly suicidal, the feeling of being 'underwater' and the difficulty in seeking help raises concerns.",
    "detected_category": "other",
    "timestamp": "2025-12-15 14:14:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating active suicidal ideation. While the person reached out for help, the presence of the urge itself raises the severity. This requires continued monitoring and support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 14:13:49"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Dude got jumped. Makes you think, y'know? Never thought I'd see something like that happen so close to home. Shaken up.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a violent assault ('Dude got jumped'). While the author was not directly involved, witnessing such an event can be traumatizing and suggests a potential risk of future violence in the area.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 14:12:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm underwater. Reaching out before it gets worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being overwhelmed and reaching out for help before things get worse, indicating potential suicidal ideation or a mental health crisis.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 14:11:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD. It's terrifying. My brother's been struggling, and I'm so scared. Anyone know good resources for families? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text expresses fear and concern, the brother's OD struggle and the user's anxiety indicate a potential for a crisis situation. The user is actively seeking resources, which is a positive sign, but the underlying risk associated with ongoing substance abuse is concerning.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 14:10:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Rough day. Urges were strong. Managed to distract myself by calling a friend. Still feeling shaky, but hanging in there. It's a process, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes strong urges, which could be interpreted as urges to engage in a negative behavior (potentially self-harm, substance abuse, or relapse related to a previous issue). While the person managed to distract themselves, they still feel shaky, indicating ongoing vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 13:30:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD. Scares me, brings back bad memories. If you're struggling, please reach out. There's help, there's hope. You're not alone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear related to overdoses and encourages reaching out for help, suggesting a potential risk of overdose or relapse. While it's not explicitly stating imminent danger, the mention of bad memories and struggles indicates vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 13:29:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out to a friend, but it's hard to explain. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but lacks explicit suicidal or self-harm ideation. While concerning, it primarily conveys emotional distress.",
    "detected_category": "other",
    "timestamp": "2025-12-15 13:28:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIP posts lately. Lost another friend to overdose last night. This needs to stop. If you're struggling, please reach out. There are people who care. I care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and concern about overdose deaths, indicating a potential for further overdoses in the affected community. While it doesn't directly indicate immediate risk for the author, the heightened emotional state and discussion of overdose contribute to a medium severity.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 13:27:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up yesterday. Scary reminder that addiction is a beast. Learn the signs of OD, please. Naloxone saves lives. #reallife",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a recent near-fatal overdose event, suggesting immediate and significant risk related to substance use and potential for recurrence.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 13:26:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "```\nJust feeling so lost. Things at home have been... rough. Constant put-downs, controlling behavior. Anyone else been through this? How did you find the strength to leave? I need help.\n```",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home situation with controlling behavior and put-downs, and the user expresses feeling lost and needing help to leave. This suggests a potential risk of escalating harm due to the abusive environment. While there's no explicit mention of self-harm or suicidal ideation, the feeling of being lost and the need for help indicate a level of distress that warrants attention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 13:25:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Talking to my therapist tomorrow, but tonight is rough. Just trying to get through it. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and a struggle to cope, suggesting a potential for self-harm. While the person is seeking help, the immediate risk is elevated due to the reported difficulty getting through the night.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 13:24:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Sometimes it feels like I'm just going through the motions. Like I'm watching my own life happen to someone else. I'm exhausted. Talking to a friend tomorrow. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of detachment, exhaustion, and going through the motions, which could indicate depression or a significant mental health struggle. The mention of talking to a friend suggests a desire for help, but the overall tone warrants monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 13:23:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scariest thing ever. Narcan saved their life. Please, if you're using, carry it. Know the signs. It can happen to anyone. 💔",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose incident involving a friend, highlighting the potential for fatal consequences. The use of Narcan indicates a severe medical emergency. While the friend survived, the situation underscores a significant and immediate threat to life.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 13:22:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing a friend OD was terrifying. Narcan saved them, but it shook me up bad. Learn the signs, carry it if you can. It could save someone's life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes witnessing a potentially fatal overdose, highlighting the immediate danger and significant emotional impact. While Narcan was successful, the event itself indicates a high-risk situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 13:21:36"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I yelled, and he took off. She was crying. I stayed with her until she called a friend. Feel so shaken. Is there anything else I could have done?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a physical assault (shoving). While the immediate threat is gone because the perpetrator fled, the incident indicates a potential for further violence and the victim is clearly distressed. The bystander is also emotionally affected.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 12:25:51"
  },
  {
    "title": "User Story: Overdose",
    "content": "Never thought it'd happen to someone I know. Found my roommate unresponsive. Narcan saved their life. Scary stuff. Learn the signs and carry it, please. Could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Overdose is a life-threatening medical emergency requiring immediate intervention. Narcan was needed to reverse the effects, indicating a significant risk to life.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 12:24:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just feeling lost. Things at home have been...rough lately. Constant put-downs, walking on eggshells. Is this normal? Anyone else relate? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling lost and alone, combined with experiences of put-downs and walking on eggshells at home, suggesting emotional distress and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 12:23:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Relapsed last night. Feeling so ashamed and alone. Reaching out before things get worse. Any advice on coping skills that actually work?\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Been clean for 3 months. It's a daily battle, but celebrating the small wins. You're not alone in this fight.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Seeing a lot of jokes about self-harm lately. It's not a punchline. It's a sign someone is deeply hurting and needs help.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates a recent relapse and feelings of shame/isolation, increasing the risk of escalation. Option 3 highlights the normalization of self-harm, which could desensitize individuals to the seriousness of the issue.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 12:22:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a crisis line, feels like a small step. Anyone else relate? It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of being overwhelmed, suggesting a potential risk. While the person has reached out for help, the presence of urges elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 12:21:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want to feel *something* different. Scared to admit I've been cutting again. Anyone else relate? How do you cope? I need help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates active self-harm (cutting) and a feeling of being overwhelmed, coupled with a plea for help. This suggests a significant risk of further self-harm or escalation to more serious self-destructive behaviors.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 12:20:41"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a fight break out on the train platform. Shaken up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling and cause anxiety, but doesn't indicate immediate danger or severe harm to the person reporting.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 12:19:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Lost my cousin last night to an OD. Feels so unreal. Please, if you're struggling, reach out. There's help available. Don't let this happen to anyone else.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a fatal overdose, indicating a high-risk situation even though it's about a past event affecting others.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 12:18:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> Things at home are getting scary. Walking on eggshells constantly. Don't know where to turn. Anyone been through this?\n\n**Option 2 (Sharing Story):**\n\n> Never thought it would happen to me. Verbal abuse is still abuse. It chips away at you. I'm trying to rebuild.\n\n**Option 3 (Raising Awareness):**\n\n> Remember abuse isn't always physical. Emotional manipulation & control are just as damaging. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests an abusive situation, with potential for emotional distress and a need for help. While not explicitly stating intent to harm self or others, the situation described poses a risk to the individual's well-being.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 12:17:35"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Narcan saved them, but it was way too close. Learn CPR, carry naloxone. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event. While the person survived, the phrase \"way too close\" implies a high risk of fatality. The event indicates a potential ongoing risk of overdose in the area.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 12:16:33"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a guy get shoved on the train today for bumping someone. Scary how fast things escalate. Anyone else witness stuff like that lately? Makes you wonder...",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes a single instance of violence (shoving) which is concerning but doesn't indicate an ongoing threat or imminent danger to the original poster or others. It expresses concern and contemplation, but doesn't suggest the poster is in immediate danger or planning violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 11:17:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my kid's school. Shook me up bad. Makes you wonder what kind of world we're raising them in. Anyone else feeling this lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but there's no direct indication of imminent danger to the person reporting or others. It expresses concern but lacks specific threats or escalation.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 11:16:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Felt sick. Should I have done something? Now I just feel guilty for walking away.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an act of violence (shoving) suggests potential for escalation and physical harm to the girlfriend. While the text doesn't detail serious injury, the act of violence warrants concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 11:15:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Still processing things my ex said. Gaslighting is real, and it messes with your head. Anyone else gone through this? How did you start to trust your own judgment again?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes emotional distress and questioning of self-judgment due to gaslighting, but doesn't indicate immediate danger to self or others.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 11:14:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed yesterday, almost relapsed. Reached out to a friend instead. Still struggling, but glad I didn't give in. Talking helps, even if it's just a little.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a near relapse, suggesting significant distress and vulnerability. While the person reached out for help, the risk of future relapse and potential escalation remains.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 11:13:49"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up. Dude was really hurt. Makes you think, you know? Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports witnessing a violent fight resulting in injury, suggesting potential for escalation or desensitization to violence. The statement 'Makes you think, you know? Anyone else feel on edge lately?' indicates potential psychological distress.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 11:12:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I keep making excuses for him, but the yelling's getting worse. Last night... I don't even want to say it. Is this still abuse if he hasn't hit me? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Escalating verbal abuse and reluctance to disclose further details suggest a potential for physical violence and significant emotional distress.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 11:11:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is anyone else feeling this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, and reaching out for help. While there's no explicit mention of self-harm or suicide, the \"underwater\" metaphor and feelings of desperation suggest potential risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 11:10:43"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw two guys fighting outside my building last night. Shook me up. Anyone else feel on edge lately? Makes me want to move.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing unease and a desire to move, but doesn't indicate direct threat or imminent danger to the poster or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 11:09:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Learn the signs, folks. It can happen to anyone. Be safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose was reversed, the text describes a life-threatening situation and highlights the potential for future occurrences.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 11:08:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed ('underwater'), indicating significant distress and a need for help. While not explicitly suicidal, the sense of desperation and reaching out suggests a potential for escalation if support is not provided.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 10:20:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Trying to distract myself but it's hard. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which suggests a potential for self-harm or other harmful behaviors. While the individual is trying to distract themselves and seeking support, the presence of urges elevates the risk beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 10:19:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"He apologized again, flowers & promises. Said it won't happen again. This is the 4th time. Is it ever going to stop? Feeling so lost & alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Pattern of repeated apologies and promises after recurring incidents suggest a potential cycle of abuse. The feelings of being lost and alone increase the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 10:18:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just... heavy. Reaching out before things get worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a desire to reach out 'before things get worse,' which suggests potential escalation towards self-harm or suicidal ideation. The user is implicitly asking for help, indicating a need that isn't being met and a desire to prevent a negative outcome.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 10:17:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, stronger than before. Trying to stay strong, but it's exhausting. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges and feelings of being overwhelmed, suggesting a potential risk of self-harm or other negative coping mechanisms. While the individual expresses a desire to stay strong, the level of exhaustion raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 10:16:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend in the street. Froze. Someone called the cops, but I feel sick. Is there anything else I could have done? Really shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessed a violent assault indicating immediate physical danger to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 10:15:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things are bad at home again. I feel so alone and don't know where to turn. Anyone else been through this?\"\n\n**Option 2 (Raising Awareness):**\n\n> \"It's not always physical. Gaslighting & emotional manipulation are abuse too. Don't let anyone diminish your feelings.\"\n\n**Option 3 (Sharing a Story):**\n\n> \"Finally left. Hardest thing ever, but I deserve peace. It's okay to choose yourself. #Survivor\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The texts suggest emotional distress, potential abuse, and a user in a vulnerable state. While not explicitly mentioning self-harm or suicide, the feelings of loneliness and the reference to leaving a difficult situation warrant moderate concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 10:14:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary. Narcan saved them, thank god. Makes you realize how close we all are to the edge. Learn CPR, carry Narcan. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event requiring Narcan intervention, indicating a serious, potentially life-threatening situation, although the individual survived. The call to action suggests the event had a significant impact.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 10:13:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park yesterday. Scariest thing ever. Narcan saved him, but it shook me up. Anyone know where to get training on how to use it? Feel like I need to be prepared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and highlights the presence of opioid use/abuse in the community. While the person survived, the potential for future overdoses and the emotional impact on the witness warrant a medium severity rating. The individual's expressed need for Narcan training reinforces the perceived risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 10:12:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things are bad at home again. Walking on eggshells. Anyone know resources for emotional abuse?\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Took me years to realize yelling & control *is* abuse. Still feels weird calling it that after all this time.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Remember abuse isn't always physical. Gaslighting & manipulation leave scars too. Don't ignore it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse, which can escalate to physical violence or contribute to mental health crises. Option 1 indicates an acute situation (\"Things are bad at home again\") and a need for resources.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 10:11:30"
  }
]