[
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Naloxone saved him, thank god. Makes you realize how fragile life is. Learn the signs, carry Narcan. You could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event indicating a risk of future overdose events in the area and highlights the immediate danger of opioid use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-17 03:43:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about the OD crisis again. Scares me. Lost a friend last year. If you're struggling, please reach out. There are people who care. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and acknowledges the OD crisis, directly referencing the loss of a friend. While not explicitly stating suicidal intent, the mention of struggle and encouragement to reach out suggests a potential vulnerability and elevated risk, especially considering the context of overdose. It is above general anxiety but below immediate danger.",
    "detected_category": "overdose",
    "timestamp": "2025-12-17 03:42:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. Small things, but escalating. I feel so stupid for letting him back in. Anyone know resources for emotional abuse support? I feel trapped.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a pattern of escalating emotional abuse and a feeling of being trapped, suggesting a potential for increased risk of harm over time. The user is seeking support, indicating awareness of the problem, but the escalation and feeling of entrapment elevate the severity beyond 'low'.",
    "detected_category": "abuse",
    "timestamp": "2025-12-17 03:41:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Almost relapsed. Reached out to a friend instead. Still hurts, but I'm here. It's a day-by-day thing, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a near relapse, suggesting a significant struggle and vulnerability. While the individual reached out for help, the risk of relapse remains a concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-17 03:40:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? How did you find the strength to leave?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, leading to feelings of isolation. While not explicitly mentioning physical harm or suicidal ideation, the situation implies a potential for escalation and requires attention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-17 03:39:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Felt so overwhelmed last night, relapsed after 6 months clean. Disappointed in myself but trying to remember recovery isn't linear. Back to therapy tomorrow. One day at a time.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential vulnerability and increased risk. While the individual expresses disappointment and plans to re-engage with therapy, the relapse itself presents a moderate level of concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-17 03:38:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Just trying to get through the day without giving in. Anyone else feel this way? It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with urges and exhaustion, suggesting a potential for self-harm or relapse. The poster is reaching out for support, which implies they are aware of the potential danger but are actively fighting it.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-17 03:37:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to stay strong and remember why I stopped. Sending love to anyone else struggling tonight. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential risk of acting on them. While the individual is trying to stay strong, the presence of urges warrants a medium severity assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-17 03:36:43"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside the grocery store. Froze. Called the cops, but I feel sick. Wish I'd done more. Anyone else ever witness something like this? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing domestic violence is a severe situation due to the immediate risk of harm to the victim and the potential for escalation. While the witness themselves may not be in immediate physical danger, the event is emotionally distressing and involves a significant safety concern for the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-17 03:35:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... Feeling trapped. Anyone else been through this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and feeling trapped, indicative of a potentially abusive situation. While it doesn't explicitly mention physical violence or suicidal ideation, the feeling of being trapped and the mention of put-downs raise concern for emotional abuse and potential escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-17 03:34:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about the overdoses lately... it's scary. Almost lost a friend last year. Narcan is crucial, please learn how to use it. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions overdoses and a near-fatal experience of a friend, suggesting a real and present risk. While not a direct threat, it highlights a dangerous situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-17 02:51:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Not doing great. Urges are strong tonight. Just trying to breathe and remember this feeling will pass. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges, suggesting a potential risk of acting on them. While there's no explicit mention of self-harm or suicide, the intensity of the urges warrants a medium severity assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-17 02:50:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong, even though I know it's not the answer. Reached out to a friend, hoping they can help me through this. It's exhausting fighting this battle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating a potential for action. While the person acknowledges it's not the answer and reached out for help, the intensity of the urge elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-17 02:49:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Just talking feels impossible. Anyone else ever feel completely stuck?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of heaviness and being stuck, which suggests emotional distress. However, there is no explicit mention of self-harm, suicide, or harm to others.",
    "detected_category": "other",
    "timestamp": "2025-12-17 02:48:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so lost lately. Everything's just... heavy. Reaching out before things get worse. Anyone know of any good resources?\n\n**Option 2 (Sharing a Story):**\n\n> Thinking of my friend today. It's been a year. Please check in on the people you love. You never know what someone's going through.\n\n**Option 3 (Raising Awareness):**\n\n> It's okay to not be okay. Talking about it is the first step. Let's break the stigma surrounding mental health.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates distress and a desire to seek help 'before things get worse,' suggesting potential escalation if support isn't received. Option 2 references the loss of a friend, possibly by suicide, and encourages checking in on loved ones, hinting at a concern for others' well-being. While not explicitly suicidal, these combined factors suggest a need for monitoring.",
    "detected_category": "suicide",
    "timestamp": "2025-12-17 02:47:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Scariest thing ever. Narcan saved his life. Please, learn the signs of an overdose. It can happen to anyone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan, indicating a severe and immediate safety risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-17 02:46:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Just reaching out... has anyone else felt like they're just completely underwater? Could use some support.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain any explicit mentions of self-harm, suicide, violence, or abuse. It's primarily a general expression of distress and a request for support.",
    "detected_category": "other",
    "timestamp": "2025-12-17 02:45:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD. Scares me, honestly. Lost a friend last year. If you're struggling, please reach out. There are people who care. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and grief related to overdose deaths, indicating personal connection and awareness of risk. While not explicitly suicidal, the mention of becoming a statistic and the plea to reach out suggest potential vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-17 02:44:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank goodness. Makes you think, though. Anyone know where to get training around here? Want to be prepared if it happens again.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event and indicates a risk of future overdose incidents in the area. While the individual survived, the event highlights a potential public health concern and the need for preparedness.",
    "detected_category": "overdose",
    "timestamp": "2025-12-17 02:43:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been feeling so isolated lately. Constant put-downs disguised as \"jokes\" are really getting to me. Anyone else experience this? Starting to doubt my own sanity.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of isolation, being targeted by put-downs, and doubting sanity. While not explicitly stating suicidal ideation or self-harm, the erosion of self-worth and mental state poses a medium risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-17 02:42:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it feels like the only way to quiet them is to hurt. I know it's not right. Trying to find better ways to cope. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to self-harm as a coping mechanism, though it also indicates an awareness that it's not right and a desire to find better ways to cope. This suggests a potential for self-harm, making it a medium risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-17 01:47:11"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his car after getting a ticket. Made me jump. Reminded me of my dad. Anyone else get super triggered by stuff like that? Feeling anxious now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing an isolated act of anger (punching a car). While it caused anxiety in the observer and triggered a memory, there's no indication of immediate danger to self or others. The observer's anxiety is a reaction to the event, not necessarily a threat in itself.",
    "detected_category": "other",
    "timestamp": "2025-12-17 01:46:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but there is no explicit mention of self-harm, suicide, violence, or abuse. It's a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-17 01:45:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. Urges were strong, but I distracted myself with a movie. Small win. Anyone else relate? Just trying to get through it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges which, while managed, represent a risk. The nature of the urges is not specified, but the feeling of being overwhelmed suggests a potential for escalation if coping mechanisms fail.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-17 01:44:06"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, walking on eggshells... Feels like I'm losing myself. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a pattern of emotional abuse ('constant put-downs, walking on eggshells') which can significantly impact mental health and potentially escalate over time. The feeling of 'losing myself' is a concerning indicator of distress.",
    "detected_category": "abuse",
    "timestamp": "2025-12-17 01:43:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Narcan saved them. Please, if you or someone you know is struggling, reach out. There's help out there. Don't be afraid.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while thankfully averted with Narcan, indicates a potentially life-threatening situation and highlights the prevalence of drug use in the area. The call for help suggests awareness of ongoing struggle and potential for future incidents.",
    "detected_category": "overdose",
    "timestamp": "2025-12-17 01:42:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm underwater. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of deep sadness and helplessness ('feeling so low,' 'underwater,' 'don't know what else to do'). This suggests emotional distress and a potential risk of self-harm or suicidal ideation, although there is no explicit mention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-17 01:41:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after almost losing my best friend to an OD. Scariest night of my life. Please, if you're struggling, reach out. There are people who care and want to help. Don't let shame keep you silent.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event of a close friend, indicating a significant and immediate risk of potential harm or death associated with substance abuse. The author's emotional distress also suggests potential vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-17 01:39:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells lately. Partner gets angry so fast, then apologizes like it never happened. Starting to feel crazy. Is this normal? Anyone else experience this? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of anger and apology which can be indicative of emotional abuse or manipulation. The feeling of 'walking on eggshells' and 'feeling crazy' suggest significant distress. While not explicitly stating violence or self-harm, the situation warrants concern and further investigation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-17 01:38:57"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Things got really bad last night. I'm finding it hard to cope. Reached out to a helpline, feeling a little better knowing someone heard me. It's a long road.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates difficulty coping and a recent crisis ('Things got really bad'). While the person reached out for help, the statement 'It's a long road' suggests ongoing distress and potential vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2025-12-17 01:37:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking feels impossible, but I know I need to. If anyone else has been here, what helped?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and unable to communicate, which are indicators of distress. The user is reaching out for help, suggesting a willingness to seek support, but the underlying feelings could escalate if unaddressed.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-17 00:44:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just need to vent. He yelled again, broke a plate. Said it was my fault. Feels like I'm walking on eggshells all the time. Is this normal? I'm so tired.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes verbal abuse, property destruction (breaking a plate), and a feeling of being constantly on edge, indicative of a potentially escalating abusive situation. While there's no direct threat of violence, the yelling and blaming combined with the impact on the person's well-being suggests a risk of further harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-17 00:43:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain any explicit threats or plans for self-harm or harm to others. It indicates a desire for connection and support.",
    "detected_category": "other",
    "timestamp": "2025-12-17 00:42:41"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight downtown last night. Shook me up. This city's getting rougher. Anyone else feel unsafe lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feeling unsafe due to witnessing a fight, but doesn't indicate imminent danger or direct involvement. It's more of a general observation about increasing crime.",
    "detected_category": "violence",
    "timestamp": "2025-12-17 00:41:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Relapsed after 6 months clean. Feeling so ashamed and alone. Reaching out for support again. It's a daily battle.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety can increase the risk of dangerous behaviors or accidental overdose due to reduced tolerance. Feelings of shame and isolation can exacerbate the situation and increase vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-17 00:40:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nJust saw a news story about another OD. Scared. My brother's struggling & it feels like we're just waiting for the other shoe to drop. Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses fear about a brother's potential overdose, implying a high risk of a life-threatening situation. The phrase \"waiting for the other shoe to drop\" indicates anticipation of a negative outcome related to the brother's struggle.",
    "detected_category": "overdose",
    "timestamp": "2025-12-17 00:39:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scared me. Narcan saved him, thank god. Makes you realize how close it is. Learn CPR/how to use naloxone, seriously. Could save someone you know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual survived due to Narcan, a drug overdose indicates a significant health risk and potential for fatal consequences. The text expresses fear and emphasizes the proximity of such incidents, suggesting a relevant community risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-17 00:38:35"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about the ODs lately... scary. Lost a friend last year. If you're struggling, please reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions overdoses and the loss of a friend, suggesting a potential risk of overdose or self-harm due to grief and the acknowledgement of struggling. While the author is encouraging help-seeking, the presence of these elements elevates the risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-17 00:37:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been walking on eggshells lately. Constant criticism, nothing I do is right. Is this normal in a relationship? Feeling lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 61 (char 86)",
    "detected_category": "unknown",
    "timestamp": "2025-12-17 00:36:31"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy shove his girlfriend on the street today. Just walked right past like it was normal. I froze. Wish I'd said something. Feeling sick about it. Anyone else ever experience something like that? What do you DO?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent act (shoving) suggests a potential for escalation and harm to the victim. The poster expresses distress and seeks advice, indicating a recognized problem.",
    "detected_category": "violence",
    "timestamp": "2025-12-17 00:35:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just need to vent. Another fight, another slammed door. He says he's sorry, but I'm starting to feel like sorry isn't enough anymore. Is this normal? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes a fight and feelings of being lost, but there are no explicit mentions of self-harm, suicide, violence towards others, abuse, or overdose. The context suggests a relationship issue causing emotional distress, but the immediate risk appears low.",
    "detected_category": "other",
    "timestamp": "2025-12-16 23:18:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the park. Scared me so bad. Reminded me of things I try to forget. Anyone else feel like certain places just trigger bad memories? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and experiencing triggered memories, indicating distress and potential anxiety, but there is no explicit threat or indication of immediate danger to the individual or others. The focus is on personal feelings and coping mechanisms.",
    "detected_category": "other",
    "timestamp": "2025-12-16 23:17:02"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just feeling so lost. Things escalated again last night. Walking on eggshells constantly. Anyone else ever feel like they're losing themselves in a relationship?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates relationship distress, potential emotional abuse (walking on eggshells), and a feeling of loss of self. While there's no explicit mention of harm, the escalating conflict and emotional distress suggest a need for concern and further investigation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 23:16:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel so trapped. Anyone else been through this? I need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving controlling behavior and constant put-downs, indicating potential emotional abuse and a feeling of being trapped. While there's no explicit mention of physical harm or suicidal ideation, the situation could escalate and requires attention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 23:14:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Narcan saved them, but it shook me. Please, if you're using, carry it. And know the signs. It can happen to anyone. Be safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was successful in this instance, a recent overdose event indicates a risk of future overdoses and potential fatalities, especially if Narcan isn't available or administered in time. The event shook the person who witnessed it, indicating it was a serious incident with potential for severe consequences.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 23:13:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n>  Relapsed. Feeling so numb, but also overwhelmed. Reaching out because I don't know what else to do. Anyone else been here?\n\n**Option 2 (Sharing Experience):**\n\n>  3 weeks clean. It's hard, ngl. Some days the urge is unbearable. Just trying to take it one day at a time.\n\n**Option 3 (Raising Awareness):**\n\n>  Wish people understood self-harm isn't attention-seeking. It's a sign someone's hurting too much to cope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates a relapse and feelings of being overwhelmed, suggesting potential immediate risk. Option 3 addresses self-harm, pointing to a potential for harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 23:12:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post that addresses the topic of suicide in a way that aims to be authentic and encourages help-seeking:\n\n\"Things have been really dark lately.  Just feeling so overwhelmed. Reached out to a friend, and it helped a little.  Gonna try calling the lifeline tomorrow.  One step at a time, I guess.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post expresses feelings of being overwhelmed and experiencing a dark period, which suggests a risk for suicidal ideation. The user is taking steps to seek help (reaching out to a friend and planning to call a lifeline), which mitigates the risk somewhat, but the presence of suicidal thoughts necessitates a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 23:11:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough night. Felt that familiar urge again. Reached out to a friend instead. Still shaky, but a little lighter. It's a long road, but I'm still walking.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with urges, implying a potential risk. Reaching out to a friend is a positive coping mechanism, but the continuing feeling of shakiness suggests the urge was significant and may resurface. The mention of a 'long road' suggests an ongoing struggle requiring continued vigilance.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 23:10:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant yelling, walking on eggshells... I feel so small. Has anyone else been through this? How did you cope? I need to find a way out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with constant yelling and a feeling of being small, suggesting emotional distress and potential for escalation. The phrase 'I need to find a way out' indicates a desire to escape the situation, implying it is becoming unbearable, and needs further evaluation to determine if the person may attempt to harm themselves or others.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 23:09:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after a scare. Mixing meds is NO joke. Please be careful and know what you're taking. Almost didn't make it. Sober now, but damn that was close. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a near-fatal event due to mixing medications, suggesting a significant risk of severe health consequences or death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 23:08:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Please, if you're using, have Narcan. It can save a life. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event, indicating a life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 22:17:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... it's terrifying. Lost a friend last year. If you're struggling, please reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a friend's death from overdose and expresses fear, indicating a potential for increased risk in individuals struggling with similar issues. While not explicitly stating suicidal ideation, the context of overdose death and a call for help suggest vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 22:16:47"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy get shoved on the train platform today. Scared me half to death. People just walked around him. Is everyone okay? Feels like things are escalating lately.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes a single instance of violence (shoving), the concern is that 'things are escalating lately,' suggesting a potential pattern or increased risk of similar incidents. The victim being ignored raises further concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 22:15:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Just trying to make it through the day without giving in. Anyone else relate? Feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and a struggle to cope, suggesting potential self-harm risk. The individual expresses feeling alone, which can exacerbate the situation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 22:14:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scared me. Naloxone worked, thank god. It can happen to anyone. Learn the signs, carry Narcan if you can. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose incident, which while successfully addressed, represents a significant health risk and potential for fatality. Witnessing such an event can also have a psychological impact.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 22:13:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his car mirror after getting a ticket. Made me jump. Reminded me too much of my dad. Anyone else get triggered by seemingly small acts of anger? Feeling shaky.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing an act of anger that triggered a negative emotional response in the author. While the author is experiencing distress, there is no indication of immediate danger to themselves or others.",
    "detected_category": "other",
    "timestamp": "2025-12-16 22:12:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"It's hard to admit, but things at home haven't been good. Constant put-downs, isolating me from friends... feels like I'm walking on eggshells. Anyone else been through this? Feeling so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (put-downs, isolation) which can escalate to more severe harm. The mention of feeling alone and 'walking on eggshells' suggests a stressful and potentially dangerous environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 22:11:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post addressing suicidal feelings, while staying within the constraints and focusing on seeking help:\n\n\"Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to talk to someone.  Anyone know good resources?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions feeling \"so low\" and like a \"dark cloud won't lift,\" which, coupled with the expressed need to \"talk to someone,\" suggests potential suicidal ideation. Even though the post focuses on seeking help, the underlying sentiment indicates a serious crisis.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 22:10:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just left. Again. I'm so tired of this cycle. Anyone know resources for emotional abuse support in [City]? Feeling lost and worthless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and mentions a cycle of abuse, suggesting a potentially escalating situation. The user is actively seeking support resources.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 22:09:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, suggesting potential emotional distress and a cry for help. While not explicitly suicidal, the metaphor of being 'underwater' hints at feeling suffocated and unable to cope.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 22:08:32"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy get shoved on the subway. Everyone just stared. Makes you wonder if anyone would actually help if things got worse.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A physical assault occurred, and the lack of intervention suggests a potential for escalation or further harm. While the immediate risk may be low since the text implies it was a single shove, the implied inaction of bystanders and potential for worsening violence elevates the risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 21:18:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. If you've been there, how did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but there is no explicit mention of self-harm, suicide, violence, abuse, or overdose. It appears to be a general cry for help and support.",
    "detected_category": "other",
    "timestamp": "2025-12-16 21:17:44"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard shouting next door again last night, then a crash. Called the cops anonymously before, but it keeps happening. Anyone know resources for domestic disturbances? Feel helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Repeated domestic disturbances with potential for escalation. The poster expresses feeling helpless, suggesting emotional distress.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 21:16:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but it lacks specific indicators of immediate harm to self or others. It's a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-16 21:15:41"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Relapsed after 6 months clean. Feeling so ashamed and alone. Reached out to my therapist, but waiting is hard. Anyone else been there? Just need to know I'm not the only one.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety can be a trigger for increased risk. The user expresses feelings of shame and loneliness, which can exacerbate the situation. While they reached out to a therapist, the waiting period introduces a vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 21:14:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Never thought it'd happen to someone I know. My neighbor OD'd last night. Narcan saved him, thank god. This stuff is scary real. Please, know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Neighbor's overdose highlights risk, even though Narcan was effective. Encourages awareness of overdose signs.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 21:13:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit statements or plans for self-harm, suicide, violence, abuse, or overdose. It appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-16 21:12:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...bad. Walking on eggshells constantly. Anyone else ever feel like they're losing themselves? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 88 (char 113)",
    "detected_category": "unknown",
    "timestamp": "2025-12-16 21:11:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just reaching out to see if anyone else feels this way? Don't know what to do anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of lostness and helplessness, but lacks specific details indicating immediate danger.",
    "detected_category": "other",
    "timestamp": "2025-12-16 21:10:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, having a really rough night. Urges are strong. Trying to distract myself but it's hard. Anyone else feel this way sometimes? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and difficulty coping, suggesting a potential risk. While not explicitly stating intent, the vulnerability expressed warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 21:09:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD hit way too close to home. Lost a friend last year. Please, if you're struggling, reach out. There's help out there. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about overdose and mentions the loss of a friend, indicating a potential risk for individuals struggling with substance use. While not explicitly stating suicidal intent, the context implies a heightened risk of self-harm or accidental overdose due to substance abuse.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 20:19:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately, like I'm underwater. Reaching out to a friend, hoping it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of heaviness and seeking support from a friend, suggesting distress but not an immediate plan or intent for self-harm or suicide. The phrase 'It's okay to not be okay' indicates an awareness of mental health struggles and a willingness to acknowledge them.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 20:18:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Old coping mechanisms almost won. Reached out to a friend instead. Still shaky, but here. Talking helps, even if it's just a little.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feeling overwhelmed and nearly relapsing into old, potentially harmful coping mechanisms. While they reached out for help, they are still feeling shaky, indicating ongoing distress and vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 20:17:49"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. Resisting the urge to relapse is so hard sometimes. Just gotta keep breathing, I guess. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with resisting relapse, suggesting a potential risk of self-harm, even if not explicitly stated. The statement 'resisting the urge' coupled with 'bad day' implies distress and vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 20:16:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Trying to resist, but it's hard. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting) and difficulty resisting it, indicating active ideation and potential for imminent harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 20:15:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been...bad. Constant yelling, put-downs. Starting to feel like I'm walking on eggshells. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with emotional abuse indicators (yelling, put-downs, walking on eggshells). While not explicitly stating physical harm, the consistent negative atmosphere poses a risk to mental well-being and could escalate.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 20:14:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling so lost and empty. Reaching out to a friend tonight. Just need to know I'm not alone in this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates feelings of loneliness and emptiness, but doesn't express explicit intent for self-harm or suicide. Reaching out to a friend is a positive coping mechanism.",
    "detected_category": "other",
    "timestamp": "2025-12-16 20:13:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mentions of self-harm, suicide, violence, or abuse. It is a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-16 20:12:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm starting to realize the yelling and control isn't normal. Feels like walking on eggshells all the time. Anyone else been through this? How did you even begin to get out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving yelling and control, creating a feeling of constant anxiety ('walking on eggshells'). This suggests emotional and potentially psychological abuse, which can escalate. The question about how to 'get out' indicates a desire to escape a potentially harmful situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 20:11:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them. Please, learn CPR and how to use it. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was successful, an overdose event is inherently risky and life-threatening. The event caused distress and the text urges others to learn life-saving skills.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 20:10:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Cutting again after 6 months clean. Feels like such a failure. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Relapse into self-harm after a period of abstinence, coupled with feelings of failure and isolation, indicates a significant risk of continued or escalating self-harm behavior.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 19:18:33"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. It's one thing to read about it, another to see it. Anyone else feel like things are getting more volatile lately? Feeling uneasy.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing unease and a feeling of increased volatility. While unsettling, it doesn't indicate immediate danger to the author or others. The observation of a fight is a single incident and lacks specifics to suggest an escalating threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 19:17:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been walking on eggshells lately. Partner's temper is so unpredictable. Just needed to say it out loud, feels less real in my head. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Unpredictable temper suggests potential for escalation and the phrase \"walking on eggshells\" implies fear and emotional distress. This could lead to emotional or psychological abuse, or potentially physical violence.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 19:16:29"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the corner store. Shaken up. Reminded me of things I try to forget. Anyone else get triggered by stuff like that? Feeling anxious.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses anxiety and being triggered by a violent event, but does not indicate immediate danger or intent to harm self or others.",
    "detected_category": "other",
    "timestamp": "2025-12-16 19:15:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Just wanted to reach out and see if anyone else knows what it's like. It's getting hard to see the point. Talking helps, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a lack of purpose ('hard to see the point'), which are risk factors for suicidal ideation. While not explicitly stating intent to harm oneself, the mention of talking helping suggests the individual is struggling and seeking support.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 19:14:26"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just need to vent. Another fight, more yelling. He smashed a plate this time. Scared. Is this...normal? Feeling so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Escalating violence (smashing a plate) coupled with fear suggests a potential risk of further harm. The user explicitly states they are 'scared'.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 19:13:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to quiet things down is to hurt. I know it's not, but the feeling is so strong. Trying to find better ways to cope. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to hurt oneself, indicating potential self-harm. While the person acknowledges it's not the right solution and is seeking alternative coping mechanisms, the intensity of the feeling elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 19:12:22"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Still can't believe it happened. Gaslighting messes with your head, makes you doubt everything. Anyone else been through this? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of confusion and being lost due to gaslighting, but it doesn't explicitly mention self-harm, suicide, or violence. The distress seems emotional and psychological, rather than posing an immediate physical threat.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 19:11:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is getting stronger. Reached out to a friend, but it's still tough. Anyone else relate? Just trying to get through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm and indicates the individual is struggling despite reaching out for support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 19:10:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Scared. Found my brother unresponsive yesterday. Narcan saved him. Please, if you're using, carry it. It's not worth the risk.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Brother experienced a life-threatening overdose requiring Narcan. Near-fatal event indicates a high risk of future overdose and potential fatality.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 19:09:17"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so incredibly alone lately. Like I'm underwater and can't breathe. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 70 (char 95)",
    "detected_category": "unknown",
    "timestamp": "2025-12-16 18:22:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. Urges were really strong. Managed to distract myself with a movie, but it's exhausting. Anyone else relate? Just feeling really alone right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges and feelings of isolation, which are risk factors. While the person managed to distract themselves, the exhaustion and feeling alone suggest ongoing vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 18:21:11"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and overwhelmed, indicating emotional distress. The phrase \"I don't know what else to do\" suggests a potential escalation risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 18:20:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a tough week. Feeling really overwhelmed and alone. Reaching out in case anyone else knows what this is like. Could use a friendly ear.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of overwhelm and loneliness, indicating emotional distress but lacks specific threats or plans for self-harm or harm to others.",
    "detected_category": "other",
    "timestamp": "2025-12-16 18:19:08"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Makes you wonder what people are going through. Scared me, honestly. Hope everyone involved is okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessed a fight, expresses concern but no direct threat or ongoing danger to the reporter. Limited information, impact appears primarily emotional.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 18:18:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and a lack of coping mechanisms, indicating potential for escalation if support is not received. The phrase \"I don't know what else to do\" suggests a limited ability to find solutions on their own.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 18:17:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things are rough at home lately. Walking on eggshells all the time. Anyone know of resources for emotional abuse? Feeling so lost.\"\n\n**Option 2 (Sharing a Story):**\n\n> \"Never thought it would happen to me. Gaslighting is real. It messes with your head. Slowly finding my way out.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Don't dismiss controlling behavior as 'love.' It can escalate. Know the signs of abuse. Your safety matters.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The texts indicate potential emotional and psychological abuse, which, while not immediately life-threatening, can escalate and significantly impact mental health. Gaslighting is mentioned, which is a form of manipulation and control.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 18:16:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy, and I'm not sure how to find my way back to feeling okay. Reaching out in case anyone has felt this way and has some advice.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but there's no explicit mention of self-harm, suicide, or harm to others. It's a general expression of distress and a request for advice.",
    "detected_category": "other",
    "timestamp": "2025-12-16 18:15:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Walking on eggshells constantly. Anyone else feel like they're losing themselves in their relationship? Need to figure out next steps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult and stressful home environment (\"walking on eggshells\") and a loss of self within the relationship. This suggests potential emotional distress and the possibility of escalation to more serious issues if not addressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 18:13:57"
  },
  {
    "title": "User Story: Abuse",
    "content": "```\nBeen walking on eggshells lately.  Everything I do is wrong.  Is this normal in a relationship?  Starting to feel really small.  Anyone else experienced this?  Don't know where to turn.\n```",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Feeling consistently criticized and diminished within a relationship can indicate emotional abuse. The phrase 'walking on eggshells' suggests a pattern of controlling behavior. While there's no explicit mention of harm, the feeling of being 'really small' and not knowing 'where to turn' suggests a potential for escalation if the situation persists or worsens.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 18:12:55"
  }
]