[
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud is constantly over me. Reaching out to a friend, hoping it helps. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and low mood, but does not contain explicit statements of self-harm or suicidal intent. The individual is also reaching out to a friend for support, which is a positive coping mechanism.",
    "detected_category": "other",
    "timestamp": "2026-01-23 18:22:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like nothing matters. Reaching out because I know I need help. Talking to someone feels impossible right now, but I'm trying. Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a need for help, suggesting potential for self-harm or suicidal ideation, though not explicitly stated. The user acknowledges the need for help but is struggling to reach out.",
    "detected_category": "suicide",
    "timestamp": "2026-01-23 18:21:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scary stuff. Narcan saved their life. Please, carry it if you can. Knowing how to use it is vital. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a friend's recent overdose requiring Narcan, indicating a high risk of further overdose events and potential fatalities within the social circle.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 18:20:38"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes a violent incident, it's a second-hand account. However, the mention of someone being 'knocked out cold' indicates a potential for serious injury, and the author's feeling of being 'on edge' suggests broader unease about the situation, warranting a 'medium' risk assessment.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 18:19:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Relapsed last night after 6 months clean. Feeling ashamed, but trying to reach out instead of spiraling. Any advice on coping with the guilt?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential for increased vulnerability and risk. While the individual is reaching out for help, the feelings of shame and guilt can contribute to further negative coping mechanisms.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-23 18:18:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved their life. Please, if you're using, carry it. It's free & can save someone you love. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a recent overdose event requiring Narcan, indicating a high-risk situation for potential future overdoses or harm to self or others.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 18:17:33"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside my building. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately? Need to breathe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing emotional distress but not indicating direct threat or involvement. The mention of feeling 'on edge' and needing to 'breathe' suggests anxiety rather than imminent danger or risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 18:16:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just realized yelling doesn't bruise, but it sure as hell breaks something inside. Feeling so lost and small. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, small, and broken inside, potentially indicating emotional distress and vulnerability. While it doesn't explicitly mention self-harm or suicide, the mention of 'breaking something inside' after describing yelling could be an indication of emotional abuse and its impact. The request for coping mechanisms further highlights the individual's need for support.",
    "detected_category": "abuse",
    "timestamp": "2026-01-23 18:15:29"
  },
  {
    "title": "User Story: Violence",
    "content": "My neighbor's been screaming again. I heard things breaking. Called the cops last time, but it just escalated after they left. Anyone know what to do? I'm genuinely scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential escalating situation involving violence at the neighbor's residence. The mention of things breaking and the previous escalation after police intervention suggests a risk of harm to the neighbor or potentially the reporting individual.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 18:14:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want the pain to stop. Not looking for attention, just wondering if anyone else feels this way? It's scary.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses a desire for pain to stop and uses the word 'scary,' indicating distress and potential suicidal ideation, though lacking explicit plans.",
    "detected_category": "suicide",
    "timestamp": "2026-01-23 18:13:25"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, walking on eggshells... I'm starting to feel like I'm losing myself. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional distress and a potentially abusive environment. While not explicitly stating harm, the feelings of losing oneself and the mention of 'constant put-downs' and 'walking on eggshells' suggest a negative impact on mental well-being and potential escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-23 17:21:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "> Things have been rough at home lately. Walking on eggshells constantly. Anyone else ever feel like they're just waiting for the next explosion? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a stressful and potentially abusive home environment, using phrases like \"walking on eggshells\" and \"waiting for the next explosion.\" This suggests a heightened level of distress and potential for harm within the household, although the target and nature of that harm are unclear.",
    "detected_category": "abuse",
    "timestamp": "2026-01-23 17:20:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and reaching out for help, suggesting emotional distress. While it doesn't explicitly mention self-harm or suicidal ideation, the metaphor of being 'underwater and can't find the surface' indicates a significant level of distress that warrants concern and further assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-23 17:19:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel trapped. Has anyone else experienced this? I don't know what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, indicating possible emotional or psychological abuse. The feeling of being 'trapped' suggests a significant impact on the individual's well-being.",
    "detected_category": "abuse",
    "timestamp": "2026-01-23 17:18:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Reached out to a friend, feels good to not be alone with this. Remember you're not either. 💚",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, implying a potential for self-harm or relapse. Reaching out to a friend is a positive coping mechanism, but the presence of the urges elevates the risk to medium.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-23 17:17:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Reached out to a crisis line, feels like a small step. Anyone else relate? Just feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of isolation, which increases risk. Reaching out to a crisis line is a positive sign, but the presence of urges necessitates a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-23 17:16:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed ('underwater'), and a sense of helplessness. While not explicitly stating suicidal intent, the intensity of the negative emotions and the plea for help suggest a significant level of distress that warrants concern and further assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-23 17:15:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things aren't good at home. He's been yelling more, and last night... I don't know what to do. Feeling lost. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential escalation of abuse at home, involving yelling and an unspecified incident ('last night...') causing distress. While not explicitly stating physical violence, the vagueness and feeling of being lost raise concerns about potential for harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-23 17:14:38"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of things I try to forget. Anyone else feel like violence just keeps escalating? How do you guys cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses distress and concern about violence, but doesn't indicate immediate danger or intent to harm self or others. It primarily describes being shaken by witnessing a fight and reflects a general worry about escalating violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 17:13:36"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got decked, out cold. Shook me up. Makes you realize how quickly things can escalate. Anyone else ever witness something like that? Feeling kinda on edge now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be disturbing, but there's no indication of ongoing danger or direct threat to the individual or others beyond the initial event.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 17:12:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. urges are strong. Just trying to breathe and remember this feeling will pass. Anyone else relate? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges, suggesting distress and potential risk of self-harm, but explicitly mentions coping mechanisms. The need for validation implies a desire to avoid acting on the urges.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-23 16:21:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Naloxone saved them, but it really shook me. Learn the signs, carry Narcan. It could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while fortunately resulting in survival, is a significantly distressing event. The call to action suggests the prevalence of the issue.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 16:20:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after a near OD. Scariest thing ever. Please, if you're struggling, reach out. Don't want anyone to go through that. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent near-fatal overdose, indicating a high risk of recurrence and significant underlying issues.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 16:19:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. The urge to cut is so strong. Trying to distract myself, but it's hard. Anyone else get this? How do you cope? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating a potential risk. While the person is attempting to distract themselves and seeking support, the intensity of the urge suggests a need for concern and possible intervention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-23 16:18:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. urges are back. trying to stay strong and remember why i stopped. anyone else relate? just feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a relapse in a previous struggle. While not explicitly stating intent, the feeling of being overwhelmed and alone raises concern for potential self-harm or harm to self through unhealthy coping mechanisms. The user is reaching out, implying a need for support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-23 16:17:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, but it shook me up. Makes you think about how easily it can happen. Be careful out there, friends. And learn CPR.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose event was witnessed by the author and Narcan was available, overdose events can lead to permanent health concerns or death. The user is also reporting distress and is reminded to be careful, indicating an awareness of risk. Overdoses can have a permanent health impact and carry risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 16:16:16"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge after witnessing something like that? Kinda need to vent.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but does not directly indicate immediate danger to the author or others. It expresses feeling shaken and on edge, suggesting emotional distress but not an immediate threat.",
    "detected_category": "other",
    "timestamp": "2026-01-23 16:15:14"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy, and I'm not sure where to turn. Just need to find a little light somewhere. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit suicidal ideation, self-harm behaviors, or plans. It expresses a need for help and light, suggesting a desire for improvement rather than harm.",
    "detected_category": "other",
    "timestamp": "2026-01-23 16:14:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's getting harder to pretend everything's okay. The put-downs are constant, and now things are getting physical. Feeling so trapped. Anyone know where to start getting help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates escalating abuse, including physical violence, and a feeling of being trapped, suggesting significant immediate risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-23 16:13:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw on the news about another OD. Scares me. Lost a friend last year. If you're struggling, please reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text is about overdose awareness and support, the mention of a recent overdose and loss of a friend indicates a potential for emotional distress and vulnerability, moving it beyond a simple awareness message.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 16:12:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Just reaching out to say it's been tough, and I'm trying to find my way back. If anyone's been there, any advice is welcome.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and struggling, but doesn't mention any specific plans or intent to harm oneself or others. It's a general expression of distress and a request for help.",
    "detected_category": "other",
    "timestamp": "2026-01-23 15:20:44"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a guy get shoved on the train platform today. Heart's still racing. People just walked past. Is this normal now? Feeling sick about it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person who wrote the text was not personally harmed, they witnessed a violent act that caused them significant distress. The incident suggests a potential for serious injury to the victim and a concerning lack of intervention from bystanders.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 15:19:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, having a really rough night. The urge to relapse is so strong. Trying to distract myself, but it's hard. Anyone else ever feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a strong urge to relapse, suggesting a potential risk to the individual's well-being. While the user is seeking support and attempting distraction, the intensity of the urge elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-23 15:18:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm drowning and can't see the surface. Reaching out because I don't know what else to do. Any advice or just someone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and drowning, indicating significant emotional distress and a potential need for support. While there isn't explicit mention of self-harm or suicidal ideation, the intensity of the negative feelings warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-23 15:17:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the party last night. Scariest thing ever. Narcan saved them. Please, learn how to use it. You could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was successful, the event indicates a potential ongoing risk of overdose in the community or at similar gatherings. The call to learn how to use Narcan implies this is not an isolated incident.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 15:16:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD in my town. It's terrifying. Lost a friend last year. If you're struggling, or know someone who is, please reach out. There are resources. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a recent overdose in the user's town and mentions the loss of a friend to overdose. While it's framed as a cautionary message and offers resources, the proximity and personal connection to overdose deaths indicate a heightened level of concern and potential risk for the user or their community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 15:15:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Shook me up. Should I have said something? Feel so guilty for just walking away. #violence #domesticabuse",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While a single shove doesn't indicate ongoing severe abuse, it constitutes an act of violence and potential escalation to more serious harm. The reported distress indicates a real possibility for significant impact.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 15:14:33"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD on the street today. Scary stuff. Luckily someone had Narcan. Reminded me of my brother... Please, if you're struggling, reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be traumatizing and trigger emotional distress. The text also alludes to personal connection with addiction, potentially increasing risk for the author.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 15:13:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm drowning and no one can see me. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, feeling like they are drowning and reaching out for help, suggesting a level of distress that needs attention but doesn't explicitly mention self-harm or suicide.",
    "detected_category": "suicide",
    "timestamp": "2026-01-23 15:12:30"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing outside my building. Sounded like it was escalating fast. Called the non-emergency line, hope they're okay. Makes you realize how common this stuff is. Anyone else feel helpless sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The argument was escalating and the witness felt the need to call the non-emergency line, suggesting a potential risk of violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 15:11:29"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got bad again and I relapsed. Feeling so ashamed and alone. Reaching out to my therapist tomorrow. Just needed to say it somewhere.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse indicates a return to potentially harmful behavior. Shame and isolation are risk factors for escalation. Seeking therapy is a positive mitigating factor.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-23 14:20:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the gas station last night. Scary stuff. Narcan saved them. Carry it. Learn how to use it. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose and the potential for future occurrences suggests a significant, albeit indirect, safety risk. The advice to carry and use Narcan implies a real possibility of encountering similar situations.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 14:19:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is anyone else feeling this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, potentially indicating a mental health crisis. The phrase 'underwater' can be interpreted metaphorically as feeling suffocated or unable to cope. Reaching out for help suggests a need for support.",
    "detected_category": "suicide",
    "timestamp": "2026-01-23 14:18:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scariest thing ever. Narcan worked, thank god. Learn how to use it, people. It saves lives. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even when reversed, is a significantly distressing event, indicating potential psychological impact on the person who reported it and highlighting an ongoing risk of overdose in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 14:17:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Is anyone else struggling?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but it does not contain any explicit or direct statements of self-harm, suicide, violence, abuse, or overdose. It expresses a desire for connection and shared experience, suggesting a willingness to seek support.",
    "detected_category": "other",
    "timestamp": "2026-01-23 14:16:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is back. Trying to stay strong and reach out instead. Anyone else feel this way? It's so isolating.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text explicitly mentions the return of the urge to self-harm, indicating an active risk, but also shows help-seeking behavior and an attempt to stay strong, suggesting a potential for intervention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-23 14:15:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant put-downs, isolating me from friends... feels like I'm walking on eggshells. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse (put-downs, isolation) which creates a hostile environment and significant emotional distress. While there's no explicit mention of physical harm, the \"walking on eggshells\" phrasing suggests potential for escalation and a climate of fear.",
    "detected_category": "abuse",
    "timestamp": "2026-01-23 14:14:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so heavy, y'know? Like tonight. Just trying to breathe and remember I'm not alone in feeling this way. Anyone else relate? Talking helps, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and a desire for connection. While it mentions difficulty breathing and feeling not alone, there are no explicit mentions of self-harm, suicide, violence, abuse, or overdose. The user is also actively seeking communication, which is a positive sign.",
    "detected_category": "other",
    "timestamp": "2026-01-23 14:13:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing stuff about overdoses lately and it's hitting hard. Lost a friend last year. Scared for others. Anyone know resources or just need to talk? It's okay to not be okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about overdoses and mentions the loss of a friend, indicating potential vulnerability and distress related to overdose risk in the community. While not explicitly stating intent, the fear for others and offer to talk suggests a need for support.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 14:12:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Just reaching out... has anyone else felt this way? How did you cope? Need some hope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and lack of meaning in life, which are risk factors for self-harm or suicidal ideation. While there's no explicit mention of self-harm or suicide, the expressed feelings warrant concern and further investigation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-23 14:11:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just realized the constant \"jokes\" about my weight aren't funny anymore. They're making me feel worthless. Anyone else deal with this kind of thing? How do you cope? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of worthlessness, which is a risk factor for mental health issues and potentially self-harm. While there's no explicit mention of self-harm or suicide, the expression of feeling 'lost' in response to feeling worthless indicates a need for support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-23 13:32:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling overwhelmed. Urges are strong tonight. Anyone else relate? Just need to know I'm not alone and maybe find some healthy distractions.\n\n**Option 2 (Sharing a Personal Story):**\n\n> Scars fade, but the memories don't. Proud of how far I've come, but still have tough days. Recovery is possible.\n\n**Option 3 (Raising Awareness):**\n\n> It's not attention-seeking, it's a cry for help. Please be kind and understanding. You never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 describes strong urges and feeling overwhelmed, suggesting immediate risk. While not explicitly suicidal, the intensity of the feelings warrants concern. Options 2 and 3 are more general but indicate potential past or present struggles.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-23 13:31:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is back, and it's scary. Reached out to a friend, hoping it helps. Remember we're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions the return of the urge to hurt oneself, indicating active suicidal ideation or self-harm ideation. Reaching out to a friend is a positive coping mechanism, but the presence of the urge elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-23 13:30:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Made me sick. Wish I'd said something, but I froze. Has anyone else been in that situation? How do you react? Feeling guilty.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, while not directly causing harm to the reporter, indicates a potential for escalation or further violence in the environment. The reporter also expresses guilt, which could lead to further distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 13:29:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want to feel *something* else. Scared myself last night. Reaching out for help today. It's not okay, and I deserve better.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feeling overwhelmed and a desire to feel 'something' else, coupled with the phrase 'scared myself last night,' which suggests a potential risk of self-harm or suicidal ideation. However, the individual is also proactively reaching out for help, indicating a protective factor.",
    "detected_category": "suicide",
    "timestamp": "2026-01-23 13:28:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want to feel *something* else. Anyone else ever feel that way? Trying to find healthier ways to cope. It's hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and a desire for a different emotional state. While concerning, it indicates an attempt to find healthier coping mechanisms, suggesting a degree of resilience and awareness. There are no explicit mentions of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2026-01-23 13:26:58"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Constant yelling, and yesterday... well, I'm scared. Anyone know resources for emotional abuse? I feel so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of ongoing emotional abuse and expresses fear. While it doesn't explicitly mention physical violence, the phrase 'yesterday... well, I'm scared' implies a potentially escalating situation. The user is seeking resources, indicating a recognition of the severity of their situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-23 13:25:57"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shaken up. Makes you realize how quickly things can escalate. Anyone else feel like violence is getting worse lately? Feeling anxious.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is upsetting, but there's no indication of direct threat, intent to harm self or others, or immediate danger. The person expresses anxiety, but not specific plans or threats.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 13:24:55"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, feeling isolated. Anyone else been through this? Need to figure out what to do next.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, indicating potential for escalating mental health issues. While there is no explicit mention of self-harm, suicide, or violence, the negative home environment and expressed need for help suggest a concerning situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-23 13:23:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them. Carry it, learn how to use it. It could save a life. This needs to stop.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a serious health crisis and potential for further incidents. While Narcan was effective in this instance, it highlights the ongoing risk and the need for preventative measures.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 13:22:51"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scariest thing ever. Narcan saved them. Learn CPR and how to use it. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an actual overdose event experienced by the author's friend, indicating a high risk scenario and potential for recurrence affecting both the original victim and potentially others in their social circle.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 12:25:33"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight downtown last night. Two guys just went at it. Makes you wonder what's going on in people's lives to get to that point. Feeling pretty shaken up today.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling and cause emotional distress, but there is no direct indication of immediate danger to the individual or others. The text describes a past event and the speaker's resulting feelings, not an active threat or plan.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 12:24:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a screen. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of numbness and detachment, coupled with a plea for help indicating potential distress and difficulty coping. While not explicitly suicidal, the feeling of disconnect and seeking support suggests a need for intervention.",
    "detected_category": "suicide",
    "timestamp": "2026-01-23 12:23:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nUgh, bad day. Really fighting the urge to relapse. Just need to make it through tonight. Anyone else been there? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses a strong urge to relapse, indicating a potential risk to their well-being. While not explicitly stating intent to harm themselves, the struggle suggests vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-23 12:22:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Screaming, threats... I feel so trapped. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving screaming and threats at home, creating a feeling of being trapped. While there is no explicit mention of physical violence or suicidal ideation, the escalation of verbal abuse and the feeling of entrapment suggest a potentially dangerous situation. The individual is also reaching out for help, indicating a recognition of the problem and a desire for intervention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-23 12:21:27"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the subway platform. Scared me senseless. Is everyone okay out there? Feels like things are escalating lately.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was physically assaulted (shoved) on a subway platform, indicating potential for injury. While the immediate outcome is unknown, the act itself constitutes violence and creates a risk of further harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 12:20:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post focusing on seeking help and sounding authentic:\n\n\"Been feeling so heavy lately. Like I'm underwater. Reached out to a friend, and it helped a little. Gonna try calling the lifeline tomorrow. Just gotta keep going.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and 'underwater,' which suggests a potential struggle with mental health. The individual has taken the positive step of reaching out to a friend and plans to contact a lifeline. However, the overall tone indicates ongoing distress and the need for further support, thus indicating the situation is more serious than low severity. It is not an immediate threat, but also not a safe state.",
    "detected_category": "suicide",
    "timestamp": "2026-01-23 12:19:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so numb lately. Like I'm watching my life from behind a glass wall. Reaching out to a friend, but it's hard to explain. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of numbness and detachment, seeking connection with others who may share similar experiences. No explicit mention of self-harm, suicide, or harm to others.",
    "detected_category": "other",
    "timestamp": "2026-01-23 12:18:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scared. My friend OD'd last night. Narcan saved them, but it was too close. Where can I learn how to use it, just in case? Need to be prepared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Friend's recent overdose indicates a high risk of future overdose events, potentially affecting the user or others around them. The user's expressed fear and proactive seeking of Narcan training suggests awareness of ongoing danger.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 12:17:20"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary. Really made me think about how close anyone can be. If you're struggling, please reach out. There are people who care and want to help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a stressful event and the text expresses concern for others struggling, suggesting a potential risk of overdose in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 12:16:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming I just want to feel *something* else. Scared I'll slip up again. Talking to my therapist helps, but it's still a struggle. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to \"feel something else\" when overwhelmed and fear of a relapse, suggesting potential self-harm or suicidal ideation. While the person mentions therapy, the struggle persists, indicating ongoing risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-23 11:18:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIPs lately. Lost another friend to overdose. Please, if you're struggling, reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and loss due to overdose, indicating potential vulnerability in the author and implicitly acknowledging the prevalence of overdose risk within their social circle. While not directly stating suicidal ideation, the message underscores a concerning situation with potential risk for both the author and their community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 11:17:45"
  },
  {
    "title": "User Story: Violence",
    "content": "I can't believe he shoved me like that. My shoulder still hurts. Has anyone else experienced something like this with their partner? I'm feeling lost and don't know what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a physical altercation ('shoved me') resulting in physical pain ('shoulder still hurts'). While not explicitly stating severe harm, the act of shoving can escalate, and the user expresses feeling 'lost,' suggesting emotional distress. The experience is with a partner, suggesting potential for ongoing interaction. These facts raise concern, meriting a 'medium' severity.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 11:16:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the ambulance lights last night scared me. Reminded me of losing my brother. If you're struggling, please reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses distress and grief but focuses on encouraging others to seek help rather than expressing immediate self-harm or suicidal intent.",
    "detected_category": "other",
    "timestamp": "2026-01-23 11:15:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to quiet the noise is to hurt. It's not a solution, I know. Reaching out is hard, but I'm trying. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 57 (char 82)",
    "detected_category": "unknown",
    "timestamp": "2026-01-23 11:14:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD today. Scary stuff. Narcan saved him, thank God. Reminded me how close we all are to the edge. Get trained, carry it. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose and needing Narcan intervention indicates a significant risk of overdose in the environment. While the individual survived, the event highlights the potential for fatal outcomes and proximity to high-risk behavior.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 11:13:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at a party last night. Scariest thing ever. Narcan saved them. Please, if you're using, have it on hand. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose event requiring emergency intervention (Narcan). Overdoses are life-threatening and represent a high risk to individual health and safety.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 11:12:37"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street. It escalated fast. Called the cops, but still shaken. Makes you realize how easily things can turn violent. Anyone else ever witness something like that? Feeling sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence is upsetting but the individual is not directly involved or threatened, expressing emotional distress but no immediate danger is indicated.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 11:11:36"
  },
  {
    "title": "User Story: Violence",
    "content": "My neighbor's yelling again. Heard a crash. Called the cops last time but nothing changed. Scared for the kids in that house. Anyone know resources to help safely?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Potential for violence or abuse impacting children. Previous police involvement with no resolution suggests escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-23 11:10:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Constant yelling, put-downs... I feel so worthless. Anyone else gone through this? Need to know I'm not alone and that it can get better.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a potentially abusive environment with constant yelling and put-downs, leading to feelings of worthlessness. While there's no direct mention of self-harm or suicide, the negative emotional state significantly increases the risk of escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-23 11:09:32"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing on the street, escalated fast. He shoved her. Feeling sick. Wish I'd said something. Anyone know what to do in those situations? Really shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence (shoving) occurred, suggesting a potential for further escalation and harm to the victim. While the observer is shaken, the primary concern is the potential for harm to the woman who was shoved.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 10:20:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown yesterday. Scary stuff. Makes you think about the people you know, you know? Check in on your friends, seriously. You never really know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text doesn't express intent, it reports an overdose, indicating the presence of dangerous drug use and potential for further overdoses within the community. The call to check on friends suggests awareness of potential hidden struggles.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 10:19:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing a friend OD was the scariest thing ever. Narcan saved their life. Learn CPR and how to use it. You never know when you might need it. Please be safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes witnessing a drug overdose, a life-threatening event requiring immediate intervention. While Narcan was successful, the potential for death indicates high severity.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 10:17:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is back, stronger than ever. Reached out to a friend, but it's still hard. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, which indicates a significant risk to the individual's safety.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-23 10:16:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming. I relapsed last night after a few months clean. Feeling so much shame. Reaching out for support feels impossible right now, but I know I need to.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety combined with feelings of shame and difficulty seeking help suggests potential for increased risk. The individual acknowledges the need for support but feels it's 'impossible' to reach out, indicating a barrier to immediate help and potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-23 10:15:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. The urge to self-harm is strong. Trying to distract myself with music. Anyone else get this? How do you cope? Just need to know I'm not alone rn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating immediate risk. While the user is attempting to distract themselves, the intensity of the urge elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-23 10:14:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Makes you wonder what's going on with people. Shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't directly indicate imminent danger or a high likelihood of severe harm to the individual or others. The user expresses being \"shaken up\" but does not express intentions of violence or harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 10:13:53"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Should I have said something? Feel sick about it now. Anyone else been in that situation?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an instance of physical assault (shoving). While not explicitly stating serious injury, the action indicates a risk of escalating violence and potential for harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 10:12:51"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, but it really shook me. Learn the signs, people. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the person was saved, indicates a significant risk of overdose in the area. It also has potential psychological impact on the witness. The overdose itself posed a high risk to the individual experiencing it.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 10:11:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... rough. I feel so isolated. Has anyone else dealt with controlling behavior from their partner? I could really use some support right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and isolation, which can escalate to more severe situations. The user is requesting support, suggesting they are struggling.",
    "detected_category": "abuse",
    "timestamp": "2026-01-23 10:10:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD downtown. Terrifying. Narcan saved them. Carry it, learn how to use it. It could save a life. Scared me straight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While someone was saved, an overdose is a serious medical emergency with potential for death. The text also conveys the emotional impact of witnessing such an event.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 09:23:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Just wanted to say if you're struggling, you're not alone. Reach out to someone, anyone. It's okay to need help. 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and encourages seeking help, indicating distress but no immediate threat. There is no mention of specific plans or intent to harm oneself or others.",
    "detected_category": "other",
    "timestamp": "2026-01-23 09:22:09"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs and walking on eggshells. Feels like I'm losing myself. Anyone else been through this? Need to figure out how to cope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional distress and a potentially abusive situation involving constant put-downs. The phrase 'losing myself' suggests a significant impact on mental well-being and a need for coping mechanisms.",
    "detected_category": "abuse",
    "timestamp": "2026-01-23 09:21:08"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Shook me up. Didn't know what to do. Wish I'd said something. Anyone else ever freeze in a situation like that? Feeling awful.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault suggests a potential risk of escalating violence and immediate harm to the victim. Although the witness themselves wasn't directly harmed, the event caused distress and highlights the presence of violence in the community.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 09:20:06"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Didn't know what to do, froze. Wish I'd said something. Anyone else experienced this? Feeling guilty.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Observed violence indicates a potential risk of escalation or repeated abuse. While not directly involved, the witness's distress and feelings of guilt suggest a significant impact and potential for future inaction, which could indirectly enable harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 09:19:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good lately. Constant put-downs, walking on eggshells... feels like I'm losing myself. Anyone else been through this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 73 (char 98)",
    "detected_category": "unknown",
    "timestamp": "2026-01-23 09:18:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a memorial for someone lost to overdose. It's heartbreaking. Please, if you're struggling, reach out. There's help available and you don't have to go through it alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a fatal overdose, indicating a significant risk associated with substance abuse. While not directly threatening, it highlights a serious potential for harm and encourages seeking help, suggesting awareness of ongoing struggles.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 09:17:01"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out downtown. So scary how quickly things escalated. Makes you realize how fragile peace is. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Reports a fight witnessed, indicating a potential but not immediate threat to the safety of the person reporting. The escalating nature and feeling \"on edge\" suggest some distress, but don't point to immediate harm to self or others. No explicit target or method mentioned.",
    "detected_category": "violence",
    "timestamp": "2026-01-23 09:15:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scared me so bad. Narcan worked, thankfully. Made me realize how close we all are to the edge. Learn how to use it, please. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential risk of harm, even though the individual survived. It highlights the presence of dangerous situations and the potential for future harm.",
    "detected_category": "overdose",
    "timestamp": "2026-01-23 09:14:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way sometimes?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mention or implication of self-harm, suicide, violence, abuse, or overdose. It seeks connection and shared experience, suggesting a desire for support rather than immediate danger.",
    "detected_category": "other",
    "timestamp": "2026-01-23 09:13:56"
  }
]