[
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved their life. Carry it if you can. It really does work. Could be anyone you know. 😞",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was effective, the overdose event indicates a potentially life-threatening situation. The victim survived, but the risk remains of future overdoses or similar incidents affecting others.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 00:44:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up yesterday. Narcan saved him. Scariest moment of my life. Please, learn the signs of an overdose. It could save someone you love. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event, indicating a high level of immediate danger.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 00:43:15"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary. Reminded me of what my brother went through. Is there any help for PTSD from witnessing violence? Feeling really shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes feeling shaken and seeking help for potential PTSD symptoms after witnessing a fight. While distressing, it doesn't indicate an immediate threat of harm to self or others.",
    "detected_category": "other",
    "timestamp": "2025-12-09 00:42:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after od'ing. Scared & ashamed, but alive. If you're struggling, please reach out. It's not worth it. There's help out there. I'm trying to find it too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Recent overdose suggests ongoing risk and vulnerability to future attempts, despite the expression of wanting help.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 00:41:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to feel *something* is to hurt. I know it's not healthy, but the urge is so strong. Talking to someone feels impossible. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses an urge to self-harm as a means of feeling something, coupled with feelings of isolation and difficulty in seeking help. While not explicitly stating intent to act, the strength of the urge and the perceived impossibility of talking to someone raise concerns about potential escalation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 00:40:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Felt that familiar urge to hurt myself. Instead, I'm reaching out. Anyone else been there? What helps?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a current urge to self-harm, indicating active ideation. While the individual is reaching out for help (a positive sign), the presence of the urge elevates the risk beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 00:39:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but does not contain explicit mentions of self-harm, suicide, or harm to others. It's a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-09 00:38:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were strong, but I distracted myself with a movie. Small victory, I guess. Anyone else relate? Just feeling alone rn.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text mentions strong urges and feeling alone, but the person actively used a distraction technique (watching a movie). While concerning, there's no immediate indication of self-harm or suicidal intent.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 00:37:06"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw two guys fighting outside the bar last night. One was bleeding bad. Shook me up. Is there anything you can even *do* in that situation besides call 911? Feeling kinda helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a violent altercation resulting in significant bleeding, indicating a potential threat to life and physical safety. While the reporter is not directly involved or threatened, the described violence is serious.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 00:36:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, having a really rough night. The urge to self-harm is so strong. Trying to distract myself, but it's hard. Anyone else ever feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm and difficulty distracting from it. While it is a request for support and doesn't explicitly state intent to act, the intensity of the urge elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 23:17:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. The urges are strong. Trying to remember my coping skills. Just need to get through tonight. Anyone else feel this way sometimes?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and a struggle to cope, suggesting potential self-harm or suicidal ideation. The phrase \"just need to get through tonight\" implies a crisis point.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 23:16:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to a friend helped a little, but it's still hard. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but there is no explicit mention of self-harm, suicide, violence, or abuse. While concerning, it appears to be a general expression of sadness and isolation.",
    "detected_category": "other",
    "timestamp": "2025-12-08 23:15:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, but damn. Learn CPR & where to get Narcan. It could be anyone. #overdose #narcan #OD #opioidcrisis #CPR #help",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a potentially traumatic event, and the mention of Narcan implies a risk of further overdose incidents. The use of hashtags #opioidcrisis suggests a wider problem.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 23:14:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. Scared. Lost a friend last year. If you're struggling, please reach out. There are people who care and want to help you stay safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and grief related to overdose deaths, including the personal loss of a friend. While not explicitly suicidal, the context of overdose and the mention of struggle indicates a potential risk for someone experiencing similar difficulties.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 23:13:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but lacks specific details or plans for self-harm or harm to others. It seems like a general cry for help and support.",
    "detected_category": "other",
    "timestamp": "2025-12-08 23:12:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. The urge to cut is back. Reached out to a friend, hoping it helps this time. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of self-harm urges and a feeling of being 'low.' While the person has reached out for help, the statement 'Just need to get through tonight' suggests immediate distress and a potential for acting on the urges.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 23:11:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It helps. There's a helpline too if you need it. 988.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which suggests a potential risk. While the person reached out for help, the presence of urges warrants a medium severity.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 23:10:21"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel so trapped. Anyone else been through this? Need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, indicating a potential abusive environment and feelings of being trapped. While not explicitly stating physical harm, the emotional distress and potential for escalation warrant medium severity.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 23:09:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "Ugh, feeling so overwhelmed lately. Just talking about it feels like a weight lifted. If you're struggling too, please reach out. You're not alone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and encourages seeking support, but it doesn't contain any explicit or imminent threats to oneself or others.",
    "detected_category": "other",
    "timestamp": "2025-12-08 23:08:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about a friend lost to overdose. It's terrifying how easily it happens. Naloxone training is so important. Learn the signs, carry it if you can. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text expresses concern and promotes preventative measures, the mention of a recent overdose death indicates a real and present danger in the poster's social circle. The text highlights the ease with which overdoses occur, implying a non-negligible risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 22:17:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Never thought I'd see it happen, but my friend OD'd last night. Scariest thing ever. Narcan saved him, but damn. Please, learn the signs & carry it if you can. It really does save lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Friend experienced a life-threatening overdose, indicating a high potential for severe health consequences and potential death. Narcan was required to reverse the overdose.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 22:16:37"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on the train platform. Shook me up bad. Reminded me of things I'd rather forget. Anyone else feel triggered by stuff like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused distress and triggered negative memories. While upsetting, it doesn't indicate immediate harm or danger to the individual or others. The mention of being 'triggered' suggests a potential for psychological distress, but without further information, the risk remains low.",
    "detected_category": "other",
    "timestamp": "2025-12-08 22:15:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a heavy cloud I can't shake. Reaching out because I know I need to. If you've been there too, how did you start to feel better?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of low mood and a desire to feel better, suggesting the individual is aware they need help. While there's no explicit mention of self-harm or suicide, the intensity and persistence of the negative feelings warrant a 'medium' severity rating, indicating the need for further assessment and support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 22:14:33"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get jumped on my street last night. Shaken up. Called 911, but still feel helpless. Anyone else witness anything around Elm & Oak? Just hoping he's okay.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A violent crime (assault) occurred, and the poster expresses concern and helplessness, indicating potential psychological distress. While the victim's condition is unknown, the event itself poses a risk of physical harm and has a clear impact on the witness.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 22:13:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Terrifying. Narcan worked, thank God. Makes you realize how close we all are to the edge. Learn to recognize the signs, please. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose implies a significant risk of fatality and the potential for delayed psychological trauma in the witness. The successful use of Narcan does not negate the high risk involved in the initial overdose event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 22:12:29"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mention of self-harm, suicide, or violence. It appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-08 22:11:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Rough day. Urges are strong. Just trying to breathe through it. Anyone else feel like they're just... existing sometimes?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the individual is experiencing strong urges and feelings of just existing, which could suggest a potential for self-harm or suicidal ideation, although it's not explicitly stated.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 22:10:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nJust saw a story about another OD. Makes me sick. Lost my cousin last year. Please, if you're struggling, reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the text discusses a sensitive topic (overdose) and expresses sadness and a call for help, it does not contain any direct threats, plans, or indications of immediate danger to the author or others. It is primarily a message of support and awareness.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 22:09:25"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. Said he was sorry last time. I feel so stupid. Is this really my life now? Anyone else gone through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text suggests a pattern of harmful behavior from another person ('It's been happening again. Said he was sorry last time.'). The writer expresses feelings of being trapped ('Is this really my life now?') and seeks validation from others, indicating potential emotional distress and possible physical danger. The repetition increases concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 22:08:23"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train platform. Scared me half to death. He's okay, thankfully, but wtf is wrong with people? Makes you think.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was physically assaulted (shoved) on a train platform. While the victim is reportedly okay, the act itself represents a potential for serious injury or death depending on the circumstances (e.g., proximity to the edge of the platform, oncoming train).",
    "detected_category": "violence",
    "timestamp": "2025-12-08 21:17:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. Resisting urges is so hard rn. Just need to remember I've gotten through this before. Taking it one minute at a time. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses difficulty resisting urges, which could potentially relate to self-harm, though it's not explicitly stated. The individual is actively trying to cope, but the struggle suggests a potential risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 21:16:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Please, if you're using, carry it. Learn how to use it. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an actual overdose event, which represents a high risk to life and well-being.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 21:15:15"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel anxious after witnessing something like that? Need to process.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling anxious. While upsetting, it doesn't indicate immediate danger to the individual or others, nor does it suggest intent or planning of harmful actions.",
    "detected_category": "other",
    "timestamp": "2025-12-08 21:14:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, potentially indicating a mental health crisis. The phrase \"don't know what else to do\" suggests a lack of coping mechanisms and warrants further investigation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 21:13:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel so small. Has anyone else been through this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, which can escalate to physical violence or lead to significant mental health issues. While there is no immediate threat implied, the situation described has the potential for harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 21:12:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like nothing matters. Reaching out because I know I need to. Talking to a friend helped a bit. Gonna try to find a therapist tomorrow.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates low mood and feelings of hopelessness, suggesting potential depression. The individual recognizes the need for help and has already taken steps (talking to a friend), and plans to seek professional help (therapist). While there are no explicit suicidal ideations, the level of distress warrants a 'medium' severity due to the potential for escalation if not addressed. The action of reaching out is positive.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 21:11:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after almost losing my best friend to an OD. Scariest night of my life. Please, if you're struggling, reach out. There's help out there. Don't let this happen to someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose of a close friend, indicating a high risk situation and potential for future harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 21:10:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Reached out to a crisis line, just needed to tell someone. It helps, even a little. Please, if you're struggling too, don't stay silent.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and reaching out for help, suggesting a current struggle but active engagement with support systems. The plea to not stay silent implies awareness and a desire for others to seek help as well.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 21:09:03"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on the train. Shaken up. This city is getting scary. Anyone else feeling more on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight on public transport is unsettling, causing feelings of fear and anxiety, but there's no indication of direct harm or immediate threat to the individual or others mentioned in the text. It's a reaction to an event, not a plan or threat of violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 21:08:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, with a plea for help. While it doesn't explicitly mention self-harm or suicide, the metaphorical language (feeling underwater) and the act of reaching out suggest a significant level of distress that requires attention. The uncertainty warrants a 'medium' severity to ensure appropriate follow-up and support.",
    "detected_category": "other",
    "timestamp": "2025-12-08 20:19:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my friend OD last night. Terrifying. Called 911, thankfully they're okay. Scared me straight. Please be careful out there, look out for each other. Narcan saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates potential risk for the person who overdosed and secondary trauma for the witness. The friend is okay, mitigating the severity somewhat, but the risk of future overdose events or mental health impact remains.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 20:18:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Thankfully they're okay now, but please, if you're struggling, reach out. There's help available. Don't let it get that far.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose incident, which carries a significant risk of death or serious health consequences. While the person survived, the event highlights the potential for harm and underscores the need for preventative action.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 20:17:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got decked, out cold. Shaken up. Is it just me or is the city getting more aggressive? Anyone else notice this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A violent assault resulting in loss of consciousness was observed. While the victim is not the message sender, the event indicates a potential escalation of violence in the area.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 20:15:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to distract myself, but it's hard. Anyone else relate? Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of being overwhelmed and alone, suggesting a potential risk of self-harm or suicidal ideation, though no explicit plan or method is mentioned.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 20:14:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and overwhelmed, using the metaphor of being underwater. This suggests distress and a potential risk of escalation without support. The direct reach out for advice indicates a desire for help, but also suggests current coping mechanisms are insufficient.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 20:13:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD. It's terrifying. Lost a friend last year. If you're struggling, please reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions overdose and loss of a friend, indicating potential distress or vulnerability related to substance use. While it encourages seeking help, the direct reference to overdose events elevates the risk beyond just general sadness.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 20:12:53"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his girlfriend on the street today. Just walked right past. Still feeling sick about it. Should I have done something? What would you do?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be psychologically harmful and the original poster expresses distress. While the direct risk to the poster is low, the risk of escalation for the victim of the assault is unknown and potentially high. Further, the 'should I have done something' suggests a sense of unease and moral obligation.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 20:11:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a fight on my way home. Dude got clocked hard. Shook me up. Anyone else feel like things are getting more aggressive lately? Just trying to process.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be psychologically distressing and suggests a potential for escalation in the environment.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 20:10:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, but it shook me up bad. Please, if you're using, carry it. And know how to use it. It could save a life. #harmreduction #overdoseprevention",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 137 (char 162)",
    "detected_category": "unknown",
    "timestamp": "2025-12-08 20:09:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed ('underwater') which can be indicative of distress. The individual is actively reaching out for help, suggesting they are seeking a solution. While not explicitly suicidal, the language suggests potential vulnerability and requires further assessment.",
    "detected_category": "other",
    "timestamp": "2025-12-08 19:16:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, but shook me up. Makes you realize how close we all are to the edge. Anyone know where I can get trained in how to use it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while not directly involving the individual, can be emotionally distressing and highlight the prevalence of drug use and its potential for harm. The individual expresses feeling shaken and reflects on proximity to risk, which suggests a moderate level of psychological impact and concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 19:15:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park yesterday. Scared me senseless. Narcan saved him, thank god. Makes you realize how close we all are to the edge. If you're struggling, please reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a recent overdose incident, indicating the presence of dangerous substances and potential risk to others in the area. While the person was saved, it highlights the fragility of life and the prevalence of substance abuse issues.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 19:14:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head. Scratched my arm again last night. Feels stupid after. Anyone else know this feeling? Just trying to get through it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes self-harm (scratching) and feelings of distress. While it doesn't explicitly mention suicidal intent, the combination of factors suggests a need for concern and potential escalation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 19:13:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight. Hope it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and underwater, which suggests potential distress or depression. Reaching out to a friend is a positive coping mechanism, but the underlying distress warrants concern and monitoring.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 19:12:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just realized yelling every day & controlling who I talk to IS abuse. Didn't think it was 'that bad' 'til a friend pointed it out. Feeling lost & scared. Anyone else been through this? How did you start to heal?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the individual is experiencing emotional abuse, acknowledges its impact, and expresses feelings of being lost and scared. While there's no immediate threat of physical harm, the emotional distress and vulnerability suggest a need for support and potential escalation of the situation. ",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 19:11:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to hide the bruises. He says he's sorry after, but it keeps happening. I feel so lost and alone. Is this really my life now? Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes physical abuse (bruises) and expresses feelings of isolation and despair, indicating a high risk of immediate or future harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 19:10:46"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the park. So scary. My hands are still shaking. Is there anything I can do to help the guy who got hurt? Feel helpless right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A physical altercation resulting in injury has occurred. While the user isn't directly in danger, the potential for escalation and the presence of violence warrant a medium severity rating.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 19:09:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Just trying to get through it minute by minute. Anyone else relate? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential relapse or escalation of a previous struggle. While not explicitly stating intent to harm oneself, the feelings of isolation and minute-by-minute struggle warrant concern and indicate a need for support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 19:08:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm underwater. Reaching out because I don't know what else to do. If you've been there, how did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being overwhelmed and hopeless, reaching out for help. While not explicitly suicidal, the statement suggests significant emotional distress and a potential risk that needs to be addressed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 19:07:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling? Need to remember I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of loneliness and being lost, but does not contain explicit mention of self-harm, suicide, or harm to others. Seeking connection and shared experiences suggests a desire for support.",
    "detected_category": "other",
    "timestamp": "2025-12-08 18:21:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you realize how quickly things can escalate. Shaken up. Anyone else ever witness something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate immediate danger to the author or others. The author expresses being shaken up but is primarily seeking coping strategies.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 18:20:39"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Just trying to take it one day at a time. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges, suggesting a potential relapse or escalation of a pre-existing issue. While not explicitly mentioning harm, the phrase 'rough time' and seeking coping mechanisms implies distress and vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 18:19:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Things have been rough at home lately. Walking on eggshells constantly. Is this normal? Starting to feel like I'm losing myself. Anyone else been through something similar?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 99 (char 124)",
    "detected_category": "unknown",
    "timestamp": "2025-12-08 18:18:35"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Just trying to take it one hour at a time. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential for self-harm. The individual is overwhelmed, which increases vulnerability. While there is no explicit plan, the presence of urges warrants a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 18:17:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant put-downs, controlling behavior... I feel so isolated. Has anyone else gone through this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, which can escalate to more severe safety risks over time. The feeling of being 'lost' indicates a potential for declining mental health.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 18:16:31"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend on the street. Froze. Wish I'd done something, anything. Feeling sick. Is there a bystander intervention training I can take?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessed violence indicating an immediate risk of harm to the girlfriend.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 18:15:29"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a fight break out downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potentially dangerous situation, but the author only expresses feeling shaken and on edge. There's no indication of direct involvement, planning, or intent to cause harm to themselves or others. It mainly expresses a general feeling of unease.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 18:14:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm so tired of walking on eggshells. Every little thing sets him off. Is this normal in a relationship? I feel so lost and alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and a feeling of being trapped. While not explicitly stating physical harm, the phrase \"walking on eggshells\" suggests fear and control dynamics, which can escalate. The feelings of being \"lost and alone\" raise concern for the individual's mental well-being.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 18:13:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "Sometimes it feels like I'm underwater, and the surface is miles away. Reaching out for help feels impossible, but I know I need to. If you've been there, what helped you take that first step?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and isolated, with a hint of needing help. While not explicitly suicidal, the metaphor of being underwater and far from the surface suggests a significant struggle. The request for advice on taking the first step implies a desire to improve the situation but acknowledges a significant barrier.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 18:12:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them. Carry it, learn how to use it. Could save a life. I'm still shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event indicating potential danger in the environment, even though Narcan was effective. The person's shaken state suggests a significant emotional impact.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 17:18:30"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you wonder what's going on in people's lives that leads to that. Hope everyone involved is okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning, but the poster expresses concern and hope for the individuals involved. There's no indication of direct involvement or intent to harm others.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 17:17:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw my neighbor being taken away by paramedics. OD. Please, if you're struggling, reach out. There are people who care and want to help you get through this. Don't let this be your story.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a recent overdose requiring medical intervention, suggesting an immediate risk of harm and potential for further overdose incidents in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 17:16:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Rough night. The urges were so strong. So glad I reached out instead. Talking really helped. Still shaky, but safer. There's support out there. You're not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges (unspecified, but potentially harmful) and ongoing shakiness, suggesting a recent crisis. Reaching out helped, but the person is still vulnerable.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 17:15:25"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a memorial for someone lost to overdose. Hits hard. We gotta be there for each other. Naloxone saves lives, know how to use it. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a fatal overdose, which implies a potential risk of further overdoses or substance abuse issues within the community. While not explicitly stated, the memorial suggests a recent event and the plea for naloxone awareness indicates a concern for ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 17:14:23"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The yelling is constant, and now...other things. Feeling trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates potential abuse (physical or emotional) and a feeling of being trapped, coupled with increasing difficulty coping. This suggests a high risk of escalation and potential for immediate harm to the individual.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 17:13:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm underwater. Talking feels impossible, but I know I need to reach out. Any advice on finding help when you're suffocating?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed ('suffocating'), and unable to communicate, suggesting significant emotional distress and a potential need for immediate support. While it doesn't explicitly mention self-harm or suicide, the intensity of the distress warrants a 'medium' severity assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 17:12:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain explicit statements of suicidal intent, self-harm plans, violence, abuse, or overdose. It appears to be a general expression of distress and a call for support.",
    "detected_category": "other",
    "timestamp": "2025-12-08 17:11:17"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so trapped. Has anyone else experienced this? How did you find a way out?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, suggesting emotional and potentially psychological abuse. The feeling of being 'trapped' raises concern for escalation. While not explicitly stating imminent harm, the situation described could lead to further distress and potential harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 17:10:14"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a fight outside my kid's school. Shaking. Makes you wonder what's going on with people. Anyone else feeling on edge lately? I'm so worried about safety now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning, but doesn't indicate imminent danger to the author or others. It expresses general anxiety and worry about safety rather than a specific threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 17:09:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Talking to someone feels impossible, but I'm trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of low mood and difficulty reaching out for help, suggesting potential for escalation if left unaddressed. The user acknowledges needing help, which indicates some awareness of their situation, but the difficulty in talking to someone is concerning.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 16:19:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things aren't good at home. Walking on eggshells constantly. Anyone else feel like they're losing themselves trying to keep the peace? I don't know what to do anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a stressful and potentially harmful home environment, characterized by fear and self-sacrifice. The statement \"I don't know what to do anymore\" suggests a level of distress and potential for escalation, although no specific threats are mentioned.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 16:18:54"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy get shoved on the train platform. Shook me up. Made me realize how quickly things can escalate. Anyone else feel more on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While a violent act (shoving) occurred, the text focuses on the observer's anxiety and doesn't indicate ongoing threat or severe injury.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 16:17:51"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scared. Found my brother unresponsive. Narcan worked, but barely. Please, if you're using, even occasionally, carry it. It saves lives. Don't want anyone else to go through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal opioid overdose requiring Narcan. While the person survived, the situation was extremely dangerous and highlights the significant risk of overdose-related death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 16:16:50"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the corner store. Shook me up. Reminded me of my brother... Anyone else feel like anger's just everywhere lately? How do you guys cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning, but doesn't indicate direct involvement or imminent danger to the poster or others. The post expresses feelings of being shaken up and observations about anger, but does not include threats, plans, or self-harm indicators.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 16:15:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Just trying to take it one day at a time. Anyone else relate? Feeling pretty alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse in urges and feelings of isolation, suggesting a potential risk for self-harm or other negative outcomes.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 16:14:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Finally left. It's terrifying and empowering all at once. My head is still spinning, but I know I did the right thing. Any advice for navigating this new chapter? Feeling so lost. \"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of disorientation and being lost after a significant life change. While the language suggests emotional distress (\"terrifying\", \"lost\"), there's no direct indication of immediate danger to self or others.",
    "detected_category": "other",
    "timestamp": "2025-12-08 16:13:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Narcan saved them. Makes you think... Know the signs, carry it if you can. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports an overdose incident requiring Narcan, indicating a potential ongoing risk of overdose in the area. While the person survived, it highlights the presence of a significant health hazard.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 16:12:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Makes you realize how quickly things can escalate. Anyone else feeling on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text reports witnessing a fight, which is concerning but doesn't directly indicate imminent danger to the author or others. The author expresses feeling \"on edge,\" suggesting anxiety but not necessarily an immediate safety risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 16:11:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling so low and alone. Reaching out because I don't know what else to do. If anyone has felt this way, how did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being low, alone, and not knowing what to do. While it doesn't explicitly mention self-harm or suicide, the overall tone suggests emotional distress that warrants concern and further assessment. The user is reaching out for help, indicating a potential for escalation if support is not provided.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 16:10:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just heavy. Talking to a friend helped a bit, but it's still there. Gonna try to reach out for more support tomorrow. It's scary, but I gotta keep trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but it also shows resilience and a willingness to seek help. There's no immediate indication of self-harm or suicidal intent, but the individual is clearly struggling and requires support.",
    "detected_category": "other",
    "timestamp": "2025-12-08 15:19:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me. Please, if you're using, have someone with you, and have Narcan. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event indicating potential for further overdoses in the area and highlights the inherent risks associated with drug use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 15:18:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Thankfully they were ok. Naloxone saves lives, people. Please learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual survived, an overdose is a serious medical emergency with potential for fatality. The event caused distress to the observer.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 15:17:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so overwhelmed lately. The urge to cut is back. Day 3 of fighting it. Just posting here for some accountability. It's hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a recurrence of self-harm urges and active struggle to resist them. While the individual is seeking accountability, the presence of these urges suggests a significant risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 15:16:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up yesterday. Scariest night of my life. Please, if you're using, carry Narcan. It saves lives. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event, indicating a significant risk to life. The mention of Narcan and the friend almost not waking up strongly suggests a severe health emergency.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 15:15:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scared me half to death. Luckily, paramedics got there fast. Folks, please be careful out there. This stuff is real. Learn the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event indicates a potential for serious harm or death. While the individual survived due to intervention, the risk of overdose in the area is evident, posing a threat to others.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 15:14:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good lately. Constant yelling, then the silent treatment. Walking on eggshells. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially escalating situation of emotional distress and a negative home environment, possibly indicative of abuse or domestic conflict. While not explicitly stating imminent harm, the mention of 'walking on eggshells' and feeling 'alone' suggests vulnerability and a need for support.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 15:13:10"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain specific threats or plans. It's a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-08 15:12:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Like I'm underwater. Reaching out before I sink further. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 93 (char 118)",
    "detected_category": "unknown",
    "timestamp": "2025-12-08 15:11:06"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, leading to feelings of isolation. While not explicitly stating intent to harm oneself or others, the situation suggests a potential for escalation and requires attention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 15:10:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post about suicide, aiming for authenticity and focusing on seeking help:\n\n\"Feeling really low lately. Like, a weight I can't shake. Reaching out because I know I need to. Anyone know good resources for talking to someone? Just need to not feel so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post expresses feelings of low mood, being overwhelmed, and a direct need for help and connection. While not explicitly mentioning suicidal ideation, the intensity of feeling 'a weight I can't shake' and seeking resources for talking to someone suggests a level of distress that warrants concern and potential intervention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 14:19:03"
  }
]