[
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, stronger than before. Trying to resist, but it's exhausting. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges and feelings of overwhelm, suggesting a potential risk of acting on those urges. While there's no explicit mention of specific actions, the level of distress warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 03:45:36"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a guy shove his girlfriend on the street today. Frozen. Didn't know what to do. Still feel sick about it. Anyone else ever witness something like that? How did you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, specifically physical assault, can have a significant psychological impact on the observer, causing distress and potentially leading to further safety concerns if the situation escalates or repeats. While not directly involving physical harm to the reporter, it suggests an environment where violence is present and potentially normalized.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 03:44:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just... heavy. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain any explicit mentions or indications of self-harm, suicide, violence, abuse, or overdose. It reads more as a general cry for help and support.",
    "detected_category": "other",
    "timestamp": "2025-12-26 03:43:33"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get punched outside the bar. Shook me up. Is this normal now? Feel sick. Anyone else see it? What do you even do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing an act of violence, which is upsetting but does not directly indicate immediate danger to the person writing the message or others. The emotional response suggests distress, but not necessarily an intention to harm themselves or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 03:42:31"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Taking it one day at a time. If you're struggling too, you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a strong urge to self-harm, which presents a significant risk. The person has reached out for help, which is a positive sign, but the intensity of the urge warrants a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 03:41:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but does not indicate immediate harm or a specific plan. Seeking advice suggests a desire for help and coping strategies.",
    "detected_category": "other",
    "timestamp": "2025-12-26 03:40:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Just realized gaslighting is abuse. My partner does it constantly. Feeling so lost and confused. Is this normal in relationships? Need to figure out my next steps.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates ongoing emotional abuse (gaslighting), which can have serious psychological effects and escalate to physical abuse in some cases. The user expresses feeling lost and confused, suggesting vulnerability and potential for further harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 03:39:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, rough day. The urge to self-harm is strong. Trying to distract myself, but it's hard. Anyone else get this? Any tips? Feeling really alone rn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm and feelings of loneliness, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 03:38:26"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight downtown last night. So scary how quickly things escalated. Shaking me up. Anyone else ever witness something like that? Just trying to process it all.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence, which is unsettling, but doesn't indicate imminent danger to the author or others. It expresses emotional distress (shaking me up) but is primarily a request for shared experience and processing.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 03:37:25"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things are bad at home. Walking on eggshells all the time. Is this normal? Feeling so alone.\"\n\n**Option 2 (Sharing Experience):**\n\n> \"He apologized again. Said it wouldn't happen. But it did. I'm so tired of this cycle.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Gaslighting is real. Don't let anyone make you doubt your own reality. Trust yourself.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The texts describe potential emotional and/or physical abuse. The 'tired of this cycle' statement in option 2 suggests a pattern of abuse and potential escalation. 'Walking on eggshells' and 'gaslighting' also indicates a harmful dynamic.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 03:36:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urges are back, stronger than ever. Just trying to make it through tonight. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges' which are 'stronger than ever' indicating a potential risk of self-harm or suicide. The user is also struggling to 'make it through tonight' suggesting immediate distress.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 02:53:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things aren't good at home. Constant put-downs, controlling behavior... Feels like I'm walking on eggshells. Anyone else been through this? How did you find help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and a potentially controlling environment, which can escalate. The phrase \"walking on eggshells\" indicates fear and anxiety.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 02:52:27"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing on the street, escalated so fast. He shoved her. Makes me sick. Is there anything you can even do in that situation? Feel helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes a single instance of violence (a shove), it indicates a potential for escalation and poses a risk to the woman's immediate safety and well-being. The escalation from argument to physical altercation is concerning.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 02:51:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 103 (char 128)",
    "detected_category": "unknown",
    "timestamp": "2025-12-26 02:50:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. Narcan worked, thank god. Please, if you're using, have someone with you and carry Narcan. It saves lives. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose, which is a life-threatening situation. While the person survived due to Narcan, the risk of death was immediate and present.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 02:49:22"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy shove his girlfriend on the street today. Broad daylight. It shook me up. Is it wrong I didn't do anything? Feeling guilty.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes a single instance of witnessed violence, but does not indicate ongoing risk to the victim or potential escalation. The reporter expresses feeling shaken and guilty, indicating awareness of the incident's seriousness but no direct threat to themselves or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 02:48:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just...heavy. Reaching out before things get worse. Anyone else feel like this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost, overwhelmed ('heavy'), and proactively reaching out to prevent further deterioration. This suggests potential for self-harm or suicidal ideation, although no specific plan or intent is mentioned.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 02:47:20"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Made me realize how quickly things can escalate. Anyone else feel like things are getting angrier lately? Need to process this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potentially violent situation. However, the author expresses being shaken and needing to process the event, indicating they are not directly involved in perpetrating violence or expressing intent to harm themselves or others. The risk is low because it's reactive and about witnessing, not participating or planning.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 02:46:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Relapsed last night. Feels like I'm back at square one. Anyone know any good coping strategies that actually work?\"\n\n**Option 2 (Personal Story):**\n\n> \"Scars are fading, but the urges still come. It's a battle, but I'm still here fighting.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Self-harm isn't attention-seeking. It's a sign someone's in deep pain. Please be kind & listen.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates a recent relapse, suggesting vulnerability. Option 2 mentions urges, indicating ongoing risk. While Option 3 is supportive, the overall context points to individuals experiencing a current struggle.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 02:45:17"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a guy punch his dog in the park today. Just lost it. Yelled at him, but feel so shaken. Anyone else witness something similar? How do you even process that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing animal abuse is distressing and can cause emotional distress, but it doesn't inherently suggest an imminent risk of severe harm to a person.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 02:44:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "Ugh, another \"perfect\" family holiday pic. Wish mine was. Still dealing with the aftermath of what my stepdad did. Therapy helps, but some days are just...dark. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions dealing with the 'aftermath' of something stepdad did and 'dark' days, suggesting potential past abuse and ongoing mental health struggles. While not explicitly stating intent to harm self or others, the negative affect and reference to a past event warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 01:46:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit suicidal ideation, self-harm, or threats of violence. It appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-26 01:45:39"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel anxious after witnessing something like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling and cause anxiety, but the text doesn't indicate imminent danger or direct threat to self or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 01:44:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just trying to process things. He said he was joking when he called me worthless, but it keeps replaying in my head. Is that normal? Feeling so confused.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests emotional distress and confusion following a verbal attack. While there's no explicit mention of self-harm or suicide, the replay of negative comments and feelings of worthlessness warrant a 'medium' severity as it could potentially escalate if unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 01:43:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to stay strong & remember why I stopped before. Anyone else relate? Just feeling really alone rn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential for harmful behavior. The individual also expresses feeling alone, which can exacerbate the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 01:42:35"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown. Scary stuff. Narcan saved him, thankfully. Really makes you think. Anyone know where to get training around here?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event and indicates the presence of substance use issues in the area, though the individual survived. The fact that the person is looking for training indicates a desire to get involved, which could expose them to potentially dangerous situations.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 01:41:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. Constant put-downs, controlling who I see... Feels like walking on eggshells. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, indicating a potentially harmful situation. The phrase \"walking on eggshells\" suggests a heightened state of anxiety and fear. The user is also asking for help, suggesting they recognize the situation is not healthy.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 01:40:32"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on my street today. Shook me up. Makes you realize how easily things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text doesn't indicate immediate danger to the author or others. It expresses feeling shaken and on edge, suggesting anxiety but not necessarily imminent harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 01:39:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Walking on eggshells constantly. Feeling trapped. Anyone else ever feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling trapped and walking on eggshells, suggesting a potentially volatile or abusive situation at home. While it doesn't explicitly mention harm, the implicit stress and feeling of being trapped elevates the risk beyond low.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 01:38:29"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Trying to resist, but it's hard. Anyone else relate? Any tips on coping?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a strong urge to self-harm (cutting), suggesting active suicidal ideation/self-harm ideation even though the individual is attempting to resist. This represents a notable risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 01:37:28"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so lost lately. Just want to disappear. Talking to a therapist, but it's hard. Anyone else been through this? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of wanting to disappear and feeling lost, suggesting potential suicidal ideation, though not explicitly stated or with a plan. Seeking therapy is a protective factor but the statement that it's 'hard' tempers the protective nature.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 00:46:00"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Guy got shoved, hit his head hard. Waiting for the ambulance. Shaken up. This city's getting rough. Anyone else see it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person sustained a head injury due to a physical altercation, requiring ambulance assistance. While the long-term outcome is unknown, head injuries can have serious consequences.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 00:44:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Just trying to take it one day at a time. Reach out to someone if you're feeling this way too. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which suggests a potential for escalation and harm. While actively seeking help is mentioned, the presence of urges elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 00:43:57"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is back. Reached out to a friend, hoping it helps this time. It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions the urge to hurt oneself, indicating active suicidal ideation. Reaching out to a friend is a positive action, but the presence of the urge elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 00:42:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Scariest thing I've ever seen. Narcan saved his life. Learn the signs, carry it if you can. You could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a severe and immediate threat to life.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 00:41:55"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up. People just stood there filming. Makes you wonder, y'know? Is everyone just desensitized now?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text doesn't indicate imminent danger to the speaker or others. The speaker expresses concern about societal desensitization rather than direct threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 00:40:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after a month clean. Disappointed but trying not to spiral. Reaching out to my therapist today. It's a process, I guess.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates vulnerability and potential for further risky behavior. Seeking therapy is positive, but the relapse itself warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 00:39:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Urges were really strong. Made it through without hurting myself, but barely. Taking it one day at a time. Anyone else relate? Just feeling really alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports strong urges for self-harm and barely managed to resist. While the person did not act on the urges, the intensity and near-miss situation indicate significant distress and risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 00:38:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but doesn't contain explicit mentions of self-harm, suicide, violence, or abuse. It appears to be a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-26 00:37:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... rough. Walking on eggshells constantly. Anyone else ever feel this way? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a stressful and potentially unsafe home environment ('walking on eggshells'). While it doesn't explicitly mention violence or abuse, the feeling of constant tension suggests a potentially harmful situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 00:36:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. Walking on eggshells all the time. Is this normal in relationships? Feel like I can't do anything right. Need to talk to someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a potential for abuse (walking on eggshells), requiring further assessment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 23:17:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out to a friend tonight. Hope it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The statement expresses feelings of hopelessness and a lack of meaning in life, which are risk factors for self-harm or suicidal ideation. While reaching out to a friend is a positive sign, the depth of the negative feelings expressed warrants a medium severity.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 23:16:39"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. Urges are back. Reached out to a friend, just need someone to listen. It helps, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which suggests a relapse or worsening of a mental health condition. While the individual has reached out for help, the presence of urges warrants a medium severity rating due to the potential for escalation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 23:15:37"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate immediate danger to the speaker or others. The feeling of being 'on edge' is vague and could be related to general anxiety rather than a specific threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 23:14:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Talking to someone feels impossible, but I know I need to. Any advice on finding help when you feel like you can't reach out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, coupled with a difficulty in seeking help. While it doesn't explicitly mention self-harm or suicide, the stated inability to reach out when feeling the need indicates a vulnerability and potential escalation if support isn't found.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 23:13:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Terrifying. Narcan saved them, but it shook me up. Makes you realize how close it is, you know? Anyone know of local support groups for witnesses? Just feeling kinda lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be a traumatic experience leading to psychological distress and potential for secondary trauma. The individual is expressing feelings of being shaken and lost, indicating a need for support.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 23:12:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> Things have been rough at home lately. Walking on eggshells constantly. Anyone know of any resources for dealing with emotionally abusive parents? Feeling lost.\n\n**Option 2 (Sharing Experience):**\n\n> I used to think it was normal to be yelled at for every little thing. It's not. It's abuse. Took me years to realize that.\n\n**Option 3 (Raising Awareness):**\n\n> Gaslighting is real, and it's insidious. Don't let anyone make you question your own sanity. Your feelings are valid.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse, which can significantly impact mental health and potentially escalate to more severe situations. While not explicitly suicidal or violent, the feeling of being 'lost' and 'walking on eggshells' indicates a need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 23:11:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (put-downs, controlling behavior) and feelings of isolation, which can be precursors to more severe mental health issues or escalation of the abusive situation. The person is also asking for help, indicating a potential need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 23:10:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, thank god. Makes you realize how fragile life is. Learn CPR & Narcan training, folks. It can save someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, indicates a serious public health issue and potential for fatal consequences. The call to action to learn CPR and Narcan highlights the risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 23:09:28"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Two guys, over nothing. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate immediate danger to the author or others. It expresses unease and heightened awareness of potential violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 23:08:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm underwater. Just reaching out, hoping someone understands. It's hard to keep going sometimes.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and struggling to keep going, suggesting potential suicidal ideation, although without specific plans.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 22:17:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Talking to someone tomorrow. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and acknowledges the need for help, indicating a potential risk. The user is taking steps to address the issue by talking to someone, which mitigates the immediate risk, but the underlying feelings require monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 22:16:24"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. My hands are still shaking. Should I have done something? I froze. Feeling so guilty.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed an act of violence (shoving) which indicates potential for escalation and harm to the girlfriend. While the immediate risk might be contained, the potential for future violence and the emotional distress of the witness elevate the concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 22:15:22"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on the way home. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel extra anxious lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused anxiety but doesn't indicate direct involvement or imminent danger to the author or others. It reflects a general feeling of unease.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 22:14:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm underwater. Reaching out before it gets worse. Any tips for finding a therapist? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost, combined with a proactive step of reaching out for help. The statement 'before it gets worse' indicates a potential for escalation if not addressed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 22:13:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Day 3 clean. Just need to keep reminding myself it's a temporary fix. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant and immediate risk. While the individual is currently abstaining ('Day 3 clean'), the intense urge suggests a high likelihood of relapse.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 22:12:18"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out downtown last night. So scary how quickly things escalated. Shaken up. Anyone else witness that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The user witnessed a fight, which caused them distress, but there's no indication of direct harm to the user or intent to cause harm to others.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 22:11:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Relapsed last night. Feeling so ashamed and lost. Reached out to the crisis line, just needed to tell someone. It's a long road, but I'm still here.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse coupled with feelings of shame, loss, and reaching out to a crisis line indicates distress and potential for escalation. While the individual states they are 'still here,' the relapse increases vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 22:10:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, thankfully. Made me realize how fragile life is. Learn the signs, carry Narcan. You could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event that can be psychologically distressing and indicates the presence of significant risk within a community. While the person survived, the event itself carries potential for secondary trauma and highlights the ongoing danger of substance abuse.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 22:09:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at a party last night. Scariest thing ever. Narcan saved them, but damn. Please, if you're using, have someone with you and carry Narcan. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event requiring Narcan intervention, indicating a significant and immediate risk of serious harm or death associated with drug use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 22:08:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad. Getting screamed at for every little thing. Walking on eggshells. Anyone else experience this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive situation involving verbal abuse and a feeling of isolation. While not explicitly stating intent to harm self or others, the emotional distress and feeling of being alone raises concern for potential escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 21:17:13"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on my street. Shaken up. Called the cops, but still... Makes you wonder what's going on with people lately. Anyone else feel on edge?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual reporting is shaken and expresses unease, the fight itself indicates a potential for violence in the area, and the feeling of being \"on edge\" suggests a heightened state of anxiety and potential vulnerability.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 21:16:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Reached out to a friend, just need someone to listen. It helps. Please, if you're struggling too, don't be alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges, implying potential self-harm or suicidal ideation. The individual reached out for help, which is a positive sign, but the presence of strong urges elevates the risk beyond low. The encouragement to others not to be alone suggests awareness of the danger.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 21:15:10"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend, hoping it helps. It's exhausting pretending I'm okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost, overwhelmed ('underwater'), and exhausted from pretending to be okay. This indicates emotional distress and potential vulnerability, requiring further assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 21:14:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Reached out to a friend, feels a tiny bit lighter. Remember we're not alone in this. 💜 If you're struggling too, please reach out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential relapse or escalation of a previous issue. While the person has reached out for help, the presence of urges elevates the risk beyond low. The specific nature of the urges is not clear, warranting caution.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 21:13:07"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so numb lately. Everything's just... heavy. Reaching out because I don't know what else to do. Talking feels impossible, but I need to try.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses numbness, emotional heaviness, and a feeling of being overwhelmed, suggesting potential risk for self-harm or suicidal ideation. The individual is reaching out, indicating some awareness of needing help, but also states talking feels impossible, which is concerning.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 21:12:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them. We need more people trained. Learn the signs, it could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person overdosed, indicating a serious health risk, but the situation was resolved with Narcan. While the individual was saved, the potential for fatal outcomes exists and highlights a broader community issue.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 21:11:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were strong, but I distracted myself with a movie. Small win, I guess. Anyone else get that feeling of needing to feel *something*? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates urges, but also successful distraction and seeking coping mechanisms. While concerning, the person is actively managing the situation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 21:10:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, I just want to feel *something* else. Day 1 clean. Scared, but trying. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to feel \"something\" else due to overwhelming thoughts, coupled with the mention of being \"clean\" and scared. This suggests potential self-harm tendencies or a struggle with addiction/withdrawal, indicating elevated risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 21:09:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Just realized yelling every day & calling me names isn't normal. Feeling lost. Anyone else been through this? How do you even start to fix things?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse and distress which can escalate to mental health issues. While not explicitly mentioning harm, the repeated verbal abuse and the user's feeling of being 'lost' suggests a need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 21:08:00"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 74 (char 99)",
    "detected_category": "unknown",
    "timestamp": "2025-12-25 20:18:55"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a guy shove his girlfriend on Elm St. Shook me up. Didn't know what to do, just froze. Anyone else ever witness something like that? Still feel sick about it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent act can be psychologically distressing and indicates a potential safety risk for the victim. While the witness wasn't directly harmed, the event is concerning.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 20:17:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about another OD in my town. It's scary how easily things can go wrong. If you're struggling, please reach out. There are people who care & want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post describes an overdose in the community, indicating a risk of further overdose events. It also mentions struggling individuals, suggesting potential vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 20:16:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Talking feels impossible.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed (\"lost lately,\" \"underwater,\" \"don't know what else to do\"). While not explicitly mentioning self-harm or suicide, the intensity of the negative emotions and the feeling of being unable to communicate could indicate a potential for escalation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 20:15:50"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a guy shove his girlfriend on Elm St. Shook me up. Didn't know what to do. Anyone else ever witness something like that? Feeling helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be emotionally distressing and creates a potential risk of escalation if the abuser becomes aware of witnesses.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 20:14:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just reaching out... anyone else ever feel like they're drowning? Really need to hear I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and 'drowning,' suggesting significant emotional distress and a potential risk of self-harm or suicidal ideation. The request for reassurance ('need to hear I'm not alone') indicates a cry for help.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 20:13:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to someone feels impossible, but I know I need to. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, and indicates a need for help, suggesting potential for escalation if support is not found.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 20:12:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a significant level of distress and a feeling of being overwhelmed. The user is actively seeking help, suggesting they haven't yet reached a point of hopelessness, but the phrasing suggests potential for escalation if support isn't received.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 20:11:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just feeling so lost. The constant put-downs are getting worse. Is this normal in relationships? Starting to think maybe it's not just 'teasing' anymore. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of increasing emotional abuse, leading to feelings of being lost. While no immediate threat is stated, the escalation and questioning of normalcy suggest increasing distress and potential for harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 20:10:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "i'm struggling. things got really bad last night and i hurt myself again. i hate this. trying to find the strength to call the helpline. wish me luck.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly states self-harm occurred ('hurt myself again') and expresses intense distress and a sense of hopelessness, indicating a high risk of further self-harm or suicidal ideation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 20:09:42"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. Last night was bad. I feel so lost and ashamed. Does anyone know resources for emotional abuse? I need help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and feelings of shame and being lost, suggesting a need for help. While not explicitly stating intent for self-harm or suicide, the severity of emotional distress warrants a medium risk level as abuse can escalate to more serious outcomes.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 19:16:22"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a guy shove his girlfriend on the street today. Just walked right past. Feel sick about it. What should I have done?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault indicates a potential for escalation and further violence. While the reporter is not directly in danger, the event itself poses a risk to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 19:15:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about the ODs lately is scary. My brother almost died last year. Narcan saved him. Please, learn how to use it. It could save someone you love. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a near-fatal overdose experience of the author's brother, highlighting the real possibility of severe harm or death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 19:14:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of self-harm urges and feeling overwhelmed, which represents a potential risk even with reaching out for help. The exhaustion mentioned suggests ongoing distress.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 19:13:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming. I messed up again, and the urges are strong. Trying to stay safe and remember I deserve better. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feeling overwhelmed, mentions 'urges,' and a past mistake, indicating potential self-harm risk. While the person is trying to stay safe, the presence of strong urges elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 19:12:17"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and a sense of desperation. While it doesn't explicitly mention self-harm or suicide, the metaphor of being 'underwater' and reaching out for help indicates a potential crisis and warrants further investigation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 19:11:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thank god. Reminded me how fragile life is. Learn the signs, folks. It could save someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose event occurred, requiring intervention. While the person survived, the event highlights the potential for fatal outcomes.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 19:10:14"
  },
  {
    "title": "User Story: Abuse",
    "content": ">Been feeling trapped lately. Constant put-downs disguised as \"jokes.\" Starting to believe them. Anyone else experience this? How do you cope? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped, repeated put-downs, and feeling lost, which can indicate emotional distress and potential for escalation if not addressed. The individual is starting to internalize negative messages which is concerning.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 19:09:12"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a guy get jumped on my street last night. Shaken up. Makes you realize how quickly things can turn. Anyone else feel unsafe lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a violent assault occurring in the user's vicinity, indicating a potential threat to their safety and well-being. The user also expresses feeling unsafe.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 19:08:11"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend on the street. Froze. Someone else intervened, thankfully. Still shaking. What do you even DO in that situation? Feeling so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing violence indicates a high risk event. While the original victim may now be safer due to intervention, the text describes a violent assault which inherently poses a high risk of serious harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 19:07:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. The urges are back. Trying to stay strong and remember why I stopped. If anyone has tips for dealing with this, please share.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges' returning, implying a previous struggle with something potentially harmful. While the person is trying to stay strong, the presence of these urges suggests a risk of relapse or acting on them. The specific nature of the urges is unknown, necessitating a cautious approach.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 18:21:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. The urge to cut is strong. Trying to resist, but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses active thoughts of self-harm (cutting) and difficulty resisting these urges, indicating a potential risk of self-inflicted harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 18:20:05"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Like I'm underwater. Reaching out because I don't know what else to do. If anyone has felt this way, how did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of intense loneliness and hopelessness, suggesting a potential for self-harm, though it does not explicitly mention suicidal ideation. The phrase \"underwater\" can be interpreted metaphorically as feeling overwhelmed and suffocated by emotions.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 18:19:04"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just wanted to say if you're struggling too, you're not alone. Reaching out feels impossible, but maybe it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and suggests reaching out for help, indicating distress but no explicit plan or intent for self-harm or suicide.",
    "detected_category": "other",
    "timestamp": "2025-12-25 18:18:02"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so small. Has anyone else experienced this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of emotional abuse (put-downs, controlling behavior) which can escalate and negatively impact mental health. While not explicitly stating intent to harm oneself or others, the feeling of being 'small' and the seeking of help indicates distress and potential for further harm if the situation continues.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 18:17:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary how fast things escalated. Shaking now. Anyone else feel like things are getting more volatile lately? I don't feel safe anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight and expressing feelings of fear and unsafety suggest a moderate level of risk due to potential for further exposure to violence or psychological distress.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 18:15:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary stuff. Narcan saved them, thank goodness. Makes you realize how close to home this is. Anyone know where to get training? Want to be prepared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a risk of potential future overdoses in the area, and the user's concern indicates distress and a desire to be prepared for similar events. While not directly indicating imminent harm to the user or others, it highlights a significant safety concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 18:14:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Please, if you're using, have someone with you. Narcan saves lives. Learn how to use it. I'm so shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose incident, indicating a high risk of death or serious harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 18:13:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train. Everyone just stared. Makes you wonder what you'd actually do in that situation. Feeling pretty shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical assault occurred, potentially leading to injury. While the immediate threat is over, the observer is shaken, suggesting the event had a significant impact and could lead to future anxiety or fear.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 18:12:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Please, if you're struggling, reach out. There's help out there. Don't let it get this far.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal event implying a potential suicide attempt or serious self-harm. The urgency in the language ('almost didn't wake up', 'Don't let it get this far') suggests a very high level of risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 18:11:53"
  }
]