[
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's hard to admit, but things aren't okay at home. Walking on eggshells constantly. Anyone else been through this? Just feeling so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a distressing home environment characterized by fear and isolation, suggesting potential for emotional distress and harm. While it doesn't explicitly mention self-harm or violence, the phrase 'walking on eggshells' indicates a potentially volatile or abusive situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-25 01:47:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scariest thing ever. Narcan saved them. Pls learn the signs, carry it if you can. It's not a joke.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Direct report of an overdose incident, implying immediate and life-threatening danger to at least one individual. Although the individual was saved, the event highlights the potential for fatal outcomes.",
    "detected_category": "overdose",
    "timestamp": "2026-01-25 01:46:42"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a guy shove his partner on the street. Froze. Wish I'd said something, anything. Feeling sick about it. What do you even do in that situation?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be emotionally distressing and may lead to feelings of helplessness or guilt. While the text doesn't directly indicate imminent danger to the reporting person, it suggests a potentially escalating situation and the witness's emotional distress warrants attention.",
    "detected_category": "violence",
    "timestamp": "2026-01-25 01:45:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel trapped. Has anyone else gone through this? Any advice on getting out?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation with constant put-downs and controlling behavior, indicating emotional abuse and a feeling of being trapped. While not explicitly stating physical harm, the potential for escalation and the impact on mental well-being are concerning.",
    "detected_category": "abuse",
    "timestamp": "2026-01-25 01:44:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Scary night. Friend OD'd. Narcan saved them. Learn the signs, carry it if you can. Could save a life, literally.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A friend overdosed, requiring Narcan. Overdoses are life-threatening events.",
    "detected_category": "overdose",
    "timestamp": "2026-01-25 01:43:37"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out on the bus today. Just yelling at first, then... I froze. Shaking now. Anyone else feel totally helpless in situations like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence, causing a personal reaction of fear and helplessness. While disturbing, it doesn't indicate imminent danger to the author or others, nor direct involvement in the violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-25 01:42:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is getting stronger. Reached out to a crisis line, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The individual explicitly states an increasing urge to self-harm, indicating an active risk. While they have reached out for help, the strength of the urge elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-25 01:41:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. Really fighting the urge to relapse. Just need to make it through tonight. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with relapse, implying a potential for self-harm or substance use depending on the context of the relapse. While not explicitly stating intent, the expressed urge requires attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-25 01:40:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been feeling so isolated lately. Constant put-downs and control... starting to feel like I'm losing myself. Anyone else been through this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feelings of isolation, control, and loss of self, indicative of potential emotional abuse and mental health distress. The user is also seeking help, implying they recognize the problem but are struggling.",
    "detected_category": "abuse",
    "timestamp": "2026-01-25 01:39:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Hard not to just...scratch the surface to feel something else. Trying to find healthier ways to cope. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions self-harm ideation ('scratch the surface to feel something else') indicating a potential for action, though seeking healthier coping mechanisms is a positive sign.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-25 01:38:30"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street, really escalating. Didn't know what to do, felt frozen. Anyone else ever witness something like that? Wish I'd intervened somehow. Feeling pretty shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially violent situation escalating between two people. While the original poster (OP) was not directly involved, the situation could have become more dangerous and the OP's feeling of being 'shaken up' indicates some level of distress and potential for future hypervigilance or anxiety related to witnessing the event.",
    "detected_category": "violence",
    "timestamp": "2026-01-25 00:51:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Guy got knocked out cold. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel like violence is getting worse lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was knocked unconscious during a fight, indicating a moderate level of physical harm and potential for serious injury. While the poster was shaken, they were not directly involved.",
    "detected_category": "violence",
    "timestamp": "2026-01-25 00:50:54"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. The urge to hurt myself is so strong. Reached out to a friend, but it's still hard. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge for self-harm, indicating a significant risk of harm to the individual. Although the person reached out for help, the feeling persists, suggesting an immediate and serious concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-25 00:49:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming. I relapsed last night after a few months clean. Feeling ashamed and lost. Reaching out for support again. It's a tough journey.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates increased vulnerability and potential for negative consequences. Feelings of shame and being lost exacerbate the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-25 00:48:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Constant yelling, and yesterday... he pushed me. I don't know what to do. Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a physical assault (being pushed) and mentions a generally hostile and unstable home environment (constant yelling). This suggests an immediate safety risk of ongoing violence and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-25 00:47:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but no explicit mention of self-harm, suicide, or harm to others. Reaching out for help is a positive sign.",
    "detected_category": "other",
    "timestamp": "2026-01-25 00:46:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt that familiar urge again last night. Day 1 of trying to find healthier coping mechanisms. It's hard, but I gotta keep trying. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Mentions a 'familiar urge' but focuses on coping mechanisms and seeking support. Expresses a desire to try to cope in a healthier manner, indicating a proactive approach.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-25 00:45:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel like violence is just… everywhere lately? Wish I knew how to help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses concern and unease about witnessing a fight, but does not indicate imminent danger to the author or others. It's a reaction to a general sense of increasing violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-25 00:44:45"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a guy screaming at his girlfriend on the street today. Just froze. Wish I'd said something, done something. Feeling sick about it now. Anyone else ever feel this helpless?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing verbal abuse is upsetting but does not indicate immediate danger to the person reporting. The feeling of helplessness is a concern, but doesn't suggest direct involvement in a risky behavior or ideation. It's an indirect report.",
    "detected_category": "abuse",
    "timestamp": "2026-01-25 00:43:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\nIt's hard to admit, but things at home aren't good. Always walking on eggshells. Anyone know resources for emotional abuse? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a situation of emotional abuse at home, suggesting a potentially harmful environment that could escalate. The user expresses feeling lost, highlighting emotional distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-25 00:42:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved their life, thank goodness. Makes you realize how fragile things are. Please be careful out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potential safety risk to the observer and highlights the presence of a life-threatening situation. While the person survived, the incident demonstrates the presence of significant health risks and potential for similar incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 23:17:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need to. Talking to a friend tomorrow, hoping it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and a lack of meaning, indicating potential depression or suicidal ideation, but seeking help by talking to a friend suggests some protective factors and not imminent risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-24 23:16:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Like there's no air left. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of heaviness and lack of air, suggesting potential depression and hopelessness. The user is reaching out for help, indicating they are struggling. While not explicitly suicidal, the distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-24 23:15:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nJust saw someone OD in the park. Narcan saved them, but it shook me up bad. Know where to get it in [City]? Gotta be prepared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a highly distressing event and indicates the presence of a significant risk of overdose in the described location. The individual's expressed need to acquire Narcan suggests an anticipation of further overdose events.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 23:14:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Trying to remember my coping skills but it's hard. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges and difficulty coping, suggesting a potential risk of self-harm or suicidal ideation, even though it's phrased as a request for support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-24 23:13:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "I'm having a really hard time lately. Feeling so lost and overwhelmed. Just reaching out to see if anyone else understands? Need some hope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of distress, hopelessness, and being overwhelmed, but doesn't contain specific plans or intentions of self-harm or harm to others. It primarily seems like a cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2026-01-24 23:12:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Constant yelling, put-downs... I feel worthless. Anyone else been through this? Where do I even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of worthlessness and mentions a hostile home environment including yelling and put-downs, suggesting emotional abuse. While not explicitly stating intent to harm self or others, the expression of feeling worthless is a risk factor.",
    "detected_category": "abuse",
    "timestamp": "2026-01-24 23:11:33"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. I froze. Wish I'd said something. Feeling sick about it. Has anyone else been in that situation? What do you even do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text doesn't explicitly state ongoing danger to the person who posted, it describes an incident of potential violence (shoving) and expresses concern and distress about witnessing it. The immediacy and potential for escalation are unknown, but it signifies a breakdown in safety and potential for physical harm to the partner.",
    "detected_category": "violence",
    "timestamp": "2026-01-24 23:10:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD in my town. It's terrifying. Feels like it's happening way too often. Anyone know where to find resources for loved ones struggling? I want to help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about frequent overdoses in the user's town and a desire to help, indicating a potential risk for overdose incidents affecting individuals the user knows.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 23:09:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank goodness. Makes you realize how fragile life is. Be safe out there, everyone. Look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose, which is a serious medical emergency with potentially fatal consequences. While the person was saved, the incident highlights a significant risk to public safety and individual well-being.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 23:08:29"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a guy yelling at his partner on the bus today. Made me so uncomfortable. Anyone else feel helpless in those situations?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing verbal aggression can be distressing, but the text describes discomfort rather than direct threat or imminent harm. While the situation could escalate, the immediate risk appears low.",
    "detected_category": "other",
    "timestamp": "2026-01-24 22:17:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... Feeling trapped. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, indicating potential emotional abuse and feelings of being trapped. While not explicitly stating intent, the feeling of being trapped is a risk factor for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-24 22:16:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\nIt's hard to admit, but things at home haven't been good lately. Walking on eggshells constantly. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 92 (char 114)",
    "detected_category": "unknown",
    "timestamp": "2026-01-24 22:15:32"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside my apartment. Shook me up. Called the cops, but still feel sick. Anyone else ever witness something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is upsetting and caused emotional distress, but there's no immediate threat to the reporter or indication of severe physical danger. They contacted the police and are seeking coping mechanisms.",
    "detected_category": "violence",
    "timestamp": "2026-01-24 22:14:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at a party last night. Scariest thing ever. Paramedics saved them, thank God. Made me realize how fragile life is. Learn the signs, carry Narcan. You could save someone's life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose, which is a life-threatening medical emergency and indicates a significant risk of harm.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 22:13:29"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend in the parking lot. Froze. Called the cops, but I feel sick. Is there anything else I should have done? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, especially abuse, can have a significant psychological impact on the observer, leading to feelings of helplessness and distress. While the direct physical risk to the reporting individual is low, the potential for escalation of the violent situation and the emotional distress experienced warrant a 'medium' severity assessment.",
    "detected_category": "violence",
    "timestamp": "2026-01-24 22:12:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Didn't cope well. Reaching out for help today. It's scary, but I know I can't keep doing this.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feeling overwhelmed and struggling to cope, suggesting a potential mental health crisis. The individual is seeking help, which is a positive sign, but the underlying distress level warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-24 22:11:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, but it made me realize how easily it could be anyone. Learn the signs & carry Narcan if you can. It truly saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a potentially traumatizing event and highlights the risk of overdose in the community. While Narcan was available, the ease with which it could happen to anyone raises concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 22:10:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 74 (char 99)",
    "detected_category": "unknown",
    "timestamp": "2026-01-24 22:09:23"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy get shoved on the train platform. Heart's still racing. Is this just normal now? Feel so unsafe.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was physically assaulted (shoved) on a train platform, indicating a potential for further violence or injury. While the immediate impact may not be severe, the event creates a sense of unsafety and raises concerns.",
    "detected_category": "violence",
    "timestamp": "2026-01-24 22:08:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the gas station today. Scary stuff. Narcan saved their life. Carrying it now. You never know. Learn how to use it, could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a stressful event and highlights the presence of a life-threatening situation. While the person survived, the experience indicates a risk of future overdose events in the community and raises awareness of potential personal involvement.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 21:16:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a fight on the bus today. Shook me up. Reminded me of things I'd rather forget. Anyone else feel triggered by stuff like that? Just trying to cope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes feeling triggered and shaken up after witnessing a fight. While distressing, there's no indication of immediate harm to self or others. The user is expressing a desire to cope rather than expressing active intent to engage in harmful behaviors.",
    "detected_category": "other",
    "timestamp": "2026-01-24 21:15:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scariest thing. Narcan saved him, thank god. Makes you realize how easily it can happen. Check on your friends, seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose implies a real and present danger, though the individual was saved. Highlights the accessibility and potential for fatal outcomes related to drug use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 21:14:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got clocked hard. Makes you wonder, what's going on with people? Feeling uneasy tonight. Anyone else see anything?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't indicate imminent danger or widespread violence. The observer expresses unease, suggesting psychological impact, but the threat level is localized and past.",
    "detected_category": "violence",
    "timestamp": "2026-01-24 21:13:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough at home lately. Walking on eggshells constantly. Anyone else feel like they're losing themselves trying to keep the peace?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a distressed state and a potentially unhealthy home environment. \"Walking on eggshells\" suggests anxiety and suppressed emotions. While not explicitly mentioning harm, the feeling of \"losing themselves\" implies a significant negative impact on mental well-being. Further investigation is warranted to assess the potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-24 21:12:53"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his dog on the street. Shaking. Feel sick. Called animal control, hope they do something. Anyone else witness this near Elm & Maple? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing animal abuse can cause significant distress and potential for escalation if the individual intervenes directly. The person also expresses a need to talk, suggesting emotional distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-24 21:11:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, almost relapsed. Reached out to a friend instead. Still struggling, but taking it one day at a time. It's exhausting.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a near relapse, suggesting a vulnerability and active struggle with a potentially dangerous behavior. While the person reached out for help, the risk of relapse remains a concern.",
    "detected_category": "other",
    "timestamp": "2026-01-24 21:10:50"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Frozen. Didn't know what to do. Feeling sick about it now. Anyone else ever witness something like that? How did you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an instance of violence (shoving) witnessed by the author, potentially indicating a risk of escalation or repeated abuse. While the direct physical harm may not be extreme, the context suggests a possible ongoing issue.",
    "detected_category": "violence",
    "timestamp": "2026-01-24 21:09:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scariest thing ever. They're okay now, thankfully. Please, if you're using, carry Narcan. It saves lives. Don't be afraid to call for help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Direct report of an overdose event, although the individual survived, indicates a high-risk situation and potential for recurrence. The presence of a friend overdosing suggests possible shared risk factors.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 21:08:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been...rough lately. Walking on eggshells all the time. Anyone else ever feel trapped and not know where to turn? #abuseawareness #domesticviolence (This post exceeds the character limit. Revised version below)\n\n---\n\nHome's been rough. Constant tension, feels like I'm always doing something wrong. Anyone else relate? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user describes a home environment filled with tension and feeling constantly wrong, hinting at potential emotional abuse or a difficult living situation. While the language is vague, the feeling of being 'lost' indicates potential distress and a need for support.",
    "detected_category": "abuse",
    "timestamp": "2026-01-24 21:07:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking feels impossible. Has anyone else felt this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain specific details of self-harm, suicidal ideation, violence, abuse, or overdose. It appears to be a general expression of distress and a reaching out for connection.",
    "detected_category": "other",
    "timestamp": "2026-01-24 20:18:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n\"Feeling really overwhelmed lately. Just need someone to talk to. Anyone been through something similar?\"\n\n**Option 2 (Personal Story):**\n\n\"Remembering a dark time. Grateful for the people who helped me through. It does get better.\"\n\n**Option 3 (Raising Awareness):**\n\n\"Check in on your friends, especially the quiet ones. You never know what someone's going through.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and reminiscing about difficult times, but it also highlights seeking help and the possibility of improvement. There's no direct mention of self-harm, suicide, or violence.",
    "detected_category": "other",
    "timestamp": "2026-01-24 20:17:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Reached out to a friend, just needed to say it out loud. It helps, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges, which is concerning. Reaching out for help is a positive sign, but the presence of strong urges suggests a potential risk that needs monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-24 20:16:16"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight break out on my street last night. Scared the hell out of me. Is this normal now? Feeling so unsafe lately.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes witnessing a fight and feeling unsafe, suggesting a potential risk of violence. While no direct threat is made, the feeling of unsafety and the fight itself indicate a medium level of risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-24 20:15:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head. Scratched last night. Again. Feeling so ashamed, but also... numb? Anyone else ever feel this way? Just looking for someone who understands.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes self-harm (scratching) and feelings of shame and numbness, which suggests a moderate risk level. While not explicitly suicidal, self-harm is a significant indicator of distress and potential escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-24 20:14:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up yesterday. Scariest moment of my life. Narcan saved them. Please, learn the signs of an overdose. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a high risk of death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 20:13:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Hard to explain, but I just want the pressure to stop. Anyone else ever feel like hurting themselves just to feel *something* different? Really don't want to, but the thoughts are loud.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions thoughts of self-harm and a desire to feel 'something' different, indicating a significant level of distress and potential risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-24 20:12:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Things have been really dark lately. Feeling so lost and alone. Reaching out because I don't know what else to do. Any advice or support would be appreciated.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of darkness, loneliness, and being lost, indicating emotional distress and a potential need for support. The statement of reaching out suggests a desire for help, but the lack of specific intent to harm oneself or others places it in the medium severity range.",
    "detected_category": "suicide",
    "timestamp": "2026-01-24 20:11:08"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the corner store. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel like things are getting more volatile lately? Feeling kinda helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling shaken, but doesn't indicate direct involvement, immediate threat, or severe harm to the author or others. It expresses a general sense of unease and helplessness rather than specific violent intent or risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-24 20:10:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Day 3 clean, but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting) and acknowledges difficulty resisting this urge. While the person is currently \"clean\" for 3 days, the presence of the urge indicates an elevated risk of relapse.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-24 20:09:04"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly low lately. Like there's no way out. Talking to my doctor tomorrow, I hope things can get better.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The statement expresses feelings of hopelessness ('no way out') and low mood, which are potential indicators of suicidal ideation. Seeking help from a doctor is a positive step, but the level of distress warrants medium severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-24 19:16:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a screen. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of numbness, detachment, and a cry for help, suggesting emotional distress and potential risk of escalation if left unaddressed.",
    "detected_category": "suicide",
    "timestamp": "2026-01-24 19:15:24"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a screen. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of numbness and detachment, and seeking help, which could indicate underlying distress and potential for escalation. The feeling of watching life from behind a screen suggests a degree of disassociation which needs to be monitored.",
    "detected_category": "suicide",
    "timestamp": "2026-01-24 19:14:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to talk to someone. Any advice on finding affordable therapy?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a need to talk to someone, indicating a potential risk. The mention of a 'dark cloud' and feeling 'low' suggests a prolonged negative emotional state. The individual is seeking help, which is a positive sign, but the underlying distress warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-24 19:13:21"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting near the park. Shook me up. Reminded me of my brother. Anyone else feel anxious after witnessing something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the witness experienced distress and the event involved violence, it's a past event and doesn't indicate imminent danger or direct threat. It expresses anxiety and seeks coping mechanisms, not a plan or intent to cause harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-24 19:12:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after a few months clean. Feeling ashamed but trying to remember recovery isn't linear. Anyone else relate? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential vulnerability and a temporary loss of coping mechanisms. While the individual expresses shame and a desire to continue recovery, the relapse event itself poses a risk, and the lack of immediate coping strategies warrants a 'medium' severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-24 19:11:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Glad they're okay now, but it shook me up. Please, if you're struggling, reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic experience and indicates the potential for harm within the person's social environment. While the person survived, the event highlights the presence of high-risk behaviors and associated emotional distress.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 19:10:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news report about another OD in our town. Makes me sick. Lost my cousin last year. Please, if you're struggling, reach out. There's help out there. Don't be another statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about overdoses in the community and mentions a personal loss. While not explicitly stating intent of self-harm or suicide, the context suggests a potential vulnerability and highlights a serious public health issue.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 19:09:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nScared. Found my brother unresponsive. Narcan worked, but it was too close. Please, if you're struggling, reach out. Don't want anyone to go through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Brother experienced a life-threatening overdose requiring Narcan. While the immediate crisis is averted, the situation indicates a significant risk of future overdose and potential fatality.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 19:08:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The yelling is constant, and now... it's physical. I don't know what to do. Anyone else been through this? Feeling so lost and alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes escalating violence including physical harm, indicating a dangerous situation for the individual. The feelings of being lost and alone exacerbate the risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-24 19:07:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Narcan saved him. Learn the signs of OD, please. It's not worth losing someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan, indicating a high risk situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 18:21:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park yesterday. Scared me senseless. Narcan saved him, but it made me think… We gotta talk about this stuff more. Anyone know where to get training locally?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event that can significantly impact mental health and potentially lead to secondary trauma. The individual is seeking resources and expressing concern, indicating a need for support. While the immediate danger is resolved, the potential for lasting psychological effects warrants a medium severity rating.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 18:20:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just trying to take it one day at a time. Reaching out because I know I need to talk to someone. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being low and needing to talk to someone. While there is no explicit mention of self-harm or suicide, the general sentiment and acknowledgement of needing help indicate a potential risk that needs further assessment.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-24 18:19:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scary night. Found my roommate unresponsive. Narcan saved them. Please, learn CPR and how to use it. Could save a life. #overdoseprevention",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a life-threatening overdose situation where the roommate was found unresponsive and required Narcan to be revived, indicating a high risk of death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 18:18:06"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good lately. Constant put-downs are chipping away at me. Is this normal? Feeling lost and unsure what to do next.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates ongoing emotional abuse (constant put-downs) leading to feelings of being lost and unsure. While there's no immediate threat specified, the chipping away suggests a deteriorating mental state that could escalate if unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2026-01-24 18:17:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, but it shook me up bad. We gotta check on each other. You're not alone, reach out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be traumatic and indicates a risk of further overdoses in the community. While Narcan was successful, the overall situation points to potential for future, possibly fatal, events.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 18:16:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**(Option 1: Seeking Help)**\n\n> Feeling so overwhelmed lately. Urges are back, stronger than ever. Reached out to a hotline, hoping it helps this time. Just need to make it through tonight.\n\n**(Option 2: Sharing a Struggle)**\n\n> Relapsed after a few months clean. Disappointed but trying not to beat myself up more. It's a process, right? Be kind to yourselves today.\n\n**(Option 3: Raising Awareness)**\n\n> Seeing a lot of jokes about self-harm lately. It's not a joke. It's a sign someone is deeply hurting. Please be mindful of what you share.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Synthetic generation",
    "detected_category": "self-harm",
    "timestamp": "2026-01-24 18:15:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thank goodness. Makes you realize how close it is to all of us. Anyone know good resources for learning how to use it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event indicates a risk, and the mention of Narcan use highlights the potential for severe consequences. While the individual survived, the event's impact and proximity suggest a concerning situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 18:13:57"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight on the bus today. Two teens, over a phone. It escalated so fast. Shook me up. Is this normal now? Makes me scared for my younger brother.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and evokes fear, but there is no indication of immediate danger to the speaker or their brother. The event caused emotional distress but doesn't suggest a high risk of physical harm or serious escalation.",
    "detected_category": "violence",
    "timestamp": "2026-01-24 18:12:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scared. Found my roommate unresponsive. Narcan worked, but it was close. Learn the signs of OD, please. It could save a life. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The roommate was unresponsive and required Narcan, indicating a life-threatening overdose situation. While Narcan was effective, the situation was described as 'close', suggesting a high risk of death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 18:11:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scared me to death. Narcan saved them, but it's a reminder how close to the edge things are. Anyone else feel like this is happening way too often?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event can be psychologically distressing and indicates a potential risk of future exposure to similar traumatic events. While the person survived, the event highlights the presence of a serious health crisis in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 17:16:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy, and I'm not sure where to turn. Just need to hear I'm not alone in this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and loneliness but lacks specific details about self-harm or suicidal intent. It primarily communicates a desire for connection and support.",
    "detected_category": "other",
    "timestamp": "2026-01-24 17:15:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough week. Urges are strong. Just trying to get through it one minute at a time. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses strong urges and is struggling to cope, suggesting potential for self-harm or other harmful behavior. The specific nature of the urges is unknown but the intensity raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-24 17:14:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Called the non-emergency line, but feel like I should have done more. Anyone else witness stuff like that? Makes you feel helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an act of violence (shoving) which constitutes a potential physical safety risk to the girlfriend. While the incident is over, the reporting person's feeling of helplessness suggests potential escalation or future risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-24 17:13:53"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend in the street. Froze. Someone called the cops, I hope. Still shaking. Feeling sick. Is there anything else I could've done?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing a violent assault (punching) indicates a serious immediate threat to the victim's physical safety and potential for escalation.",
    "detected_category": "violence",
    "timestamp": "2026-01-24 17:12:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... feels like I'm walking on eggshells. Anyone else been through this? How did you find the strength to get out? #abuse #domesticviolence #help",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, which can escalate to physical violence and has a significant impact on mental health. The mention of 'walking on eggshells' suggests a heightened state of anxiety and fear.",
    "detected_category": "abuse",
    "timestamp": "2026-01-24 17:11:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown yesterday. Shook me up bad. Narcan saved him, thank god. Makes you realize how close it is. If you're struggling, please reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, indicates a significant safety risk related to drug use in the community and raises the possibility of further overdose events affecting others, including the original poster.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 17:10:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are strong. Reached out to a friend, feels a little better. Remember you're not alone. 988 is there if you need it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and struggle, suggesting elevated risk. Reaching out to a friend is a protective factor, but the presence of strong urges necessitates a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2026-01-24 17:09:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Walking on eggshells all the time. Is this normal? Feeling really lost. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive home environment ('walking on eggshells') and feelings of being lost, suggesting emotional distress and possible risk of escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-24 17:08:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scariest thing ever. They're okay now, thank god. But please, if you're struggling, reach out. It's not worth it. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a recent overdose event involving a friend, indicating a potential risk of future overdose or related harm within the social circle. While the friend survived, the event highlights vulnerability and potential for recurrence or similar situations among individuals struggling with addiction.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 17:07:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm underwater. Just reaching out... has anyone else felt this way? Could really use some support right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and needing support, but does not contain specific threats or plans for self-harm, suicide, violence, or abuse. It is a general expression of distress and a request for help.",
    "detected_category": "other",
    "timestamp": "2026-01-24 16:18:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get too much, and I cope in unhealthy ways. Today's one of those days. Trying to reach out instead. Anyone know good resources? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the individual is struggling with overwhelming feelings and uses unhealthy coping mechanisms. They are reaching out for help, suggesting a desire to avoid more dangerous outcomes, but the mention of 'unhealthy ways' combined with feeling 'lost' raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-24 16:17:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at a party last night. Scariest thing ever. Narcan worked, thank god. Please, learn the signs and carry it if you can. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was administered successfully, an overdose occurred, indicating a potentially life-threatening situation. The event caused significant distress to the person reporting it. Learning signs and carrying Narcan is encouraged which indicates a high risk of future overdoses in the associated community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 16:16:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy, and I don't know where to turn. Just reaching out to see if anyone else understands. Maybe sharing helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of sadness and being lost, but lacks explicit suicidal ideation or plans. Sharing feelings suggests a desire for connection rather than isolation.",
    "detected_category": "other",
    "timestamp": "2026-01-24 16:15:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post addressing suicidal feelings, aiming for authenticity and help-seeking:\n\n\"Been feeling so numb lately. Like nothing matters. Just reaching out... anyone else ever feel this way?  Need to find a way out of this hole.\"\n\nI have avoided any graphic details or specific methods, focusing on the feeling and the call for connection.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes feelings of numbness and hopelessness, and expresses a desire to escape the situation, which are all indicators of suicidal ideation. While it avoids specific methods, the statement \"Need to find a way out of this hole\" is a direct expression of wanting to escape, implying the ideation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-24 16:14:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough lately. Feeling isolated & scared at home. Just need to hear from someone who understands. It's getting harder to pretend everything's okay.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses isolation, fear, and difficulty coping, suggesting potential for escalation if support is not received. The statement \"It's getting harder to pretend everything's okay\" indicates increasing distress.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-24 16:13:39"
  },
  {
    "title": "User Story: Violence",
    "content": "Heard shouting next door again. Sounded bad. I called the cops anonymously last time, but I feel like I should do more. Anyone know what resources are available to help a neighbor in a domestic violence situation? I'm scared for them.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports of shouting and concern for a neighbor suggest a potential domestic violence situation. While the immediate physical danger is unconfirmed, the repeated nature (\"again\") and fear expressed warrant a medium severity rating.",
    "detected_category": "violence",
    "timestamp": "2026-01-24 16:12:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a friend OD. Terrifying. Narcan saved their life. Learn the signs and keep it on you. Could be someone you know next. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose event, a life-threatening medical emergency. While Narcan was successful, the incident highlights the immediate and serious danger of overdose.",
    "detected_category": "overdose",
    "timestamp": "2026-01-24 16:11:35"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back and stronger. Trying to stay strong, but it's hard. Anyone else relate? Just feeling so alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of strong urges and feelings of isolation, suggesting a potential struggle with mental health or addiction, increasing the risk of harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-24 16:10:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been feeling so isolated lately. Walking on eggshells all the time. Is this normal in a relationship? Starting to think it's not... Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential emotional abuse (walking on eggshells). While there's no explicit mention of physical harm, the isolation and feeling of walking on eggshells suggest a potentially unhealthy and escalating situation. The user is seeking validation, indicating a need for support.",
    "detected_category": "abuse",
    "timestamp": "2026-01-24 16:09:32"
  }
]