[
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being lost, which are risk factors for self-harm or suicidal ideation. The individual is reaching out for help, indicating a potential need for support and intervention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 12:22:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Trying to distract myself, but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges' returning and feeling overwhelmed, suggesting a potential risk of acting on those urges. While the individual is trying to distract themselves, the difficulty in doing so raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 12:21:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Please, if you're struggling, reach out. There's help available. Don't let it get that far. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a near-lethal event, although the exact cause is unclear. The phrases \"almost didn't wake up\" and \"Don't let it get that far\" indicate a potentially serious situation. The vulnerability of the author is shown through: \"Scariest thing ever. I'm still shaking\"",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 12:20:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scared me to death. Narcan saved them, but it shook me up. Where can I learn how to use it? Want to be ready if it happens again.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a significant event with potential for psychological distress. While the individual survived, the text indicates the observer was significantly shaken and is now actively seeking training to respond to future overdose events. This suggests a heightened awareness and concern about the possibility of future incidents, indicating a medium level of risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 12:19:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but shaken up. Learn CPR & how to use it, please. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, requiring Narcan intervention, indicating a significant health risk even though the person survived. Witnessing the event has caused emotional distress.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 12:18:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in our town. Scared me. Almost lost a friend last year. Narcan saves lives. Learn how to use it. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a recent overdose and a past near-fatal overdose of a friend, highlighting the potential for future overdose events. The call to learn how to use Narcan indicates an anticipation of future need.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 12:17:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is back. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a direct urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 12:16:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain any explicit mentions of self-harm, suicidal ideation, violence, abuse, or overdose. It appears to be a general expression of emotional distress and a request for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-13 12:15:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Makes you realize how easily things can go wrong. Please, if you're struggling, reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while not directly indicating imminent harm to the author, suggests potential exposure to traumatic events and highlights the prevalence of substance abuse issues. The call to reach out implies awareness of personal or community struggles.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 12:14:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs and yelling... I feel so small. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a negative home environment with emotional abuse, indicating potential for psychological harm. While not explicitly stating intent for self-harm or suicide, the feeling of being 'small' and asking for help suggests distress that warrants attention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 12:13:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a screen. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of numbness and detachment, indicating potential emotional distress and a need for support. While not explicitly suicidal, the plea for help suggests a significant decline in mental well-being and warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 11:16:02"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough. Walking on eggshells constantly. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 92 (char 117)",
    "detected_category": "unknown",
    "timestamp": "2025-12-13 11:15:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after 6 months clean. Disappointed in myself, but trying to remember recovery isn't linear. Gonna reach out to my therapist today.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential escalation of risk. While the individual expresses disappointment and intends to seek support, the relapse itself warrants a medium severity assessment.",
    "detected_category": "other",
    "timestamp": "2025-12-13 11:13:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Talking to my therapist tomorrow, but tonight feels so long. Anyone else relate? Just trying to get through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses a strong urge to self-harm and feelings of being overwhelmed, indicating immediate distress. Seeking therapy is a positive sign, but the immediate risk requires attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 11:12:57"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n\"Felt really low lately. Urges are back. Reached out to a friend, but it's still hard. Anyone else relate? How do you cope?\"\n\n**Option 2 (Sharing Experience):**\n\n\"Scars are a reminder of a dark time. Healing isn't linear, but I'm trying to be kinder to myself each day.\"\n\n**Option 3 (Raising Awareness):**\n\n\"It's not attention-seeking, it's a cry for help. Let's be more understanding and supportive of those struggling.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 mentions urges, indicating a potential risk of self-harm. While help is being sought, the persistence of urges elevates the severity. Option 2 mentions 'scars', implying past self-harm. Option 3 advocates for understanding cries for help, indirectly acknowledging a potential issue.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 11:11:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Punches thrown, yelling. Shook me up. Makes you wonder what's going on with people. Anyone else see it? Hope everyone's okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessed a fight, but no specific mention of serious injuries or escalation to a level suggesting widespread danger. More a description of a disturbing event.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 11:10:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Shook me up. Didn't know what to do. Wish I'd said something. Anyone else ever freeze like that? Feeling awful.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a violent act is disturbing, but the text describes witnessing, not experiencing, the violence. No immediate threat to the author or others is indicated, although the situation could escalate if the assault continues.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 11:09:53"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on the street. Shook me up bad. Reminded me of things I'd rather forget. Anyone else get triggered by stuff like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes being shaken up and triggered by a fight, but doesn't express intent to harm self or others. It seeks coping mechanisms, indicating a desire to manage distress.",
    "detected_category": "other",
    "timestamp": "2025-12-13 11:08:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is getting strong again. Reached out to a friend, hoping it helps this time. It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating an immediate risk to the individual's safety and well-being. While the individual has reached out for help, the intensity of the urge warrants a high severity assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 11:07:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so numb lately, like I'm watching life from behind glass. Reaching out because I don't know what else to do. Has anyone else felt this way? Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of numbness and detachment from life, indicating potential emotional distress and a need for support. While not explicitly suicidal, the feeling of being disconnected and reaching out for help suggests a moderate level of concern.",
    "detected_category": "other",
    "timestamp": "2025-12-13 11:06:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but it shook me. Where can I learn to use it in case it happens again? Seriously, any resources appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event. While the person survived, the request for Narcan training indicates concern about future incidents and a potential for repeated exposure, which could impact mental health. It also hints at a possible high-risk environment.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 10:17:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Trying to resist, but it's hard. Anyone else relate? Any tips for coping?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating immediate risk and potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 10:16:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Terrifying. Narcan worked, thankfully. Makes you realize how close we all are to losing someone. Learn CPR, carry Narcan. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose and the potential for death, even with intervention, indicates a significant but localized risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 10:15:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so overwhelmed lately. Just remembering my uncle, lost him to suicide years ago. It still hurts. Talking helps, even a little. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and grief related to a past suicide of a relative, which could trigger suicidal ideation or feelings of hopelessness. The mention of talking helping is a protective factor, but the underlying vulnerability warrants a medium severity assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 10:14:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Still trying to process everything. It's hard to admit, but I wasn't okay. Getting out was the hardest part. If you're going through something similar, please know you're not alone. There are resources out there. Reach out.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests the individual experienced a difficult situation and was 'not okay'. The phrase 'getting out was the hardest part' implies a possible crisis or harmful environment. While not explicit, the message suggests potential distress needing support.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 10:13:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things at home have been rough lately. Walking on eggshells constantly. Is this normal? Feeling so isolated. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive or highly stressful home environment (\"walking on eggshells\"). The feeling of isolation further elevates the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 10:12:10"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing emotional distress. While unsettling, it doesn't indicate imminent danger to the poster or others, nor does it suggest intent to cause harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 10:11:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like nothing matters. It's scary. Reaching out to a friend tonight. Hoping things get better. It's okay to not be okay, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and acknowledges that feeling this way is \"scary.\" While the person is reaching out for support, the presence of suicidal ideation, even if passively expressed, elevates the risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 10:10:07"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Shook me up. Said something, but feel like I should've done more. Anyone else ever freeze like that? How do you react next time?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a witnessed act of violence (shoving). While it's a single incident and doesn't provide extensive details about the relationship or intent, any physical altercation carries the potential for escalation and harm. The observer's distress suggests the event had a significant impact.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 10:09:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is anyone else feeling this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, suggesting distress and a need for support. The metaphor of being 'underwater' can indicate feelings of being suffocated or trapped. While not explicitly suicidal, the language suggests significant emotional distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 10:08:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up bad. Reminded me of my brother's situation. Domestic violence is a nightmare. Wish there was more help out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing emotional distress and referencing domestic violence. While concerning, it doesn't indicate immediate danger to the author or others. There is no threat or implication of immediate harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 09:17:26"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on the bus. Shaken. This city is getting scarier. Anyone else feel that way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't indicate immediate danger to the individual. The text expresses fear and anxiety, but no direct threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 09:16:25"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary. They were lucky someone knew what to do. Narcan is so important. Learn the signs. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose was successfully managed, it indicates the presence of a life-threatening situation and the potential for future occurrences. The event caused distress (scary), highlighting the impact and potential psychological harm to witnesses. The advice to learn the signs implies the risk of future events.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 09:15:23"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. It's always walking on eggshells. He yells, then says he's sorry. Says he didn't mean it. Is this normal? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential for escalating abuse. The phrase 'walking on eggshells' and 'he yells' suggest an abusive relationship, which can escalate and pose a significant safety risk. While not explicitly stated, the speaker's feeling of being 'lost' could indicate emotional distress that warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 09:14:22"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough at home lately. Walking on eggshells constantly. Is this normal in a relationship? Starting to feel like I'm losing myself.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a feeling of losing oneself, which, while not explicitly mentioning harm, suggests a potentially unhealthy and destabilizing situation. 'Walking on eggshells' hints at potential emotional abuse or a highly conflictual environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 09:13:20"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. So scary how quickly things escalated. Makes you think, you know? Stay safe out there, everyone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, indicating potential violence. However, it doesn't indicate direct involvement or threat to the speaker or others. It's more of a general observation and expression of concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 09:12:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice or just someone to listen?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and a plea for help, indicating emotional distress and potential vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 09:11:17"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shaken up. Makes you realize how quickly things can escalate. Anyone else feel like things are getting more volatile lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Describes an instance of violence resulting in unconsciousness. While it's a secondhand account, the mention of being 'knocked out cold' indicates potential for serious injury.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 09:10:16"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, walking on eggshells... Feels like I'm losing myself. Anyone else been through this? Where did you find help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home environment with emotional abuse (put-downs) and a feeling of being lost. While not explicitly stating intent to harm self or others, the context suggests a risk of escalating mental health concerns. 'Walking on eggshells' indicates a high-stress environment that could lead to further deterioration.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 09:09:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel trapped. Has anyone else been through this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, indicating a potential abusive situation and feeling trapped. While not explicitly stating physical harm or suicidal ideation, the emotional distress suggests an escalation risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 09:08:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 103 (char 128)",
    "detected_category": "unknown",
    "timestamp": "2025-12-13 08:20:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Thankful for the paramedics. This sh*t's gotta stop. Anyone know where to find resources for narcan training? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be psychologically distressing and indicates a potential risk of future overdoses in the area. The expressed feeling of helplessness also suggests a potential impact on mental well-being.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 08:19:07"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the subway. Everyone just stared. My heart's still racing. Is this normal now? Feeling really shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical assault occurred, though the extent of injury is unknown. The witness expresses significant emotional distress (racing heart, feeling shaken) indicating a potentially traumatic experience.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 08:18:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nUgh, rough day. Feeling the urge to relapse. Reached out to my crisis text line. Just gotta keep breathing. Anyone else been there? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses a strong urge to relapse, indicating a potential crisis. While reaching out for help is positive, the presence of the urge signifies elevated risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 08:17:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Reminded me of things back home. Anyone else get triggered by stuff like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling triggered. While it indicates distress, it doesn't suggest immediate danger to self or others. The individual is seeking coping mechanisms, indicating a desire to manage their emotions in a healthy way.",
    "detected_category": "other",
    "timestamp": "2025-12-13 08:16:02"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out on my street last night. So scary. Shaking still. Is there anything I can do to help the guy who got hurt? Feel so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence, potential for vicarious trauma and concern for injured individual. Though the person is not directly in danger now, there is indication of distress and the possibility of future anxiety/fear related to the event.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 08:15:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Walking on eggshells constantly. Is this normal? Anyone else feel like they're losing themselves? #abuseawareness",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a potentially abusive home environment, characterized by fear and a loss of self. While there's no explicit mention of violence or immediate danger, the 'walking on eggshells' and 'losing themselves' indicate psychological distress and potential emotional abuse, which could escalate.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 08:13:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like nothing matters. Reaching out to a friend, hoping it helps. Remember to check on your loved ones, you never know what they're going through.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of low mood and hopelessness, which are potential indicators of suicidal ideation. The act of reaching out is positive, but the overall sentiment warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 08:12:57"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Remember we're not alone. Talking is key. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a high level of immediate risk. While the person reached out to a friend, the persistence of the urge requires serious attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 08:11:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIPs lately. ODs are hitting hard. Scared for my brother. Anyone know resources for families dealing with addiction in [City Name]?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text mentions a high number of deaths (RIPs) and overdoses (ODs), coupled with the writer's fear for their brother, indicating an immediate and significant risk related to substance abuse and potential overdose.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 08:10:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the subway. Shook me up. Is it just me, or is everyone on edge lately? Makes me scared to ride alone now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While a violent act (shoving) occurred, the text describes witnessing it rather than being a direct victim. The writer expresses fear and anxiety, but doesn't indicate immediate danger or intent to harm themselves or others. The incident is unsettling but doesn't suggest a high probability of severe harm to the writer or widespread danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 07:17:30"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Makes you wonder what's going on with people. Hope everyone involved is okay. Feeling shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text expresses concern and empathy rather than direct involvement, intent to harm, or imminent danger to the author or others. It reflects emotional distress but not a specific threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 07:16:28"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get jumped on my way home. Shook me up bad. Called the cops, but still... feels like there's nowhere safe anymore. Anyone else feel this way lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault is a traumatic experience that can lead to anxiety and a feeling of unsafety. While the original poster was not directly harmed, the event has a significant emotional impact and implies a potential for future violence in the area.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 07:15:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so overwhelmed lately. The urge to cut is strong. Reached out to a friend, just need someone to listen. It's a day by day thing, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating potential for harm. However, the individual has reached out for help, which is a mitigating factor.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 07:14:24"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit statements of self-harm, suicide, or harm to others. It's a general expression of distress and a request for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-13 07:13:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Terrifying. Narcan saved their life. Please, if you're using, have it on hand. And know how to use it. Could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose, indicating a severe and immediate risk to individuals using drugs. While Narcan was used successfully, the event highlights the potential for fatal consequences and the urgent need for preventative measures.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 07:12:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to remember my coping skills but it's hard. Anyone else relate? Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges and difficulty coping, suggesting an increased risk of self-harm. The feeling of loneliness exacerbates the situation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 07:11:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a tough time lately. Urges are back. Trying to distract myself, but it's hard. Anyone else relate? Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of isolation, which are risk factors for self-harm or suicidal ideation. While not explicitly stating intent, the mention of 'urges' warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 07:10:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Everything feels overwhelming. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a lack of coping mechanisms, indicating potential distress. While it doesn't explicitly mention self-harm or suicide, the expression \"feeling so low\" and not knowing what else to do warrants concern and further investigation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 07:09:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Called 911, they're ok now, but shook me up. Naloxone saves lives, ppl. Be careful out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event is a serious situation with potential for vicarious trauma and heightened anxiety in the witness. While the person who overdosed is now okay, the event signifies a safety risk for others and indicates the presence of a dangerous substance.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 07:08:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want the pain to stop, even for a little bit. Trying really hard to find better ways to cope. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire for pain to stop, which suggests potential suicidal ideation, although it also mentions attempts to find better coping mechanisms, indicating some level of help-seeking. The ambiguity warrants a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 06:21:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional or psychological abuse and feelings of being trapped, indicating a significant impact on well-being. While not explicitly mentioning physical harm, the controlling behavior and put-downs suggest a potentially escalating situation that warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 06:20:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, using the metaphor of being 'underwater,' which suggests a struggle and a cry for help. While not explicitly stating suicidal ideation, the feelings of hopelessness warrant concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 06:19:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to a friend helped a little, but it's still hard. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but it does not contain specific threats or plans for self-harm. Talking to a friend provided some relief, suggesting a protective factor.",
    "detected_category": "other",
    "timestamp": "2025-12-13 06:18:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just a dark cloud that won't lift. Reaching out because I know I need to. If anyone else is struggling, you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of depression and acknowledges the need for help, suggesting a potential risk. While not explicitly suicidal, the persistent low mood warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 06:17:05"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train for accidentally bumping someone. Shook me up. Is this normal now? Feel like everyone's on edge.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While concerning, the incident describes a single act of violence that did not result in severe injury. The observer expresses feeling shaken but doesn't indicate imminent danger to themselves or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 06:16:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nUgh, things got really dark last night. I relapsed. Feeling so ashamed but also just...numb. Reached out to a crisis line, gonna try to get back on track. It's a long road.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Relapse after a period of sobriety, feelings of shame and numbness, and reaching out to a crisis line indicate a high risk of self-harm or suicide.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 06:15:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating emotional distress and a potential need for support. The metaphor 'underwater' suggests a feeling of being overwhelmed and struggling.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 06:14:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the park. Scared me so bad. My hands are still shaking. Anyone else feel like things are getting more volatile lately? Makes me worried for my kids.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and expressing fear and worry. While concerning, it doesn't indicate imminent or direct threat of severe harm to anyone. The fear experienced is a personal reaction to a potentially violent event.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 06:12:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my friend unresponsive. Narcan worked, thank god. Scary reminder of how easily things can go wrong. Learn the signs, carry Narcan, please. It could save a life. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a friend found unresponsive due to a likely overdose, requiring Narcan. This indicates a life-threatening situation that was averted, highlighting a significant immediate danger.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 06:11:58"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so incredibly lost lately. Like I'm underwater. Just reaching out... has anyone else felt this way? What helped?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but doesn't contain explicit mentions of self-harm, suicide, or violence. It is a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-13 05:18:05"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel like violence is getting worse lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing distress, but doesn't indicate direct involvement, intent to harm, or immediate danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 05:17:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Finally left. Scared but free. After years of the 'silent treatment' and constant put-downs, I deserve better, right? Anyone else been through this? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the individual has recently left an abusive situation (likely emotional/psychological abuse). While there's no explicit mention of self-harm or suicide, the feelings of fear, being lost, and having endured years of negative treatment suggest a heightened risk of emotional distress and potential for unhealthy coping mechanisms.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 05:16:03"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard yelling next door again last night. Sounded like things were thrown. Called the non-emergency line, but they said they couldn't do anything unless they heard screams. What do you do?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Yelling and sounds of objects being thrown next door suggest a potential escalation to violence or abuse. The poster is scared and unsure how to proceed after the non-emergency line offered no help.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 05:15:01"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a fight downtown last night. Guy got clocked pretty bad. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling and cause anxiety, but the text doesn't indicate ongoing danger or direct threat to the speaker or others beyond the initial event.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 05:13:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's getting harder to hide the bruises. He says he's sorry after, promises it won't happen again. But it does. Is this normal? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a pattern of physical abuse and the victim's distress, indicating a high risk of serious harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 05:12:58"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and helplessness, indicating emotional distress. While not explicitly mentioning self-harm or suicide, the metaphor of being 'underwater' and the plea for help suggest a significant risk that requires attention and support. The phrase 'don't know what else to do' also indicates a lack of coping mechanisms.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 05:11:56"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Dude got knocked out cold. Shook me up bad. Is there anywhere to learn self-defense around here? Feeling really vulnerable now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent event can cause significant emotional distress and a feeling of vulnerability. The individual is now actively seeking self-defense training, suggesting a perceived increased risk to their personal safety.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 05:10:55"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. Constant put-downs, controlling who I see... Is this normal? Feeling trapped and lost. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 78 (char 103)",
    "detected_category": "unknown",
    "timestamp": "2025-12-13 05:09:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scared me senseless. They're okay now, thankfully. Narcan works. Please, if you're using, carry it. And tell someone you trust. This shit is real.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, an overdose occurred, indicating a serious health risk and potential for future, possibly fatal, incidents. The text also suggests potential risk for others in a similar situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 05:08:51"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out downtown. Shook me up bad. Seeing that kind of anger... makes you realize how fragile things are. Anyone else feel this way sometimes?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potentially violent situation, but it primarily focuses on the emotional impact on the author. There's no indication of direct threat or immediate danger to the author or others, or any suggestion of escalation.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 04:22:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need to get through tonight. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of being overwhelmed, suggesting a potential risk of self-harm or relapse. While the person has reached out for support, the exhaustion and struggle imply a vulnerability that needs to be taken seriously.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 04:21:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mentions of self-harm, suicide, or violence. It appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-13 04:20:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Narcan saved them, but it shook me up. If you're using, please be careful & have someone with you. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential for future similar incidents or escalation. While the person survived due to Narcan, the situation carries significant risk for those using substances.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 04:19:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed yesterday, relapsed after 6 months clean. Feeling a lot of shame but trying to remember it's a slip, not a fall. Reaching out to my therapist today. This sucks.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates vulnerability and potential for escalating substance use. While the individual is reaching out for help, the shame and negative feelings increase risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 04:18:03"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy shove his girlfriend on the street. Froze. Wish I'd said something, anything. Feeling sick about it now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an act of violence suggests potential for escalation and immediate harm, even if not directed at the reporter. The act of shoving can cause physical harm and emotional distress. The reporter's distress also indicates a potentially harmful situation.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 04:17:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant put-downs, isolating me from friends... I feel trapped. Anyone else been through this? How did you find help? #abuseawareness #domesticviolence",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, indicating a potentially dangerous situation. While there's no explicit mention of physical violence or immediate danger, the feeling of being trapped raises concerns for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 04:15:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Made me think about my sister's abusive ex again. Still gives me chills. Anyone else deal with this kind of trauma?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and expressing fear and traumatic memories. While concerning, there is no immediate threat of violence or self-harm expressed by the author. The mention of an abusive ex suggests potential past trauma, but does not indicate an active risk.",
    "detected_category": "other",
    "timestamp": "2025-12-13 04:14:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw another ambulance on my street. Makes me sick. Lost my cousin last year. Please, if you're struggling, reach out. There's help out there. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses grief and encourages seeking help, but doesn't indicate immediate risk to the author or others.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 04:13:56"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Dude got seriously hurt. Makes you wonder what's going on with people. Shaken up, honestly. Anyone else see anything?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a violent incident where someone was 'seriously hurt,' indicating a potential for significant harm, but lacks specific details to suggest widespread or ongoing risk. The author expresses being 'shaken up,' which indicates emotional distress related to the event.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 04:12:54"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n>  Relapsed after 6 months clean. Feeling so ashamed and alone. Reached out to my therapist, but it's gonna be a long week. Any coping tips appreciated.\n\n**Option 2 (Raising Awareness):**\n\n> Scars aren't always visible. Be kind, you never know what someone's going through. Check in on your friends.\n\n**Option 3 (Personal Story):**\n\n>  Urges are hitting hard tonight. Just trying to breathe and remember why I stopped. Taking it one minute at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 describes a relapse which can be dangerous. Option 3 describes strong urges which may lead to self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 03:40:02"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw two guys fighting outside my building last night. Scared the crap out of me. Is this happening more often lately, or am I just noticing it more? Feeling really unsafe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing fear but doesn't indicate direct threat to the speaker. It expresses feeling unsafe but doesn't suggest immediate danger or escalation.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 03:38:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his dog on Elm St. Shaken up. Reported it, but feeling helpless. Anyone else witness this? What can be done to actually stop animal abuse around here?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the incident is disturbing, it's a single instance of animal abuse and there's no immediate threat to human safety. The reporter is shaken but not indicating self-harm or violent intent.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 03:37:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown yesterday. Scary. Narcan saved him, but it shook me up. Makes you realize how fragile life is. Be safe out there, folks. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even when reversed by Narcan, indicates a significant risk of harm in the environment, although it doesn't directly involve the author.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 03:36:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He's been getting worse lately, yelling over nothing. Last night he smashed a plate. Is this normal? I feel so trapped. Where do I even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates escalating anger and potential for violence from another person, creating a feeling of being trapped and a need for help. While there's no direct threat of harm from the speaker, the situation is concerning and warrants intervention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 03:35:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing so many RIP posts lately... Scared. Almost lost my best friend last week to an OD. Narcan saved him. Please, learn the signs & carry it if you can. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a near-fatal overdose, indicating a serious safety risk. While the friend was saved, the incident highlights the potential for fatal outcomes related to drug use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 03:34:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just heavy. Talking to a friend helped a bit, but it's still there. Gonna try to reach out for more support tomorrow. Hope things get better.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of sadness and being lost, but also indicates active coping mechanisms (talking to a friend, planning to reach out for more support). No direct mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2025-12-13 03:33:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a bit. Just taking it one day at a time. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 03:32:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant yelling, and I feel so small. Anyone else ever feel trapped like this? Need to figure out my next step.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a feeling of being trapped and constant yelling, suggesting a potentially abusive or highly dysfunctional home environment. While it doesn't explicitly mention harm, the feeling of being 'small' and needing to figure out the 'next step' indicates distress and a need for intervention before the situation escalates. There's a potential for the individual to experience psychological harm or consider harmful coping mechanisms.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 03:31:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. He yells all the time, and last night... I don't know what to do. Anyone been through this? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes yelling and a concerning, though unspecified, event the previous night. This raises concerns about potential verbal or physical abuse, though the exact nature is unclear. The user expresses feeling lost and seeking help, indicating distress and a need for support.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 03:30:46"
  }
]