[
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about another OD. Scares me, honestly. Lost a friend last year. If you're struggling, please reach out. There's help available. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose and expresses fear, indicating potential vulnerability in the author or someone they know. It also references the loss of a friend, suggesting personal experience with the issue.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 08:19:42"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He keeps saying he's sorry, but then it happens again. I feel so trapped. Anyone else been through this? How do you even start to get out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped and a repeated cycle of apologies followed by negative actions. This suggests a potentially abusive situation. The individual is also seeking advice on how to escape, indicating a desire to change their circumstances but a lack of immediate resources or plan.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 08:18:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out to a friend, hoping it helps. Anyone else ever feel this way? Talking feels impossible.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and lack of motivation, hinting at potential depression. Reaching out to a friend is a positive sign, but the feeling of it being 'impossible' to talk is concerning.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 08:17:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs, walking on eggshells... I feel so alone. Anyone else been through this? Where do I even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and feelings of isolation, indicating potential for escalation. While not explicitly stating harm, the mention of constant put-downs and walking on eggshells suggests a toxic environment that can negatively impact mental health and potentially lead to self-harm or suicidal ideation in the future if not addressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 08:16:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"It's hard to admit, but things aren't good at home. Constant put-downs are wearing me down. Anyone else experience this? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes ongoing emotional abuse (put-downs) which can have a significant negative impact on mental health. While it doesn't explicitly mention self-harm or suicidal ideation, chronic emotional abuse increases the risk of these outcomes.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 08:15:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Terrifying. Narcan saved him, but shook me up. Please, if you're using, have someone with you and have Narcan. It could save a life. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose implies a high risk of similar incidents occurring involving the individual or their social circle. The text explicitly mentions a life-threatening situation requiring emergency intervention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 08:14:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary. My hands are still shaking. Is there anywhere to volunteer, maybe help prevent this kind of thing? Feeling so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text primarily expresses fear and a desire to help, not an immediate threat of violence or harm to the author or others. There's no direct indication of ongoing violence or escalation. The author expresses wanting to help prevent such events from occurring.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 08:13:33"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shaken up. Anyone else witness that? Hope he's okay. Makes you think, you know?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was knocked unconscious in a fight, indicating a potential for serious injury.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 08:12:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... It's scary. My brother almost didn't make it last year. Naloxone saved his life. Learn the signs, please. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions a near-fatal overdose and highlights the importance of awareness to prevent future incidents. While the writer is not personally at risk, the text implies an ongoing risk of overdose in the community and a past personal experience with a serious overdose situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 08:11:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post about suicide, aiming for authenticity and help-seeking, while staying under 300 characters:\n\n\"Things have been really dark lately. Feeling so lost and overwhelmed.  Talking feels impossible, but I know I need to. Anyone else been there? How did you get through it?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The post expresses feelings of being lost, overwhelmed, and experiencing a dark period, all indicative of suicidal ideation. While it seeks help, the direct mention of darkness and feeling overwhelmed suggests a high level of distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 08:10:28"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Should I have done something? Feeling sick about it. What can you even do in that situation?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence and feeling distressed could indicate a potential for escalation or long-term psychological harm. While the text doesn't explicitly mention ongoing danger to the victim or perpetrator, the reported incident suggests a risk of continued abuse.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 07:17:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Trying to stay strong, but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses active suicidal ideation (urge to cut) and feelings of being overwhelmed, indicating a need for support and a potential risk of self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 07:16:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like a dark cloud won't lift. Reaching out because I know I need to talk to someone. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of depression and a need for help. While not explicitly suicidal, the described state could escalate without intervention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 07:15:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I'm fighting them. Just need to get through tonight. Anyone else relate? Any tips for coping?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with urges, suggesting potential self-harm or relapse into a harmful behavior. The statement expresses a need to 'get through tonight,' implying immediate distress. While not explicitly stating suicidal intent, the resurgence of urges and feelings of being overwhelmed necessitate a 'medium' severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 07:14:13"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel like violence is getting worse lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text doesn't indicate direct involvement, immediate danger, or serious injury. The person expresses feeling shaken up, but this suggests emotional distress rather than physical harm or imminent threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 07:13:11"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mentions or indications of self-harm, suicide, violence, abuse, or overdose. It's a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-06 07:12:10"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Wish I'd said something, done something. Feeling sick about it. Anyone else ever experience that? How do you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault suggests potential for escalation and immediate danger to the victim. The poster's distress also warrants concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 07:11:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a glass wall. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of numbness, detachment, and a lack of direction, indicating potential emotional distress and a need for support. The user is reaching out, which is a positive sign, but the underlying feelings could escalate if unaddressed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 07:10:07"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like I'm underwater. Reaching out to a friend, but it's hard. Anyone else ever feel this way? Just looking for a little hope.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed, which are risk factors for more serious mental health concerns. The individual is reaching out, suggesting a desire for help, but the depth of the negative feelings warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 07:09:05"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed, indicating potential emotional distress and a need for support. While there's no explicit mention of self-harm or suicidal ideation, the feeling of being lost and not knowing what else to do warrants concern and a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 07:08:03"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Frozen. Should I have said something? Feel sick about it. Wish I knew what to do in those situations.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an incident of public assault, indicating potential for physical harm and emotional distress to the victim. While the observer is not directly involved, their feeling of sickness suggests a potential escalation or repeated pattern.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 06:20:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I hate this. Trying to stay strong but it's hard. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feeling overwhelmed and mentions the return of 'urges,' which, while not explicitly stated, raises concern for potential self-harm or other negative coping mechanisms. The user is also struggling to stay strong, indicating vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 06:19:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things are bad at home again. Walking on eggshells. Anyone know resources for emotional abuse?\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Gaslighting is so insidious. Didn't realize how much it messed me up until recently. Healing is hard.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"People often overlook verbal abuse. It leaves scars you can't see. It's still abuse and it's not okay.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and its lasting impact. While not explicitly stating imminent danger, the mention of \"walking on eggshells,\" \"gaslighting,\" and the difficulty of healing suggests a potentially harmful situation and a need for resources.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 06:18:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Narcan saved him. Please, learn the signs of OD and carry it if you can. It's real, and it's scary. We need to talk about this more.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose, indicating a high risk of death or serious harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 06:17:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of loss, heaviness, and helplessness, indicating emotional distress and a need for support. While not explicitly mentioning self-harm or suicide, the individual is clearly struggling and reaching out for help, suggesting the situation could escalate if not addressed. The statement 'I don't know what else to do' is a concerning indicator.",
    "detected_category": "other",
    "timestamp": "2025-12-06 06:16:25"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Please, if you're using, carry it. You could save a life. Mine almost wasn't saved once.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose incident, a life-threatening event. While the person survived due to Narcan, the event itself indicates a high level of risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 06:15:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Woke up feeling like I'm walking on eggshells again. Just trying to be invisible. Does anyone else feel this way sometimes? It's exhausting.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of anxiety and exhaustion, but lacks explicit mentions or indicators of imminent danger or intent. The phrase \"walking on eggshells\" suggests a stressful environment, but without further context, it's difficult to ascertain the specific nature or source of the stress, or if it poses a direct threat to the individual.",
    "detected_category": "other",
    "timestamp": "2025-12-06 06:14:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are strong. Just trying to make it through the day without giving in. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the individual is experiencing strong urges and struggling to cope. The specific nature of the urges is unclear, but the phrase 'giving in' suggests a potential risk to their well-being.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 06:13:21"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up bad. Never seen anything like it. Is there anywhere to volunteer to help de-escalate situations like that? Feel so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight is a potentially traumatic event, causing emotional distress and a desire to help. While the original poster (OP) isn't directly involved or threatened currently, exposure to violence can have lasting psychological effects.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 06:12:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost, overwhelmed, and not knowing where to turn, suggesting emotional distress and potential vulnerability. While there's no explicit mention of self-harm or suicide, the intensity of the feelings warrants a 'medium' severity rating due to the risk of escalation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 06:11:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scariest thing ever. Narcan saved them, but shaken up. Please, if you're using, have someone with you and Narcan available. It could save a life. Reach out if you need help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event, indicating an immediate risk of repeated overdose and potential fatality. The friend overdosed, highlighting the high likelihood of severe harm or death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 05:17:34"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting on the street, yelling escalated so fast. Started shoving. Makes me sick. Anyone know resources for de-escalation training? Feel helpless witnessing that.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence (shoving) has occurred, indicating a potential for escalation and injury. While the observer is not directly involved, the situation poses a risk of harm to the individuals fighting.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 05:16:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight, hoping it helps. It's exhausting feeling this way.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and exhausted, and mentions reaching out to a friend for support. While indicative of emotional distress, there is no explicit mention of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2025-12-06 05:15:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are strong. Trying to distract myself but it's hard. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges and difficulty coping, indicating potential self-harm risk. The user is reaching out for support, which suggests they are aware of the problem but struggling to manage it independently.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 05:14:29"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\nJust saw a fight break out at the corner store. Scared me half to death. Makes you wonder what's going on in people's lives that leads to that. Wish there was something I could do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A fight breaking out indicates a potential for physical harm to those involved and possibly bystanders, and suggests a breakdown of social order.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 05:13:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Narcan saved them. Please, if you're using, keep it with you. Learn how to use it. It could save a life. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose situation requiring Narcan intervention, indicating a high risk event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 05:12:26"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just realized yelling & insults every day *is* emotional abuse. Thought it was just \"how he is.\" Feeling so lost. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse, which can have significant and lasting psychological impacts. While not immediately life-threatening, it represents a serious safety risk due to potential long-term mental health consequences.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 05:11:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, thank god. Knowing what to do matters. Learn it. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event indicating potential risk of further overdoses in the area. While the person survived, the event highlights a significant health risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 05:10:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, and it helped a little. Just taking it one day at a time. If you're struggling too, you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a high level of immediate risk despite seeking help. While reaching out to a friend is positive, the urge remains strong.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 05:09:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Naloxone saved their life, thank goodness. Makes you realize how fragile things are. Anyone know where I can get trained to use it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be traumatizing and lead to secondary stress or anxiety. The mention of naloxone implies a risk of future overdoses in the area.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 05:08:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Felt so overwhelmed today. Urges were strong, but I distracted myself. Small victory. Still sucks, but gotta keep trying. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates the person is experiencing strong urges and feeling overwhelmed, but they were able to distract themselves. This suggests active coping and reduces the immediate risk. While the situation warrants concern, it doesn't present an immediate threat based solely on this text.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 04:18:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head, I just want it to stop. Scared to admit it, but I cut again last night. Reaching out because I know this isn't me. Where do I even start to get better?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions self-harm (cutting) and expresses a desire for internal pain to stop, indicating a high level of distress and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 04:17:31"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing in the street, got physical real quick. Reminded me of my parents. Shaken up. Anyone else feel triggered by stuff like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight triggered an emotional response, but there's no indication of immediate danger to self or others. The user is seeking coping mechanisms.",
    "detected_category": "other",
    "timestamp": "2025-12-06 04:16:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park today. Scary stuff. Narcan worked, thank god. Learn CPR & recognize the signs, people. It could save a life. Seriously shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a serious health and safety risk event. While the individual survived due to Narcan, the situation itself is high-risk and the witness expresses being shaken up, suggesting a significant emotional impact.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 04:15:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Finally left. Scared but free. Been gaslit for so long, I don't even know what's real anymore. Any advice for rebuilding after emotional abuse?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the person is experiencing significant emotional distress and confusion following emotional abuse. While there is no explicit mention of self-harm or suicide, the statement \"I don't even know what's real anymore\" suggests potential vulnerability and a need for support.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 04:14:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so heavy. Relapsed after a few months clean. Feeling so ashamed, but trying to be gentle with myself. Reaching out for support again. 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety is a significant risk factor, and feelings of shame can exacerbate the situation. Seeking support is a positive sign, but the overall context suggests vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 04:13:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just... heavy. Reaching out before things get worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and a desire to reach out 'before things get worse,' suggesting potential escalation of distress. This hints at a possible risk that needs monitoring.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 04:12:23"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude was getting jumped and no one helped. Makes you sick, you know? Is there anywhere to report something like that anonymously? Feel helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the author was not directly involved in the violence, they witnessed a violent assault and express distress and helplessness. This suggests potential psychological impact and concern for community safety, raising it beyond a simple observation.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 04:11:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about another OD in our town. It's terrifying. Anyone know where to find naloxone locally? Feel helpless. Need to do something.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post mentions a recent overdose death in the town, which is concerning. The user expresses feeling helpless and a desire to find naloxone, indicating a potential for future overdose events. While the user is not directly stating they are overdosing or considering it, the proximity to a recent OD and the need for naloxone warrants medium severity.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 04:10:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a bit. Taking it one hour at a time. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk. While the person reached out for help, the presence of the urge warrants high concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 04:09:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown yesterday. Scary stuff. Please, if you're struggling, reach out. There are people who care and want to help. Don't become another statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a recent overdose, indicating a risk of further overdoses in the area. While the author expresses concern and encourages seeking help, the event itself points to an existing danger.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 03:36:06"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train platform. Scared me half to death. Reminded me of what my sister went through. Is there anywhere to report stuff like that even if no one's hurt (yet)? Feeling so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing someone being shoved suggests potential for escalation to serious harm. The mention of a sister's past experience indicates a heightened emotional response and potential for vicarious trauma. The uncertainty of further harm and feeling helpless adds to the concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 03:35:05"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight downtown. Dude got seriously hurt. Makes you think, y'know? Is there anywhere safe anymore? Feeling pretty shaken up.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a violent altercation resulting in serious injury, witnessed by the author, leading to feelings of unease and a questioning of personal safety. While not directly threatened, the experience is unsettling and suggests potential for anxiety or fear of future violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 03:34:03"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got clocked hard. Makes you wonder what's going on in people's lives, ya know? Hope he's okay. Shook me up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Report of a physical altercation resulting in injury. While no ongoing threat is explicitly stated, the description ('clocked hard') suggests a potentially serious impact.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 03:33:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, thank god. Makes you realize how fragile life is. Anyone know where I can get trained on how to use it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose and seeking Narcan training indicates potential exposure to similar high-risk situations in the future. While the immediate event was mitigated, the individual's interest in Narcan suggests possible ongoing exposure to overdose events.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 03:32:00"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel like anger's just boiling under the surface lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a concerning event, but does not indicate imminent danger to the speaker or others. It expresses concern about escalating anger but doesn't imply planned violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 03:30:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so overwhelmed lately. Just want to know if anyone else has felt like they're drowning and how they got through it. Need some hope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and seeking hope, but lacks any explicit mention of self-harm, suicide, violence, abuse, or overdose. While the feeling of 'drowning' can be a metaphor for severe distress, the user is primarily seeking support and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-06 03:29:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it really shook me up. Know where to get it, folks. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates a potential ongoing risk of overdose in the community. While Narcan was available, the potential for future incidents remains, and the emotional impact on the witness is significant.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 03:28:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest night of my life. Please, if you're struggling, reach out. There are people who care & want to help. Don't let it get this far. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text suggests a possible suicide attempt or severe self-harm incident ('almost didn't wake up'). The urgency in the message and the heart emoji further emphasize the seriousness of the situation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 03:27:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing the author to feel shaken and on edge. While unsettling, it doesn't indicate direct involvement in violence or immediate danger to themselves or others. It mainly expresses a feeling of unease.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 03:26:52"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you realize how quickly things can escalate. Anyone else feeling on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and expressing unease, but doesn't indicate direct involvement, imminent threat, or intent to harm self or others. The language is general and lacks specific details about potential future incidents.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 02:47:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. Narcan worked, thank god. Learn how to use it, it could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event, and while the person survived due to Narcan, the situation indicates a risk of future overdose incidents in the community. While the text expresses relief, it indirectly points to the presence of dangerous drug use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 02:46:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my friend unresponsive. Narcan worked, thank god. Scariest moment of my life. Learn CPR and carry Narcan, please. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a life-threatening overdose event requiring Narcan administration, indicating a high risk of death had intervention not occurred.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 02:45:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Walking on eggshells constantly. Anyone else been through this? Feeling so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and potentially abusive home situation, creating a state of emotional distress and isolation. While not explicitly mentioning violence, self-harm, or suicidal ideation, the phrase \"walking on eggshells\" is often associated with environments where there is a risk of unpredictable and potentially harmful reactions, suggesting a heightened level of potential danger.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 02:44:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after 6 months. Feeling incredibly disappointed in myself. Reaching out for support again. It's a tough journey.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential vulnerability and risk of escalation. While the individual is reaching out for support, the disappointment and tough journey highlight the need for monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 02:43:40"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw my neighbor get shoved yesterday. It was quick, but scary. Made me think, what would I even DO? Anyone know self-defense classes around here?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing an assault on a neighbor is concerning, but the text doesn't indicate immediate danger to the speaker or a high probability of future incidents. The speaker's concern is more about preparedness than imminent threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 02:42:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm stuck in a hole. Reaching out because I don't know what else to do. Is anyone else going through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and hopelessness but does not contain explicit mention of self-harm, suicidal ideation, violence, abuse, or overdose. The individual is reaching out for support, indicating a desire for help rather than a concrete plan for harm.",
    "detected_category": "other",
    "timestamp": "2025-12-06 02:41:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. Urges are strong. Just trying to breathe and remember this feeling will pass. Anyone else been there? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and a struggle to cope, suggesting a potential risk of self-harm or acting on those urges. While not explicitly mentioning intent, the intensity of the feelings warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 02:40:35"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Trying to resist, taking it one minute at a time. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating active thoughts and a struggle to resist. While the user is attempting to cope, the presence of the urge elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 02:39:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Urges were strong. Reached out to a friend instead. Still shaky, but glad I didn't give in. It's a day-by-day thing, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges, suggesting a potential safety risk. While the individual reached out for help and resisted giving in, the shakiness implies ongoing vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 02:38:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been really bad lately. Walking on eggshells constantly. Anyone else feel like they're losing themselves in their relationship? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, feeling alone, and walking on eggshells, suggesting potential abuse or a highly stressful relationship dynamic. While not explicitly stated, this could escalate to self-harm or suicidal ideation if left unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 01:45:31"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Old coping mechanisms keep creeping back into my head. Trying to fight it. Talking to my therapist tomorrow. It's so hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with overwhelming feelings and the return of old coping mechanisms. While the individual is fighting it and seeking help from a therapist, the relapse into old coping mechanisms suggests increased vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 01:44:29"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, rough day. The urge to relapse is so strong. Trying to stay busy and remember why I stopped. Anyone else feel this way sometimes? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a strong urge to relapse, which suggests a potential for self-harm depending on the nature of the addiction. While the individual is actively trying to cope, the intensity of the urge elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 01:43:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Thankfully they're okay now. Makes you realize how easily things can go wrong. Please, if you're struggling, reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose victim is now okay, the event highlights the potential for severe harm and reflects a crisis situation. The text also encourages seeking help, implying a recognition of ongoing risk for others.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 01:42:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Taking it one hour at a time. If you're struggling too, you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk. While the person reached out for help, the urge remains present.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 01:41:24"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Wish I'd said something. Feeling sick about it. Anyone else ever witness something like that? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can have psychological impacts and the situation indicates a potential risk of ongoing abuse.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 01:40:22"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Reminded me of what happened with my brother last year. Still trying to help him cope. Anyone know resources for anger management? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence triggered a traumatic memory related to the person's brother, and the user expresses feeling helpless. While there's no direct threat, the vicarious trauma and expressed helplessness surrounding a past violent incident indicate a need for support and potential risk of escalation if left unaddressed.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 01:39:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Talking to someone feels impossible, but I'm trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of persistent sadness and difficulty seeking help, suggesting potential for escalation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 01:38:19"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Shook me up. Didn't know what to do, wish I'd said something. Anyone else witness stuff like that? Makes you feel so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a single incident of violence, while upsetting, doesn't indicate ongoing danger or high risk to the reporter or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 01:37:18"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a fight downtown yesterday. Just spiraled after. Makes me sick to my stomach. Anyone else feel this way after witnessing something like that? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses distress after witnessing a fight but does not indicate direct involvement, intent to harm self or others, or ongoing danger. The user is asking for coping mechanisms, suggesting a desire to process the experience in a healthy way.",
    "detected_category": "other",
    "timestamp": "2025-12-06 01:36:16"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, isolating me from friends... Feeling lost. Anyone else been through this? How did you find help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, suggesting a potential risk of mental health decline and vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 00:43:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want to feel *something* else. Scared myself last night. Reaching out for help today. It's time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a desire to feel something else due to overwhelming feelings and the individual acknowledging they scared themselves, suggesting a potential for impulsive behavior. The explicit reaching out for help is a positive sign, but the preceding statements necessitate a 'medium' severity rating.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 00:42:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed, indicating a potential risk for mental health decline. The individual is reaching out for help, suggesting they are aware of their struggle but may not have the resources to cope independently. While there's no explicit mention of self-harm or suicide, the intensity of the feelings warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 00:41:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found out a friend OD'd last night. Thankfully they're okay now, but it was close. Scared me to death. Please, be careful out there and look out for each other. Naloxone saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A friend experienced a non-fatal overdose, indicating a potential risk to others in the friend group and highlighting the dangers of substance use. The user expresses fear, suggesting emotional distress.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 00:40:16"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. The urge to self-harm is strong. Trying to distract myself, but it's hard. Anyone else feel this way sometimes? Just looking for a little support.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating a potential for action. While the individual is seeking distraction and support, the urge itself elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 00:39:15"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. This guy was really hurt. Makes you wonder what's going on with people. Feeling pretty shaken. Anyone else see it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent fight with someone being seriously hurt can be traumatic and lead to anxiety or fear. While not directly threatened, the observer reports feeling 'shaken,' indicating a potential psychological impact. The event involved a serious injury.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 00:38:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's getting harder to pretend everything's okay. The constant put-downs & control... I feel so trapped. Has anyone else experienced this? Is there a way out?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Feeling trapped and experiencing constant put-downs and control are indicators of potential emotional distress and possible abuse, raising concern for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 00:37:11"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough week. Feeling so isolated and overwhelmed. Just reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of isolation and being overwhelmed, indicating distress but no explicit mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2025-12-06 00:36:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Narcan saved them. Carrying it now myself. Hope everyone knows how to use it. Please learn. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose and subsequent concern suggest a potentially widespread issue and personal anxiety.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 00:35:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out before I sink further. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The statement expresses feelings of being overwhelmed and a desire to reach out, suggesting potential distress and a risk of further deterioration if support is not received. The metaphor 'sinking further' implies a worsening condition.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 00:34:07"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight. Hope it helps. If you're struggling too, please don't give up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, with metaphorical language suggesting distress. While explicitly reaching out for help is positive, the underlying sentiment indicates potential for escalation if support is not adequate.",
    "detected_category": "suicide",
    "timestamp": "2025-12-05 23:17:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get punched outside the bar. Shook me up bad. Reminded me of my dad. Anyone else deal with flashbacks after seeing violence? Feeling really anxious.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence, causing anxiety and flashbacks, but does not indicate immediate danger to self or others. While the experience is distressing, there's no explicit mention of intent to harm or being in immediate danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-05 23:16:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out before it gets worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, with an implicit request for help before things escalate. The phrase 'before it gets worse' suggests a potential for deterioration in mental state.",
    "detected_category": "suicide",
    "timestamp": "2025-12-05 23:15:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them. Carry it, learn how to use it. You could save a life. Resources are out there. Don't be afraid to look.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and highlights the potential for life-threatening situations. While the person was saved, the incident indicates an ongoing risk of overdose in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-05 23:14:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park today. Scared me so bad. Narcan saved him, thankfully. This stuff is real, people. Please look out for each other. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential risk to others in the community, although the immediate danger was averted by Narcan.",
    "detected_category": "overdose",
    "timestamp": "2025-12-05 23:13:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Walking on eggshells constantly. Is this normal? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a stressful and potentially harmful home environment ('walking on eggshells'). While not explicitly stating violence or abuse, the feeling of being 'lost' suggests emotional distress and potential for escalation. Further investigation is warranted.",
    "detected_category": "abuse",
    "timestamp": "2025-12-05 23:12:39"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Just wanted to say if you're struggling, you're not alone. It's okay to ask for help, even if it feels impossible. Things can get better. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of overwhelm but offers a message of hope and encouragement to seek help. There's no direct mention of harmful intent or specific plans.",
    "detected_category": "other",
    "timestamp": "2025-12-05 23:11:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scared me straight. Never thought I'd see it. Anyone know where to get Narcan around here? Seriously shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be a traumatic experience, indicating a potential mental health crisis or need for support. While the individual is not the one who overdosed, the text expresses distress and a desire to be prepared for future occurrences.",
    "detected_category": "overdose",
    "timestamp": "2025-12-05 23:10:36"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train. Scary how quickly things escalate. Makes you wonder what sets people off. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a physical altercation (shoving) in a public space, which constitutes a potential safety risk. While the extent of injury is unknown, the potential for escalation and harm exists. The mention of heightened anxiety (\"feel on edge\") adds to the concerning nature of the situation.",
    "detected_category": "violence",
    "timestamp": "2025-12-05 23:09:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is back. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of self-harm urges and feeling overwhelmed, which presents a significant risk. The individual has reached out for help, which is a positive sign, but the presence of the urge elevates the severity beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-05 23:08:33"
  }
]