[
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong, even though I know it's not the answer. Anyone else struggle with this? Just trying to not feel so alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating active suicidal ideation. While the individual acknowledges it's not the answer, the presence of the urge itself elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 11:19:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend, hoping it helps. It's hard to keep swimming.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and 'underwater,' with a struggle to 'keep swimming' which can be interpreted as a metaphor for coping with difficult emotions. Indicates seeking help from a friend, suggesting awareness of the need for support, but also acknowledging the difficulty of the situation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 11:18:38"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out on the bus today. It was so fast and scary. Shaking still. Is there anywhere to report stuff like that, even if no one seemed seriously hurt?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a safety concern. However, the text indicates that no one seemed seriously hurt, which lowers the severity. The author is shaken but seeking reporting options, not expressing immediate danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 11:17:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, rough day. Feeling the urge to self-harm creeping up. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses an urge to self-harm and acknowledges the difficulty in fighting it. While the individual has reached out for help, the presence of the urge indicates a moderate level of risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 11:16:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"I'm so tired of walking on eggshells. Every little thing sets him off. Is this...normal? Feeling so trapped lately.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a potentially volatile and trapping situation. While not explicitly mentioning violence or harm, the phrases \"walking on eggshells\" and \"sets him off\" indicate potential emotional or verbal abuse and control, increasing the risk of escalation. The feeling of being trapped also raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 11:15:33"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out at the bar last night. Punches thrown, bottles smashed. It was terrifying. Shook me up more than I thought it would. Is it normal to feel this anxious after witnessing something like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence is upsetting and can cause anxiety, but the text doesn't indicate imminent danger or direct threat to the individual or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 11:14:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough. Walking on eggshells constantly. Anyone else feel like they're losing themselves? Need to find some strength.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and stressful home environment ('walking on eggshells'), suggesting potential emotional distress and loss of self. While not explicitly stating harm, the situation described raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 11:13:29"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but lacks specific plans or intent to harm self or others. Seeking advice suggests a desire for help.",
    "detected_category": "other",
    "timestamp": "2026-01-19 11:12:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about another OD. Scared me. Lost my cousin last year. If you're struggling, please reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and acknowledges a loss due to overdose, and encourages seeking help. While not explicitly suicidal, it indicates potential vulnerability and exposure to a high-risk situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 11:11:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately, like I'm drowning. Reaching out because I don't know what else to do. Any advice or just someone to listen would be appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, using the metaphor of drowning. While it's a cry for help and indicates distress, it doesn't explicitly mention self-harm or suicidal ideation, but the intensity warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 11:10:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, which could indicate a risk of self-harm or suicidal ideation. The individual is reaching out for help, suggesting they are struggling but haven't yet acted on any specific plans.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 10:21:51"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, thank god. Makes you realize how easily it can happen. Learn CPR and carry Narcan, people. You could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a recent overdose event, indicating a potential ongoing risk in the described environment. While Narcan was available and effective, the accessibility of drugs leading to overdose remains a concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 10:20:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells for so long, I forgot what my own voice sounds like. Is this...normal? Starting to think I need help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a significant loss of self and potential distress, suggesting a need for help. While not explicitly mentioning harm, the feeling of being silenced and the questioning of normalcy raise concerns about mental well-being and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 10:19:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it's like the only way to quiet them is to feel something else, even if it hurts. Trying to find better coping mechanisms. Anyone else relate? How do you deal?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential for self-harm as a coping mechanism, suggesting distress and a need for alternative strategies. While not explicitly suicidal, the mention of seeking physical pain to quiet internal noise raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 10:18:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got really bad last night and I relapsed. Feeling so ashamed. I need to find a better way to cope. Where do I even start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse and feelings of shame indicate distress and a potential risk of future negative behaviors. The text mentions a need to cope, which is a positive aspect but the overall sentiment suggests vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 10:17:44"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Frozen. Should I have said something? Feel sick about it now. Anyone else experience this? What do you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an act of violence (shoving), which could potentially lead to physical injury and indicates a possible abusive relationship. While the immediate risk to the poster isn't apparent, the observed violence is concerning.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 10:16:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, thank god. We gotta talk more about this, people are dying. Where can I learn how to use it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was used successfully, someone overdosing indicates a potential ongoing public health risk and the mention of people dying highlights the seriousness of the situation. The person asking where to learn how to use Narcan indicates concern and a potential desire to intervene in future overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 10:15:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant put-downs... I feel so small. Anyone else experience this? Just looking for someone who understands.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes ongoing emotional abuse (put-downs) which can significantly impact mental health and potentially escalate over time. The user is seeking validation and understanding, suggesting they are struggling to cope. While there's no explicit mention of self-harm or suicide, the sustained emotional distress raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 10:14:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, and a plea for help suggesting potential emotional distress. While not explicitly suicidal, the metaphor of being 'underwater' implies suffocation and desperation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 10:13:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Okay, here's a short, realistic post:\n\n\"Felt so overwhelmed today. Urges were really strong. Managed to distract myself for now, but it's exhausting. Anyone else relate? Just feeling really alone with this.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post expresses strong urges and feelings of being overwhelmed and alone. While the individual managed to distract themselves, the intensity of the urges and the expressed isolation suggest a potential risk of escalation. The nature of the 'urges' is unspecified, increasing uncertainty.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 10:12:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Didn't know what to do. Wish I'd said something. Anyone else ever freeze like that? Feels awful.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence suggests potential for escalation or further harm. While not directly involved, the description implies a potential for a more dangerous situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 09:26:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud I can't shake. Reaching out because I know I need to. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of persistent sadness and acknowledges a need for help, suggesting potential for escalation if unaddressed.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 09:25:00"
  },
  {
    "title": "User Story: Violence",
    "content": "Heard shouting next door again last night. Makes me jump every time. Called the non-emergency line before, but nothing changed. Feeling helpless. Anyone else deal with this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text doesn't explicitly state immediate danger, the repeated shouting, feeling helpless, and being easily startled suggests a potential for escalation. The ongoing nature of the situation, coupled with the impact on the individual's well-being, warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 09:23:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Just broke a 6-month clean streak. Feeling so ashamed and lost. Reaching out before things get worse again. Any advice on coping strategies that actually work?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after 6 months suggests vulnerability. Shame and feeling lost indicate potential for escalation. Reaching out is positive, but the risk of self-harm or other negative coping mechanisms exists.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 09:22:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm starting to think the yelling isn't normal. It's constant, and now he's isolating me from my friends. Has anyone else experienced this? I feel so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional and social abuse (isolation) which, while not directly life-threatening, can escalate to more dangerous situations or significantly impact mental health.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 09:21:55"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing unease. While unsettling, it doesn't indicate immediate danger to the individual or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 09:20:53"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. My heart is still racing. Said something, but feel like I should have done more? Anyone else ever freeze up like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence (shoving) indicates a risk of escalation or further harm to the victim. While not directly involved, the poster's distress suggests potential for vicarious trauma or a desire to intervene in future situations.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 09:19:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been walking on eggshells lately. Every little thing sets him off. Is this normal in relationships? Starting to feel really trapped.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a potential for escalation. \"Walking on eggshells\" and \"every little thing sets him off\" indicates possible emotional abuse and control. Feeling \"trapped\" is also a concerning sign.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 09:18:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Cutting again after 6 months clean. Messed up. Need to find my way back to coping strategies that actually work. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Relapse into self-harm after a period of abstinence indicates a significant escalation in distress and coping difficulties, raising immediate concerns for safety.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 09:17:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It helps. If you're struggling too, you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which suggests an escalation of distress. While the person has reached out for help, the presence of urges necessitates a medium severity rating. The specific nature of the urges is not defined, but their reappearance warrants attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 09:16:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Didn't want to, but I relapsed. Day 1 again. Reaching out for support this time. It's so hard.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse can indicate a worsening of underlying issues and increased vulnerability. Reaching out is a positive sign, but the statement conveys distress and a struggle with a difficult situation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 08:23:33"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the bus stop. Makes me sick. Reminded me of things at home. Anyone else deal with this? Feeling so unsafe lately.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a feeling of unsafety and distress triggered by witnessing violence, potentially indicating vulnerability and a heightened emotional state.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 08:22:31"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I hate this. Reached out to a friend, hoping it helps. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feeling overwhelmed, suggesting a potential risk of self-harm or relapse into harmful behaviors. Reaching out to a friend is a positive step, but the severity remains moderate due to the presence of urges and the expressed need to 'get through tonight'.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 08:21:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home have been rough. Constant put-downs are wearing me down. Anyone else ever feel this way? I'm not sure what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a feeling of being worn down by constant put-downs, suggesting a potential for escalation. The individual is also seeking help and validation, implying they are struggling to cope. While there is no explicit mention of self-harm, suicide, or violence, the ongoing abuse and resulting distress elevates the risk level beyond low.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 08:20:28"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting on the street, yelling. He shoved her. My hands are still shaking. Called 911, hope she's okay. Makes you realize how close it can be.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence (shoving) occurred, indicating a risk of injury. While the immediate threat may have subsided with the 911 call, the situation involved assault and potential harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 08:19:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but lacks explicit statements of harm or intent. It's a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2026-01-19 08:18:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Cutting again after 6 months clean. Feels like such a failure. Reached out to my therapist, hoping to get an emergency appointment. Just need to get through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Relapse of self-harm after a period of abstinence indicates a significant escalation of distress and potential for further self-harm. The individual is actively seeking help, which is a positive sign, but the intensity of the feelings and the relapse elevate the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 08:17:23"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Constant yelling, put-downs... I feel so small. Anyone else go through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a negative home environment with emotional abuse. While there is no explicit mention of self-harm or suicide, the feelings of worthlessness ('feel so small') and the general distress ('things have been bad') warrant a medium severity rating as it could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 08:16:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so numb lately, like I'm watching my life from behind glass. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of numbness and detachment, but doesn't explicitly mention self-harm, suicide, or violence. It is a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2026-01-19 08:15:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Called 911, they’re gonna be okay. Reminded me we gotta look out for each other. Naloxone saves lives. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, indicating a serious health risk, but the person received help and is expected to recover.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 08:14:18"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Guy got shoved into traffic. So scary. Makes you think, y'know? Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a violent act that resulted in someone being pushed into traffic, indicating potential for serious injury or even fatality. While the individual's condition is unknown, the situation poses a significant risk of harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 07:25:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. My heart's still pounding. Wish I'd said something, anything. Feeling so helpless. Anyone else ever witness something like that? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing domestic violence is distressing and could indicate a pattern of escalating abuse. While the text doesn't indicate immediate physical danger to the reporting person, it describes an act of violence that requires attention. The mention of the heart pounding indicates the witness is also experiencing distress, potentially leading to safety concerns if exposed regularly.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 07:24:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scared me half to death. They're okay now, thankfully. Makes you realize how fragile life is. Anyone know where to get Narcan around here? Just want to be prepared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the person survived, indicates a risk of future overdose events in the area. The person is also seeking Narcan, indicating concern about the potential for further overdose incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 07:23:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another overdose. It's terrifying. Lost a friend last year. Please, if you're struggling, reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text expresses concern and offers support, the mention of overdose and losing a friend suggests a potential ongoing crisis and heightened risk for individuals struggling with substance use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 07:22:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Terrifying. Narcan saved them, but it was close. Please, if you're using, carry it. And know how to use it. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, the text describes a near-fatal overdose event. The prompt highlights the danger of drug use and the potential for severe harm or death. The close call implies a significant risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 07:21:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Everything feels heavy. Reaching out because I know I need help, but it's hard to ask. Any advice on finding a therapist?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of being lost, overwhelmed, and a need for help, which could suggest a potential for worsening mental health and possible self-harm risk in the future if unaddressed. The user is actively seeking help which lowers the immediate risk but does not negate the severity of the underlying feelings.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 07:20:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Just reaching out. Has anyone else felt this way? Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed ('drowning'), which suggests significant emotional distress. While there is no explicit mention of self-harm or suicide, the language indicates a potential risk that requires further assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 07:19:36"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside my building. One got knocked out cold. Shaking. Called 911. Hope he's okay. Anyone else ever witness something like that? Still processing.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A person was knocked unconscious, indicating serious physical harm and potential life-threatening injuries. The mention of 'shaking' suggests the witness is significantly distressed.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 07:18:35"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his girlfriend on the street today. Frozen. Wish I'd said something. Anyone else ever feel that helpless?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an act of violence (shoving) that, while not explicitly severe, could indicate a pattern of abuse or escalation. The observer expresses regret at not intervening, suggesting a perceived potential for further harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 07:17:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "I keep making excuses for him, but the yelling is getting worse. And now the throwing things started. Is this still just a \"rough patch\"? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Escalating verbal and physical aggression indicates potential for physical harm and emotional distress. The user expresses feeling lost, suggesting a lack of resources or support.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 07:16:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Trying to stay strong, but it's hard. Anyone else feel this way? Any tips for coping?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses a strong urge to self-harm, indicating a potential risk. While they are trying to cope, the strength of the urge elevates the risk level beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 06:26:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant yelling, put-downs... I feel so small. Anyone else go through this? How did you cope? I just need to feel less alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and feelings of worthlessness, indicating a potential risk for mental health deterioration. While not explicitly stating intent to harm themselves, the feelings of isolation and being small could escalate. The mention of yelling and put-downs falls under abuse.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 06:25:27"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Froze. Wish I'd said something. Feeling sick about it. Anyone else ever experience that? What do you DO?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, potential for escalation and indirect risk to the original poster due to psychological impact and the question of intervention.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 06:24:25"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text reports witnessing a fight, which is concerning but doesn't indicate direct involvement or intent to harm. It primarily expresses feeling shaken and on edge.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 06:23:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park today. Scary stuff. Called 911, he's gonna be okay. But damn, it hits you hard. Learn CPR, carry Narcan if you can. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a potentially traumatic event and highlights the presence of drug use and associated dangers in the community. While the individual survived, the risk of future overdoses remains, indicating an ongoing safety concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 06:22:23"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of what my brother went through. Anyone know resources for PTSD support? He's been struggling.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a fight witnessed and the potential for PTSD in the original poster's brother. While it doesn't directly indicate immediate danger to life or safety, vicarious traumatization and the potential for PTSD in a loved one represent a moderate level of concern that warrants attention and resource provision.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 06:21:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things got really dark last night. I feel so ashamed, but I need to reach out. Anyone know good resources for self-harm? Feeling lost.\"\n\n**Option 2 (Sharing Experience):**\n\n> \"It's been 3 weeks clean. Small victory, but feeling proud. The urge is still there, though. Sending strength to anyone else struggling.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"People need to understand self-harm isn't about attention. It's about pain. Let's be kinder and listen without judgment.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Option 1 expresses a current and active desire for information related to self-harm, indicating immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 06:20:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Lost a friend last night. OD. Feels unreal. Please, if you're struggling, reach out. There are people who care and want to help you get through this. Don't be afraid.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose death, indicating a high risk of potential copycat behavior, grief-related self-harm, or shared risk factors within the deceased's social circle.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 06:19:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Terrifying. Narcan saved them, but it shook me. Where can I learn how to use it? Seriously, everyone should know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a risk of further overdoses in the area and highlights a need for preventative action. While the individual survived, the event underscores potential harm.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 06:18:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Like there's no way out. Reaching out because I don't know what else to do. Please, any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and being overwhelmed, with a direct plea for help indicating a potential crisis.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 06:17:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary stuff. Naloxone saved them, thank goodness. Carry it, learn how to use it, it could save a life. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While naloxone was effective, the text describes a recent overdose, indicating an ongoing risk of future overdoses in the area. The call to action suggests a proactive concern for potential future incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 05:26:30"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Wish I'd said something, but I froze. Anyone else ever feel that helplessness? Makes me sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault suggests a risk of further violence. While the original poster is not the direct victim, the event caused significant distress and helplessness, indicating a potentially unsafe environment for others and the direct victim.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 05:25:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD in the bathroom at work. Scared me so bad. Narcan worked, thank God. Seriously, learn how to use it, people. Could save a life. Feeling shaky and need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be a traumatic experience leading to psychological distress for the witness, as indicated by feeling 'shaky' and needing to talk. While the immediate danger is averted by Narcan, the event's impact on the individual warrants attention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 05:24:27"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Makes you realize how quickly things can escalate. Shaken up. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't directly indicate immediate personal risk. While it mentions feeling \"on edge,\" it lacks specific threats or harmful intentions.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 05:23:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a glass wall. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of numbness and detachment, and a plea for help, suggesting emotional distress and potential for escalation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 05:22:24"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Should I have said something? Feel sick about it now. Anyone else ever witness something like that? What do you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a witnessed act of violence (shoving), suggesting potential for escalation or further harm. The witness expresses distress, which could indicate a need for support or intervention skills training.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 05:21:23"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on the bus. My hands are still shaking. Is there anywhere to report something like that anonymously? Feeling so unsettled.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight on a bus can be a disturbing event, causing anxiety and fear as indicated by shaking hands and feeling unsettled. While the reporter wasn't directly involved, there's a potential for vicarious trauma and the possibility of future incidents. The need for anonymous reporting suggests a fear of potential repercussions or involvement.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 05:20:21"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Said something nasty too. Shook me up. Is there anything you're supposed to DO in that situation? I froze. Feeling guilty.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing public violence (shoving and verbal abuse) indicates a potential risk of escalation or further harm to the woman. While the original reporter is not in immediate danger, the witnessed event raises concerns.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 05:19:20"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Said something about her phone. Shook me up. Wish I'd said something. Anyone else ever freeze up like that? Feeling awful.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a physical assault (shoving). While the extent of injury is unknown, physical violence on the street indicates a potential for harm. The 'shook me up' and 'feeling awful' suggest the witness recognizes the severity.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 05:18:18"
  },
  {
    "title": "User Story: Violence",
    "content": "My neighbor's dog bit my kid today. Just a nip, but still scary. Animal control said it's the 3rd time. What can I even do? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A dog bite, even a 'nip', can cause injury and potential infection. The history of multiple incidents (3rd time) increases the risk of future, potentially more severe, bites. The child was bitten.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 05:17:16"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home have been rough lately. Constant put-downs, feeling trapped. Anyone else been through this? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling \"trapped\" and experiencing \"constant put-downs,\" suggesting potential emotional abuse and distress. While not explicitly mentioning harm, these feelings could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 04:38:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, and that helped a little. Remember we're not alone in this. 💜 If you're struggling too, please reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk. While the person reached out to a friend, the urge persists, suggesting the need for immediate support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 04:37:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just needed to say it out loud. It helps, even a little. Taking it one hour at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting increased vulnerability and potential risk. While the individual has reached out for help, the presence of urges elevates the severity beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 04:36:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Walking on eggshells constantly. Feels like I'm always doing something wrong. Anyone else experience this? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 88 (char 113)",
    "detected_category": "unknown",
    "timestamp": "2026-01-19 04:35:54"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out at the corner store today. Shook me up. Is there anywhere I can learn self-defense around here? Feeling really vulnerable now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight caused distress and a desire for self-defense, but no direct threats or harm are indicated.",
    "detected_category": "other",
    "timestamp": "2026-01-19 04:34:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, but please, if you're struggling, reach out. There's help available. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even if the person is now okay, indicates a potentially dangerous situation and the presence of substance use issues in the environment.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 04:33:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a friend OD. Scariest thing ever. Narcan saved them. Please, if you're using, carry it. Learn how to use it. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event requiring Narcan, indicating a high risk of severe harm or death associated with drug use. The personal connection and urgency of the message amplify the severity.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 04:32:50"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get jumped on my street last night. Shook me up bad. Makes you realize how fragile things are. Anyone else feel like their neighborhood's getting worse?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault suggests a potential increase in crime and risk of violence in the area, causing fear and anxiety for the individual.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 04:31:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately, like I'm drowning. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, coupled with a sense of desperation (\"drowning,\" \"don't know what else to do\"). While not explicitly suicidal, the language suggests significant distress and a potential risk for escalation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 04:30:47"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out on my street last night. It was terrifying. Shaking still. Is anyone else feeling like things are getting more volatile lately? I'm worried.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing fear and worry, but doesn't indicate direct involvement or imminent danger to the user or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 04:29:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a heavy cloud's just settled in. Reaching out to a friend tonight. Hope things get brighter.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and low mood, but there's no explicit mention of self-harm, suicide, or harm to others. The individual is reaching out for support, which is a positive coping mechanism.",
    "detected_category": "other",
    "timestamp": "2026-01-19 03:50:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just realized my relationship might not be healthy. Constant put-downs, isolating me from friends... Anyone else been through this? Feeling lost and alone. Where do I even start to fix this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional abuse (put-downs, isolation), which can escalate to more severe mental health issues. The user expresses feeling lost and alone, indicating distress and potential vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 03:49:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "My brother almost didn't wake up yesterday. Scariest day of my life. Please, if you're struggling, reach out. There's help available. Don't let it get to that point.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential suicide attempt ('almost didn't wake up') implying a serious situation, although it's framed in the past. The message advocates for seeking help, suggesting the brother was struggling with something significant.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 03:48:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank goodness. Makes you realize how fragile life is, and how easily things can go wrong. If you or someone you know is struggling, please reach out for help. There are resources available.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Direct report of an overdose incident, although the individual survived. Highlights the real and present danger of drug use and the potential for fatal outcomes.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 03:47:00"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so overwhelmed lately. Just existing feels heavy. Talking to my therapist tomorrow, but needed to say it somewhere. Hope things get better.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of overwhelm and heaviness, but there's no explicit mention of self-harm, suicide, or harm to others. The individual is seeking help from a therapist, which is a positive coping mechanism.",
    "detected_category": "other",
    "timestamp": "2026-01-19 03:45:58"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just feeling so lost lately. Things at home are... complicated. Walking on eggshells all the time. Anyone else ever feel like they're just existing, not living? Could really use some support.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a difficult home situation, suggesting potential for escalation if left unaddressed. The phrase \"walking on eggshells\" hints at a potentially abusive environment. While no direct threats are made, the overall tone warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 03:44:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling really overwhelmed lately. Urges are back. Anyone know good coping mechanisms that actually work? I just want to feel normal again.\n\n**Option 2 (Sharing a past experience):**\n\n> It's been a year since my last incident. It's still a struggle some days, but I'm proud of how far I've come. Recovery is possible.\n\n**Option 3 (Raising Awareness):**\n\n> Scars aren't always visible. Be kind, you never know what someone is going through. Check in on your friends, even the strong ones.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates active urges, suggesting a potential risk of self-harm. While not explicitly stated, the feeling of being overwhelmed and the return of urges warrant concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 03:43:55"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting on the street, yelling & shoving. Didn't know what to do. Should I have intervened? Feeling sick about it now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Observed violence (yelling and shoving) between two individuals, indicating a potential risk of escalation or injury. While the observer is safe, the situation itself presents a risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 03:42:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He yelled again last night, then acted like nothing happened this morning. Is this normal? I feel like I'm going crazy.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates possible verbal abuse, which can escalate. The user's statement of feeling 'crazy' suggests emotional distress and vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 03:41:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nUgh, things got really bad last night. Clean for a while, but relapsed. Feels like square one. Reaching out to my therapist today. This sucks.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety can be dangerous, increasing risk of overdose or other harmful behaviors. Seeking therapy is a positive step, but the immediate aftermath of relapse presents elevated risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 03:40:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Terrifying. Narcan saved their life. Keep it on you, people. You never know when it could be needed. Learn how to use it. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a friend overdosing, indicating a life-threatening situation. While Narcan was administered successfully, the event highlights a significant risk of overdose and potential fatality.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 03:02:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary. Shaking. Anyone else feel like things are getting more volatile lately? I'm starting to feel unsafe walking alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight and expressing fear for personal safety while walking alone suggests a moderate level of perceived risk. While not directly involved, the individual's sense of vulnerability is elevated.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 03:01:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "I feel so lost. Things at home are getting worse, not better. Constant put-downs, now yelling. Is this normal? Starting to think it's not just \"stress.\" Where do I even begin to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, escalating verbal abuse (put-downs, yelling), and a questioning of the situation's normalcy, suggesting potential emotional distress and a need for help. While there is no explicit mention of harm, the escalation and the questioning of 'normal' raises concerns.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 03:00:55"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his girlfriend on Elm St. yesterday. I froze. Still feel sick about it. Wish I'd done something. Anyone else ever feel this helpless?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence, indicating a potential risk of escalating violence or future incidents.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 02:59:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to stay strong and remember why I stopped. Reaching out instead. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges are back' and feeling overwhelmed, suggesting a struggle with a negative behavior. While the user is actively reaching out and trying to stay strong, the presence of urges elevates the risk above low. The specific nature of the urges is unknown, but they are clearly causing distress.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 02:58:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm drowning and no one can see it. Reaching out before things get worse. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost and drowning, suggesting significant emotional distress and a plea for help to prevent escalation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 02:57:50"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got clocked hard. Makes you wonder what sets people off. Feeling uneasy. Anyone else see it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be psychologically distressing and suggests a potential for further escalation in the area.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 02:56:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but I'm still shaken. If you or someone you know is struggling, please reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event, indicating a potential risk of vicarious trauma or increased anxiety for the individual who shared the message. While the person survived due to Narcan, the event highlights the presence of overdose risk in their environment and could signal a need for support for both the person who overdosed and the person who witnessed it.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 02:55:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing in the street, got really heated. Reminded me of my parents. Anyone else feel triggered by stuff like that? Makes me want to disappear.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses emotional distress and a desire to avoid the situation, but does not contain any explicit plans or intent for self-harm or harm to others.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 02:54:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's a struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly states a strong urge to self-harm, indicating immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 02:53:44"
  }
]