[
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, coupled with a plea for help, suggesting potential emotional distress and a need for support. The 'underwater' metaphor can indicate feelings of suffocation and hopelessness.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 17:16:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Paramedics got there fast, thank god. Makes you realize how fragile life is. Anyone know where to find Narcan training nearby? I need to be prepared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event and indicates the presence of substance use and potential harm in the area. The person is seeking Narcan training, indicating a perceived risk of future overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 17:15:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I feel so lost. Things at home have been bad lately, escalating. I don't know who to talk to or what to do anymore. Just feeling trapped. Anyone been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, trapped, and escalating problems at home. While there's no explicit mention of self-harm or suicide, the combination of these factors suggests a potential for harm or crisis and warrants concern.",
    "detected_category": "other",
    "timestamp": "2026-01-17 17:14:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got overwhelming and I relapsed. Feeling so ashamed but trying to reach out instead of hiding. Anyone else been there? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse indicates a return to harmful behaviors. While the individual is reaching out, the shame and overwhelming feelings coupled with the relapse history suggest a potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 17:13:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Narcan saved their life. Makes you think, you know? Everyone should know how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with successful intervention, can be distressing and indicative of a potential risk of further overdoses in the area.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 17:12:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. The urge to cut was strong, but I distracted myself with music. Small victory. Still feeling shaky, though. Anyone else get through this? How?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a strong urge to self-harm (cutting) which indicates a significant level of distress. While the individual managed to distract themselves, the continued feelings of shakiness suggest the urge is still present and represents an ongoing risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 17:11:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"I feel so lost. Things at home have been... intense lately. Constant yelling, then apologies, then it starts again. Is this normal? I don't even know who to talk to.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially unstable and distressing home environment characterized by constant conflict. While it doesn't explicitly mention harm, the intense emotional distress and feeling of being lost warrant concern and further investigation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 17:10:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm finally out. It's terrifying and I feel so lost. Years of walking on eggshells... I deserve better, right? Anyone else been through this? Just need to hear I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of terror, loss, and a history of walking on eggshells, suggesting a potentially dangerous or unstable situation. While there's no explicit mention of harm, the underlying distress warrants a medium severity rating. The individual is also seeking validation and connection, indicating a need for support.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 17:09:32"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Guy got seriously hurt. Makes you think, y'know? Is there anywhere safe anymore? Feeling shaken.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports serious injury from a fight, indicating potential for significant physical harm, and expresses concern about safety.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 17:08:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before things get worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 82 (char 107)",
    "detected_category": "unknown",
    "timestamp": "2026-01-17 17:07:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's so hard to admit, but things at home haven't been good. Walking on eggshells all the time. Is this normal? I feel so lost and scared. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling scared and walking on eggshells, suggesting a potentially unsafe environment at home. While not explicitly stating violence or abuse, the language hints at a potentially harmful situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 16:18:16"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after a few months clean. Feeling incredibly disappointed in myself. Reaching out to my therapist today. It's a setback, not a failure, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential for continued unhealthy behaviors and increased vulnerability. The individual is expressing negative emotions (disappointment) which can exacerbate the situation.",
    "detected_category": "other",
    "timestamp": "2026-01-17 16:17:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is getting stronger. Reached out to a friend, but still struggling. Anyone else get this? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm and acknowledges ongoing struggle despite reaching out for help, indicating a significant risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 16:16:13"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. Just trying to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm and indicates the individual is struggling to cope, suggesting an immediate risk to their safety.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 16:15:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm just going through the motions. Reaching out because I don't know what else to do. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and going through the motions, but lacks explicit mentions or indicators of self-harm, suicidal ideation, violence, abuse, or overdose. The person is reaching out for help, suggesting a willingness to seek support.",
    "detected_category": "other",
    "timestamp": "2026-01-17 16:14:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been rough. Constant put-downs, controlling behavior... Feels like I'm walking on eggshells. Anyone else been through this? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, creating a stressful and isolating environment. While there's no explicit mention of physical harm, the 'walking on eggshells' phrasing suggests a potentially escalating situation that could lead to mental and emotional distress. The feeling of isolation also raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 16:13:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scary stuff. Please, if you're using, have Narcan on hand. It can save a life, and it's not worth the risk. Thinking of them and hoping they pull through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Indicates a recent overdose event, directly witnessed by the author. While the author expresses concern and encourages preventative measures, the event itself suggests an immediate risk to someone's life. The outcome for the individual who overdosed is uncertain ('hoping they pull through').",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 16:12:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It's a struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges are back' which indicates a potential relapse into harmful behaviors. Seeking support from a friend is a positive step, but the presence of urges elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 16:11:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Rough night. Felt like I was losing it. Didn't SH, though. Small victory. Gonna try calling the hotline tomorrow. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with mental health and feelings of losing control, alongside the mention of resisting self-harm. The intention to call a hotline suggests seeking help.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 16:10:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm starting to realize the constant put-downs aren't normal. It's chipping away at me. Anyone else been through this? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential for mental health decline due to ongoing negative experiences. While not explicitly suicidal or self-harming, the feeling of being 'chipped away' and 'lost' suggests vulnerability and a need for support, increasing the risk of escalation if the situation persists.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 16:09:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. Scares me. Lost a friend last year. If you're struggling, please reach out. There are people who care and want to help you get through this. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Implies risk of overdose in the community and expresses concern for others struggling, referencing a past loss from overdose, but directly encourages seeking help.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 15:17:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. The yelling is constant, and now there's pushing. I feel so trapped. Is this what abuse looks like? Need to talk to someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Escalating violence with pushing indicates a high risk of serious physical or psychological harm. The individual expresses feeling trapped and suspects abuse, demonstrating significant distress and potential danger.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 15:16:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Please, learn how to use it. Could save a life. #staysafe",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event indicating potential harm and a need for immediate intervention. While Narcan was effective, the situation highlights the risk of overdose incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 15:15:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nSaw someone OD downtown yesterday. Scary. Narcan saved them, thank god. Makes you realize how close we all are to the edge sometimes. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the person survived, indicates a serious health and safety issue within the community and can be emotionally distressing. The mention of being 'close to the edge' suggests potential emotional vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 15:14:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Called 911, they're okay now, but shaken. Please, if you're struggling, reach out. There's help available. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person who overdosed is currently okay, the incident indicates a serious health crisis and potential ongoing risk for others struggling with similar issues. The mention of overdose also suggests the potential for future occurrences.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 15:13:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**(Option 1: Seeking Help)**\n\n> Rough day. Urges are strong. Trying to distract myself but it's hard. Anyone else feel this way? Could use some support.\n\n**(Option 2: Sharing a Small Victory)**\n\n> Almost slipped tonight, but I managed to call a friend instead. Small win, but it feels huge right now.\n\n**(Option 3: Reflecting on Recovery)**\n\n> Scars are a reminder of where I've been. Still a journey, but I'm further than I thought I'd be. Be kind to yourselves.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates active urges and a struggle to cope, suggesting a potential risk. Option 2 shows a near-slip, indicating vulnerability. Option 3 offers hope, but the context of the scars suggests a history of significant distress. Overall, there's potential for harm if support isn't readily available.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 15:12:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before it gets too dark. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed ('underwater'), and reaching out 'before it gets too dark,' suggesting a potential for escalation if support is not received. The metaphor of being underwater hints at suffocation and desperation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 15:11:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so heavy. It's hard to talk about, but I've been struggling with self-harm. It feels like the only way to cope sometimes. I know it's not healthy. Has anyone found helpful resources or just wants to listen?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses active engagement in self-harm as a coping mechanism and acknowledges its unhealthy nature. While not explicitly suicidal, the presence of self-harm significantly elevates the risk. There's also a request for resources or someone to listen, indicating a potential openness to help.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 15:10:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm drowning. Reaching out because I don't know what else to do. Is there anyone who understands?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed (drowning metaphor), and desperation in seeking help. This suggests emotional distress and potential vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 15:09:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Please, if you're struggling, reach out. There's help, and you're not alone. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a friend experiencing a serious, potentially life-threatening event ('almost didn't wake up'). While the exact cause is unclear, the speaker's distress ('Scariest moment of my life,' 'I'm still shaking') suggests a significant health or mental health crisis. The plea for help further indicates the friend is struggling.",
    "detected_category": "other",
    "timestamp": "2026-01-17 15:08:16"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Two guys really going at it. Makes you wonder what pushes people to that point. Scared me, honestly. Hope they're both okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes a fight witnessed by the author. While potentially dangerous, the author was not directly involved or threatened. The fight is over, and the author expresses concern rather than immediate danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 14:17:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough week. Feeling so incredibly alone. Just reaching out to see if anyone else has felt this way and found a way through it. Need some hope right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and a need for support, but it does not contain any explicit statements or indicators of immediate self-harm or suicidal intent. The individual is reaching out for help and hope, which suggests a desire to cope with their feelings rather than act on them.",
    "detected_category": "other",
    "timestamp": "2026-01-17 14:16:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**(Option 1: Seeking Help)**\n\n> Feeling so overwhelmed lately. The urge is strong tonight. Anyone know any good distractions that actually work? Just trying to get through this.\n\n**(Option 2: Sharing a Struggle)**\n\n> Relapsed after 3 months clean. Feeling like such a failure. Trying not to spiral. One day at a time, I guess.\n\n**(Option 3: Raising Awareness)**\n\n> It's not about attention. It's about pain. If someone you know is struggling, please just listen. You don't need to fix it, just be there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates active suicidal ideation with the phrase \"The urge is strong tonight.\" Option 2 describes a relapse which could lead to further self-harm. Option 3 has a lower severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 14:15:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... feels like I'm walking on eggshells. Anyone else been through this? Need to figure out what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of abuse (put-downs, controlling behavior) and feeling unsafe (\"walking on eggshells\"). While not explicitly stating physical harm, the described situation suggests potential for escalation and negatively impacts mental well-being.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 14:13:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a kid OD downtown last night. Scary stuff. Narcan saved him, but it shook me up. Please, if you're using, be careful and have someone with you. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was administered and the person survived, the overdose event itself indicates a significant risk of death. The text also suggests this is not an isolated incident by implying drug use is happening.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 14:12:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Should I have done something? Feeling sick about it now. What would you have done?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a possible instance of physical abuse (shoving). While the immediate risk to the original poster is low, the risk to the girlfriend is potentially high if the abuse escalates.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 14:11:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, and explicitly reaches out for help, suggesting potential distress that needs attention. The metaphor of being 'underwater' can indicate feelings of suffocation or being trapped.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 14:10:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Please, if you're struggling, reach out. There's help. Don't let it get this far.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal event, strongly suggesting a suicide attempt or significant self-harm, indicating immediate danger.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 14:09:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is back. Reached out to a friend, hoping it helps. Remember we're not alone in this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of self-harm urges, which suggests active risk, although the person has reached out for help, mitigating the risk somewhat.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 14:08:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. This is getting scary. My brother almost didn't make it last year. Please, if you're struggling, reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose death and a near-fatal overdose of the author's brother. While the author is encouraging help-seeking, the mention of overdose and personal connection to a near-death experience suggests a moderate level of risk related to overdose potential in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 14:07:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to hide the bruises. He says he's sorry after, but it keeps happening. Anyone else been through this? Feeling so lost and alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes physical abuse, indicated by the mention of bruises inflicted by another person. The user expresses feelings of being lost and alone, indicating significant emotional distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 13:24:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them. Please, if you're using, have it and know how to use it. It can happen to anyone. 😔",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a recent overdose event requiring Narcan intervention, indicating immediate and significant risk to individuals using drugs.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 13:23:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital. Witnessed an OD last night. Terrifying. Learned Narcan training is free at the community center. Seriously considering it. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be psychologically distressing and indicates the presence of a potential immediate threat to others in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 13:22:36"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside my building. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and can cause anxiety, but doesn't indicate immediate danger or a direct threat to anyone mentioned.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 13:21:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Woke up this morning feeling like I'm walking on eggshells again.  Said something wrong, I guess.  Silence now. Just feels heavy. Anyone else ever feel this... trapped?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of anxiety and being trapped in a potentially tense social situation. While concerning, there is no explicit mention of self-harm, suicide, violence, abuse, or overdose. The feeling of being trapped could relate to a stressful interpersonal relationship, but it doesn't suggest immediate danger.",
    "detected_category": "other",
    "timestamp": "2026-01-17 13:20:33"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the subway platform. So fast, so senseless. My heart is still pounding. Makes you wonder what's going on with people lately. Be safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a violent act (shoving) on a subway platform, which carries a risk of serious injury or death. While the person who wrote the text was not directly harmed, the event indicates a potential for violence in a public space and expresses fear for others' safety.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 13:19:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Lost my cousin last week. OD. Feels like a nightmare. Please, if you're struggling, reach out. There are people who care. Don't become a statistic.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text discusses a recent overdose death, which is strongly correlated with potential overdose or suicidal ideation in the reader. While the text is primarily about grief, the risk of contagion or triggering a crisis in someone vulnerable is high.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 13:18:29"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to quiet the noise. I know it's not, but the urge is so strong. Reached out to a friend, hoping it helps this time. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses suicidal ideation, indicated by the phrases \"quiet the noise\" and \"the urge is so strong.\" While the person has reached out for help, the presence of suicidal thoughts elevates the risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 13:17:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been getting worse. Constant yelling, put-downs... I feel trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a worsening situation of verbal abuse and feelings of being trapped, which could escalate to physical harm or mental health crisis.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 13:16:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved their life. Please, learn the signs and carry it if you can. It could be the difference.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose and administering Narcan indicates a potential for future overdose events and highlights the severity of the situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 13:15:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scared. Found my brother unresponsive. Narcan worked, thank god. This stuff is everywhere. Learn the signs, carry Narcan. It can save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Brother found unresponsive and required Narcan, indicating a potentially fatal overdose situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 12:22:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Constant yelling, walking on eggshells... I feel trapped. Anyone else been through this? How did you cope? I'm scared and don't know where to turn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home situation with emotional distress, fear, and feeling trapped. While there's no explicit mention of self-harm, suicide, violence, or abuse, the level of distress and feelings of being trapped suggest a potential escalation of risk if the situation continues or worsens.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 12:21:51"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nSaw someone OD downtown yesterday. Scary. Naloxone saved them, but it shook me. We need more access & less stigma. Know the signs, carry Narcan if you can. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose incident, which carries a risk of death or serious health complications. While Naloxone was used successfully, the potential for a fatal outcome elevates the severity.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 12:20:49"
  },
  {
    "title": "User Story: Violence",
    "content": "My neighbor's dog bit my kid today. Just a nip, but still. Animal control said it's the third time this month. What can I even do? I'm so worried about it happening again.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A dog bite, even a nip, requiring animal control intervention is a moderate safety risk. The fact that it's the third time this month escalates concern and suggests a pattern of aggressive behavior, increasing the likelihood of a more severe bite in the future. The worry about future incidents indicates the parent perceives a real and present danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 12:19:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIP posts lately. Lost a friend to overdose last night. Please, if you're struggling, reach out. There are people who care and want to help. Don't be another statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post references a recent overdose death and encourages people struggling to reach out, implying potential risk of overdose or suicide in the struggling individuals. While not explicitly mentioning intent, the context suggests elevated risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 12:18:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n>  Relapsed after a while. Feeling so ashamed and lost. Anyone know good resources for online support groups? Just need to connect with someone who gets it.\n\n**Option 2 (Sharing Experience):**\n\n>  Scars are reminders of battles I fought and survived. Doesn't mean I'm okay now, but it means I was strong enough then. Still working on being strong now.\n\n**Option 3 (Raising Awareness):**\n\n>  It's not attention-seeking, it's a cry for help. Please be kind to those struggling. You never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse, feelings of shame and being lost indicate potential vulnerability and need for support. While not explicitly suicidal, the relapse is a concerning factor.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 12:17:44"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy shove his partner on the street. My heart is pounding. I froze. Wish I'd said something. Is there ever a 'right' way to intervene?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a potential assault, but the reporter is not directly involved or threatened. While concerning, the immediate risk of severe harm to the reporter seems low. Intervention is a consideration, but no escalation is indicated.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 12:16:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Narcan saved them, but it shook me up. Reminded me how fragile life is. Please look out for each other. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a successful intervention, indicates a serious situation with potential for future incidents and psychological impact on the witness.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 12:15:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thank goodness. Makes you realize how fragile life is. Learn the signs, carry Narcan if you can. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with successful Narcan intervention, suggests a significant health and safety risk within the environment. The event highlights the presence of potentially lethal substances and the fragility of life, impacting the witness and community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 12:14:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Relapsed after 6 months clean. Feeling so ashamed. Reached out to my therapist, waiting to hear back. Just needed to tell someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates vulnerability and potential for escalation. While the individual has reached out for help, the shame and emotional distress increase the risk. Requires monitoring and support.",
    "detected_category": "other",
    "timestamp": "2026-01-17 12:13:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired of walking on eggshells. Every little thing sets him off. Just wish I knew how to make it stop. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation where the author feels like they are 'walking on eggshells,' suggesting a potentially abusive or volatile environment. While no explicit threats or actions are mentioned, the feeling of isolation and constant anxiety warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 11:16:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the gas station today. Terrifying. Called 911, they're okay now. This stuff is everywhere. Please, be careful out there and know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the immediate overdose situation was resolved, the text indicates a potentially ongoing risk due to the prevalence of dangerous substances. It also reflects a concerning event that could cause distress.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 11:15:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting on the street. He was yelling, she was crying. Felt so helpless. Wish I knew what to do in those situations. Makes me sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the text describes a potentially volatile situation (a couple fighting), it is observed from a distance. The observer expresses feelings of helplessness and unease, but there's no direct mention of physical violence, immediate danger to either party, or specific threats. The observer is not involved, and the situation appears to be one of public disturbance rather than a direct and imminent risk to life or safety.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 11:14:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thankfully. Makes you realize how fragile life is. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a serious health and safety risk in the community. While the individual was saved, the incident highlights the prevalence of drug use and potential for future life-threatening situations.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 11:13:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough. Constant yelling, put-downs. Feels like I'm walking on eggshells. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with emotional abuse (yelling, put-downs), creating a significant level of distress and potential for long-term psychological harm. While not explicitly mentioning physical harm, the 'walking on eggshells' metaphor suggests a highly stressful and potentially volatile situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 11:12:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get too much. Scratched last night. Feels like I'm failing. Anyone know good coping skills that actually work? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions self-harm ('scratched last night'), feelings of failure, and being lost, indicating distress and potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 11:11:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Just reaching out... has anyone else felt this way? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed, which are risk factors for self-harm and suicide. While it is a general expression of distress and a call for connection, the metaphor of 'being underwater' suggests a significant struggle.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 11:10:49"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out downtown yesterday. So fast, so brutal. I froze. Still feel shaken. Is there anywhere to learn how to react safely if that happens again?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence can be traumatizing, causing anxiety and a desire for self-protection. The individual expresses being 'shaken' and seeks resources for safer reactions in the future. The risk of immediate harm to themselves or others is low, although potential future exposure is concerning.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 11:09:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to someone feels impossible, but I know I need to. Where do I even start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and isolation, suggesting a potential risk to mental well-being. The individual acknowledges a need for help but feels overwhelmed, indicating a barrier to accessing support. While there's no explicit mention of self-harm or suicide, the depth of distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 11:08:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so heavy lately, like nothing matters. Reaching out because I know I need to. Talking to someone tomorrow. It's a start.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and acknowledges a need for help, suggesting potential suicidal ideation but also an active step towards seeking support. The statement \"like nothing matters\" is a key indicator of a possible crisis.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 11:07:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. The urge to hurt myself was really strong. I'm trying to stay strong and distract myself, but it's hard. Anyone else been there? What helps?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating immediate risk. While the individual is attempting to cope, the intensity of the urge necessitates a high severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 10:17:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about another OD. Makes me sick. Lost my cousin last year. Learn the signs, carry Narcan if you can. It saves lives. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a recent overdose and a past loss due to overdose, indicating potential vulnerability or triggering emotions related to substance use. While it promotes Narcan use (a positive action), the personal connection to loss elevates the risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 10:16:31"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight downtown. Makes you realize how quickly things can escalate. Shaken up. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing the author to feel shaken and on edge. While unsettling, it doesn't indicate direct involvement, imminent danger, or specific threats. The mention of escalation suggests awareness of potential violence, but not necessarily an immediate or personal risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 10:15:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thankfully. Learn the signs and carry it if you can. Could save a life. #overdoseawareness #narcan #staysafe",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, the event involved a potentially fatal overdose, indicating a significant immediate risk. The hashtag #staysafe also implies an acknowledgement of danger.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 10:14:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so overwhelmed lately. Relapsed after a few months clean. Just trying to take it one day at a time. Anyone else been there? It's so hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety can increase the risk of overdose or other negative consequences associated with the previous substance use. The feeling of being overwhelmed also suggests a vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 10:13:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Okay, here's a short, realistic social media post about self-harm, aimed to sound authentic and encourage help-seeking, while avoiding glorification or specific methods:\n\n\"Rough day. Urges were strong. Didn't act on them, but it was close. Feeling drained. Anyone else get this? Just trying to get through it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post describes strong urges related to self-harm, indicating a potential risk even though the individual reports not acting on them. The vulnerability and seeking of connection suggest a need for support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 10:12:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things aren't good at home. Constant put-downs are draining. Anyone else deal with this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress due to constant put-downs, suggesting a potentially harmful environment. While not explicitly stating self-harm or suicidal ideation, the feeling of being 'lost' warrants attention and further assessment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 10:11:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, uses a metaphor of drowning, and explicitly reaches out for help, indicating a potential crisis. While not explicitly suicidal, the language suggests significant emotional distress.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 10:10:21"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just had another fight with my partner. Things got physical again. I feel so lost and ashamed. Is this normal? I don't know what to do anymore.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates physical violence within a relationship, suggesting potential for serious injury or escalation. The individual also expresses feelings of being lost and ashamed, which raises concerns about their emotional well-being and potential for future harmful behaviors.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 10:09:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, a potential precursor to more serious harm. The phrase 'don't know what else to do' indicates a lack of coping mechanisms.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 10:08:19"
  },
  {
    "title": "User Story: Violence",
    "content": "My neighbor's yelling again. Sounds like it's escalating. I'm scared to call, but worried for the kids. Anyone else dealt with this? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The situation involves escalating yelling and concern for children, suggesting a potential risk of violence or abuse. The poster is scared, indicating a genuine threat perception.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 09:18:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "429 Resource exhausted. Please try again later. Please refer to https://cloud.google.com/vertex-ai/generative-ai/docs/error-code-429 for more details.",
    "detected_category": "unknown",
    "timestamp": "2026-01-17 09:17:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Just reaching out...has anyone else felt this way? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, potentially indicating emotional distress and a need for support. The 'reaching out' suggests a desire for connection and help, but the depth of distress is unclear. While not explicitly suicidal, the metaphor of being 'underwater' can be concerning.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 09:16:12"
  },
  {
    "title": "User Story: Violence",
    "content": "Heard shouting next door again last night. Sounded like things were getting thrown. Makes me sick to my stomach. Wish I knew what to do. Feel so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports of shouting and objects being thrown next door suggest a potential escalation of violence or abuse. The reporter's feelings of helplessness and sickness indicate significant emotional distress related to the situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 09:15:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD on the street today. Scary stuff. Narcan saved him, thank goodness. Makes you realize how fragile life is. Anyone know where I can get trained on using it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be psychologically distressing and indicates the presence of immediate and serious health risks (overdose) in the environment. While the person survived due to Narcan, the incident suggests a potential ongoing risk of overdose in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 09:14:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a thing about overdoses and it hit hard. Lost a friend last year. Knowing the signs and having Narcan could've made a difference. Learn about it. It matters.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses overdoses and the potential impact of Narcan, indicating a risk of overdose even though it doesn't apply directly to the author. The mention of a lost friend elevates the risk from low to medium because it suggests a personal connection to the issue and potential for vicarious trauma or heightened awareness of risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 09:13:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is getting strong again. Reached out to a friend, hoping it helps. It's exhausting fighting this battle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The individual expresses a strong urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 09:12:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Like I'm underwater. Reaching out before things get worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a desire to reach out before things worsen, suggesting potential for escalation. The 'underwater' metaphor can indicate feelings of suffocation or being trapped, which can be associated with depression and suicidal ideation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 09:11:05"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just feeling so lost. Things at home keep escalating, yelling turning into... other things. Don't know where to turn. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates escalating conflict at home, possibly involving violence or abuse. The user expresses feeling lost and alone, suggesting emotional distress and a potential risk of harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 09:10:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a guy shove his girlfriend on the street today. Made me sick. Wish I'd said something, but I froze. Anyone else ever feel that helplessness? What can you even do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an act of violence (shoving) and expresses feelings of helplessness, which can be precursors to more serious issues or indicate ongoing abuse. While not directly threatening, it points to a potentially dangerous situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 09:09:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor being carried out by paramedics. OD. Scared. This addiction stuff is real, y'all. Please reach out if you're struggling. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Neighbor overdosed and needed emergency medical attention. While the author expresses fear and concern rather than ideation, the event highlights the potential for fatal consequences related to addiction.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 08:19:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head. Just needed to tell someone I'm struggling today. Reached out to a friend, hoping it helps. It's okay not to be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses internal distress and acknowledges struggling, suggesting a potential mental health crisis. While there's no explicit mention of self-harm or suicide, the intensity of the internal experience ('so loud inside my head') warrants concern and further assessment.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 08:18:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Said something nasty and walked off. Heart's pounding. Should I have done something? Feel sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence suggests potential for escalation or further harm to the victim. While not directly involved, the witness's distress indicates the event's impact and potential for psychological harm to both the victim and observers.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 08:17:49"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside the bar. Makes me sick. Reminded me of things I'd rather forget. Anyone else feel completely drained after witnessing something like that? I just want to feel safe again.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing emotional distress and a desire for safety, but there is no direct threat or indication of immediate danger to the author or others. The severity is low because it primarily reflects emotional impact rather than immediate physical harm or threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 08:16:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary. Narcan saved them, thank goodness. Makes you realize how close we all are to the edge. Get trained, carry it. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was successful, the text describes an overdose event, indicating a significant health risk and potential for fatality. The 'close to the edge' comment suggests a broader context of risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 08:15:46"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out on the bus today. So fast and brutal. Shook me up. Is there anywhere to report something like that anonymously? Feeling really uneasy.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent event can cause significant distress and potentially lead to anxiety or fear for personal safety. The individual is actively seeking anonymous reporting options, indicating a degree of concern. While not directly involved, the witness might be at risk of future incidents or experiencing psychological distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 08:14:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. If you've been there, how did you find your way out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of depression and a desire for help, suggesting potential vulnerability and a need for support. The phrasing \"dark cloud won't lift\" and \"need to\" are concerning.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 08:13:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been...rough. Constantly walking on eggshells. Is this normal? Feeling so lost and alone. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home environment and feelings of isolation, potentially indicating abuse or a stressful situation that could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 08:12:41"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are strong. Reached out to a friend, feels a little better. Remember there are options. Talking helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the presence of strong urges, which suggests a level of distress that requires attention. While reaching out to a friend is a positive coping mechanism, the strength of the urges warrants a 'medium' severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 08:11:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my building. Shook me up. Makes you wonder what people are going through to get to that point. Hope everyone involved is okay. Feeling really uneasy now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and evokes concern for those involved, but there is no indication of immediate danger or severe threat to the author or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 08:10:38"
  }
]