[
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. I feel trapped and scared. Has anyone else been through this? I don't know where to even start getting help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped and scared at home, hinting at a potentially unsafe situation. The user is also asking for help, indicating a need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-23 18:21:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, thank goodness. If you or someone you know is struggling, please reach out. There's help. I'm still shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose and the mention of Narcan saving the person indicates a life-threatening situation. The author's shaken state underscores the severity of the event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-23 18:20:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "```\nBeen feeling so isolated lately. My partner's been controlling who I talk to and gets angry over small things. Walking on eggshells all the time. Anyone else experience this? Feeling lost.\n```",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional and psychological abuse due to controlling behavior. While not explicitly stating physical violence, the feeling of being controlled and the partner's anger suggest a pattern of abuse that could escalate and is negatively impacting the individual's mental state. The feeling of isolation and being lost are concerning indicators.",
    "detected_category": "abuse",
    "timestamp": "2025-12-23 18:19:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but lacks any explicit mentions of self-harm, suicidal ideation, violence, or abuse. The user is reaching out for support, which is a positive sign.",
    "detected_category": "other",
    "timestamp": "2025-12-23 18:18:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice or just someone to listen?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain any explicit or imminent threats of self-harm, suicide, or harm to others. It indicates a desire for support and advice, suggesting a willingness to seek help.",
    "detected_category": "other",
    "timestamp": "2025-12-23 18:17:33"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank god. Makes you realize how close we all are to the edge. If you're struggling, please reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, indicates a significant risk of overdose in the environment. The text also expresses feelings of vulnerability and encourages seeking help, which suggests awareness of potential danger or struggle.",
    "detected_category": "overdose",
    "timestamp": "2025-12-23 18:16:31"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Clean for 3 months, almost slipped. Reached out to a friend instead. Still shaky, but I'm here. It's so hard sometimes.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a near relapse after 3 months of sobriety, suggesting vulnerability and potential for future, more serious, incidents. The user is experiencing significant emotional distress and acknowledges the difficulty of their situation.",
    "detected_category": "other",
    "timestamp": "2025-12-23 18:15:29"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Didn't know what to do, froze. Wish I'd said something. Anyone else ever feel this helpless?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a witnessed act of violence (shoving) which poses a potential risk of escalation or further harm to the victim. While the text doesn't directly involve the reporter, it indicates an immediate threat to another person.",
    "detected_category": "violence",
    "timestamp": "2025-12-23 18:14:27"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up. Is there anywhere I can volunteer to help prevent this kind of stuff? Feeling helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling distressed, but there's no indication of direct involvement, threat, or intent of harm towards self or others. It expresses a desire to help prevent violence, suggesting a concern for safety rather than an imminent safety risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-23 18:13:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Felt the urge to cut again, but distracted myself with music. Still feeling shaky. Anyone else get through it by doing something creative?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a recent urge to self-harm, suggesting active ideation. While the individual reports using a distraction technique, the continued feeling of shakiness suggests the distress is ongoing and not fully resolved.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 18:12:24"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up bad. Is there anywhere to volunteer to help prevent this kinda stuff? Feel helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault, though not directly involving the individual, can be psychologically distressing and indicates a potential risk for anxiety, fear, and a sense of helplessness. The text describes a real-world incident involving violence with real-world impact.",
    "detected_category": "violence",
    "timestamp": "2025-12-23 17:18:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant yelling, walking on eggshells... I feel trapped. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home environment with constant yelling and feeling trapped, which indicates emotional distress and potential abuse. While it doesn't explicitly mention physical harm or suicidal ideation, the feeling of being trapped can escalate risks.",
    "detected_category": "abuse",
    "timestamp": "2025-12-23 17:17:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back, and I hate feeling this way. Reached out to a friend, just needed someone to listen. It helps. If you're struggling too, you're not alone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions the return of urges, indicating potential self-harm or suicidal ideation. While the individual sought help, the presence of urges warrants a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2025-12-23 17:16:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before things get worse. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, with a proactive reach out suggesting a desire to prevent escalation. The phrase \"before things get worse\" indicates potential for negative outcomes if support is not received.",
    "detected_category": "suicide",
    "timestamp": "2025-12-23 17:15:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so overwhelmed lately. Just reaching out because I know I need to. If anyone has felt this way and found something that helped, I'm open to suggestions. It's hard to keep going.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The statement expresses feeling overwhelmed and having difficulty continuing, which suggests emotional distress and potential for escalation. The specific ask for coping strategies also indicates they are actively seeking help, implying a concerning level of distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-23 17:14:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before it gets worse. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed with a desire for help before the situation escalates. This suggests potential for self-harm or suicidal ideation if support is not received.",
    "detected_category": "suicide",
    "timestamp": "2025-12-23 17:13:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. Quietly, like I imagine it always will. Feeling so lost & ashamed. Does anyone know where I can find help that actually *helps*? I'm scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, ashamed, and scared, indicating distress. The phrase 'happening again' suggests a recurring issue. While not explicitly suicidal or self-harming, the level of distress and the plea for help warrant a 'medium' severity assessment.",
    "detected_category": "other",
    "timestamp": "2025-12-23 17:12:28"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to a friend helped a bit, but it's still there. Anyone else ever feel this way? Just trying to not feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of loneliness and being overwhelmed but does not indicate immediate danger or specific plans for self-harm. Mentioning talking to a friend is a protective factor.",
    "detected_category": "other",
    "timestamp": "2025-12-23 17:11:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, thankfully, but it really shook me. Narcan saves lives. Learn how to use it. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a significant health risk event, though the individual survived. The emotional impact on the witness also contributes to the severity.",
    "detected_category": "overdose",
    "timestamp": "2025-12-23 17:10:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Trying to stay strong and remember why I stopped. It's a daily battle. Any tips for coping with these feelings?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses active suicidal ideation (urge to cut), indicating a current risk. While the individual is also expressing a desire to stay strong and cope, the presence of the urge to self-harm elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 17:09:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice?\n\n**Option 2 (Sharing a Story):**\n\n> I almost wasn't here a year ago. Hard to believe how far I've come. Recovery is possible.\n\n**Option 3 (Raising Awareness):**\n\n> Check in on your friends, even the strong ones. You never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses feelings of being lost and overwhelmed, suggesting potential distress. Option 2 references a past suicidal ideation/attempt which indicates a history of vulnerability. These combined warrant a medium risk assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-23 16:19:38"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up bad. Seeing someone get hurt like that... I keep replaying it in my head. Anyone else ever feel this way after witnessing something like that? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates distress and potential for emotional trauma after witnessing violence. The need to talk suggests a need for support to process the event and prevent potential negative mental health outcomes.",
    "detected_category": "other",
    "timestamp": "2025-12-23 16:18:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, coupled with a plea for help, suggesting potential but not imminent risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 16:17:34"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Makes you wonder what's going on with people. Anyone else feeling on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potentially dangerous situation. However, the author primarily expresses fear and unease rather than indicating direct involvement or imminent danger to themselves or others. The mention of feeling 'on edge' suggests anxiety, but it does not point to a specific, severe risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-23 16:16:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Just need to vent. Things escalated again last night. I feel so alone and don't know what to do anymore. Is there anyone who understands?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of isolation, desperation, and a recent escalation of an unspecified negative situation, indicating potential emotional distress and a need for support. The phrase \"don't know what to do anymore\" increases concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-23 16:15:30"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Dude was clearly hurting, and no one helped. Makes you wonder, what can you even do in that situation? Feel helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Reports witnessing a fight and feeling helpless, but doesn't indicate direct personal involvement in violence or immediate danger to self or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-23 16:14:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home haven't been good. Constant put-downs, isolating me... I feel trapped. Anyone else been through this? How did you find help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and feelings of being trapped and isolated, which could escalate to more serious harm. The specific intent or plan is unclear but the level of distress suggests significant risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-23 16:13:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Just wanted to say if you're struggling, you're not alone. Talking helps, even if it feels impossible. Reach out to someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and encourages seeking help, but it lacks explicit suicidal ideation or plans.",
    "detected_category": "other",
    "timestamp": "2025-12-23 16:12:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed yesterday. Didn't cope well. Reaching out to my therapist today. It's a long road, but gotta keep moving forward. Talking helps.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feeling overwhelmed but indicates proactive coping mechanisms like reaching out to a therapist and focusing on moving forward. While acknowledging difficulty, there's no direct indication of immediate danger or specific plans for harm.",
    "detected_category": "other",
    "timestamp": "2025-12-23 16:11:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It helps. If you're struggling too, you're not alone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions of \"urges\" suggest potential self-harm or suicidal ideation. While the individual reached out for help, the presence of urges indicates a level of risk that needs attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-23 16:10:22"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately, urges are strong. Trying to distract myself but it's hard. Anyone else feel this way? Just looking for some connection.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and difficulty coping, suggesting a potential risk of self-harm or other negative actions. The individual is reaching out for connection, which implies they are aware of the struggle and seeking support, but the strength of the urges raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 15:18:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Really struggling tonight. Urges are strong. Anyone else feel this way? Just need to know I'm not alone.\n\n**Option 2 (Sharing Experience):**\n\n> 4 yrs clean from self-harm. Still get the thoughts sometimes, but I'm learning to cope. It *is* possible.\n\n**Option 3 (Raising Awareness):**\n\n> Scars aren't attention-seeking. They're a reminder of pain survived. Be kind. You never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses strong urges related to self-harm, indicating immediate risk. While options 2 and 3 are supportive and positive, the immediate need for help in option 1 elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 15:17:57"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, rough day. The urge to self-harm is so strong right now. Trying to distract myself, but it's hard. Anyone else been there? What helps?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 15:16:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just reached out to the crisis line. Talking helped, even a little. There's support out there. Please don't give up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of being lost and reaching out to a crisis line. While talking helped, the initial outreach suggests a level of distress that warrants concern and is more than just a passing thought. It indicates a crisis that needed intervention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-23 15:15:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Never thought it'd happen to someone I knew. Found my roommate unresponsive. Narcan saved his life. Scariest moment ever. Learn the signs, carry Narcan. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan, indicating a high risk to life.",
    "detected_category": "overdose",
    "timestamp": "2025-12-23 15:14:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been...not good. Constant yelling, walking on eggshells. Is this normal? Feeling so lost. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with constant yelling and a feeling of being lost, suggesting emotional distress and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-23 15:13:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. Urges were strong, but I reached out to a friend instead. Small victory. Still hurts, but I'm here. Anyone else get that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges, suggesting potential self-harm or suicidal ideation. While the individual reached out for help, the continued pain and expression of being overwhelmed warrant a medium severity level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 15:12:48"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Should I have done something? Feeling sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text doesn't indicate direct harm to the original poster, it describes an act of violence (shoving) which poses a risk of physical harm to the girlfriend. The poster's distress suggests potential for psychological impact. The risk severity is influenced by the possibility of escalation by the perpetrator.",
    "detected_category": "violence",
    "timestamp": "2025-12-23 15:11:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming. I relapsed last night after 6 months clean. Feeling so much shame. Reaching out for support again. It's a day-by-day thing, I guess.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety and expression of shame can indicate increased vulnerability and potential for further harmful behavior. Seeking support is a positive sign, but the risk remains.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 15:10:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. The yelling is constant now, and I feel so small. Has anyone else felt like they're walking on eggshells all the time? I need to talk to someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, a potentially volatile environment due to constant yelling, and a feeling of being overwhelmed. While there's no explicit mention of self-harm, suicide, or violence, the escalating distress and feeling of needing to talk suggest a need for intervention and monitoring.",
    "detected_category": "abuse",
    "timestamp": "2025-12-23 15:09:42"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\nJust saw a guy get shoved on the train for bumping into someone. It escalated so fast. Shook me up. Is this normal now? Feeling kinda unsafe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Reports a single incident of physical violence (shoving) with no indication of serious injury or ongoing threat. The reporter expresses feeling unsafe, but not that they are personally at immediate risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-23 14:18:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, stronger than before. Reached out to a friend, just needed to say it out loud. It helps, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges, suggesting a potential escalation of a negative situation. While the individual reached out for help, the presence of strong urges necessitates a 'medium' severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 14:17:23"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"He's been isolating me from my friends lately. Says they're 'bad influences.' Anyone else experience this? Starting to feel trapped.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Isolation from friends is a common tactic in controlling or abusive relationships. Feeling trapped suggests a loss of autonomy and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-23 14:16:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Trying to resist, but it's exhausting. Anyone else relate? Just feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a return of strong urges, indicating a potential escalation of risk. While not explicitly stating intent, the feeling of exhaustion and loneliness raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 14:15:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just had another fight with my partner. Walking on eggshells constantly. Is this normal? Feeling so lost and alone. Need to talk to someone...\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates emotional distress and relationship issues, but there is no explicit mention of self-harm, suicide, violence, overdose, or abuse, though abuse cannot be ruled out completely. The user expresses a need to talk, suggesting a desire for support rather than immediate danger.",
    "detected_category": "other",
    "timestamp": "2025-12-23 14:14:18"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out on the bus today. Just yelling at first, then fists. Shook me up bad. Is there anywhere I can report this kind of thing without getting involved? Feeling really anxious.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can have a significant emotional impact, leading to anxiety and potential for escalation if left unaddressed. The individual is seeking reporting options, suggesting a need for intervention.",
    "detected_category": "violence",
    "timestamp": "2025-12-23 14:13:16"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Dude was really hurt. Makes you wonder what's going on with people. Feeling shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent fight with someone seriously injured indicates a potential for further violence and possible psychological distress for the witness. The phrase 'dude was really hurt' suggests a significant level of injury.",
    "detected_category": "violence",
    "timestamp": "2025-12-23 14:12:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. Narcan saved them. Please, learn how to use it. It could save a life. #overdose #naloxone #recovery\n\nI'm replacing the provided example with a better response:\n\nMy brother almost died last night. OD. We need to talk about this. Where can I find resources for addiction help? I'm lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions a recent overdose event involving a family member, indicating immediate concern and potential for ongoing risk. The user is actively seeking help and resources.",
    "detected_category": "overdose",
    "timestamp": "2025-12-23 14:11:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after ODing. Scariest experience of my life. Never thought it would happen to me. If you're struggling, please reach out. It's not worth it. 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The individual explicitly states they overdosed and it was a scary experience, indicating significant harm and potential for recurrence.",
    "detected_category": "overdose",
    "timestamp": "2025-12-23 14:10:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen having a rough week. Urges are back. Trying to stay strong & remember why I stopped. Anyone else relate? Just feeling alone rn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses having urges, which could indicate a risk of self-harm or relapse into harmful behaviors. The statement of feeling alone further increases the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 14:09:09"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on my street last night. Shook me up. Makes you realize how quickly things can escalate. Is there anywhere to volunteer, like, to help prevent this stuff?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning, but does not indicate direct involvement, intent to harm, or immediate danger to the author or others. The author's reaction is one of shock and a desire to help prevent future incidents, suggesting concern rather than active participation in violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-23 13:28:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel so trapped. Anyone else been through this? How did you find help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, indicating a potentially abusive situation. The feeling of being trapped raises concern for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-23 13:27:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, but it's still hard. Anyone else feel this way? Just looking for some understanding.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk. While the individual has reached out to a friend, the persistence of the urge suggests the need for immediate support and intervention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 13:26:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after od'ing. Scared. Real scared. Never thought it would happen to me. If you're struggling, please reach out. It's not worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Recent overdose indicates a significant risk of future attempts. The individual expresses fear but acknowledges the event occurred, suggesting ongoing vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-23 13:25:28"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Scary how quickly things escalated. Reminded me of what my brother went through. Makes you realize how fragile things are. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning but doesn't directly indicate imminent danger to the author or others. The mention of a brother's experience and fragility suggests reflection on violence rather than active participation or planning.",
    "detected_category": "violence",
    "timestamp": "2025-12-23 13:24:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nUgh, rough day. Feeling the urge to self-harm creeping up. Trying to distract myself, but it's hard. Anyone else get this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses an urge to self-harm, indicating a potential risk. While the individual is attempting to distract themselves, the presence of the urge elevates the severity beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 13:23:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things aren't good at home. Walking on eggshells constantly. Anyone else feel like they're losing themselves? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a potentially unsafe home environment and feelings of being lost, indicating emotional distress and a possible risk of escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-23 13:22:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's a daily struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating an immediate risk to the individual's safety.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 13:21:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough week. Feeling really low, like nothing matters. Reached out to a friend, just needed to vent. Talking helps. If you're struggling too, please don't keep it in.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of hopelessness ('nothing matters') and a low mood, which suggests potential suicidal ideation. While they reached out for help, the presence of these feelings warrants a 'medium' severity level.",
    "detected_category": "suicide",
    "timestamp": "2025-12-23 13:20:20"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Narcan saved him. Scariest thing ever. Please, if you're using, have someone with you and have Narcan. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention. This indicates a high risk of death or serious harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-23 13:19:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just needed someone to listen. It helps, even a little. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The return of urges suggests a potential risk for self-harm or suicide. While the individual has reached out for support, indicating a protective factor, the presence of urges elevates the risk beyond low.",
    "detected_category": "suicide",
    "timestamp": "2025-12-23 12:24:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but there's no explicit mention of self-harm, suicide, violence, abuse, or overdose. It appears to be a general expression of emotional distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-23 12:23:37"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude was totally out of control. Makes you wonder what sets people off, and how to help before it gets that far. Anyone know resources for anger management?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight indicates potential for violence but the individual is seeking resources for anger management, suggesting awareness and a desire to prevent future incidents.",
    "detected_category": "violence",
    "timestamp": "2025-12-23 12:22:35"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. Feels so close to home. Scared, tbh. If you're struggling, please reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and acknowledges a recent overdose in the user's community, suggesting potential distress and proximity to a high-risk event. While not explicitly stating suicidal intent, the message highlights vulnerability and the need for support, warranting a medium severity level.",
    "detected_category": "overdose",
    "timestamp": "2025-12-23 12:21:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just realized patterns in my relationship are...not okay. Constant put-downs disguised as jokes? Isolating me from friends? Feels wrong, but is it really abuse? Scared to admit it even to myself.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional abuse (put-downs, isolation). While not explicitly stating physical violence, these patterns can escalate and have significant psychological impact. The fear and uncertainty suggest a vulnerability that requires attention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-23 12:20:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... Scares me so bad. Lost my cousin last year. If you're struggling, please reach out. There's help. You're worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a recent overdose death and the author expresses fear and grief, referencing a personal loss. This indicates potential vulnerability and emotional distress, and while not explicitly suicidal, the connection to overdose and loss elevates the risk beyond low.",
    "detected_category": "overdose",
    "timestamp": "2025-12-23 12:19:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so incredibly alone lately. Like I'm underwater. Reaching out for help feels impossible, but I know I need to. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of isolation and being overwhelmed, indicating a possible mental health struggle and a stated need for help. The metaphor 'underwater' suggests a feeling of suffocation or being trapped. While not explicitly suicidal, the combination of factors raises concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-23 12:18:28"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy and I don't know what to do. Reaching out because I need to know I'm not alone in this. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but lacks explicit suicidal ideation or intent. Seeking connection and advice indicates a desire for help.",
    "detected_category": "other",
    "timestamp": "2025-12-23 12:17:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm starting to realize the yelling & put-downs aren't normal. Feels like walking on eggshells all the time. Anyone else been through this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a pattern of verbal abuse and emotional manipulation (yelling, put-downs, walking on eggshells). This suggests an unhealthy and potentially escalating situation that could lead to emotional distress, anxiety, and potentially other negative outcomes. While there's no immediate threat of physical harm explicitly stated, the emotional environment is concerning.",
    "detected_category": "abuse",
    "timestamp": "2025-12-23 12:16:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's a daily battle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 12:15:24"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you realize how quickly things can escalate. Stay safe out there, everyone. Feeling shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, indicating a potential for violence. While concerning, it's a past event and the poster is primarily expressing feeling shaken rather than being directly threatened or involved now.",
    "detected_category": "violence",
    "timestamp": "2025-12-23 11:18:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD. Scares me. Lost my cousin last year. If you're struggling, please reach out. There are people who care & want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and mentions a personal loss due to overdose, which suggests a potential vulnerability or heightened emotional state related to substance use. While not explicitly suicidal, the reference to struggling and urging others to reach out indicates a degree of distress and a possible risk related to overdose.",
    "detected_category": "overdose",
    "timestamp": "2025-12-23 11:17:04"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feeling lost and overwhelmed, using the metaphor of being 'underwater,' suggesting a sense of desperation and helplessness. The plea for help indicates a potential crisis.",
    "detected_category": "suicide",
    "timestamp": "2025-12-23 11:16:02"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out downtown. Shook me up bad. Anyone else feel like things are getting more volatile lately? Makes me nervous to go out.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling, but the text doesn't indicate imminent danger to the individual or others. It expresses anxiety and concern about increasing volatility, but not direct involvement or threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-23 11:15:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... scary lately. Walking on eggshells constantly. Don't know where to turn. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially unsafe home environment and emotional distress. While not explicitly stating violence or self-harm, phrases like 'scary' and 'walking on eggshells' suggest a risk of escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-23 11:13:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things are rough at home. Feeling isolated. Anyone know of any resources for emotional abuse?\"\n\n**Option 2 (Sharing a Story):**\n\n> \"Never thought it would happen to me. Gaslighting is real, and it's messing with my head. Starting to question everything.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Control isn't love. Learned that the hard way. Please, if you feel trapped or scared, reach out to someone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While there is no explicit mention of self-harm or suicidal ideation, the text suggests emotional distress, isolation, and potential abuse (gaslighting). The user is questioning their reality and feeling trapped, indicating a need for support and potential escalation if left unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-23 11:12:57"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Made me realize how close it can be, you know? Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and expressing feeling on edge. While potentially unsettling, it doesn't indicate imminent danger or direct involvement. The individual is expressing a general feeling of unease rather than making threats or showing signs of being in immediate danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-23 11:11:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. Narcan saved them. Learn CPR and how to use it, please. You could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was successful, an overdose is inherently a serious and life-threatening event. The text implies a direct witness to a traumatic event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-23 11:10:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional and psychological abuse (put-downs, controlling behavior) leading to isolation. While not explicitly stating intent to harm self or others, the described situation could escalate, indicating a need for support and intervention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-23 11:09:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out before it gets worse. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and 'lost' with a plea for help 'before it gets worse,' suggesting potential for escalation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-23 11:08:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. He yells, then apologizes, then it happens again. I feel so trapped. Is this normal? Anyone else experience this? I need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 59 (char 84)",
    "detected_category": "unknown",
    "timestamp": "2025-12-23 10:19:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD. It's scary how close to home this hits. Anyone else feeling helpless? Thinking of taking a naloxone training, maybe that's one thing I can do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of helplessness in response to a recent overdose, suggesting potential vulnerability and awareness of a serious risk in their community. While not explicitly stating suicidal ideation, the helplessness and proximity to the event elevates the risk beyond low.",
    "detected_category": "overdose",
    "timestamp": "2025-12-23 10:18:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Almost relapsed, but reached out to a friend instead. Still struggling, but glad I didn't give in. One day at a time, I guess.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a near relapse, suggesting a potential vulnerability and active struggle. While the individual reached out for help, the risk of relapse remains.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 10:17:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after OD'ing. Scared & ashamed. This isn't how I want to live. Anyone know where I can find support groups in the city?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Recent overdose indicates a high risk of future attempts. Seeking support is a positive sign, but the underlying risk remains very high.",
    "detected_category": "overdose",
    "timestamp": "2025-12-23 10:16:16"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Scared me half to death. Is this normal now? Feeling really shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing fear and unease, but does not indicate direct involvement or ongoing threat. While upsetting, it doesn't suggest imminent danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-23 10:15:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough lately. Constant yelling, then the silent treatment. Walking on eggshells is exhausting. Anyone else deal with this? Feeling so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a stressful and potentially emotionally abusive environment (constant yelling, silent treatment, walking on eggshells). While not explicitly mentioning physical violence or self-harm, the feeling of isolation and distress raises concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-23 10:14:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary stuff. Please, if you're struggling, reach out. There are people who care and want to help. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose, indicating a potential safety risk, and implicitly warns against similar outcomes. While not directly expressing intent, it acknowledges the possibility of further incidents.",
    "detected_category": "overdose",
    "timestamp": "2025-12-23 10:13:12"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his car after getting a ticket. Made me jump. Reminded me too much of my dad. Anyone else get triggered by stuff like that? Feel so on edge now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing an outburst of anger that triggered a negative emotional response in the author. While the author is feeling on edge, there is no indication of intent to harm themselves or others. The author is describing their emotional reaction rather than taking any action.",
    "detected_category": "other",
    "timestamp": "2025-12-23 10:12:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found out a friend OD'd. Scared & heartbroken. This stuff is so dangerous. Please, if you're struggling, reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text expresses grief and loss due to a friend's overdose, it also acknowledges the danger and encourages seeking help. This indicates awareness and potential support-seeking behavior for the author, mitigating immediate risk but highlighting a vulnerability to the same dangers that caused the friend's overdose.",
    "detected_category": "overdose",
    "timestamp": "2025-12-23 10:11:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm drowning and no one can see it. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 74 (char 99)",
    "detected_category": "unknown",
    "timestamp": "2025-12-23 10:10:06"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Constant put-downs & controlling behavior. Feeling trapped. Anyone else been through this? Need to figure out my next step.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and feeling trapped, suggesting a potentially abusive situation. While not explicitly stating physical harm, the emotional distress warrants a 'medium' severity rating due to the potential for escalation and mental health impact.",
    "detected_category": "abuse",
    "timestamp": "2025-12-23 09:21:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head. Hard not to hurt the outside to match. Trying to find better ways to cope. Anyone else feel this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses internal distress and a desire to harm the 'outside' which could indicate potential for violence or self-harm. While the user is 'trying to find better ways to cope', the impulsive feeling is concerning.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 09:19:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary stuff. Narcan saved their life. Carry it, learn how to use it. You could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, an overdose is a life-threatening event with potential for severe harm or death. The situation described is dangerous.",
    "detected_category": "overdose",
    "timestamp": "2025-12-23 09:18:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so lost lately. Like I'm drowning and can't find the surface. Reaching out... anyone else ever feel this way?\n\n**Option 2 (Personal Story - Brief):**\n\n> Was in a really dark place a while back. Getting help was the hardest, but best, thing I ever did. There is hope.\n\n**Option 3 (Raising Awareness):**\n\n> Check in on your friends, even the ones who seem okay. You never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't explicitly mention suicidal ideation or intent. Option 2 offers a positive perspective, and Option 3 encourages checking on others, which are protective factors.",
    "detected_category": "other",
    "timestamp": "2025-12-23 09:17:55"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just left. Again. My heart's racing. I know I deserve better than this cycle, but it's so hard to break. Any advice on staying strong this time?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates emotional distress and a struggle with a negative cycle, but doesn't explicitly mention self-harm, suicide, or violence. The user is asking for advice, suggesting a desire to break the cycle.",
    "detected_category": "other",
    "timestamp": "2025-12-23 09:16:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Rough day. Really fought the urge to relapse. Feeling so drained. Anyone else get that 'almost' feeling and then just...nothing left?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with relapse, suggesting a potential risk to well-being, although there is no immediate plan or intent mentioned.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 09:15:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so heavy, y'know? Like tonight. Just trying to breathe through it. Reached out to a friend. Hope things get lighter soon.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being overwhelmed and reaching out for support. While concerning, there is no explicit mention of harm to self or others.",
    "detected_category": "other",
    "timestamp": "2025-12-23 09:14:50"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. So much anger. Makes you wonder what people are going through. Hope everyone involved is okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessed a fight, expressing concern for those involved. No direct threat or indication of personal harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-23 09:13:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The constant put-downs & controlling behavior... I feel so trapped. Is this normal? Anyone else gone through this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, feelings of being trapped, and potential abuse, which could escalate to more severe outcomes. The mention of 'constant put-downs & controlling behavior' suggests a potentially harmful relationship dynamic.",
    "detected_category": "abuse",
    "timestamp": "2025-12-23 09:12:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Things got really dark last night & I relapsed. Day 1 again. Reaching out because I don't want to do this alone. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a relapse after a period of sobriety, coupled with feelings of being overwhelmed and a statement that things got 'really dark'. This suggests a high risk of self-harm or suicidal ideation, and the individual is explicitly seeking help.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-23 09:11:45"
  }
]