[
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Luckily, they're okay now. Please, if you're struggling, reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual survived, the text describes an overdose, a life-threatening event. The immediacy and personal impact expressed ('Scariest thing ever') suggest a significant level of distress and potential for future risk to others who may be struggling.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 08:22:18"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel trapped. Anyone else gone through this? How did you find the strength to leave?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving controlling behavior and put-downs, suggesting emotional abuse and a feeling of being trapped. While not explicitly stating physical harm, the feeling of being trapped can escalate to more serious situations or impact mental health.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 08:21:15"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his girlfriend on the street today. Shook me up. Didn't know what to do. Wish I'd said something. Anyone else ever freeze up like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault (shoving) indicates a potential for further violence or escalation. While the text doesn't directly involve the reporter, it suggests a situation where someone was harmed and expresses concern, indicating a moderate risk level.",
    "detected_category": "violence",
    "timestamp": "2026-01-15 08:20:14"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary. Made me realize how fragile things are. Anyone else feeling on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potentially dangerous situation, but there is no indication that the individual was directly involved or injured. The emotional reaction expressed (feeling scared and on edge) is a normal response to witnessing violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-15 08:19:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Just reaching out... has anyone else felt this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, potentially indicating depression or a mental health crisis. While it doesn't explicitly mention self-harm or suicide, the feeling of being 'underwater' can be a metaphor for feeling suffocated or overwhelmed by life's challenges. Reaching out for support suggests a desire to cope, but the level of distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-15 08:18:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Narcan worked, thank goodness. Makes you realize how fragile life is. Learn the signs, carry Narcan if you can. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was administered successfully, an overdose occurred, indicating a risk of severe health consequences and potential fatality. The experience was clearly distressing.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 08:17:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary. Narcan saved them, but it shook me up bad. Reminded me how fragile life is. Please be careful out there, and look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event that can have a significant emotional impact. While the person survived due to Narcan, the experience was traumatic and highlights the risk of overdose in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 08:16:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scariest thing ever. Narcan saved them, but it really shook me up. Learn CPR and carry Narcan, people. It could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose implies a potential for a similar event occurring and raises concern for the well-being of individuals struggling with substance use. While Narcan was used successfully, the event itself carries inherent risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 08:15:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just feeling so lost. He says he loves me but then yells and controls everything. Is this normal? I feel like I'm walking on eggshells all the time. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional and verbal abuse within a relationship. The feeling of being controlled and constantly 'walking on eggshells' suggests a power imbalance and potential for escalation. While not explicitly stating physical harm or suicidal ideation, the situation warrants concern due to the abusive dynamics described.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 08:14:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm drowning and no one sees it. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed (\"drowning\"), which are risk factors for suicidal ideation. While there's no explicit mention of self-harm or suicide, the intensity of the distress warrants a 'medium' severity rating.",
    "detected_category": "suicide",
    "timestamp": "2026-01-15 08:13:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... rough. I'm walking on eggshells all the time. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a potentially unsafe home environment with emotional distress and a feeling of isolation. \"Walking on eggshells\" indicates possible emotional or verbal abuse, but without more information, the severity cannot be determined to be high. The mention of feeling alone increases the risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 07:21:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how fragile things are, you know? Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate imminent danger to the author or others. It expresses feeling shaken and on edge, but lacks specific threats or plans.",
    "detected_category": "violence",
    "timestamp": "2026-01-15 07:20:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mentions of self-harm, suicide, or harm to others. It seems to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2026-01-15 07:19:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my friend OD last night. Scariest thing ever. Narcan saved him. Please, if you're using, carry it. It could save a life. Getting mine refilled tomorrow.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A friend experienced a life-threatening overdose, indicating a high risk situation. While Narcan was used successfully, the event itself points to significant danger.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 07:18:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at a party last night. Scariest thing ever. Narcan saved their life. Please, learn how to use it. You could save someone's kid, friend, or even a stranger. It's so important.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an actual overdose event requiring emergency intervention (Narcan). Overdoses can be fatal.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 07:17:44"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street. Yelling turned physical fast. Called the cops, hope they got there in time. Shaken up, feel so helpless. Anyone else ever witness something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed a violent physical altercation in public. While the reporter is not directly involved or harmed, the event caused distress and a feeling of helplessness, suggesting a potential emotional impact.",
    "detected_category": "violence",
    "timestamp": "2026-01-15 07:16:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I relapsed last night. The urges were too strong. Feeling so much shame but reaching out because I know I can't do this alone. Any advice on coping strategies that actually work?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse suggests a return to harmful behavior. Expressing shame and seeking help indicates awareness and a desire to change, but the relapse itself elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 07:15:41"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, days like today are so hard. The urge to just...feel *something* else is overwhelming. Reached out to my therapist, hoping she has some openings this week. Just gotta keep breathing.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses an overwhelming urge to \"feel something else,\" which could indicate a desire to engage in risky or harmful behaviors. The individual is seeking help from a therapist, which is a positive sign, but the intensity of the expressed feeling warrants a medium severity assessment.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 07:14:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post about suicide, aiming for authenticity and help-seeking, while staying under 300 characters and avoiding hashtags:\n\n\"Things feel really heavy lately.  Just existing is exhausting.  Anyone else been there?  Talking feels impossible, but I know I need to reach out.  Where do you even start?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The post expresses feelings of hopelessness, exhaustion with existence, and an implicit desire to reach out for help due to suicidal ideation. The statement \"Things feel really heavy lately. Just existing is exhausting.\" indicates a significant emotional burden. The fact that the user acknowledges they need to reach out suggests a degree of self-awareness, but also highlights the severity of their distress.",
    "detected_category": "suicide",
    "timestamp": "2026-01-15 07:13:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Been feeling so low lately, like nothing matters. Reaching out because I don't know what else to do. Anyone else ever feel this way?\"\n\n**Option 2 (Personal Story - Reflective):**\n\n> \"Dark place tonight. Remember when I almost didn't make it? Grateful for every day since. It gets better, even if it doesn't feel like it now.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Lost a friend to suicide. Please, check in on the people you love. You never know what someone's going through.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 61 (char 86)",
    "detected_category": "unknown",
    "timestamp": "2026-01-15 07:12:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Just reaching out... has anyone else felt this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, hinting at potential emotional distress and a possible cry for help. While not explicitly suicidal, the metaphor of being 'underwater' suggests a feeling of being overwhelmed and struggling.",
    "detected_category": "suicide",
    "timestamp": "2026-01-15 06:23:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved their life. Learn how to use it. It can happen to anyone. Please be careful out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose and the call for caution indicates a potentially dangerous environment and the risk of further overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 06:22:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so overwhelmed lately. Scratched again last night. Hate myself for it. Trying to find healthier ways to cope. Anyone else relate? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates self-harm (scratching) and feelings of self-hatred and loneliness, suggesting a potential risk of escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 06:21:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Paramedics got there quick, thank goodness. Makes you realize how fragile things are. Learn CPR folks, it could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose incident, indicating a direct threat to life. While the individual received medical attention, the potential for fatal consequences exists.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 06:20:05"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The constant put-downs are chipping away at me. Is this normal in a relationship? Feeling so lost. #abuseawareness #domesticviolence",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse and feelings of being worn down, suggesting a potential escalation of harm. While not explicitly stating intent to harm self or others, the vulnerability and distress are concerning.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 06:19:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scary stuff. They're okay now, thankfully. Makes you think about how easily things can go wrong. Where can I learn more about helping if it happens again?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, can be a traumatic event and highlights the risk of future overdose incidents. The user is seeking information on how to assist in similar situations, indicating a concern for potential future harm.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 06:18:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so incredibly lost lately. Like I'm drowning and no one sees it. Reaching out here because I don't know where else to turn. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed ('drowning'). While not explicitly suicidal, the individual is reaching out for help, suggesting they are struggling and potentially vulnerable.",
    "detected_category": "suicide",
    "timestamp": "2026-01-15 06:17:00"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's an attempt at a short, realistic post, focusing on seeking help and sounding authentic:\n\n\"Been feeling so incredibly low lately. Like, just constantly overwhelmed. Reaching out because I know I need to talk to someone. Any suggestions for resources?\"\n\nI have avoided any graphic details, specific methods, or language that could be triggering. The focus is on expressing feelings of distress and seeking help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of distress and a desire to seek help, but it lacks any specific plans or indications of imminent danger. It focuses on seeking resources rather than expressing intent to self-harm or other harmful actions.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 06:15:58"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant yelling, walking on eggshells... feels like I'm always doing something wrong. Anyone else been through this? Need to feel less alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with constant yelling and feeling like one is always doing something wrong. While not explicitly stating violence or abuse, the mention of \"walking on eggshells\" suggests a potentially volatile and unpredictable situation causing emotional distress. This warrants a medium severity rating as it indicates a potentially harmful situation that could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 06:14:56"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight on the bus. Guy wouldn't stop harassing a woman, then it escalated. Shaken up. Is there anywhere I can report something like that without getting involved directly?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A physical altercation occurred, indicating a risk of injury to those involved. While the immediate situation may be over, the potential for future escalation or continued harassment exists.",
    "detected_category": "violence",
    "timestamp": "2026-01-15 06:13:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short social media post aiming for authenticity and focusing on seeking help:\n\n\"Been feeling so lost lately. Like I'm underwater. Reaching out to a helpline tonight. Hope it helps.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed ('underwater'), which indicates a potential mental health crisis. The individual is seeking help from a helpline, suggesting they recognize the severity of their situation and are taking action, but the underlying distress warrants a medium severity rating. While there is no explicit mention of self-harm or suicide, the feeling of being 'underwater' can be interpreted as a metaphor for depression or hopelessness.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 05:22:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nJust saw a story about another OD. It's terrifying. My brother almost didn't make it last year. Please, if you're struggling, reach out. There are people who care. Don't be afraid to ask for help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text directly references a near-fatal overdose and expresses fear of another, indicating a high risk of overdose or related harm.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 05:21:15"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how easily things can escalate. Anyone else ever feel that way after witnessing something like that? Feeling kinda anxious now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and experiencing anxiety. While unsettling, it doesn't indicate imminent danger to the individual or others. There is no indication of violence they were involved in or plan to participate in.",
    "detected_category": "other",
    "timestamp": "2026-01-15 05:20:14"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like I'm trapped. Reaching out because I know I need help. Talking to a therapist tomorrow. It's a start.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being trapped and seeking help, indicating distress. While they are taking a positive step by seeing a therapist, the expressed feelings warrant a medium severity assessment due to the potential for escalation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-15 05:19:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Terrifying. Narcan saved their life. Please, learn how to use it. You could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a friend's overdose, a life-threatening event requiring immediate intervention. While the friend survived, the event highlights the potential for severe harm and death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 05:18:11"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately? Wish people would just chill.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text reports witnessing a fight, which is concerning, but doesn't indicate direct involvement or imminent threat to the author. The author expresses feeling shaken and on edge, but doesn't explicitly mention harm to themselves or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-15 05:17:10"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Hard to keep going sometimes.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed, and struggling to keep going, suggesting potential mental health distress and a possible risk of self-harm or suicidal ideation, though not explicitly stated.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 05:16:08"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy get punched outside my apartment. Shook me up bad. Called the cops, but still... feels like it's happening everywhere lately. Anyone else feel this way? Makes me scared to go out.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A violent act (punch) occurred, indicating potential for physical harm. While the original poster was not directly involved, the incident caused fear and suggests a perceived increase in local violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-15 05:15:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "Ugh, another fight. Walking on eggshells constantly. Is this normal in relationships? Starting to feel really isolated and unsure of myself. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feelings of isolation and uncertainty potentially stemming from relationship conflict. While not explicitly mentioning harm, the phrase \"walking on eggshells\" suggests a potentially abusive or controlling dynamic, raising concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 05:14:05"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been rough. Constant yelling, feeling like I'm walking on eggshells... Anyone else dealt with this? Feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with constant yelling and feeling unsafe ('walking on eggshells'). While it doesn't explicitly mention violence or abuse, the situation described could escalate and is causing emotional distress. The feeling of isolation is also a contributing factor to increased risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 05:13:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is back. It's like a really bad itch I can't scratch. Talking to my therapist tomorrow, thank goodness. Just needed to say it out loud.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a renewed urge to self-harm, suggesting a potential escalation of risk, even though the person is seeking help from a therapist. The simile 'like a really bad itch I can't scratch' highlights the intensity of the urge.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 04:33:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells for so long, I forgot what my own voice sounds like. Is this normal in relationships? Feeling trapped and scared to speak up. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped, scared, and voiceless within a relationship, indicating potential emotional abuse. The user is also questioning if this is normal, suggesting they recognize the situation may be unhealthy. While there are no explicit threats, the description warrants concern for the user's mental and emotional well-being.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 04:32:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things at home are rough. Walking on eggshells constantly. Never know what's going to set him off. Feeling so alone. Anyone else been through this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation with potential for escalation. \"Walking on eggshells\" and \"never know what's going to set him off\" suggest emotional abuse and a potentially volatile environment. While not explicitly stating violence, the situation presents a risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 04:31:42"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight outside the bar last night. Shook me up bad. Makes you wonder what's going on with people, you know? Just senseless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't directly indicate imminent danger or high risk to the speaker or others. The speaker expresses emotional distress but not an intent to harm themselves or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-15 04:30:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Constant put-downs, controlling behavior... I feel trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a pattern of abuse (put-downs, controlling behavior) leading to a feeling of being trapped. While there's no explicit mention of violence or intent to harm self or others, the situation described creates a significant risk for emotional and potentially physical harm depending on the escalation of the abusive behaviors. The feeling of being 'trapped' is concerning.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 04:29:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, thank god. Learn how to use it, please. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a situation with potential for serious harm or death, even though the person was saved. Encouraging others to learn Narcan use implies ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 04:28:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges are strong. Trying to distract myself with a movie. Anyone else get this way? Just feeling really alone right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions \"strong urges\" and feeling \"really alone,\" which suggests potential self-harm or suicidal ideation, though no specific plan is mentioned. The user is actively trying to distract themselves.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 04:27:35"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my neighbor unresponsive. Narcan saved them. Scary reminder of how close we all are to losing someone. Learn the signs, carry Narcan. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Neighbor was unresponsive and required Narcan, indicating a serious overdose situation averted by timely intervention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 04:26:33"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Please, if you're using, carry it. Could save a life, seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, requiring intervention (Narcan). While the person survived, the potential for fatality indicates a significant risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 04:25:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but lacks explicit mention of self-harm, suicide, or harm to others. It appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2026-01-15 04:24:29"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Everything feels heavy and pointless. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of loss, hopelessness, and a lack of purpose. The statement 'I don't know what else to do' suggests a potential escalation if support is not received.",
    "detected_category": "suicide",
    "timestamp": "2026-01-15 03:47:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Old coping mechanisms surfaced. Day 1 again. Reached out to a friend, which helped a little. It's a long road, but I'm still here.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse into old coping mechanisms after feeling overwhelmed. While the person reached out to a friend, the specific nature of the coping mechanisms is unknown, and the relapse to 'day 1 again' suggests a significant setback, increasing the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 03:46:51"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a memorial for another friend lost to overdose. This stuff is relentless. Learn the signs, carry Narcan if you can. It really can save a life. Please reach out if you're struggling. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a friend's death due to overdose and urges carrying Narcan, indicating a significant risk of overdose events in the individual's social circle and potential for personal exposure.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 03:45:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend, hoping it helps. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, which can be indicative of emotional distress. However, it also shows proactive coping by reaching out to a friend. There is no explicit mention of self-harm, suicide, or violence.",
    "detected_category": "other",
    "timestamp": "2026-01-15 03:44:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He yelled again last night, smashed a plate. I feel like I'm walking on eggshells. Is this normal? I don't know what to do anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential for escalating violence and emotional abuse, creating a harmful and unstable environment. The mention of smashed plates suggests physical aggression, and the feeling of 'walking on eggshells' points to ongoing emotional distress and fear.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 03:43:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Constant yelling, and lately...more. Feeling lost and scared. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and potentially abusive home environment. The phrase 'lately...more' suggests an escalation of the situation, potentially involving physical violence. The user expresses feeling 'lost and scared' and seeking help.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 03:42:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "I'm having a really tough time lately. Feeling so lost and overwhelmed. Reaching out because I don't know what else to do. Any advice or support would be appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, seeking advice and support. While concerning, it doesn't explicitly mention self-harm, suicide, or harm to others.",
    "detected_category": "other",
    "timestamp": "2026-01-15 03:41:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm underwater. Talking to my doctor tomorrow. Hope things start looking up soon.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates feelings of sadness and low mood, but also shows help-seeking behavior (talking to a doctor) and hope for improvement. There is no explicit mention of self-harm, suicide, or harm to others.",
    "detected_category": "other",
    "timestamp": "2026-01-15 03:40:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Constant put-downs, yelling... I feel so small. Anyone else experience this? How do you cope? I'm starting to feel really trapped.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress (feeling small, trapped) due to negative interactions at home (put-downs, yelling). While not explicitly stating suicidal ideation or self-harm, the feeling of being trapped can escalate to more severe outcomes if not addressed.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 03:39:39"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside my building. Shook me up bad. Is there anywhere I can go to just...talk about feeling unsafe? Feel like I can't breathe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The individual expresses feeling unsafe and shaken up after witnessing a fight, but doesn't indicate direct threat or harm to themselves. There is a request for resources to talk about feeling unsafe. No indication of escalation or imminent danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-15 03:38:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just needed to say it out loud. It helps, even a little. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of being overwhelmed, suggesting a potential risk of self-harm or suicidal ideation. While the individual reached out for support, the presence of urges elevates the risk level. The phrase 'urges are back' implies this is a recurring issue and not just a transient feeling.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 02:57:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I feel like I need to hurt myself just to feel *something*. Anyone else ever feel this way? It's scary, and I don't know how to cope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a desire to self-harm as a coping mechanism, indicating significant emotional distress and potential for immediate danger.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 02:56:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Hard not to just...scratch the itch, y'know? Trying really hard to find a different way to turn the volume down. Anyone else feel this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The phrase \"scratch the itch\" can be interpreted as a euphemism for self-harm. The user expresses a desire to find alternative coping mechanisms, suggesting awareness of the potential for harm and a willingness to avoid it, but the initial impulse raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 02:55:02"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. I said something, but now I'm wondering if I should've done more? Anyone else ever been in that situation? Feeling uneasy.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an instance of violence (shoving), which is a form of physical assault. While it's a single incident and the observer intervened verbally, the potential for escalation and further harm exists for the girlfriend. The observer also expresses personal unease, suggesting they recognize the seriousness of the situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-15 02:54:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Clean for a month, then relapsed last night. Feeling so much shame. Reaching out before it gets worse again. Anyone know good online resources?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates vulnerability and potential for escalating substance use, increasing the risk of negative health consequences, including accidental overdose. The expressed shame and desire to seek help suggest a degree of self-awareness and a proactive approach, but the potential for further relapse and its consequences warrants a medium severity assessment.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 02:52:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, feeling so overwhelmed lately. Old coping mechanisms keep popping into my head. Trying so hard to resist. Anyone else relate? What helps you get through it? Need some new ideas.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The mention of \"old coping mechanisms\" and \"trying so hard to resist\" suggests a struggle with potentially harmful behaviors. While not explicitly stated, the context implies a risk that needs further exploration.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 02:51:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been walking on eggshells lately. Partner's anger is getting scary. Anyone else ever feel like they're losing themselves to keep the peace? Is that...normal?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential for escalation to physical or emotional abuse. The partner's anger is described as 'scary', suggesting a perceived threat. The individual also expresses a loss of self to maintain peace, which is a significant concern. While there's no explicit mention of violence, self-harm, or suicide, the situation warrants attention due to the potential for harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 02:50:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, feeling so overwhelmed lately. The urges are back and I hate it. Just trying to take things one minute at a time. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions the return of urges and feelings of being overwhelmed, which suggests a potential risk of self-harm or other negative coping mechanisms. While the individual is trying to cope, the presence of urges warrants a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 02:49:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Reached out to a friend, feels a little better to not be alone with it. Anyone else relate? Just trying to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which suggests a potential risk. While the individual has reached out for support, the statement \"Just trying to get through tonight\" implies a current struggle and potential vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 02:48:51"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a guy punch his girlfriend in the street today. Froze. I wish I'd done something. Feeling sick about it. Anyone else ever witness something like that? What do you even do?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can have psychological impacts on the witness, potentially leading to anxiety, fear, or feelings of helplessness. While there is no immediate physical danger to the witness, the secondary trauma needs acknowledgement.",
    "detected_category": "violence",
    "timestamp": "2026-01-15 02:47:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan worked, thank god. Makes you realize how close to the edge we all are sometimes. Check on your friends, seriously. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event indicating potential risk to the individual who overdosed and highlights the prevalence of substance use issues in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 01:47:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Lost my cousin to an OD last night. Hurts like hell. Please, if you're struggling, reach out. Don't let it get this far. There are people who care.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent death due to overdose, indicating a high risk that the author or someone they know may be vulnerable to similar circumstances or experiencing acute grief and potential suicidal ideation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 01:46:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just waves of sadness. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses sadness and a desire for help, but does not contain explicit statements of suicidal ideation, self-harm plans, or imminent danger.",
    "detected_category": "other",
    "timestamp": "2026-01-15 01:45:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "Sometimes I feel like I'm walking on eggshells. He gets so angry over the smallest things. Is this normal? I'm starting to feel really isolated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests emotional distress and potential abuse ('walking on eggshells,' 'angry over the smallest things,' 'isolated'). While not explicitly stating violence, self-harm, or suicidal ideation, the feelings of isolation and fear warrant concern. The unspecified 'he' could be a partner, family member, or other individual, making the situation potentially dangerous.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 01:44:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. They're okay now, but it shook me up. Makes you realize how close to home this stuff is. Be careful out there, folks. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived the overdose, the event highlights a serious safety risk and could indicate a broader issue of drug use in the community. The observer expresses significant emotional distress, suggesting the incident was impactful.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 01:43:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. Really bad. Feeling the urge to... you know. Trying to breathe through it. Anyone else get this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 93 (char 118)",
    "detected_category": "unknown",
    "timestamp": "2026-01-15 01:42:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a glass wall. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of numbness, detachment, and a plea for help, suggesting emotional distress and potential for escalation. While not explicitly suicidal, the feeling of disconnect warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-15 01:41:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm just going through the motions. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and going through the motions, indicating a possible struggle with mental health. While it shows distress and a call for help, there is no explicit mention or implication of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2026-01-15 01:40:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things are rough at home lately. Feeling isolated and scared. Anyone know of good resources for domestic abuse in [City]? Just need to talk to someone.\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Still processing what happened. Never thought someone I loved could hurt me like that. It's not okay. It's never okay.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Gaslighting is real. It messes with your head and makes you doubt yourself. Don't let anyone control your reality.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential domestic abuse and emotional distress. While there's no explicit mention of immediate danger, the feeling of being scared and hurt by a loved one warrants a medium severity level. Option 1 shows a desire to seek help, which is a good sign, but the underlying situation could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 01:39:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD in the bathroom. Scary stuff. Called 911, hope they're okay. Naloxone saves lives. Learn how to use it. You never know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A person is actively experiencing a life-threatening overdose requiring immediate medical intervention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 01:38:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Walking on eggshells constantly. Anyone else feel like they're suffocating? Need to figure out how to get out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 88 (char 113)",
    "detected_category": "unknown",
    "timestamp": "2026-01-15 00:44:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Please, if you're struggling, reach out. There's help available, you're not alone. I'm worried sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event, which is a serious medical emergency. While it doesn't directly involve the author, witnessing it can be traumatizing and prompts concern for others who may be struggling.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 00:42:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend on Elm Street. Froze up, didn't know what to do. Wish I'd intervened. Feeling sick about it. Anyone else seen stuff like this? How do you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing a violent assault (punching) indicates a high risk of serious physical harm to the victim.",
    "detected_category": "violence",
    "timestamp": "2026-01-15 00:41:56"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Just reaching out to see if anyone else understands. Talking feels impossible right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a lack of motivation, which are risk factors for mental health decline and potentially suicidal ideation. While there's no explicit mention of self-harm or suicide, the statement 'like nothing matters' suggests a significant level of distress and requires further assessment. The unwillingness to talk openly ('talking feels impossible') is also concerning.",
    "detected_category": "suicide",
    "timestamp": "2026-01-15 00:40:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just...heavy. Reaching out because I don't know what else to do. Any advice or just someone to listen?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and a plea for help, suggesting a potential for escalation if support is not received. While not explicitly suicidal or self-harming, the 'heavy' feeling and reaching out indicate distress.",
    "detected_category": "other",
    "timestamp": "2026-01-15 00:39:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD in my town. Makes my stomach churn. Lost a friend last year. If you're struggling, PLEASE reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose in the author's town and the loss of a friend, indicating potential exposure to a distressing situation and increased risk. While the author encourages reaching out for help, the underlying issues are serious and require attention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 00:38:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Relapsed after a few months clean. Feeling so ashamed and alone. Need to remember my coping skills. Anyone else been there?\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Scars don't define us, but they tell a story. Mine's about survival. It gets better. Please reach out if you're struggling.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Hard day. Urges are strong. Just a reminder that self-harm is a sign of pain, not attention-seeking. Be kind to yourself and others.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 explicitly mentions relapse, shame, and loneliness which can be indicators of increased risk. Option 3 mentions strong urges related to self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 00:37:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He yells all the time, then acts like nothing happened. Is this normal? Feeling trapped. Need to talk to someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feeling trapped and a need to talk, which could indicate emotional distress and potential for escalation. The yelling suggests a possible abusive environment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 00:36:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Just trying to get through tonight. 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 00:35:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm just going through the motions. Reaching out because I don't know what else to do. Is anyone else feeling this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and going through the motions, indicating a possible struggle with mental health. However, there's no explicit mention of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2026-01-15 00:34:43"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy shove his girlfriend on the street today. Broad daylight. I froze. Should I have said something? Still feel sick about it. Anyone else ever witness something like that? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes a single instance of violence, the potential for escalation or repeated harm exists. The witness also expresses emotional distress, indicating the incident had a significant impact.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 23:17:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Luckily, Narcan worked. Please, learn the signs and carry it. Could save a life. Don't want anyone to go through that.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a recent overdose event. While Narcan was effective, the potential for fatal outcome exists, indicating moderate risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 23:16:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I yelled, he ran. Shaking. Did I do the right thing? Wish I knew what happened after. Feel so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed an act of violence (shoving) which suggests potential for escalation and harm to the victim. The witness also expresses distress and concern, indicating the potential impact on their well-being.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 23:15:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on my street. Shaken up. Called the cops, but feeling helpless. Anyone know of local resources for de-escalation or community safety? Seriously worried.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A fight broke out, causing the individual to feel shaken and helpless. While they called the police, the incident suggests a potential risk of further violence in the area and a feeling of insecurity. Although the individual is not directly involved and police have been contacted, the exposure to violence and expressed worry indicate a notable level of risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 23:14:52"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy get punched outside the bar last night. Shook me up. It was so sudden. Anyone else feel like things are getting more aggressive lately? Makes me scared to go out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence (a punch), which is concerning, but the immediate threat is low as the violence occurred in the past and the user expresses fear/anxiety about future events rather than being in immediate danger. The user did not report physical harm to themselves.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 23:13:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Narcan saved them, but it was close. Please, learn how to use it. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates a potential risk of future overdoses in the area. The close call suggests a high potential for fatality.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 23:12:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but does not contain explicit ideation, intent, or plans for self-harm or suicide. It's a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2026-01-14 23:11:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got too much last night. Day 1 again. Reaching out before it gets worse. Anyone know good coping skills that actually work?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse ('Day 1 again') and a potential for escalation ('before it gets worse'). While it doesn't explicitly mention self-harm or suicide, the individual is clearly struggling and actively seeking help, suggesting a moderate level of risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 23:10:45"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on the bus. Shook me up. My hands are still trembling. Makes you realize how quickly things can escalate. Is there anywhere to report something like that anonymously?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight on a bus is unsettling, but the reporter was not directly involved or physically harmed. The description focuses on emotional distress and seeking anonymous reporting, suggesting a concern about the event's potential consequences rather than immediate danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 23:09:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me. Learn the signs, please. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event, indicating a risk of further overdose events and potential mental health impact on the witness.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 23:08:41"
  }
]