[
  {
    "title": "User Story: Abuse",
    "content": "```\nJust feeling so lost. Things at home have been...rough lately. Walking on eggshells all the time. Is this normal? Starting to think maybe it's not. Anyone else been through this?\n```",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a difficult home situation, potentially involving abuse or a hostile environment (\"walking on eggshells\"). While not explicitly stating intent to harm themselves or others, the feeling of being lost and questioning the normality of the situation raises concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 06:22:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling pretty overwhelmed and alone. Reaching out to a friend today, hoping it helps. Remember to check in on your loved ones.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates feeling overwhelmed and alone, but there's no explicit mention of self-harm, suicidal ideation, or harm towards others. Reaching out to a friend is a positive coping mechanism. However, the statement does suggest a potential for escalation if support is not received.",
    "detected_category": "other",
    "timestamp": "2025-12-10 06:21:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post about suicide, aiming for authenticity and help-seeking:\n\n\"Feeling really overwhelmed lately.  Everything feels heavy.  Anyone know any good resources or just...ways to cope when it feels like too much?  Could really use some support right now.\"\n\nI have avoided any specific details about methods or intent, and focused on the feeling and the need for help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The post expresses feelings of being overwhelmed and seeks support and coping resources. It lacks explicit suicidal ideation, intent, or plans.",
    "detected_category": "suicide",
    "timestamp": "2025-12-10 06:20:33"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling and cause anxiety, but the text doesn't indicate imminent danger to the individual or others. It's more of a general observation and expression of unease.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 06:19:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD...it hits different when you've been there. Scared myself so bad that night. If you're struggling, please reach out. There's help. You're worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a personal experience with an overdose and expresses concern about others struggling. While it encourages seeking help, the underlying subject matter and past event indicate a potential risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 06:18:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD downtown. Scary stuff. Narcan saved them, thank goodness. Makes you realize how fragile life is. If you're struggling, please reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event indicates a significant safety risk in the community, even though the individual was saved. The event highlights potential risks for others and the need for intervention and support.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 06:17:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so alone. Has anyone else dealt with this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, indicating a potentially unsafe environment. While not explicitly mentioning physical harm or suicidal ideation, the feelings of isolation and the need for help suggest a situation that could escalate.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 06:16:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Please, learn the signs. It could save a life. Really shaken up today.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event, but the person survived due to Narcan. While the text expresses distress and strongly suggests a recent overdose event, the person describing the event does not indicate immediate risk to themself or others, although it's implicitly a high-risk situation for others. The overdose occurred but was mitigated. The speaker is \"shaken up\", indicating potential psychological impact, but no immediate danger to self or others beyond the general risk of overdose in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 06:15:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's so exhausting fighting this every day.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a high level of immediate risk. While the individual reached out to a friend, the intensity of the urge necessitates a high severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 06:14:22"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things have been rough at home lately. Walking on eggshells constantly. Anyone know resources for dealing with emotional abuse? Feeling lost.\"\n\n**Option 2 (Sharing Experience):**\n\n> \"It took me years to realize yelling & constant put-downs weren't normal. Therapy helped. You deserve respect.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"People often think abuse is just physical, but words can leave scars too. Know the signs of verbal abuse! You're not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the user is experiencing emotional abuse and feeling lost, suggesting potential psychological distress. While not explicitly stating intent to harm themselves, the vulnerability warrants a 'medium' severity.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 06:13:20"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on my street. Shaken up. Makes you realize how quickly things can escalate. Is everyone okay out there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A fight broke out, indicating a potential for physical harm to individuals involved or bystanders. While the reporter expresses being shaken up, there's no direct indication of them being physically harmed, but the risk of escalation or further violence exists.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 05:19:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger than ever. Reached out to a friend, just hoping talking helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges, which could be related to self-harm or substance abuse. The individual is feeling overwhelmed and exhausted, suggesting a reduced capacity to cope. While they have reached out for help, the strength of the urges elevates the risk beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 05:18:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n>  Not sure what to do. Things escalated again last night. Feeling so lost and alone. Is this normal?\n\n**Option 2 (Sharing Experience):**\n\n>  Finally left. It was the hardest thing I've ever done. Healing is a long road.\n\n**Option 3 (Raising Awareness):**\n\n>  Emotional abuse leaves scars you can't see. It's still abuse. Don't let anyone tell you it's not.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates potential distress and a possible escalation of an issue. Option 2 suggests someone has left a difficult situation, implying potential past or current abuse. While not explicitly stating intent, the overall tone and content raise concerns.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 05:17:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. I feel so stupid for letting him back in. I don't know what to do anymore. Is there anyone else who understands this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of helplessness, repeated negative experiences ('It's been happening again'), and a desire for understanding, which could indicate emotional distress or potential harm. The lack of specifics makes it difficult to definitively assess the risk, but the recurrence suggests a pattern that warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 05:16:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but does not contain explicit mentions of self-harm, suicide, violence, or abuse. It seems to be a general expression of emotional distress and a call for support.",
    "detected_category": "other",
    "timestamp": "2025-12-10 05:15:07"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but it doesn't contain specific threats or plans for self-harm, suicide, or harm to others. The person is reaching out for support, which is a positive sign.",
    "detected_category": "other",
    "timestamp": "2025-12-10 05:14:06"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing loudly on the street, escalated so fast. He shoved her. Sickening. Called the non-emergency line, hope they actually help. Feeling shaky.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence observed (shoving). Potential for escalation and harm to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 05:13:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my building. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate immediate danger to the author or others. The heightened anxiety is understandable given the situation.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 05:12:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling so lost and overwhelmed. Reaching out to a friend tonight, hoping it helps. Just need to get through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but indicates reaching out for support. There's no explicit mention of harm to self or others.",
    "detected_category": "other",
    "timestamp": "2025-12-10 05:11:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The constant put-downs are chipping away at me. Anyone else feel like they're walking on eggshells all the time? #abuse",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being worn down by constant negativity and alludes to a potentially abusive situation. The phrase 'walking on eggshells' is often associated with abusive environments. While not explicitly stating harm, the sustained emotional distress indicates a medium level risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 05:09:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shaken up. It was so sudden and brutal. Is there anywhere to talk about this stuff? Feeling anxious.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The individual expresses anxiety and distress after witnessing a fight, but there's no direct indication of immediate danger to themselves or others. They are seeking support, which is a positive sign.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 04:26:29"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his dog in the park. Shaking. Didn't know what to do. Is there anyone I can report this to? Feel sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be psychologically distressing and, while the immediate physical risk is to the dog, the reported behavior indicates a potential for escalation and is a form of animal abuse. The witness is also distressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 04:25:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, feeling like I can't do anything right. Is this normal? Feeling really lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (constant put-downs) and feelings of worthlessness and being lost, which could escalate to more serious mental health concerns or self-harm if left unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 04:24:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm drowning and can't find the surface. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and being overwhelmed, suggesting potential for self-harm or suicidal ideation, although not explicitly stated.",
    "detected_category": "suicide",
    "timestamp": "2025-12-10 04:23:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Finally left. Heartbroken but safer. Years of walking on eggshells... Anyone else feel like they lost themselves completely? How do you even start to rebuild?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a history of abuse (\"walking on eggshells\"). While not explicitly stating current danger, the heartbreak and feeling of lost self, following years of abuse, suggests a heightened vulnerability and potential for mental health decline.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 04:22:23"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Frozen. Didn't know what to do. Called non-emergency, but feeling sick about it. Anyone else experienced this? How do you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a witnessed act of violence (shoving). While seemingly a single incident, the potential for escalation or further harm exists, making it more than a negligible risk. The emotional distress of the witness also warrants consideration.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 04:21:21"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells for too long. Finally told a friend what's been happening. Feels good to not be alone with this anymore. Anyone else relate? How did you find the strength to leave?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation where the person feels like they've been 'walking on eggshells' and seeks support from others. This suggests an ongoing stressful or potentially abusive situation, but there's no explicit mention of self-harm, suicide, violence, or overdose. Seeking support and asking for advice on leaving implies an attempt to improve their situation but doesn't clarify the extent of the risk involved. It is a sign of something serious occurring and could potentially escalate.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 04:20:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of distress and isolation but does not contain any explicit statements of intent to harm self or others. It reads more like a general expression of emotional difficulty and a plea for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-10 04:19:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Trying to distract myself, but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating a significant risk. While the individual is attempting to distract themselves, the intensity of the urge warrants concern. ",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 04:18:16"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Felt so overwhelmed last night, relapsed after 6 months clean. Disappointed in myself, but reaching out for support again. It's a tough cycle.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential escalation of risk. While the individual is seeking support, the relapse itself presents a vulnerability and potential for further harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 04:17:14"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting bad on Elm St. Dude was yelling, she looked terrified. Didn't know what to do, felt sick. Anyone else see it? Hope she's okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports of yelling and a terrified woman suggest potential violence or abuse, though the exact nature and extent are unclear. The feeling of being sick indicates that the reporter perceives a serious threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 03:45:25"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them. Carry it, learn to use it. You could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a stressful event that highlights a potential danger to the community. Encouraging others to carry and use Narcan suggests the risk of overdose is present and potentially recurring. While the person survived, the incident itself indicates a risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 03:44:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Just needed to vent. Things got physical again last night. I feel so lost and alone. Is this normal? Anyone else been through this? I need help.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a pattern of physical violence, expresses feelings of being lost and alone, and explicitly asks for help. The escalation to 'again last night' suggests repeated incidents, increasing the risk of serious harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 03:43:22"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...not good. Constant yelling, put-downs. Feels like walking on eggshells. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a verbally hostile and stressful home environment, suggesting emotional abuse and a potential for escalation. While not explicitly stating violence or self-harm, the 'walking on eggshells' feeling implies fear and potential for unpredictable negative reactions.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 03:42:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud I can't shake. Talking to a friend helped a little. Remember to reach out, even when it feels impossible. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and low mood but indicates coping mechanisms (talking to a friend). There is no explicit mention of self-harm or suicidal intent.",
    "detected_category": "other",
    "timestamp": "2025-12-10 03:41:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain any explicit or imminent threats of harm to self or others. It is phrased as a general feeling and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-10 03:40:18"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home have been...bad. Constant put-downs, controlling behavior. Feels like I'm walking on eggshells. Anyone else been through this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, suggesting emotional abuse. While not explicitly stating physical harm, the phrase \"walking on eggshells\" indicates a potentially volatile and psychologically damaging environment. The user is reaching out for help, suggesting a need for support.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 03:39:16"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a fight downtown. Shook me up bad. Reminded me of things I'd rather forget. Anyone else feel like their past trauma just... pops up sometimes? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes a negative emotional reaction to witnessing a fight, potentially triggering past trauma. While distressing, it doesn't express immediate danger to self or others.",
    "detected_category": "other",
    "timestamp": "2025-12-10 03:38:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"I feel so lost. Things at home have been...rough lately. Constant put-downs, controlling behavior. Is this normal? I feel like I'm walking on eggshells. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional abuse and a feeling of being controlled, which can lead to significant psychological distress. While there's no explicit mention of physical harm or intent, the situation warrants concern and further investigation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 03:37:13"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, urges were strong. So glad I reached out to a friend instead. It's not a cure, but it helped me get through. Still struggling today, but taking it one hour at a time.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and ongoing struggle, suggesting a potential risk of self-harm or suicide. Reaching out to a friend is a positive coping mechanism, but the continued struggle warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-10 03:36:12"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Shook me up. Didn't know what to do. Is there a right way to intervene safely? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault indicates a potential risk of escalation and harm to the victim. While the observer is not directly threatened, the situation presents a risk to the victim and a potential for further violence. There is no direct threat to the person writing the post, but the witnessed event could lead to physical injury or further abuse.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 02:52:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Been feeling so overwhelmed lately. Urges are back. Anyone know good coping mechanisms that actually work? Feeling lost.\"\n\n**Option 2 (Sharing Experience):**\n\n> \"It's been [Number] days clean. Still a struggle. Taking it one day at a time. You're not alone if you're fighting this too.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Just a reminder that self-harm isn't attention-seeking. It's a sign of deep pain. Be kind, always.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates the return of urges, suggesting potential self-harm risk even though help is being sought. Option 2 is a positive message, but acknowledges ongoing struggle. Option 3 raises awareness which is neutral in risk, but relevant to the overall context.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 02:51:05"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Scary how quickly things escalated. Made me think about my anger issues again. Anyone else struggle with that? Need to find better coping mechanisms.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and reflecting on personal anger issues. While the reflection is concerning, there's no direct threat or indication of imminent harm to self or others. It expresses a desire for better coping mechanisms.",
    "detected_category": "other",
    "timestamp": "2025-12-10 02:50:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Been feeling so overwhelmed lately, urges are back. Reached out to a friend, just needed to say it out loud. It helps, even a little. Remember you're not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports feeling overwhelmed with returning urges, which could indicate a risk of self-harm, but help-seeking behavior is present.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 02:49:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urges are getting stronger. Reached out to a friend, just need someone to listen. It's a struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The mention of \"urges getting stronger\" suggests an escalation of distress, indicating a potential risk that requires attention, despite reaching out for support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 02:48:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"It's been happening again. I feel so stupid for letting it. I just want it to stop. Anyone else feel this way? How do you even start to get out?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire for something to stop and feelings of distress. The phrase \"I just want it to stop\" and \"How do you even start to get out?\" suggest a potential crisis, but the nature of the problem is unclear.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 02:46:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but it was close. Please, if you're using, carry it. And look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a critical safety concern, as it indicates a potential ongoing risk of further overdoses in the area. While Narcan was successful this time, it highlights a significant risk of fatal overdose in the future if preventative measures or harm reduction strategies are not implemented.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 02:45:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm stuck in a hole. Reaching out before it gets worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a proactive step to reach out for help \"before it gets worse\", suggesting the potential for escalation. While not explicitly suicidal, the mention of feeling \"stuck in a hole\" indicates a need for support and monitoring.",
    "detected_category": "suicide",
    "timestamp": "2025-12-10 02:44:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Reached out to a friend instead of coping the way I used to. Small victory, but it matters. Still feels raw, but I'm here.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 83 (char 105)",
    "detected_category": "unknown",
    "timestamp": "2025-12-10 02:43:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thankfully. Makes you realize how fragile life is. Learn the signs & carry it if you can. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was successful, a person overdosing represents a significant risk to their immediate health. The incident highlights the presence of a dangerous situation and potential for fatality without intervention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 02:42:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, and a desire for help. While no direct threats are made, the heavy feelings and reaching out suggest potential for escalation if not addressed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-10 01:47:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital. My friend almost didn't make it. Please, if you're struggling, reach out. There are people who care and want to help. Don't let this happen to someone you love, or yourself.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text suggests a recent suicide attempt (or near-fatal self-harm event) of a friend, indicating a high risk of contagion and potential for further harm to the original poster or others.",
    "detected_category": "suicide",
    "timestamp": "2025-12-10 01:46:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nJust got out of the hospital after OD'ing. Scared straight. This can't happen again. Anyone know of good local support groups? Really need to talk to someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual recently overdosed and is seeking support, indicating a continued risk. While they express a desire to avoid future incidents, the recent overdose and need for support suggest vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 01:45:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Trying to distract myself, but it's hard. Anyone else relate? Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges and feelings of isolation, which suggests a potential for self-harm or other risky behaviors. While there is no explicit mention of intent, the feelings described warrant concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 01:44:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to talk to someone. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of persistent sadness and a desire to seek help, indicating a potential mental health concern. While not explicitly suicidal, the statement suggests a level of distress that warrants attention and support. The request for advice on finding help suggests a degree of insight and a desire for improvement, but also an acknowledgement of needing external assistance to manage their mental state.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 01:43:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to remember my coping skills. It's a daily battle. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges and feelings of being overwhelmed, suggesting a potential escalation of risk. While not explicitly stating suicidal intent, the mention of urges necessitates a moderate level of concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 01:41:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD hit way too close to home. Lost a friend last year. Please, if you're struggling, reach out. There are people who care & want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a friend's overdose death and encourages reaching out for help, indicating potential struggles with substance use or mental health. While not explicitly suicidal, the context suggests a heightened risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 01:40:58"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out to a friend, hoping it helps. It's hard to keep going sometimes.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and difficulty coping, suggesting potential for self-harm but doesn't indicate immediate intent.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 01:39:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank goodness. Reminded me how fragile life is. Learn the signs, folks. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, which is a life-threatening event, although the person survived due to Narcan. This indicates a potential risk for others in the area.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 01:38:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank God. Please, if you're using, have someone with you and have Narcan. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a witnessed opioid overdose, a life-threatening situation requiring immediate intervention. While Narcan was effective, the risk of death or serious harm was very present.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 01:37:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Thankfully, medics got there fast. Makes you realize how fragile life is. Learn the signs, people. Could save someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While medics intervened, a potentially fatal overdose occurred, indicating a moderate risk level to the individual who overdosed and potentially others present in the park.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 00:46:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary. Naloxone saved their life, thank goodness. Makes you think... everyone should carry it. Learn how to use it, seriously. Could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose, indicating a significant health risk. While the person survived, the event highlights a serious potential for fatal outcomes.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 00:45:11"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Said something, but feel like I should've done more. Anyone else ever witness something like that? What did you do? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, especially domestic violence, can be psychologically distressing and indicates a potential safety risk for the victim. While the immediate physical threat to the witness is low, the event suggests a possible escalation of violence and potential for further harm to the girlfriend.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 00:44:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad. Constant yelling, walking on eggshells... I don't know where to turn. Anyone else been through this? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home situation with constant yelling and feeling lost. While it doesn't explicitly mention violence or self-harm, the phrase \"walking on eggshells\" and the overall tone suggest a potentially volatile and emotionally harmful environment, increasing the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 00:43:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after OD'ing. Scared straight, I guess. Never thought it would happen to me. Anyone know good resources for recovery in [city/area]? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual recently overdosed and is seeking resources, indicating ongoing vulnerability even though they express a desire for recovery. The risk of relapse exists.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 00:42:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Feeling so lost. Things escalated again last night. I don't even know who I am anymore. Is this normal? I feel like I'm going crazy.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a significant level of distress, feeling lost and questioning sanity. The phrase 'escalated again last night' suggests a pattern of negative events, while 'I don't even know who I am anymore' points to identity crisis and potential emotional instability. While not explicitly suicidal or violent, the level of distress warrants concern.",
    "detected_category": "other",
    "timestamp": "2025-12-10 00:41:05"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Scary how quickly things escalated. Makes you think, y'know? Is there anywhere safe anymore?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight but does not indicate direct involvement or threat to the speaker, nor does it suggest specific plans for violence or harm. The question about safety is rhetorical and expresses concern rather than imminent danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 00:40:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is getting strong again. Reached out to a friend, hoping it helps. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a strong urge to self-harm, suggesting active distress. While the person has reached out for help, the immediate risk needs to be taken seriously.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 00:39:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. It's a reminder that addiction is a disease, not a choice. If you're struggling, please reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports an overdose event, indicating potential for harm or death, but doesn't directly involve or threaten the user.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 00:38:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a crisis line, and just talking helped a little. Remember you're not alone. There's help available.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating an immediate risk. While the person reached out for help, the persistence of the urge necessitates a high severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 00:36:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scary stuff. Narcan saved their life. Learn the signs and carry it if you can. It really works.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests potential for copycat behavior or emotional distress in the observer. While Narcan was effective, overdoses are inherently dangerous.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 23:17:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking feels impossible. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit suicidal or self-harm ideation. It is a general expression of distress and a request for shared experiences.",
    "detected_category": "other",
    "timestamp": "2025-12-09 23:16:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Terrifying. Narcan saved them. Carry it if you can, it’s so important. Where can I get trained?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, an overdose is a life-threatening event. The event highlights potential drug use in the area.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 23:15:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> Things are bad at home. Walking on eggshells constantly. Anyone know of resources for emotional abuse? Feeling so lost.\n\n**Option 2 (Sharing Experience):**\n\n> Never thought it would happen to me. Gaslighting is real. It messes with your head. Finally getting out.\n\n**Option 3 (Raising Awareness):**\n\n> My friend is being controlled by her partner. So worried. Subtle things, but adding up. How can I help her see it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional and psychological abuse, including gaslighting and controlling behavior. While not explicitly detailing physical harm, the situation could escalate, and the user is expressing distress and concern for themselves and a friend.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 23:14:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to stay strong & remember why I stopped. Anyone else feel this way? Just looking for some support.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, implying a struggle with something the person previously stopped. While not explicitly stated, this could be related to self-harm, substance use, or another harmful behavior. The request for support suggests awareness and a desire to cope, but the presence of urges elevates the risk beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 23:13:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but there is no explicit mention of self-harm, suicide, or harm to others. It appears to be a cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-09 23:12:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a bit. Remember, you're not alone. Talking can make a difference.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a high risk of potential harm. While the person reached out to a friend, the intensity of the urge necessitates immediate concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 23:11:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about another OD. Scared me. My brother's been struggling lately and I don't know what to do. Anyone have advice on how to talk to him about getting help? Really worried.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes concern for a brother who is struggling and the mention of an overdose suggests a potential risk. While not directly expressing suicidal intent or a current overdose, the brother's struggles and the expressed worry warrant attention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 23:10:29"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a lack of coping mechanisms. While not explicitly stating suicidal ideation, the metaphor of being 'underwater' and the plea for help suggest significant distress and a potential risk that needs further assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 23:09:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD…it's terrifying. Happened to my cousin last year. Please, if you're struggling, reach out. Don't let shame win. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While not explicitly stating intent, the text expresses fear and alludes to the risk of overdose (OD), a potentially fatal event. It also references a personal connection to a fatal overdose, suggesting a possible increase in vulnerability for the author or those they are addressing.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 23:08:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor OD last night. Scariest thing ever. Called 911, thankfully they made it. We gotta look out for each other. Learn the signs, carry Narcan. It saves lives. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing a neighbor's overdose indicates a critical, life-threatening situation. The text highlights the immediate need for emergency intervention (911 call) and suggests proactive measures to prevent future occurrences (carrying Narcan).",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 22:18:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were bad, but I distracted myself with a movie. Small victory, I guess. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges' which are unspecified but implied to be negative and difficult to manage, suggesting potential self-harm or suicidal ideation. While the person distracted themselves, the presence of these urges necessitates further assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 22:16:59"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight outside my kid's school. Shook me up bad. Makes you wonder what's going on with people, you know? Feeling really uneasy tonight.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing emotional distress. While unsettling, it doesn't indicate immediate danger to the author or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 22:15:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Naloxone saved them. Carry it, learn how to use it. It could save a life. Wish more people knew.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a safety risk in the environment and highlights the potential for further overdose events. While the individual was saved, the underlying issue and potential for future incidents raise the severity.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 22:14:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a memorial for someone lost to overdose. Hits hard. Addiction's a beast. If you're struggling, please reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text acknowledges the dangers of addiction and the tragedy of overdose but focuses on offering support and encouraging people to seek help. It doesn't express imminent harm or a specific plan.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 22:13:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just... heavy. Reaching out to a friend, but it's hard to explain. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of being lost, heaviness, and difficulty explaining emotions. While not explicitly stating suicidal intent, the combination of these factors suggests emotional distress that could escalate. Reaching out to a friend is a positive sign, but further assessment is needed to determine the level of risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 22:12:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad lately. Constant put-downs, controlling behavior... I feel so isolated. Has anyone else gone through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes experiencing emotional abuse and isolation, indicating potential for escalating distress and mental health issues. While not explicitly suicidal or violent, the situation warrants attention and support.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 22:11:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Been walking on eggshells lately. Partner's mood swings are exhausting. Is this normal in relationships? Starting to feel trapped. Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Feeling trapped and the potential for escalating emotional distress indicate a need for support and a risk of further harm, although immediate danger is not explicitly stated.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 22:10:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after ODing. Scared. Never thought it would happen to me. Reaching out for help is hard, but staying silent almost killed me. If you're struggling, please, please tell someone. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Recent overdose indicates a very high risk of recurrence and potential fatality.",
    "detected_category": "overdose",
    "timestamp": "2025-12-09 22:09:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. He's been isolating me from my friends and I'm scared. Is this normal in a relationship? I feel so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional and/or psychological abuse due to isolation from friends, coupled with fear and uncertainty, which poses a significant risk to the individual's well-being.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 22:08:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough night. The urges were strong, but I managed to distract myself. Small victory, I guess. Anyone else feel this way sometimes?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions strong urges that were difficult to manage, suggesting a potential risk. While the person claims to have distracted themselves, the nature of the urges is unclear and warrants concern. The open-ended question seeking similar experiences could indicate a need for support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 21:16:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming I just want to feel *something* else. Scared myself last night. Reaching out for help today. It's not a solution, I know that now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a desire to escape overwhelming feelings and a frightening action ('Scared myself last night'). While the person is reaching out for help and acknowledges the action wasn't a solution, the mention of self-scaring raises concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 21:15:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like I'm underwater. Reaching out before it gets worse. Anyone else feel this way? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of depression and hopelessness (\"feeling so low, like I'm underwater\") and indicates a desire to cope before the situation deteriorates (\"Reaching out before it gets worse\"). This suggests some awareness and help-seeking behavior, but the underlying feelings warrant concern and further investigation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-09 21:14:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been really bad lately. Walking on eggshells constantly. Is there anyone else who understands this feeling? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a distressed mental state and a potentially unsafe home environment, characterized by constant tension and feeling alone. While not explicitly mentioning self-harm or violence, the 'walking on eggshells' suggests a potentially volatile situation that requires further investigation to determine the extent of the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 21:13:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just left. Finally. My hands are shaking so bad. Is it normal to feel this lost even though I know it was the right thing? Any advice appreciated.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates emotional distress and anxiety (shaking hands, feeling lost) but lacks explicit mentions of self-harm, suicide, violence, or abuse. The user is seeking advice, suggesting a desire to cope healthily.",
    "detected_category": "other",
    "timestamp": "2025-12-09 21:12:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a bit. Just trying to get through tonight. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a serious and immediate risk to the individual's safety. While the person reached out for help, the intensity of the urge suggests a need for urgent intervention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-09 21:11:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Anyone else been through this?\n\n**Option 2 (Personal Story):**\n\n> Thinking about my friend today. Wish he'd known how much he mattered. Please check in on your loved ones.\n\n**Option 3 (Raising Awareness):**\n\n> It's okay to not be okay. Talking about it is the first step. There's help out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and heavy, and encourages seeking help and checking in on loved ones. While there is mention of a friend and wishing they knew how much they mattered, it does not explicitly express suicidal ideation or intent. It primarily focuses on seeking support and raising awareness.",
    "detected_category": "other",
    "timestamp": "2025-12-09 21:10:45"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend in the street. Froze. Someone called the cops, but I feel sick. Is there anything else I could have done? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be traumatizing and lead to psychological distress. The text indicates the person feels \"sick\" and \"helpless,\" suggesting a significant emotional impact.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 21:09:42"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Dude got knocked out cold. Makes you think, ya know? Is there anywhere safe anymore? Scared to walk alone now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent event can cause distress and fear, suggesting a potential impact on mental well-being and feelings of safety. The statement 'Scared to walk alone now' indicates a tangible change in behavior due to the event.",
    "detected_category": "violence",
    "timestamp": "2025-12-09 21:08:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, walking on eggshells... Anyone else experience this? Feeling so alone. Need to figure out next steps.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive environment with emotional distress. The user expresses feeling alone and needing to figure out next steps, implying a desire for change and potential escalation if the situation worsens.",
    "detected_category": "abuse",
    "timestamp": "2025-12-09 21:07:39"
  }
]