[
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, with a plea for help, suggesting potential for escalation if unaddressed.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 15:17:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Narcan saved them, but it really shook me up. Anyone know where I can learn more about overdose prevention in the city?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a significant risk of overdose in the area. While the individual was saved, the event was impactful and highlights the potential for future, possibly fatal, overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 15:16:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a significant risk. While the person has reached out for help, the urge itself suggests a high level of distress and potential for immediate action.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 15:15:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Reached out to a crisis line, just needed someone to listen. It helped a little. Taking it one hour at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges and feelings of being overwhelmed, suggesting an increased risk. Reaching out for help is a positive sign, but the urges persisting warrants a medium severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 15:14:08"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get punched outside the bar. Shook me up. Is it always gonna be like this? Feels like anger is everywhere lately. Anyone else feeling it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports of violence outside a bar, though a single incident, suggests a potential risk of further altercations and harm to others in the area. The feeling of widespread anger also contributes to the concern.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 15:13:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were strong, but I distracted myself with music & a walk. Still shaky, but didn't give in. Small win. Anyone else feel this way sometimes?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges, suggesting a significant level of distress. While the individual used coping mechanisms, the shaking suggests the intensity of the urges and potential for escalation if coping mechanisms fail.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 15:12:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Shook me up bad. Narcan saved him. Learn the signs, people. It could save a life you know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event that can have a significant emotional impact. The fact that Narcan was needed indicates a potentially fatal situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 15:11:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a memorial for someone lost to overdose. Hurts so much. If you're struggling, please reach out. There's help available, you don't have to go through this alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a fatal overdose, suggesting the potential for similar incidents or ongoing struggles with substance use leading to overdose. While the message is supportive, the context indicates a tangible risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 15:10:01"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Never seen anything like it. Shook me up bad. Makes you wonder, you know?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling, but the text doesn't indicate immediate danger to the speaker or others. The speaker expresses being shaken up, but not directly threatened or planning any harmful actions.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 15:09:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are strong. Trying to distract myself, but it's hard. Anyone else relate? Just feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions strong urges and feelings of isolation, which are potential risk factors for self-harm or suicidal ideation. While not explicitly stated, the combination of these factors warrants a medium severity assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 15:07:58"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so overwhelmed lately. It's hard to see a way out. Talking to someone feels impossible, but I know I need to.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of overwhelm and hopelessness, suggesting a potential for escalation. The individual acknowledges the need for help but feels unable to reach out, indicating a barrier to support.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 14:17:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so trapped. Has anyone else dealt with this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and a feeling of being trapped, which can escalate to further safety risks. The controlling behavior mentioned can involve a range of dangers.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 14:16:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved their life. Carry it, learn how to use it, you might save someone's life too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event, which is a serious medical emergency. While the person survived due to Narcan, the potential for fatality associated with overdose indicates a medium level of risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 14:15:10"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight. Hope it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, metaphorically described as 'underwater.' Reaching out to a friend is a positive sign, but the underlying distress warrants a 'medium' severity. The phrase 'It's okay to not be okay, right?' suggests seeking reassurance, indicating vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 14:14:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Didn't want to, but I relapsed. Day 1 again. Reaching out for support this time. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse suggests potential for harm (e.g., overdose, self-harm) depending on the substance/behavior relapsed to. The expressed feeling of being overwhelmed further increases concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 14:13:07"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting on the street. He shoved her, hard. I froze. Wish I'd said something, done something. Now I just feel sick. Anyone else ever deal with this? What do you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a violent act (shoving) with potential for physical harm. While the immediate danger might be over, the potential for escalation or repeated abuse is present. The poster also expresses distress, indicating a possible impact on their mental well-being.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 14:12:06"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up. Is this normal now? Feeling so unsafe lately.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Observed violence resulting in significant injury (loss of consciousness). Indicates a potential risk to public safety and personal vulnerability.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 14:11:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating potential emotional distress and a plea for help. While not explicitly suicidal, the metaphor of being 'underwater' and feeling lost can suggest a sense of hopelessness.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 14:10:02"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Still reeling from my last relationship. Gaslighting messes you up, makes you doubt everything. Anyone else been through this? How do you even start to trust yourself again?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses emotional distress and a lack of self-trust due to past gaslighting. While the user is suffering, there is no explicit mention or implication of self-harm, suicide, violence, or substance abuse.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 14:09:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. I feel so stupid for letting him back in. I don't know what to do anymore. Feeling trapped and ashamed. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, feelings of being trapped and ashamed, and a possible abusive relationship (implied by 'letting him back in' and 'happening again'). While there's no explicit mention of self-harm or suicide, the intense negative emotions and feeling trapped raise concerns.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 14:07:58"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Scared. My neighbor's been screaming for hours. Sounds like things are getting broken. Called the cops but they haven't come yet. Don't know what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Screaming, breaking objects, and the neighbor's distress suggest a potential escalation to violence or abuse. The delayed police response increases the risk to the neighbor and potentially the reporting individual.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 13:25:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just needed someone to listen. It helps. If you're struggling too, you're not alone. 💚",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges' which suggests a potential risk, although the person reached out for help, indicating some protective factors.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 13:24:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need to. Talking to someone tomorrow. It's a start.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and a lack of motivation, indicating a potential risk of self-harm or suicidal ideation. While the person is reaching out for help and has a plan to talk to someone, the presence of negative emotions warrants a medium severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 13:23:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back, stronger than before. Reached out to a friend, just needed to say it out loud. It helps, even a little. Remember you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges, suggesting a potential risk of engaging in a harmful behavior. While the individual reached out for help, the intensity of the urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 13:22:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so isolated. Has anyone else dealt with this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, suggesting emotional abuse and isolation. While there's no explicit mention of physical harm or immediate danger, the emotional distress and feeling of being isolated raise concerns and warrant further investigation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 13:21:08"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad lately. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? How did you find help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional and psychological abuse (put-downs, controlling behavior) leading to feelings of isolation. While not explicitly stating harm, the situation described poses a risk to the individual's well-being and mental health. The request for help suggests a desire to change the situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 13:20:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. He's been isolating me from my friends and gets angry over little things. Is this normal? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes isolation, controlling behavior, and expressions of feeling alone, suggesting potential emotional abuse and increased risk of escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 13:19:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Clean for a few weeks, but relapsed tonight. Feels like such a failure. Reaching out before it gets worse. Anyone else been there?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety suggests a potential for escalation of substance use. The feeling of failure and reaching out before it gets worse indicates awareness and a desire to prevent further negative outcomes, but the risk is present.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 13:18:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Trying to distract myself but it's hard. Anyone else relate? How do you cope? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges, suggesting a potential struggle with mental health or addiction. While not explicitly stating intent, the need for coping mechanisms and a feeling of isolation raise concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 13:17:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming. Feeling like I just need to feel *something* else, even if it hurts. Trying to find healthier ways to cope. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses overwhelming feelings and a desire for self-soothing, but lacks specific plans or intent for self-harm. It mentions trying to find healthier coping mechanisms, which is a positive sign.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 13:16:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing on the street, escalated so fast. He shoved her, I froze. Should I have done something? Feeling sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence (shoving) occurred, indicating a potential for further escalation and harm. While the observer wasn't directly harmed, the situation could escalate or the woman involved could be at risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 12:23:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them. Please, if you or someone you know is struggling, get help. There's resources out there. Don't be afraid to use them.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event and indicates a risk of potential harm and death, even though Narcan was administered. The prompt emphasizes seeking help for addiction.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 12:22:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"I keep making excuses for him, but last night... I don't even know anymore. Is this normal? I feel so lost and scared. Has anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests the person is in distress, scared, and unsure if their situation is normal. The implicit reference to 'him' and making excuses hints at a potentially abusive situation. The feeling of being lost and scared elevates the risk beyond 'low'.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 12:21:13"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard shouting next door again last night, then a crash. Wish I knew what to do. Hate feeling so helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While there's no direct threat to the individual, the shouting, crash, and feeling of helplessness suggest potential violence or abuse next door, causing significant distress to the individual. The proximity to the situation elevates the risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 12:20:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Just wanted to say if you're struggling, you're not alone. Talking to someone really does help. 988 is a good place to start.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being 'heavy' and struggling, suggesting potential mental health distress. The recommendation of 988 indicates awareness of suicidal ideation or mental health crisis, but the message also encourages seeking help.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 12:19:10"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight outside my kid's school today. So messed up. Makes you wonder what kind of world we're raising them in. Anyone else feeling this lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A fight witnessed near a school suggests a potential risk of violence impacting children and the community. While not directly threatening or detailing specific plans, the observed violence raises concerns about safety and the environment children are exposed to.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 12:18:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to a friend helped a little. If you're struggling too, please reach out to someone. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but also indicates help-seeking behavior (talking to a friend and encouraging others to reach out). There are no explicit mentions of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2026-01-04 12:17:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... rough. Walking on eggshells constantly. Is this normal? Feeling so lost and alone. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a stressful and potentially harmful home environment. \"Walking on eggshells\" suggests potential emotional abuse or conflict. The feelings of being lost and alone amplify the concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 12:16:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Old coping mechanisms creeping back in. Reached out to a friend, which helped a bit. Remember we're not alone in this. <3",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of old coping mechanisms, suggesting a potential relapse into harmful behaviors. While the individual reached out for help, the overwhelmed feeling and reliance on old coping mechanisms raise concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 12:15:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Still processing things my ex said. Gaslighting is real, and it messes with your head. Anyone else been through this? How did you start to heal?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes past emotional abuse (gaslighting) and seeks advice on healing, but does not express immediate danger or intent to harm self or others.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 12:14:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Please, if you're using, carry it. Could save a life. I'm still shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A person overdosed and, while Narcan was administered successfully, the event still represents a life-threatening situation. The text indicates significant emotional distress.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 11:16:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scared me senseless. They're okay now, thankfully. But where do you even learn how to help in that situation? Feel so unprepared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event and indicates the presence of potentially life-threatening situations in the environment. While the person survived, the experience caused significant distress to the witness and highlights a lack of preparedness, suggesting a potential need for resources and training in harm reduction.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 11:15:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Narcan saved his life. Learn the signs of an overdose, please. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a high immediate risk to life.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 11:14:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a bit. Taking it one hour at a time. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a high risk of potential harm. While the person has reached out to a friend, the persistence of the urge warrants serious concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 11:13:19"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"He's been getting worse. Yelling turned to pushing. Now I'm scared. Anyone know resources for domestic abuse in [city/state]? I feel so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Escalating violence with a clear expression of fear indicates a high risk of severe harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 11:12:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park yesterday. Scary stuff. Narcan saved him, but it shook me up. Anyone know where I can get trained to use it, just in case? Feel helpless now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the individual survived, indicates a potential public health crisis and highlights the risk of overdose deaths in the area. The reporter's distress and desire to obtain Narcan training suggests a concern about future incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 11:11:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost died last night from an OD. Scared me senseless. Please, if you're struggling, reach out. There are people who care and want to help you stay safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event that almost resulted in death, indicating a high level of immediate danger and potential for recurrence for the friend or others.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 11:10:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Just realized patterns in my relationship might be abuse, not just 'rough patches.' Feeling lost & scared. Anyone else been through this? Where do I even start?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses fear and a realization that their relationship might be abusive, indicating potential for ongoing harm. The feeling of being 'lost' suggests vulnerability and a need for support.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 11:09:13"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Just trying to get through the day without giving in. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with urges, suggesting a potential risk of relapse. While the user is expressing a desire to resist, the return of urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 11:08:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, and it helped a little. Just trying to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a strong urge to self-harm, which constitutes a serious immediate risk to the individual's safety.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 11:07:10"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, and reaching out for help suggests a potential for escalating distress if support is not received. The metaphor of being 'underwater' can indicate feelings of suffocation and hopelessness.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 10:17:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just need to vent. He yelled again, smashed a plate. I hate this. Feels like walking on eggshells constantly. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a pattern of controlling, angry behavior including yelling and property destruction, causing the writer to feel anxious and unsafe. While there's no explicit threat of physical harm, the mention of 'walking on eggshells' suggests emotional abuse is occurring and escalation is possible.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 10:16:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Walking on eggshells all the time. Anyone else feel like they're losing themselves? Is there help out there?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional distress and a difficult home environment, possibly involving abuse. The phrase 'walking on eggshells' is a common indicator of a strained or volatile situation. Asking for help suggests the individual recognizes they are struggling.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 10:15:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Please, if you're using, have someone with you and Narcan. It saves lives. Learn the signs of an OD. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event. The urgency in the plea for Narcan and awareness of overdose signs indicates a high level of immediate danger and potential for repeated occurrence.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 10:14:28"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Scary how quickly things escalated. Made me realize I need to learn some self-defense. Any recommendations for classes in the city?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potential safety risk, but the individual's response focuses on learning self-defense rather than indicating immediate danger or involvement. It's a reaction to a situation rather than a current threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 10:13:26"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel so trapped. Anyone else been through this? How did you find the strength to leave?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation with controlling behavior and put-downs, indicating possible emotional abuse and feelings of being trapped. While not explicitly stating physical harm, this environment can significantly impact mental health and increase the risk of escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 10:12:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Just trying to get through it minute by minute. Anyone else relate? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges and feelings of loneliness, suggesting a potential for self-harm or other negative coping mechanisms. While there's no explicit mention of suicide or self-harm, the return of urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 10:11:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get too much, y'know? Like the only way to quiet the noise is to hurt. I'm trying really hard to stop, but it's so hard. Anyone else feel this? Any tips that actually help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a desire to self-harm as a coping mechanism and indicates difficulty in stopping. The user is actively seeking help but admits to struggling, suggesting a high risk of self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 10:10:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but it shook me. We need more resources, more help. Is anyone else feeling helpless about this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Observed overdose incident suggests potential for future occurrences and highlights a lack of resources, indicating a continuing risk. While Narcan was effective in this instance, it points to an ongoing issue.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 10:09:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking help):**\n\n> \"Things are rough at home. Walking on eggshells all the time. Anyone know where I can find local resources for domestic abuse?\"\n\n**Option 2 (Sharing a personal story):**\n\n> \"Never thought it would happen to me. Gaslighting is real. I'm slowly starting to see things for what they are.\"\n\n**Option 3 (Raising awareness):**\n\n> \"Emotional abuse leaves invisible scars. Check in on your friends, you never know what someone's going through behind closed doors.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions potential domestic abuse and gaslighting, indicating a risk of ongoing harm. The user is actively seeking resources, suggesting an awareness of the situation and a desire for help.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 10:08:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Narcan saved him. Please, if you're using, keep it close. It could save a life. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a high risk situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 09:18:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The constant put-downs are chipping away at me. Anyone else feel like they're walking on eggshells all the time? Is this normal in relationships? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, feelings of being undermined, and questioning the normalcy of the relationship dynamic. While there's no explicit mention of self-harm or suicide, the expressed feeling of being 'lost' and the description of a potentially abusive environment (constant put-downs, walking on eggshells) suggests a need for intervention and monitoring.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 09:16:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it feels like the only way to quiet them is to hurt. Trying to find other ways to cope. Anyone else feel this? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to hurt oneself as a way to cope with overwhelming thoughts, indicating a potential risk of self-harm. While the person is seeking alternative coping mechanisms, the explicit mention of self-harm elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 09:15:57"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of things at home. Anyone else feel on edge after witnessing something like that? Need to vent.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be upsetting and trigger negative emotions or memories, but the text doesn't suggest imminent harm to self or others.",
    "detected_category": "other",
    "timestamp": "2026-01-04 09:14:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on where to start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, coupled with a recognition of needing help but feeling unable to reach out. This suggests a potential for escalating distress if left unaddressed.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 09:13:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. I feel so stupid for letting it. Walking on eggshells constantly. Does anyone know resources for emotional abuse? I need to get out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of emotional abuse and a desire to escape the situation, indicating potential for escalation and negative mental health outcomes. The phrase \"walking on eggshells constantly\" is a common indicator of a strained or abusive relationship. The request for resources suggests an awareness of the problem and a desire for help, but also highlights the seriousness of the situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 09:12:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... Scares me. Lost a friend last year. If you're struggling, please reach out. There are people who care & want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern and fear related to overdoses and losing a friend. While it doesn't indicate immediate danger to the author or anyone else, the mention of a past loss and the plea for help suggest a heightened vulnerability to overdose or related mental health struggles within the author's social circle. This warrants a 'medium' rating due to the potential risk and encouragement of seeking help.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 09:11:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so overwhelmed lately. Just reaching out to see if anyone else has felt this way and has any advice. It's hard to explain, but I'm just feeling really lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and lost, but does not contain any specific indications of self-harm, suicidal ideation, violence, abuse, or overdose. It appears to be a general expression of distress.",
    "detected_category": "other",
    "timestamp": "2026-01-04 09:10:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing way too many RIP posts lately. Lost another friend to an OD. Please, if you're struggling, reach out. There are people who care. I'm here to listen too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about a friend's death due to overdose and mentions others. This indicates a potential for further overdose events and highlights the presence of struggle and vulnerability within the social circle.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 09:09:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things aren't good at home. Walking on eggshells all the time. Is this normal? Anyone else go through this? I just feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially unsafe home environment and emotional distress. While not explicitly stating violence or abuse, the phrase 'walking on eggshells' suggests fear and tension, raising concern for potential harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 09:08:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD. It's terrifying. Happened to my cousin last year. Narcan saved his life. Learn the signs, folks. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a personal experience with overdose (OD) and highlights the potential for it to happen to anyone, suggesting a real and present danger. While Narcan was successful in this instance, the mention of a cousin's OD and the term 'terrifying' point to a significant impact and potential for future risk to others related to drug use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 08:20:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy and I don't know where to turn. Talking to someone feels impossible, but I know I need help. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and a desire for help, suggesting emotional distress and potential for escalation if support is not received. The inability to talk to someone is a concerning barrier.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 08:19:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, walking on eggshells... Feels like I'm losing myself. Anyone else been through this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (put-downs, walking on eggshells) which indicates a potentially unsafe environment and negative impact on mental well-being. The user is seeking help, suggesting a desire to change the situation, but the level of immediate danger is unclear.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 08:18:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Reached out to a friend, just need someone to listen. It helps, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The return of stronger urges indicates increased risk. Reaching out is a positive coping mechanism, but the persistence and intensity of urges suggest ongoing vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 08:17:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. So much anger... Anyone else feel like things are getting more volatile lately? Need to process this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling shaken, but does not indicate direct involvement or imminent threat to self or others. It expresses a feeling of increased volatility and a need for processing, which suggests distress but not necessarily a high-risk situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 08:16:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm drowning. Reaching out before it's too late. Anyone else feel this way? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses feelings of hopelessness, a desire for help before it's \"too late,\" and a sense of isolation, all indicators of potential suicidal ideation and imminent risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 08:15:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so numb lately. The urge to feel *something* is overwhelming. I know it's not healthy, but it's hard to resist. Anyone else ever feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to feel *something*, coupled with an acknowledgement that the urge is unhealthy and hard to resist. This suggests a potential for risky behavior to achieve that feeling, although the exact nature is unclear.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 08:14:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scary stuff. Called 911, they're gonna be ok. Makes you think... know the signs, carry Narcan. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A drug overdose occurred, requiring emergency intervention. While the person will be ok, the situation presents a significant health risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 08:13:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just reaching out to see if anyone else understands. It's hard to keep going sometimes.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and difficulty coping, but lacks specific intent or plan for self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 08:12:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but does not explicitly mention self-harm, suicide, or violence. It's a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2026-01-04 08:11:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Trying to resist, but it's hard. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating a significant risk, even though the person is trying to resist. The phrase 'it's hard' suggests the individual is struggling to maintain control.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 07:19:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Taking it one hour at a time. If you're struggling too, you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk of harm to self. While the individual reached out to a friend, the intensity of the urge signifies a serious situation requiring immediate attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 07:18:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Just constant pressure and can't see a way out. Talking to a therapist, but it's slow going. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, constant pressure, and no way out. While mentioning therapy is a positive, the intensity of negative feelings suggests a risk of escalation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 07:17:41"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a fight break out on the bus. Shook me up. Reminded me of things back home. How do you guys deal with feeling unsafe in public?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and can trigger negative emotions, but the individual is primarily expressing feeling shaken and unsafe, not actively planning or engaging in violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 07:16:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs & feeling like I'm walking on eggshells. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with emotional abuse (put-downs) and chronic stress (walking on eggshells), indicating a potential for escalating distress and negative mental health outcomes. The feeling of isolation exacerbates the risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 07:15:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "I feel so lost. Things at home have been bad for a while, but last night... I don't even know what to do anymore. Is this normal? How do I get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feeling lost, overwhelmed, and a desire for help, suggesting potential distress and need for support. The reference to 'things at home being bad' is concerning.",
    "detected_category": "other",
    "timestamp": "2026-01-04 07:14:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are strong. Trying to distract myself, but it's hard. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and difficulty coping, suggesting an elevated risk of acting on those urges. While it doesn't explicitly mention self-harm or suicide, the intensity of the distress warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 07:13:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been feeling so isolated lately. Constant put-downs disguised as \"jokes\" are really getting to me. Is this normal in relationships? Starting to doubt myself.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress due to ongoing belittling behavior in a relationship, leading to self-doubt. While not explicitly stating intent to harm self or others, the isolation and emotional impact suggest a potential escalation if the situation persists.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 07:12:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. Constant yelling, put-downs. I feel so small. Anyone else been through this? How do you even start to fix it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 66 (char 91)",
    "detected_category": "unknown",
    "timestamp": "2026-01-04 07:11:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so overwhelmed lately. Just talking about it feels like a weight lifted. If you're struggling too, please reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and encourages seeking help, indicating a struggle but not explicitly mentioning self-harm, suicide, or harm to others.",
    "detected_category": "other",
    "timestamp": "2026-01-04 07:10:30"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got decked, right in front of me. Shook me up. Is it just me, or is everyone on edge lately? Makes you wonder.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Reports witnessing an isolated act of violence. While concerning, it doesn't indicate an ongoing or widespread threat to the reporter or others. The emotional distress is noted, but there's no specific threat implied.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 06:22:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nSaw someone OD downtown today. Scary stuff. Narcan saved them, thank god. Reminds me why we gotta look out for each other & know the signs. Is there naloxone training nearby? Need to get certified again.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential public health crisis and direct risk to individuals using drugs. While Narcan was administered successfully, the event highlights the ongoing danger and the need for preparedness.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 06:21:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is getting stronger. Reached out to a friend, hoping it helps. It's so exhausting fighting this every day.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates an increasing urge to self-harm, which suggests a worsening situation and potential risk. While the person reached out for help, the intensity of the urge warrants a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 06:20:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming I just want to feel *something* else. Scared I'll go too far one day. Talking helps, but it's so hard to start. Anyone else feel this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to feel something else due to feeling overwhelmed and a fear of going too far, which suggests potential self-harm. The difficulty in initiating conversation also raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 06:19:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so heavy lately. Like I'm underwater. Reaching out for help feels impossible. Anyone else been there? How did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and difficulty seeking help, which could indicate a risk of escalating distress. The question at the end is a help-seeking behavior that suggests awareness and some level of desire for support, but the initial statements point to a concerning level of emotional burden.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 06:18:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after OD'ing. Scared. Didn't think it would happen to me. If you're struggling, please reach out. There are people who care. #overdoseawareness #recoveryispossible",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The individual recently overdosed, indicating a high risk of future overdose or self-harm.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 06:17:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nScary night. Found my brother unresponsive. Narcan saved him. Please, learn the signs of an overdose. It could save someone you love. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Brother found unresponsive and saved with Narcan, indicating a life-threatening overdose situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 06:15:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found out a friend OD'd. Narcan saved them, thank god. It's scary how easily this happens. Please, carry it if you can. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan intervention was successful, the text describes a recent overdose event involving a friend, indicating a real and present risk, and highlights the ease with which overdoses occur.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 06:14:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scary. Narcan worked, thank god. Makes you realize how fragile things are. Learn CPR and how to use it. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a risk of future overdoses in the area and potential for second-hand trauma. While Narcan was effective, it highlights a serious public health concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 06:13:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Talking feels impossible, but I need to try.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed (\"underwater\"), and a desperate need for help, indicating potential emotional distress and a struggle to cope.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 06:12:53"
  }
]