[
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got bad again last night. Just trying to get through today. Anyone know any good distractions that actually work? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse and feelings of isolation, suggesting a potential for escalation. The mention of 'bad again' implies a history or pattern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 22:19:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nMy friend almost died last night from an overdose. Scariest thing I've ever been through. Learn the signs, carry Narcan. You could save a life. It's not worth losing someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose experienced by a friend, indicating a high risk event.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 22:18:16"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Frozen. Didn't know what to do. Feeling sick about it now. Anyone else ever witness something like that? How do you even react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an assault can cause psychological distress and fear for the victim's safety. While the witness is not directly at physical risk, the event points to potential for escalating violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 22:17:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells lately. Hard to explain, but my partner's mood swings are getting scary. Anyone else experience this? Feels like I'm losing myself. Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling scared and losing oneself due to a partner's mood swings, suggesting potential emotional abuse or a volatile situation with unpredictable behavior. While not explicitly stating violence, the term 'scary' indicates a potential threat.",
    "detected_category": "abuse",
    "timestamp": "2026-01-27 22:16:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so overwhelmed lately. Everything feels heavy. Reaching out because I don't know what else to do. Has anyone else felt this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of overwhelm and being burdened, but lacks specific ideation or plans for self-harm or harm to others. It's a general expression of distress and a call for support.",
    "detected_category": "other",
    "timestamp": "2026-01-27 22:15:10"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside the bar. Dude got knocked out cold. Shook me up. Anyone else feel like things are getting more aggressive lately? I'm kinda scared to walk home alone now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent altercation resulting in someone being knocked unconscious indicates a potential risk of violence. The person is now expressing fear for their own safety.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 22:14:09"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night, guy got seriously hurt. Shaken up. Makes you realize how quickly things can escalate. Anyone else witness that? Hope he's okay.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a violent altercation resulting in serious injury, indicating a significant risk of harm. The observer also expresses being 'shaken up', suggesting a psychological impact.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 22:13:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been really bad lately. Feeling trapped and scared. Anyone know of resources in [City/Region] to get help? I just need to know where to start.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feeling trapped and scared at home, suggesting potential abuse or a dangerous domestic situation. The request for resources indicates a need for help and a possible escalation if needs are unmet.",
    "detected_category": "abuse",
    "timestamp": "2026-01-27 22:12:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved their life. Please learn how to use it. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was used to save the person, the text describes a recent overdose event which indicates a potential risk of future overdoses within the person's social circle. This highlights a real and present danger, although not directly threatening the speaker.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 22:11:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. They're okay now, thankfully. Made me realize how close to home this is. Anyone know resources for friends who might be struggling?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person who overdosed is now okay, the incident indicates the presence of drug use and potential overdose risk in the community. The person reporting is actively seeking resources, suggesting concern for others who might be at risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 22:10:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm drowning and can't find the surface. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, suggestive of potential mental health distress. The phrase 'drowning and can't find the surface' indicates a significant struggle. While there's no explicit mention of self-harm or suicide, the intensity of the negative emotions warrants concern and further inquiry.",
    "detected_category": "suicide",
    "timestamp": "2026-01-27 21:16:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells lately. He gets so angry over nothing. Just wish I knew what I was doing wrong. Anyone else feel this way? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation where the author feels they are 'walking on eggshells' due to someone else's anger. While not explicitly stating violence or abuse, this language often indicates a controlling or potentially emotionally abusive environment. The feeling of being 'lost' also raises concern for the author's mental wellbeing.",
    "detected_category": "abuse",
    "timestamp": "2026-01-27 21:15:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street. Loud, scary. Reminded me of my parents. Anyone else freeze up in those situations? Feel so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling helpless, but doesn't indicate immediate danger to the author or others. It expresses emotional distress rather than a direct threat or intent to harm.",
    "detected_category": "other",
    "timestamp": "2026-01-27 21:14:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown. Scary. Naloxone saved them, but it was close. Learn CPR & carry Narcan, ppl. It really can save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Naloxone was effective, the situation was described as 'close', implying a significant risk to life. Witnessing an overdose can also be psychologically distressing.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 21:13:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice or just someone to listen?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost, overwhelmed, and reaching out for help, indicating potential emotional distress and a need for support. While no specific plan is mentioned, the feeling of being 'heavy' and not knowing what else to do warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-27 21:12:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Feeling really low lately. Like, *really* low. Reaching out before things get worse. Anyone know any good resources?\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Been there. Dark place. Talking helped. If you're struggling, please find someone. You're not alone.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Lost a friend. Suicide is never the answer. Check in on your loved ones. You never know what they're going through.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions suicide and alludes to suicidal ideation through phrases like \"really low lately\" and \"before things get worse,\" alongside the loss of a friend to suicide. While the text also promotes seeking help and support, the presence of suicide and potential suicidal feelings elevates the risk severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-27 21:11:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, gonna try to get through this. It's a struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a strong urge to self-harm, which presents an immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 21:10:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Cutting again after 6 months clean. Just needed to tell someone. Feels like I'm drowning. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Relapse into self-harm after a period of clean time, feelings of being overwhelmed and drowning, and reaching out for help are all indicators of a high level of distress and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 21:09:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**(Option 1: Seeking Help)**\n\n> Rough day. Urges are strong. Anyone know good distractions that actually work? Feeling overwhelmed.\n\n**(Option 2: Sharing Experience)**\n\n> Been clean for a month. Still a struggle, but celebrating small wins. It *is* possible.\n\n**(Option 3: Raising Awareness)**\n\n> It's not attention-seeking. It's a coping mechanism. Let's be kinder to those who are hurting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates strong urges and feeling overwhelmed, suggesting a potential risk of self-harm or relapse. While not explicitly suicidal, the intensity of the urges warrants concern. Option 2 is positive, but Option 1 overrides it. Option 3 aims to foster understanding.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 21:08:38"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Frozen. Didn't know what to do. Still shaking. Anyone else ever witness something like that? What did you do? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent act can cause significant distress and emotional trauma. While the original poster is not in immediate physical danger, the experience could have lasting psychological effects and could escalate if the abuser is not stopped.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 21:07:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm drowning and no one can see me. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, with language suggesting potential emotional distress and a cry for help ('drowning and no one can see me'). While not explicitly stating suicidal intent, the intensity of the feelings warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-27 20:19:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic post focusing on seeking help:\n\n\"Things have been really dark lately. Feeling overwhelmed and like I can't see a way out. Reached out to a helpline, hoping it helps. Just need a little light right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of being overwhelmed, hopelessness ('can't see a way out'), and darkness, suggesting a potential mental health crisis. Reaching out for help is a positive sign, but the underlying distress warrants a 'medium' severity rating.",
    "detected_category": "suicide",
    "timestamp": "2026-01-27 20:18:22"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside my building. Shaking. Called the cops but feel so helpless. Anyone else feel like anger's just... everywhere lately? Need to breathe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be psychologically distressing and the feeling of helplessness suggests emotional distress. While not directly threatened, the text indicates a potential for escalation in the environment and personal anxiety.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 20:17:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good lately. Walking on eggshells constantly. Don't know where to turn. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 87 (char 112)",
    "detected_category": "unknown",
    "timestamp": "2026-01-27 20:16:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, coupled with a desire to seek help. While not explicitly suicidal, the expression of hopelessness and reaching out suggests potential for escalation without support.",
    "detected_category": "suicide",
    "timestamp": "2026-01-27 20:15:16"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough lately. Walking on eggshells constantly. Is this normal in a relationship? Feeling so lost and scared.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of fear, being lost, and constant stress ('walking on eggshells'). While not explicitly stating harm, it indicates potential emotional distress and a potentially unhealthy relationship dynamic.",
    "detected_category": "abuse",
    "timestamp": "2026-01-27 20:14:15"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. I yelled, asked if she was ok. He glared, she just pulled him away. Wish I'd done more. Feeling helpless. Anyone else ever witness something like that? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical altercation (shoving) indicates potential for escalation and harm to the victim. The observer's feelings of helplessness also suggest a concerning situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 20:13:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been feeling so isolated lately. Constant put-downs are really getting to me. It's like I can't do anything right. Anyone else experience this? How do you cope? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of isolation, low self-worth, and being put down, indicating potential emotional distress. The feeling of being 'lost' can be a precursor to more severe mental health issues. While no explicit self-harm or suicidal ideation is present, the combination of factors warrants attention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-27 20:12:11"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. My hands are still shaking. Wish I'd said something, anything. Is there ever a right way to intervene? Feeling sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a man shove his girlfriend suggests a potential incident of violence or abuse. The reporter's emotional distress (shaking hands, feeling sick) indicates the event was disturbing and potentially escalatory. While the immediate physical risk is to the girlfriend, the witness's emotional state and uncertainty about intervention suggests a need for awareness of safe bystander intervention strategies.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 20:11:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it feels like the only way to turn the volume down is... not good. I'm trying to find better ways to cope. Anyone else relate? Feeling pretty alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses a desire to reduce overwhelming thoughts through potentially harmful means, though they explicitly state they are looking for better coping mechanisms. The phrase \"not good\" implies a consideration of self-harm or suicidal ideation. They also express feelings of loneliness, which is a risk factor.",
    "detected_category": "suicide",
    "timestamp": "2026-01-27 20:10:07"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and being overwhelmed, which can be precursors to more severe actions. The user is reaching out for help, indicating a potential need for intervention.",
    "detected_category": "suicide",
    "timestamp": "2026-01-27 19:23:19"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Walking on eggshells constantly. Anyone else feel like they're losing themselves trying to keep the peace? Is there a way out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a stressful and potentially harmful home environment. Walking on eggshells and feeling like one is losing themselves to keep the peace can be indicative of emotional abuse or a volatile situation. The question 'Is there a way out?' suggests a desire to escape the situation, implying a level of distress that warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-27 19:22:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are strong. Reached out to a friend, feels a tiny bit lighter. Remember you're not alone. Talking helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Presence of strong urges suggests potential for self-harm, mitigated slightly by reaching out to a friend.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 19:21:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Narcan worked, thankfully. Keep it with you, folks. It saves lives. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event indicating potential risk to the individual who overdosed and highlighting the presence of dangerous substances in the environment. While Narcan was effective, the event is still concerning.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 19:20:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but shook me to my core. Please, know how to use it. It can save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports an overdose event, indicating potential for serious harm or death. While Narcan was effective, the incident itself suggests a significant risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 19:19:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Terrifying. Narcan saved them, but it shook me up. Folks, please look out for each other. Learn the signs. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event, and while Narcan was successful, it highlights the presence of a potentially life-threatening situation in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 19:18:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. Narcan saved their life. Please, if you're using, have someone with you and have Narcan on hand. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose event, which is a life-threatening situation requiring immediate medical intervention. The event involved Narcan, further indicating the severity.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 19:17:09"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been feeling so isolated lately. Walking on eggshells constantly at home. Is this normal in relationships? Starting to think maybe not. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and isolation, which can escalate to mental health issues and potentially other dangerous situations. The user is clearly distressed and questioning the normalcy of their relationship.",
    "detected_category": "abuse",
    "timestamp": "2026-01-27 19:16:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want the pain to stop. Scared to admit I've been cutting again. Reaching out because I know I need help. Any advice on where to start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions self-harm (cutting) and a desire for pain to stop, indicating suicidal ideation and active self-harm. The individual is also scared, suggesting a lack of control and a potential escalation of the situation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 19:15:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back, stronger than before. Trying to stay strong and remember why I stopped. Any advice on coping when it feels overwhelming? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse or increase in urges, suggesting a potential for self-harm. While the individual expresses a desire to resist and seeks coping mechanisms, the overwhelming feeling and stronger urges elevate the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 19:14:03"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get punched outside the bar last night. Shook me up bad. Is it just me, or is everyone on edge lately? Feels like things escalate so fast.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a single instance of violence is concerning but doesn't indicate a widespread or imminent threat. The observer is shaken but not directly involved or threatened beyond witnessing the event.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 18:25:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Thankfully, EMTs got there fast. Narcan is vital. We need more resources, not judgment. Be safe out there, everyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potential public health crisis and risk of further overdose incidents, but EMT intervention mitigated immediate harm.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 18:24:20"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on the bus. So scary. My hands are still shaking. Is there somewhere to report something like that, even if no one was seriously hurt?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A physical altercation (fight) occurred, suggesting potential for injury even if none was explicitly mentioned. The person also expresses fear and lingering physical effects (shaking).",
    "detected_category": "violence",
    "timestamp": "2026-01-27 18:23:18"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside my building. Shook me up. Called the cops, but still feeling uneasy. Anyone else experience something similar? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the individual is primarily expressing emotional distress and seeking support. There's no direct indication of immediate danger to themselves or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 18:22:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, I relapsed. 😔 Reaching out to my therapist today. It's a struggle, but gotta keep trying. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse, implying a potential risk of negative health consequences and emotional distress. The user is reaching out for help, which is a positive sign, but the relapse itself elevates the risk beyond low.",
    "detected_category": "other",
    "timestamp": "2026-01-27 18:21:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Urges were strong, but I reached out instead. Still shaky, but I'm here. Talking helps. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the person experienced strong urges (unspecified but concerning) and is currently feeling shaky. Reaching out is a positive sign, but the presence of strong urges elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 18:20:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so incredibly low lately. Just reaching out because I don't know what else to do. Anyone else ever feel like there's no way out? Seriously need some support.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a desire for support, suggesting potential suicidal ideation but without explicit plans or intent. The phrase 'no way out' indicates a concerning level of distress.",
    "detected_category": "suicide",
    "timestamp": "2026-01-27 18:19:11"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so incredibly low lately. Like there's no way out. Reaching out because I know I need to talk to someone. Any advice on finding help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a desire to seek help, suggesting potential suicidal ideation but without specific plans or intent. This indicates a need for intervention and further assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-27 18:18:10"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to talk to someone. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of depression and acknowledges the need to talk to someone, suggesting a potential risk but not immediate danger.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 18:17:08"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I keep making excuses for him, but the yelling is escalating. Last night he broke a plate. I'm scared. Is this normal? Anyone else experience this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The escalation of yelling and the breaking of objects, coupled with the user's expressed fear, indicates a potential for violence and a possible abusive situation. While physical harm hasn't been explicitly stated, the trend is concerning and warrants attention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-27 18:16:06"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Froze. Wish I'd said something, anything. Feeling sick about it. Anyone else ever feel this helpless?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence, potential for escalation and victim harm, though not directly involved in the event itself. The reporter expresses distress, suggesting potential psychological impact.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 17:22:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Walking on eggshells all the time. Is this normal? Feeling trapped and isolated. Anyone else been through this? I just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 106 (char 131)",
    "detected_category": "unknown",
    "timestamp": "2026-01-27 17:21:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Felt so overwhelmed last night. Almost relapsed. Reached out to a friend instead. Still shaky, but glad I did. It's a struggle, but not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a near relapse, indicating a significant risk event. While the individual reached out for help, the shakiness suggests ongoing vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 17:20:49"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Punches thrown, yelling...scared me. Makes you wonder what's going on with people. Anyone else feeling more on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't indicate direct harm to the author or imminent escalation to severe violence. It describes a public disturbance.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 17:19:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Reached out to the crisis text line. Just need to get through tonight. It's tough.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The individual expresses a direct urge to self-harm (cutting) and is actively using crisis resources, indicating a high level of immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 17:18:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up yesterday. Narcan saved him. Scary reminder of how close we are to losing people. Please, learn the signs of OD. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Friend experienced a near-fatal overdose, indicating a high risk situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 17:17:44"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Froze. Should I have said something? Feeling sick about it now. Anyone else ever witness something like that? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be psychologically distressing and indicates a potential for escalation and further harm. While the person posting is not directly harmed, the post describes an act of violence and expresses concern, suggesting potential psychological impact and the possibility of future incidents.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 17:16:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Old coping mechanisms surfaced. Reached out to a friend, which helped. Still feeling shaky today. It's a process, I guess. Be kind to yourselves.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return to old coping mechanisms due to feeling overwhelmed and feeling shaky today. While the individual reached out to a friend, the relapse and continued shakiness suggest a potential risk of escalation and a need for continued support and monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 17:15:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Just reaching out... anyone else ever feel this way? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and a need for connection, which can be indicators of emotional distress and potential vulnerability. While not explicitly suicidal, the depth of feeling suggests a need for support and could escalate if unaddressed.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 17:14:35"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scary stuff. Narcan saved them, but shook me up. Please, look out for each other. Know the signs. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event that indicates an immediate risk to others and highlights the potential for further overdoses within the community. While Narcan was successful in this instance, the event caused distress to the witness and implies a potential ongoing risk of overdose incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 17:13:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Rough day. Urges were strong. White-knuckled through it. Feeling drained, but still here. Anyone else relate? Just trying to not feel so alone rn.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user reports strong urges and significant distress, requiring considerable effort to manage. While they report successfully coping, the presence of strong urges indicates a potential escalation risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 16:22:31"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out on my street last night. Shook me up bad. Yelling, shoving... I just froze. Feeling anxious today. Anyone else ever witness something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potentially dangerous situation. The author expresses anxiety but does not indicate any immediate threat to themself or others, nor do they express intent to harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 16:21:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant put-downs, controlling behavior... I feel so trapped. Anyone else been through this? How did you find the strength to leave?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and feeling trapped, suggesting a potential domestic abuse situation. While there's no explicit threat of violence or self-harm, the feeling of being trapped significantly raises the risk level.",
    "detected_category": "abuse",
    "timestamp": "2026-01-27 16:20:27"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Makes you realize how quickly things can escalate. Feeling really shaken up. Anyone else witness it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't directly indicate imminent danger to the writer or others. The writer expresses being shaken up, suggesting emotional distress but not necessarily a threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 16:19:25"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough. Constant put-downs, controlling behavior. Feels like walking on eggshells. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional abuse and controlling behavior, indicating a potentially harmful environment. While not explicitly mentioning physical harm, the 'walking on eggshells' feeling suggests a high level of stress and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-27 16:18:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I hate this. Anyone else relate? Just trying to get through the day.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges' which suggests a potential for self-harm or relapse into unhealthy behaviors. While the user is 'trying to get through the day,' the presence of these urges indicates a concerning level of distress and potential risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 16:17:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up yesterday. Scariest moment of my life. Please, check on your people. Know the signs. Naloxone saves lives. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a friend almost dying, suggesting a very serious overdose event. The mention of Naloxone directly implies an opioid overdose.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 16:16:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming I just want the pain to stop, even if it's just for a little while. Trying to find healthier ways to cope. Anyone else been there? How do you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire for pain to stop and implies difficulty coping, suggesting potential self-harm risk. While it mentions seeking healthier ways to cope, the initial statement warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 16:15:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like nothing matters. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 73 (char 98)",
    "detected_category": "unknown",
    "timestamp": "2026-01-27 16:14:17"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so lost lately. Like I'm underwater and can't find the surface. Talking feels impossible. Anyone else ever feel this way? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and isolated, with a sense of hopelessness. While there's no explicit mention of self-harm or suicide, the intense emotional distress and feeling of being trapped (\"underwater and can't find the surface\") suggest a potential risk that warrants further attention. The user is reaching out for connection and validation, which indicates they are aware of their distress and seeking support, potentially mitigating the immediate risk, but the depth of the distress warrants a 'medium' severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-27 16:13:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, indicating emotional distress and a need for help. While not explicitly suicidal, the metaphor of being underwater and unable to find the surface suggests a significant struggle with their mental health. Reaching out is a positive sign, but the underlying distress warrants concern.",
    "detected_category": "other",
    "timestamp": "2026-01-27 15:24:14"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like I'm drowning. Reaching out because I don't know what else to do. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being overwhelmed and 'drowning,' indicating significant distress and a need for support. The statement 'I don't know what else to do' suggests a degree of hopelessness. While there's no explicit mention of self-harm or suicide, the level of distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-27 15:23:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown. Scary stuff. Narcan saved their life, thank goodness. Makes you think, you know? Learn the signs, carry Narcan if you can. It's a real lifesaver.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was administered and the person survived, an overdose occurred, indicating potential underlying issues and a real risk of future incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 15:22:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Relapsed after 6 months clean. Feeling so ashamed and alone. Reached out to my therapist but the wait is killing me. Just need to know I'm not the only one who struggles like this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "429 Resource exhausted. Please try again later. Please refer to https://cloud.google.com/vertex-ai/generative-ai/docs/error-code-429 for more details.",
    "detected_category": "unknown",
    "timestamp": "2026-01-27 15:21:08"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy get jumped on my street. Shook me up bad. Called 911, but I feel so helpless. Is there anything else I could have done?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A violent assault occurred, indicating a risk to public safety. While the user wasn't directly harmed, witnessing the event caused distress and highlights a potential for further violence in the area.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 15:20:06"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight outside my kid's school. Shaking. Makes you wonder what's going on in people's lives. Anyone else feel like things are just getting angrier lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text doesn't indicate direct involvement, imminent danger, or a high probability of severe harm. The emotional distress is present, but not explicitly targeting anyone.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 15:19:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nUgh, bad brain day. Feeling the urge to relapse. Reached out to a friend, just need someone to talk to before I do something I regret. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to relapse and potential regret, indicating a need for immediate support to prevent a negative outcome.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 15:18:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scared. Found my brother unresponsive. Narcan worked, but it was close. Please, learn the signs of an overdose. It's not worth losing someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent, near-fatal overdose of the author's brother, indicating a high risk situation and potential for future occurrences if preventative measures are not taken. The prompt suggests learning the signs of an overdose, indicating a real and present danger.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 15:17:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good lately. Constant put-downs, isolating me from friends... feels like I'm walking on eggshells. Anyone else been through this? How did you cope? I need to figure something out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, indicating a potentially escalating situation that could lead to mental health issues or other negative outcomes.",
    "detected_category": "abuse",
    "timestamp": "2026-01-27 15:15:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Frozen. Didn't know what to do. Still shaking. Anyone else ever witness something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can have a significant emotional impact and while the person is not directly in danger, the potential for escalation of violence or the individual's ongoing distress warrants a 'medium' severity assessment.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 15:14:57"
  },
  {
    "title": "User Story: Violence",
    "content": "Heard shouting next door again last night. Sounded bad. Called the non-emergency line, but I feel awful just listening. Anyone else deal with this? Makes me sick to my stomach.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially escalating situation involving shouting and a feeling of distress from the poster, suggesting possible violence or abuse next door. The call to the non-emergency line confirms a concern, but the ongoing nature and the emotional distress expressed warrant a 'medium' severity rating.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 14:25:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD. It's terrifying. Lost my cousin last year. If you're struggling, please reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions overdose (OD) and the loss of a cousin, indicating a potential risk of overdose or substance use relapse within the network of the person who wrote the text. The emotional context suggests vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 14:24:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed yesterday, relapsed after 6 months clean. Disappointed but trying to be kind to myself. Reaching out to my therapist today. It's a bump, not the end.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential vulnerability and risk of further relapse, which can lead to more serious consequences. Reaching out to a therapist is a positive step, but the initial relapse elevates the risk beyond 'low'.",
    "detected_category": "other",
    "timestamp": "2026-01-27 14:23:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n\"Feeling so lost lately. Everything's just...heavy. Anyone know of any good resources for when you're feeling completely overwhelmed?\"\n\n**Option 2 (Sharing a personal story):**\n\n\"Remembering a really dark time last year. Never thought I'd get through it, but I did. Recovery is possible. Hold on.\"\n\n**Option 3 (Raising Awareness):**\n\n\"It's okay to not be okay. Check in on your friends, even the ones who seem fine. You never know what someone's going through.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and lost, but also seeks help and promotes recovery. There's no direct mention of self-harm or suicidal ideation, but the negative sentiment requires caution.",
    "detected_category": "other",
    "timestamp": "2026-01-27 14:22:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Please, if you're struggling, reach out. There are people who care and want to help you get safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event and indicates potential risk for others struggling with similar issues. The text also implies a general availability of drugs downtown.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 14:21:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Terrifying. Narcan saved their life. Please, if you're using, carry it. And know how to use it. It can save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event, highlighting the immediate danger and potential for fatality if Narcan wasn't available. This indicates a life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 14:20:20"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Wish I'd said something, anything. Anyone else ever freeze like that? Feeling awful.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence; potential for escalation and/or lasting psychological impact on the victim and the witness.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 14:19:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD. It's terrifying. Lost a friend last year. Please, if you're struggling, or know someone who is, reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a recent overdose (OD) and expresses concern about others struggling with similar issues. While it encourages seeking help, the mention of a friend's death due to overdose indicates a real and present danger.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 14:18:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Terrifying. Narcan saved them, but it shook me. Anyone else feel helpless sometimes? Where can I learn more about helping in these situations?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be traumatizing and indicates a potential ongoing risk of overdoses in the area. The individual is seeking information on how to help, suggesting a willingness to intervene in future situations, which carries inherent risks.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 14:17:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately, like I'm underwater. Reaching out because I don't know what else to do. Any advice or just someone to listen?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, coupled with a plea for help. While not explicitly suicidal, the 'underwater' metaphor and lack of coping mechanisms suggest potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 14:16:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown last night. Scary stuff. Please, if you're struggling, there's help out there. Don't be afraid to reach out. It could save your life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potential for repeat occurrences and highlights the presence of a dangerous situation and substance use in the area. The message encourages seeking help, implying a risk to others who may be struggling with addiction.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 13:33:22"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Remember, you're not alone. Talking is a start.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a significant and immediate risk. While the person reached out to a friend, the intensity of the urge warrants a high-severity classification.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 13:32:20"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved their life, thank god. Learn how to use it, folks. You could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was used and the person survived, the overdose event indicates a significant risk of future incidents and potential fatality. The event is also traumatizing and can have lasting effects on witnesses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 13:31:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Almost relapsed. Reached out to a friend instead, and just talking helped. Still shaky, but one day at a time, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a near relapse, which is a serious situation. While the person sought help and appears to be currently safe, the potential for relapse indicates a moderate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-27 13:30:17"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Didn't know what to do. Anyone else ever witness something like that? Wish I'd said something. Feel awful.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence in public suggests a potential risk of escalation or further harm to the victim. While the text doesn't indicate ongoing danger, the act of physical violence warrants attention.",
    "detected_category": "violence",
    "timestamp": "2026-01-27 13:29:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary stuff. Narcan saved them, thank god. Makes you realize how fragile life is. Know the signs, carry Narcan if you can. It can save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event requiring Narcan intervention, indicating a serious immediate health risk. While the person survived, the potential for fatality is high in overdose situations.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 13:28:13"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Clean for a week, then relapsed. Feels like starting all over. Anyone know good coping skills that actually work? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loss and a desire for coping skills after a relapse, but it doesn't explicitly mention self-harm, suicide, violence, or overdose.",
    "detected_category": "other",
    "timestamp": "2026-01-27 13:27:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD. Hurts so bad. Lost my cousin last year. Please, if you're struggling, reach out. There's help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses overdose (OD) and loss of a loved one, indicating potential distress and vulnerability in the writer or their network, increasing the risk, although it also promotes seeking help.",
    "detected_category": "overdose",
    "timestamp": "2026-01-27 13:26:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Walking on eggshells constantly. I don't know what to do anymore. Feeling trapped and scared. Anyone else been through this? How did you get out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, fear, and a feeling of being trapped, suggesting a potentially unsafe home environment. While it doesn't explicitly mention violence or abuse, the 'walking on eggshells' phrase implies a volatile situation. The user seeking advice on 'how to get out' further elevates the concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-27 13:25:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things aren't good at home. Constant put-downs, walking on eggshells... Anyone else feel like they're slowly disappearing? Need to find a way out.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home environment with emotional abuse (put-downs, walking on eggshells). While not explicitly stating suicidal intent, the feeling of 'slowly disappearing' and the need to 'find a way out' suggests a significant level of distress and potential for escalation if the situation continues.",
    "detected_category": "abuse",
    "timestamp": "2026-01-27 13:24:05"
  }
]