[
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just talking feels impossible. Reaching out for help, even this way, is terrifying. Is anyone else out there feeling this too?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness, isolation, and difficulty communicating, which can be indicators of mental distress and potential self-harm risk. While not explicitly suicidal, the feelings described elevate the concern level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 13:23:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a friend OD. Scariest thing ever. Narcan saved them. Learn CPR & carry it, please. You could save someone's life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose and needing Narcan indicates a life-threatening situation with immediate risk. The call to action suggests this is a recurring or widespread problem.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 13:22:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and heavy, seeking advice but doesn't mention specific harm.",
    "detected_category": "other",
    "timestamp": "2025-12-14 13:21:25"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Frozen. Heart's racing. Wish I'd said something, anything. What do you even do? Feeling sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault suggests a potential for escalation and further harm to the victim. While the observer is not directly in danger, the event is disturbing and could lead to further involvement.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 13:20:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "My neighbor OD'd last night. Narcan saved him. Scary how close it was. Learn the signs, folks. It can happen to anyone. Be safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A neighbor overdosed, requiring Narcan. While the person survived, the incident highlights the potential for fatal overdose. ",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 13:19:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. If you've been there, what helped?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a need for help. While it doesn't explicitly mention self-harm or suicide, the persistent low mood and statement about needing help raise concerns and warrant a medium severity level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 13:18:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. They're okay now, thankfully. Makes you realize how fragile life is. Learn the signs, carry Narcan. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, the occurrence of an overdose represents a significant health risk and a potential life-threatening situation. The suggestion to carry Narcan implies a known or potential risk of future overdoses.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 13:17:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need help. Talking to someone feels impossible right now, but I'm trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of depression and acknowledges needing help. While not explicitly stating suicidal intent, the 'dark cloud' metaphor and feeling of impossibility in talking suggest a significant level of distress requiring attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 13:16:18"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight on the bus today. Two guys, yelling then fists. I froze. Makes me sick thinking about it. Is there anywhere to report stuff like that anonymously? Feeling really shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence can be upsetting and cause anxiety, but the text doesn't indicate immediate danger to the individual or others. The person is shaken but doesn't express intent to harm themselves or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 13:15:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Narcan saved them. Please, learn the signs of OD and keep it on you if you can. It's real out here.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose, indicating a high risk of death or serious harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 13:14:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...not good. Constant yelling, put-downs. I feel so small. Anyone else gone through this? How did you cope? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 83 (char 108)",
    "detected_category": "unknown",
    "timestamp": "2025-12-14 12:22:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel so isolated. Has anyone else experienced this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential abuse (put-downs, controlling behavior) and feelings of isolation. While there's no explicit mention of self-harm or suicidal ideation, the situation described presents a risk to the individual's mental and emotional well-being and could escalate if left unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 12:21:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been feeling so isolated lately. Things at home are...tough. Walking on eggshells all the time. Anyone else ever feel like they're losing themselves? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses isolation, feeling like they are 'losing themselves,' and a desire to talk, suggesting emotional distress and potential risk of escalation if unaddressed. 'Walking on eggshells' implies a stressful or potentially abusive environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 12:20:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before it gets worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost, with a direct statement of reaching out \"before it gets worse.\" This suggests potential for escalation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 12:19:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital. Lost a friend to an overdose. So messed up. Please, if you're struggling, reach out. Don't let it get this far. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Recent loss of friend to overdose and statement of being \"so messed up\" indicate a high risk of potential self-harm or suicidal ideation due to grief and distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 12:18:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Narcan saved him, thank god. Makes you realize how fragile life is. Anyone know where to get training for that? Feel like everyone should be prepared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, can be a significantly distressing experience and points to a potential public health issue and risk for further overdoses.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 12:17:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found out my friend relapsed & OD'd. Thankfully they're okay, but it shook me. Addiction is a monster. Anyone else been through this? Talking helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the friend survived, the overdose event indicates a significant risk associated with addiction and potential future occurrences. The poster is also expressing emotional distress, which could escalate.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 12:16:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Been feeling so overwhelmed lately. Urges are getting stronger. Anyone know good coping mechanisms that actually work? Feeling lost.\n\n**Option 2 (Sharing a Story):**\n\n> 2 weeks clean. Small victory, but feels huge. Still struggling, but trying to focus on the good.\n\n**Option 3 (Raising Awareness):**\n\n> It's not attention-seeking. It's a sign of deep pain. Please be kind to those who are struggling. You never know what someone is going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates increased urges and feeling overwhelmed, suggesting potential for escalation. Option 2 shows some progress but ongoing struggle. Option 3 promotes awareness, hinting at underlying issues.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 12:15:23"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard shouting next door again last night. Sounded like things were thrown. Called the non-emergency line, but they said it was quiet when they arrived. Feel so helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports of shouting and objects being thrown next door suggest potential violence or abuse occurring, even if police found no immediate evidence. The feeling of helplessness also raises concern for the reporter's well-being.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 12:14:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside, I just want to make it stop. Scared to talk to anyone. Anyone else feel this way? Is there a way to quiet the noise without hurting?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to \"make it stop\" which, combined with the question about quieting the noise \"without hurting,\" suggests potential self-harm ideation. While it doesn't explicitly mention suicide or self-harm, the underlying distress and the attempt to find a safe alternative indicates a need for concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 12:13:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling so drained and empty. Reaching out because I know I need to. If anyone has felt this way, how did you start to feel better?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being drained, empty, and a need to reach out, suggesting potential depression or emotional distress. While there's no explicit mention of self-harm or suicide, the feelings described warrant a medium severity level due to the potential for escalation if not addressed.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 11:17:02"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant yelling, put-downs... feeling trapped. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a negative home environment with yelling and put-downs, indicating emotional distress and a feeling of being trapped. While there's no explicit mention of physical harm or intent to harm self or others, the feelings expressed warrant concern and a call for help, suggesting a potential escalation if unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 11:16:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after a month clean. Disappointed in myself, but trying to remember progress isn't linear. Gonna reach out to my therapist today.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates potential for increased vulnerability and potential for future high-risk behavior. The individual is expressing negative emotions but also indicating a proactive step towards help.",
    "detected_category": "other",
    "timestamp": "2025-12-14 11:14:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n>  Relapsed after a while. Feeling so ashamed & alone. Reaching out before it gets worse. Anyone know good resources for teens?\n\n**Option 2 (Personal Story):**\n\n>  Scars fade, but the feelings don't always.  It's a reminder of a dark place I fought to escape.  Healing is possible.\n\n**Option 3 (Raising Awareness):**\n\n>  It's not attention-seeking. It's a sign someone is hurting deeply. Please be kind and offer support, not judgment.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates a relapse and feelings of shame and isolation, suggesting potential for escalation. Option 2 references a dark past and scars, potentially related to self-harm. While not explicitly suicidal, the content raises concerns.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 11:13:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Froze. Wish I'd said something. Feeling sick about it now. Anyone else ever experience this? How do you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing physical violence indicates a potential risk of escalation or further harm to the victim. While the original poster was not directly involved, their distress suggests a potential for vicarious trauma or future intervention decisions impacting their own safety.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 11:12:56"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before it gets worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, and the user explicitly states they are reaching out 'before it gets worse,' suggesting potential escalation. While not explicitly suicidal, the language indicates significant distress and a desire for help.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 11:11:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. Constant put-downs, controlling behavior... feels like I'm walking on eggshells. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, suggesting emotional abuse. The feeling of \"walking on eggshells\" indicates a stressful and potentially dangerous situation. While not explicitly stating physical harm, the situation warrants concern and further investigation as emotional abuse can escalate.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 11:10:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been so angry lately. I just feel like I'm walking on eggshells all the time. Is this normal? I don't know what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential abusive situation due to the subject's anger and the feeling of \"walking on eggshells,\" which suggests fear and intimidation. While there's no explicit threat of violence, the power dynamic and emotional distress warrant concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 11:09:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need help. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a need for help, suggesting potential but not immediate risk. Reaching out is a positive sign, but the depth of the distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 11:08:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like a dark cloud won't lift. Reaching out because I know I need help. Talking to a friend tomorrow, hoping it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates feelings of sadness and a desire for help. The person is reaching out to a friend, suggesting a coping mechanism is in place. While concerning, there's no direct mention of self-harm or suicidal ideation, making the risk level lower. The phrase 'It's okay to not be okay' also indicates some acceptance and understanding of the situation.",
    "detected_category": "other",
    "timestamp": "2025-12-14 11:07:48"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Scary stuff. Made me realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Reports witnessing a fight, expressing feeling on edge. While concerning, it doesn't indicate imminent or directed violence, self-harm, or abuse.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 10:17:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and overwhelmed, using the metaphor 'underwater,' suggesting potential distress and a cry for help. While not explicitly suicidal, the feeling of helplessness warrants concern.",
    "detected_category": "other",
    "timestamp": "2025-12-14 10:16:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Felt really low lately. Old habits creeping back. Anyone know good resources for dealing with self-harm urges? Feeling lost.\"\n\n**Option 2 (Sharing a Small Victory):**\n\n> \"Tough day, but I managed to distract myself instead of giving in. Small win, but it matters. One day at a time.\"\n\n**Option 3 (Raising Awareness/Solidarity):**\n\n> \"It's not attention-seeking. It's a sign of deep pain. Please be kind to those who are struggling.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 explicitly mentions self-harm urges and feeling lost, indicating active risk. While Option 2 shows a positive coping mechanism, the initial statement indicates a tough day and past struggles. Option 3 is supportive, but doesn't directly change the severity of risk presented in other options.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 10:15:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant yelling, walking on eggshells... feels like I'm losing myself. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with constant yelling and feeling lost, suggesting emotional distress and potential for escalation to abuse or self-harm. While there's no explicit mention of harm, the sense of unease and loss of self warrants a medium severity rating.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 10:14:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank god. Makes you realize how fragile things are. Know where to get it in case you ever need it. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a recent overdose event, indicating a potential risk of future overdose incidents in the area and emphasizes the importance of having access to Narcan. While not a direct threat, it highlights a significant public health concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 10:13:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Clean for a few weeks, but relapsed tonight. Feeling so ashamed. Anyone else get that \"stuck\" feeling? Just trying to breathe through it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates a relapse and feelings of shame, but there is no explicit mention of self-harm or suicidal ideation. The person is seeking support and trying to cope.",
    "detected_category": "other",
    "timestamp": "2025-12-14 10:12:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is getting stronger. Reached out to a friend, hoping it helps. It's so exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating a potential risk. While the person reached out for help, the overwhelming feelings and urge to self-harm suggest a need for further support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 10:11:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary. Naloxone saved them, thank god. Made me realize how close anyone can be. If you're struggling, please reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event indicates potential for high harm, and the individual is reflecting on vulnerability. While the person in the text is not explicitly suicidal or using substances, the event has clearly affected them, suggesting a moderate risk to their well-being.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 10:10:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy and I don't know where to turn. Reaching out in case someone understands.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and heavy, indicating distress and a lack of direction, but does not explicitly mention self-harm or suicidal ideation. Reaching out suggests a desire for connection and support rather than immediate danger.",
    "detected_category": "other",
    "timestamp": "2025-12-14 10:09:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Hard to keep going.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed, and struggling to continue. While not explicitly suicidal, the statement 'Hard to keep going' indicates potential despair and requires attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 10:08:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Relapsed after 6 months clean. Feeling so ashamed and lost. Reaching out for support. Please, any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety combined with feelings of shame and loss can increase the risk of impulsive behavior and mental health decline.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 09:17:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Relapsed after a few months clean. Feeling so ashamed and alone. Reaching out for support. Anyone else been there?\"\n\n**Option 2 (Personal Story/Awareness):**\n\n> \"Scars aren't for attention, they're a reminder of battles fought. Healing is possible. Be kind to those struggling. You're not alone.\"\n\n**Option 3 (Venting/Reaching Out):**\n\n> \"The urges are so strong tonight. Just trying to get through it. Anything helps. Distractions? Kind words?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While none of the options explicitly mention intent to self-harm or suicide, Option 1 describes a relapse, increasing vulnerability. Option 3 expresses strong urges, indicating an acute struggle and elevated risk, though seeking help is a positive sign. Option 2 is supportive but does not directly indicate crisis, and could be posted by someone not currently in danger. The presence of relapse and strong urges elevates the overall risk level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 09:16:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing a friend OD was terrifying. Narcan saved their life. Carry it if you can, learn how to use it. It could save someone you love. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a life-threatening overdose situation. While Narcan was used to save the individual, the inherent risk of overdose is extremely high.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 09:15:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Has anyone else felt this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but lacks specific details of harm or intent. While concerning, it appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-14 09:14:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to distract myself, but it's hard. Anyone else relate? Just feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The mention of returning urges suggests a potential risk of self-harm or other harmful behaviors. The individual is expressing feeling overwhelmed and alone, which can exacerbate these urges.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 09:13:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend, hoping it helps. It's exhausting feeling this way.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and exhausted, and seeking support from a friend. While concerning, it does not contain explicit threats or plans.",
    "detected_category": "other",
    "timestamp": "2025-12-14 09:12:35"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a fight break out on my street last night. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel like things are just… tenser lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Reports a witnessed fight, causing unease, but no direct threat or harm to the reporter is indicated. The general feeling of increased tension is subjective and doesn't represent a specific risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 09:11:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD downtown. Terrifying. Narcan saved them, but it shook me. Please, if you're using, carry Narcan. It can save a life. Learn how to use it. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a witnessed overdose event, indicating potential risk of similar occurrences in the area. While Narcan was effective, the event highlights a serious and immediate health risk associated with drug use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 09:10:33"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on the street. Shaken up. Never seen anything like that in person before. Anyone else feel like things are getting more volatile lately? Makes me scared to go out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and causes fear, but there's no indication of immediate danger or harm to the individual or others. The sentiment expresses anxiety and fear, not active participation in violence or being a direct target.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 09:09:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital. Witnessed an OD and it was terrifying. Please, learn the signs, carry Narcan if you can. It can save a life. I'm still shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be a traumatic experience leading to potential psychological distress. While the text doesn't express imminent danger to the author, the mention of being 'shaken' indicates a need for support and monitoring. The presence of an overdose event indicates a risk to the broader community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 09:08:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nJust found out a friend OD'd. Narcan saved them, thankfully. Scary reminder how easily this can happen. Learn the signs, carry Narcan if you can. It saves lives. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose situation which is inherently dangerous, even though Narcan was successful. It acknowledges the ease with which such events can occur, suggesting a potential ongoing risk within the friend's social circle.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 08:20:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me up bad. Please, if you're using, carry it. Learn how. It can save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event requiring Narcan intervention, indicating a significant risk of severe health consequences or death. While the person survived, the situation underscores the high potential for fatal outcomes associated with substance use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 08:19:03"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The yelling, the put-downs... I'm starting to believe them. Anyone else feel this lost? Where do I even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, feelings of worthlessness due to verbal abuse, and a cry for help. While not explicitly stating self-harm or suicidal ideation, the feeling of being 'lost' and the impact of the abuse suggest a need for intervention and monitoring.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 08:18:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. Makes me sick. Lost my cousin last year. Please, if you're struggling, reach out. There are people who care. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a recent overdose death and expresses concern, indicating potential risk for others struggling with similar issues. The mention of losing a cousin also suggests personal connection to the issue, potentially increasing the poster's own vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 08:17:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved their life. Learn CPR & where to get it, seriously. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a stressful event and highlights the risk of overdose to others. While Narcan was effective, the situation indicates a potential ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 08:15:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, I understand. Here's a short social media post focusing on seeking help and sounding authentic:\n\n\"Been feeling so low lately. Like, really low. Reached out to a friend, and it helped a little. Thinking of calling a helpline tomorrow. Just gotta keep going. One step at a time.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being \"really low\" and reaching out for help. While the individual is taking steps to improve their situation, the depth of their negative emotions warrants a medium severity rating due to potential risk of escalation if support is not consistent or sufficient.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 08:14:57"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, walking on eggshells... Is this normal in relationships? Feeling lost and scared. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 51 (char 76)",
    "detected_category": "unknown",
    "timestamp": "2025-12-14 08:13:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up bad. Is there anywhere safe to walk around here after dark anymore? Feeling really unsafe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feeling unsafe due to witnessing a fight, but it doesn't indicate immediate danger to the individual or others. It's a general expression of fear and concern about safety in the area.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 08:12:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just realized how much I've normalized the yelling. It's constant. Is that... normal? Starting to think maybe not. Feel so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the individual is experiencing constant yelling, which suggests a potentially abusive environment. This is causing them distress and feelings of being lost.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 08:11:53"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Never seen anything like that in person before. Anyone else feel like things are getting more aggressive lately? Feeling anxious.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses anxiety and unease after witnessing a fight, but doesn't indicate any direct threat to self or others, or involvement in the violence.",
    "detected_category": "other",
    "timestamp": "2025-12-14 08:10:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are strong. Reached out to a friend, hoping it helps. Just trying to get through the day.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges and acknowledges a 'rough time,' indicating distress. While the person is reaching out for help, the intensity of the urges suggests a need for monitoring and potential intervention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 07:17:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need to get through tonight. It's okay to not be okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential for self-harm or harmful behavior. While the person has reached out for support, the presence of urges elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 07:16:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back and stronger. Reached out to a friend, feels a bit better to not be alone with it. Still scary though.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of strong urges and feelings of being scared. While reaching out to a friend is a positive coping mechanism, the intensity of the urges suggests a need for further support and monitoring. The specific nature of the urges is unknown but warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 07:15:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD in the park. Terrifying. Called 911. Please, people, be careful out there. Naloxone saves lives. Know how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A witnessed overdose suggests immediate danger to the individual experiencing it and highlights a broader public health risk in the area.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 07:14:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got decked. Shook me up. Makes you wonder what's going on with people. Anyone else feeling this lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing an act of violence (a fight), but does not suggest the author is in immediate danger, planning violence, or at imminent risk. While disturbing, it's a secondhand account and expresses more unease than immediate threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 07:13:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like too much. Scared to admit I relapsed. Reaching out because I don't want this anymore. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse and a desire to stop, suggesting potential risk. While not explicitly suicidal, the feeling of 'too much' and relapse elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 07:12:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant yelling, put-downs... I feel so small. Is this normal? Anyone else go through this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (yelling, put-downs) and feelings of worthlessness and being lost. While not explicitly mentioning self-harm or suicide, the emotional distress described increases the risk for potential escalation to those behaviors.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 07:11:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... scary lately. Walking on eggshells all the time. Is this normal? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially unsafe home environment and emotional distress, suggesting a risk of harm to the individual. While not explicitly stating violence or abuse, 'walking on eggshells' implies a threatening atmosphere.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 07:10:35"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. Urges are back, and it's hard to fight them. Reached out to a friend, just need someone to listen. It helps, even a little. #mentalhealth",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges, which suggests a potential risk. While the person is reaching out for help, the presence of urges elevates the risk beyond just feeling low.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 07:09:34"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a fight outside the bar last night. Dude got knocked out cold. Shook me up. Is this normal now? Feeling anxious about going out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault and feeling anxious about future safety suggests a moderate level of distress and potential risk of future exposure to violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 07:08:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating emotional distress and a need for support. The phrase 'underwater and can't find the surface' suggests feelings of hopelessness, but there is no direct mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2025-12-14 06:21:24"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain any explicit or imminent threats of harm to self or others. It seems like a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-14 06:20:22"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant yelling, put-downs... feels like I'm walking on eggshells. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile and emotionally abusive home environment which, while not explicitly mentioning physical harm, indicates significant emotional distress and potential for escalation. Walking on eggshells is a key indicator of a stressful and potentially volatile situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 06:19:21"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside my apartment. Called the cops, but I feel sick. Is there anything else I can do? Witnessing that was awful.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Report of active physical assault indicates a high risk of serious injury to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 06:18:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Reached out to a friend, but still struggling. Any advice on getting through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Expresses a strong urge to self-harm (cutting) and acknowledges ongoing struggle despite reaching out for help, indicating imminent risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 06:17:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a screen. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of numbness and detachment, which can be precursors to more serious mental health issues. Reaching out for help indicates some level of awareness and a desire to change, but the lack of specific ideation or plans keeps it from being high severity.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 06:16:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Old coping mechanisms keep popping up. Really trying to resist. Anyone else relate? Just feeling alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and relying on old coping mechanisms. While concerning, it doesn't explicitly mention self-harm, suicide, or violence. The individual is actively resisting the coping mechanisms and reaching out for connection, which suggests a degree of self-awareness and a desire to manage their feelings.",
    "detected_category": "other",
    "timestamp": "2025-12-14 06:15:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head I just want it to stop. Scared to admit it, but the urge to cut is back. Reached out to a friend, hoping it helps. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a strong urge to self-harm (cutting) and mentions wanting the mental distress to stop, suggesting a potential crisis situation. While the person reached out for help, the risk remains high until support is confirmed and effective.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 06:14:13"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the subway. Scary how fast things escalate. Shook me up pretty bad. Anyone else witness that near Grand Central around 5pm?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A physical assault (shoving) occurred on a subway, indicating potential for injury. While no injury severity is explicitly stated, the potential for escalation and the witness's distress suggest a moderate risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 06:13:12"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my kid's school. Shook me up bad. Makes you wonder what's going on in these kids' lives. Anyone else seeing more anger lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't indicate imminent or severe danger. It raises concerns about community violence but lacks specifics suggesting a high level of risk to specific individuals.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 06:12:10"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a guy punch his dog in the park today. Shaking. Feel sick. Didn't know what to do. Anyone else ever witness something like that? Wish I'd intervened.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing animal abuse is upsetting and can cause distress, but the immediate risk of physical harm to a human is low. The poster expresses emotional distress but does not indicate any intent to harm themselves or others.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 05:18:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost and overwhelmed, indicating a potential mental health crisis. The statement \"Talking to someone feels impossible, but I know I need to\" suggests a desire for help despite difficulty reaching out.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 05:17:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Finally left. Heart's pounding. Not sure what's next, but I'm safe. Any advice for rebuilding after emotional abuse? Feels like I don't even know myself anymore.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates the person has left an abusive situation and is now safe. While they are experiencing emotional distress and uncertainty, there is no immediate threat of harm to themselves or others. The focus is on rebuilding, suggesting a desire to move forward.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 05:16:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thank god. Makes you realize how fragile life is. Reach out if you're struggling, please. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential risk of harm, even though intervention was successful. The experience can be emotionally distressing and highlights the presence of dangerous substance use in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 05:15:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Cutting again after a long time clean. It's like the only thing that quiets the noise, even if it's just for a bit. Reaching out because I don't know what else to do. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions self-harm (cutting) after a period of abstinence, indicating a relapse and a potential escalation of distress. The individual is actively seeking help, suggesting they are struggling to cope and are aware of the seriousness of their situation. They are using self-harm to cope with overwhelming feelings, implying a significant level of emotional pain.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 05:14:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. Urges are back. Reached out to a friend, just need someone to listen. It helps. Please don't judge.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential risk of self-harm or suicide. Reaching out to a friend is a positive coping mechanism, but the presence of urges elevates the severity beyond 'low'.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 05:13:05"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, indicating a potential for mental health distress. The user is actively seeking help, which suggests they recognize the problem, but the depth of their distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 05:12:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Narcan saved him, thank God. Makes you realize how fragile life is. Anyone know where to get more training? Just in case...",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a significant event that can cause psychological distress. The question about Narcan training suggests a concern about future incidents and a desire to be prepared for potentially life-threatening situations.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 05:11:02"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on Elm St. Shook me up. Called the cops, hope she's okay. Makes you realize how easily things can escalate. Anyone else seen something similar? Feeling sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent act (shoving) indicates a potential for escalation and harm to the victim. While the immediate physical harm might be limited to the shove, the potential for further violence and the psychological impact on the victim warrant a 'medium' severity rating.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 05:10:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things at home are...rough. Walking on eggshells all the time. Anyone know resources for emotional abuse? Feeling so lost.\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Took me years to realize yelling and control *is* abuse. It's not normal. I'm still healing from it.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Gaslighting is real and it messes with your head. Don't let anyone tell you your feelings aren't valid.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and gaslighting, which can significantly impact mental health and potentially escalate to physical harm or self-harm in the long term.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 05:08:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Reminded me of my brother, he's been struggling with anger. Anyone know resources for anger management? It's getting scary.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A fight broke out, causing distress. While the focus is on the brother's anger management, the description \"getting scary\" indicates a potential escalation of violence is possible.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 04:30:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... Feels like I'm walking on eggshells. Anyone else been through this? How did you find the strength to leave?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation indicative of emotional abuse and controlling behavior which can escalate over time and negatively impact the person's mental and physical well-being. The person is seeking help and expressing a desire to leave the situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 04:29:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Just trying to make it through the night without hurting myself. Anyone else feel this way? Feeling so alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text explicitly mentions the desire to avoid self-harm, indicating a risk. While not stating intent, it expresses a struggle and feelings of loneliness, suggesting potential vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 04:28:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just realized the \"normal\" arguments are...not normal. Constant yelling, name-calling? Feels like I'm walking on eggshells. Anyone else experience this? Is this abuse? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of verbal abuse and emotional distress, indicating a potentially harmful situation that warrants further investigation. The user feels unsafe ('walking on eggshells').",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 04:27:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed ('underwater'), and a plea for understanding, suggesting emotional distress that warrants attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 04:26:41"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy shove his girlfriend on the street. Shook me up. Called the non-emergency line, hope she's okay. Makes you realize how close it is, you know?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a witnessed act of violence (shoving), indicating a potential risk of physical harm to the girlfriend. While the immediate outcome is unknown, the act itself warrants concern and justifies a medium severity level.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 04:25:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nJust saw a story about another OD. Makes me sick. Happened to a friend last year. Please, if you're struggling, reach out. There are people who care & want to help you stay safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose (OD) and implies the author's friend also overdosed and died last year. While the author encourages seeking help, the mention of overdose and a past loss indicates a potential risk for others who may be struggling.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 04:24:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Talking feels impossible but I need help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed, and a need for help, suggesting potential emotional distress and vulnerability, though no explicit suicidal ideation is present.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 04:23:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been...rough. Walking on eggshells all the time. Anyone else ever feel like they're losing themselves trying to keep the peace? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a difficult and stressful home environment, potentially involving emotional manipulation or abuse (\"walking on eggshells\"). The feeling of \"losing themselves\" indicates a potential for negative mental health consequences. While not explicitly stating harm, the situation described increases the risk of depression, anxiety, or self-harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 04:22:36"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge after seeing something like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling, but doesn't directly indicate imminent harm to the author or others. The author expresses feeling shaken and on edge, but not necessarily that they are in danger or planning violence themselves.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 04:21:34"
  }
]