[
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, feeling trapped. Anyone else gone through this? Just need to know I'm not alone. #abuse #domesticviolence #help\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional and verbal abuse, as well as a feeling of being trapped, which are significant risk factors for escalation to physical violence or mental health issues. The hashtags #abuse and #domesticviolence support this assessment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 16:18:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough night. Felt the urge to cut again. Distracted myself with music, thankfully. It's a daily battle, but I'm still here. Anyone else relate? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a clear urge to self-harm (cutting), which indicates a risk. While the individual reports using a coping mechanism and being 'still here,' the presence of the urge itself elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 16:17:00"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a screen. Reaching out because I don't know what else to do. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of numbness and detachment, and a plea for help, suggesting potential emotional distress and a lack of coping mechanisms.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 16:15:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scared me senseless. Narcan saved him, but it could've been so much worse. Please, if you're struggling, reach out. There's help out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Observed overdose incident, indicating potential for fatal outcome. Though Narcan was administered, the risk of future incidents and the potential for death remain significant.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 16:14:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking feels impossible. Anyone else ever feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of isolation and being overwhelmed but doesn't contain explicit self-harm ideation, suicide plans, or threats of violence. It seeks connection and validation, suggesting a desire for support rather than immediate danger.",
    "detected_category": "other",
    "timestamp": "2025-12-07 16:13:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found out a friend OD'd. Narcan saved him. Scared me straight. We gotta talk more about this stuff and how to get help. It's too easy to feel alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Friend's overdose indicates potential for similar situations and risk of future overdose, impacting the writer emotionally. The writer expresses fear, acknowledging the seriousness of the event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 16:12:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. If you've been there, how did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but there is no explicit mention of self-harm, suicide, violence, abuse, or overdose. It's a general expression of distress and a request for support.",
    "detected_category": "other",
    "timestamp": "2025-12-07 16:11:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling so overwhelmed and like nothing matters. Reaching out to a friend tonight, hoping it helps. Just need to get through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of overwhelm and hopelessness, suggesting potential for self-harm or suicidal ideation, although not explicitly stated. Seeking help from a friend is a positive sign, but the overall tone warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 16:10:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Trying to distract myself, but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which suggests a potential risk of self-harm or a relapse in a negative behavior. While the individual is attempting to cope by distracting themselves and seeking support, the presence of urges necessitates a moderate level of concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 16:09:49"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urges are back, and I hate it. Trying to stay strong and remember why I stopped. Any advice for getting through a tough night?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions \"urges\" which suggests a potential for self-harm or relapse into a harmful behavior. The user is expressing distress and actively seeking help, indicating they are still fighting against the urges, but the presence of the urges themselves elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 16:08:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of things I'd rather forget. Anyone else feel triggered by stuff like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes feeling triggered and shaken up by witnessing a fight, but does not explicitly mention harm to self or others. It expresses a desire for coping mechanisms, indicating an attempt to manage negative feelings rather than an intent to act on them.",
    "detected_category": "other",
    "timestamp": "2025-12-07 15:16:42"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad. Yelling turned into something else. I feel so trapped. Has anyone else dealt with this? I don't know where to turn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 70 (char 95)",
    "detected_category": "unknown",
    "timestamp": "2025-12-07 15:15:40"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a fight downtown last night. Just random, out of nowhere. Shook me up. Makes you realize how quickly things can escalate. Anyone else feeling on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused the author to feel shaken up. While concerning, it doesn't indicate imminent danger to the author or others. The author's feeling of being 'on edge' is vague.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 15:14:39"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. So scary how quickly things escalated. Is there anywhere to report stuff like that anonymously? Felt helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and suggests potential for violence, but the text does not indicate the reporter was directly involved or in imminent danger. They are expressing fear and a desire to report anonymously, indicating a concern for safety but not necessarily an active threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 15:13:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Reached out to a friend, just needed to say it out loud. It helps. If you're struggling too, please talk to someone. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which implies a potential for self-harm or other risky behavior. The individual has recognized the issue and reached out for help, which is a positive sign, but the presence of urges warrants a medium severity level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 15:12:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things aren't good at home. Constant put-downs, walking on eggshells... feels like I'm losing myself. Anyone else been through this? Need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse, creating a potentially harmful environment and impacting the individual's well-being. While there isn't an explicit threat, the feeling of 'losing myself' and 'walking on eggshells' suggests significant emotional distress.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 15:11:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Lost a friend last night. OD. Feels so unreal. Please, if you're struggling, reach out. There are people who care, even if it doesn't feel like it. Don't become a memory.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes the death of a friend due to overdose and directly encourages individuals struggling with similar issues to seek help. This indicates a high risk of overdose or suicide within the affected community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 15:10:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about Mac made me think...lost a friend last year to an OD. Scariest thing ever. If you're struggling, please reach out. There's help available. Don't be afraid.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a past overdose death and encourages seeking help, suggesting potential struggles with substance abuse. While there's no explicit statement of intent, the implied vulnerability elevates the risk beyond 'low'.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 15:09:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. Walking on eggshells constantly. Feeling trapped. Anyone else ever feel this way? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling trapped and constantly walking on eggshells, which suggests a difficult or potentially abusive situation at home. While not explicitly mentioning violence or self-harm, the level of distress and potential for escalation warrants a medium severity rating.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 15:08:28"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Reaching out before it gets worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed ('drowning') and explicitly states a desire to reach out 'before it gets worse,' suggesting the individual is aware of potential escalation. This indicates a level of distress requiring attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 15:07:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad lately. Constant yelling, controlling behavior... I feel so trapped. Anyone else been through this? How did you cope? Feeling really lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving potential emotional abuse (constant yelling, controlling behavior) and expresses feelings of being trapped and lost. While there is no explicit mention of physical harm or intent to harm oneself or others, the situation described carries a risk of escalation to more serious harm. The user is seeking support and coping mechanisms, indicating a need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 14:17:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up yesterday. Scariest moment of my life. Please, if you're struggling, reach out. Narcan saves lives, learn how to use it. I don't want to lose anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a potential overdose situation with a friend, implying immediate danger and the need for urgent intervention. The mention of Narcan further supports this.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 14:16:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, feels a little better. Remember it's okay to ask for help. 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the return of urges, suggesting a potential for self-harm or relapse, although the person has reached out for help which is a positive mitigating factor.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 14:15:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to reach out instead of giving in. Anyone else relate? Any tips on coping?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential for self-harm, though the individual is actively seeking help. This indicates a risk greater than low, but lower than a statement of intent.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 14:13:59"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on my street last night. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel like anger's just bubbling everywhere lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't indicate imminent danger to the speaker or others. The comment expresses concern about general anger, but lacks specific threats or plans.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 14:12:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Terrifying. Glad they're okay now. Narcan saves lives. Please, learn how to use it. You never know when you'll need it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual survived the overdose, the text describes a life-threatening situation (overdose) and implicitly highlights the potential for future occurrences. The call to action (learn how to use Narcan) underscores the ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 14:11:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but shook me up bad. If you're struggling, please reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome (Narcan administration), can be a significantly distressing event, indicating potential psychological impact and the risk of indirect exposure to substance abuse issues. The text also expresses concern and encourages seeking help, which suggests awareness of potential risks associated with substance use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 14:10:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been so angry lately, and I'm walking on eggshells. Is this normal? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 50 (char 75)",
    "detected_category": "unknown",
    "timestamp": "2025-12-07 14:09:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just trying to untangle what's normal arguing and what's...not. The constant put-downs are wearing me down. Anyone else been through this? How did you even start to figure it out?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes constant put-downs, which suggests emotional or verbal abuse. While it doesn't explicitly state physical harm, the phrase \"wearing me down\" indicates a negative impact on mental well-being. It warrants further investigation to determine the extent and nature of the abuse.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 14:08:50"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately? I keep replaying it in my head.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing anxiety and unease. While concerning, it doesn't suggest immediate danger to the individual or others, nor does it imply intent to harm themselves or anyone else. It primarily indicates emotional distress.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 14:07:48"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the bus stop. Shook me up. How do you guys deal with seeing stuff like that? Feeling really anxious now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence which caused anxiety, but doesn't indicate any immediate threat to the individual or others, or intent to harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 13:21:58"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post that addresses suicidal feelings, focusing on seeking help:\n\n\"Feeling really low lately. Like, bone-deep tired. Reached out to the crisis line. Just talking helped a little. Gonna try to take it one hour at a time.\"\n\n**Important Considerations:**\n\n*   **Brevity:** This is crucial for social media.\n*   **Authenticity:** It sounds like someone genuinely sharing their experience.\n*   **Focus on Help-Seeking:** It highlights a positive action (calling the crisis line).\n*   **No graphic details** that could be triggering.\n*   **Hopeful Element:** The \"helped a little\" and \"one hour at a time\" offer a small glimmer of hope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post explicitly mentions feeling 'really low' and 'bone-deep tired,' indicating a potential for suicidal feelings. While the individual has reached out for help, the feelings described suggest a significant level of distress. The presence of suicidal thoughts, even with help-seeking behavior, warrants a 'medium' severity rating. The 'helped a little' suggests the person is still struggling.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 13:20:56"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing distress and heightened anxiety. While disturbing, it doesn't directly indicate immediate danger or intent to harm self or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 13:19:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so numb lately, like I'm watching life from behind a screen. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of numbness and detachment from life, indicating a potential decline in mental well-being. The plea for help suggests they are struggling and seeking support, hinting at a possible crisis. While there is no explicit mention of self-harm or suicide, the described feelings are often associated with such thoughts. Thus, warrants further investigation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 13:18:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "My cousin almost didn't make it last night. OD. Scary stuff. Please, if you're struggling, reach out. There's help. Don't let it get this far.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose (OD), indicating a significant risk to life. The urgency in the message further emphasizes the high level of immediate danger experienced by the cousin.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 13:17:50"
  },
  {
    "title": "User Story: Violence",
    "content": "I'm scared. My neighbor's been yelling again, things getting thrown. Last time police were involved. Don't know what to do, feel trapped. Anyone else dealt with this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving escalating yelling and throwing objects by a neighbor, with a history of police involvement. The writer expresses fear and feeling trapped, suggesting a potential risk of violence or abuse. While not explicitly stated, the neighbor's behavior could pose a threat to the writer's safety and well-being.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 13:16:49"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on Elm Street. I froze. Should I have intervened? Feeling sick about it. What would you have done?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an instance of physical violence (shoving). While it's a single incident and the extent of injury is unknown, physical violence always carries the risk of escalation and potential harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 13:15:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend on Elm St. Frozen. Called 911, but I feel sick. Has anyone else witnessed something like this? What can you even DO?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Direct report of a violent assault occurring, indicating immediate danger to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 13:14:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and hopelessness. While it doesn't explicitly mention self-harm or suicidal ideation, the user is reaching out for help indicating a potential need for intervention. The metaphor of being 'underwater' suggests feeling overwhelmed and suffocated.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 13:13:44"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling, but doesn't indicate direct involvement, intent to harm, or immediate danger to the author or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 13:12:42"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out downtown. Shook me up bad. Seeing that kind of anger... makes you wonder, y'know? Is everyone okay?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but does not indicate immediate danger to the individual or others. The shaken feeling and wondering about others' well-being suggest concern but not an imminent threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 12:22:06"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get punched outside the bar last night. Shook me up. Is there anywhere to learn basic self-defense around here? Feeling really vulnerable now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence and expressing a feeling of vulnerability. While unsettling, it doesn't indicate immediate danger to the individual or others. The person is seeking self-defense training, which is a proactive rather than reactive response.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 12:21:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to distract myself, but it's hard. Anyone else get this? How do you cope? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges and difficulty coping, suggesting a potential risk of self-harm or other harmful behaviors. While no specific plan is mentioned, the individual's distress and seeking of coping mechanisms raise concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 12:20:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thankfully. Makes you realize how fragile life is. If you or someone you know needs help, please reach out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a serious risk of harm and highlights the potential for fatal outcomes, even if Narcan was administered. It suggests a prevalent issue in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 12:19:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need to. Talking to someone tomorrow. It's a start.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of hopelessness and a lack of interest in life, suggesting possible depression or suicidal ideation. While the person is seeking help, the negative feelings expressed warrant a medium severity classification.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 12:17:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I feel so isolated. He yells constantly, then apologizes & says he loves me. It's exhausting. Is this normal? I'm starting to think I'm losing it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse and potential psychological distress. The user feels isolated, is being yelled at, and questions their sanity. While not explicitly stating intent to harm themselves or others, the situation suggests a risk of escalating distress and potential for future harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 12:16:58"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home haven't been good lately. Constant put-downs, controlling behavior... I feel so isolated. Has anyone else been through this? Just looking for some support.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, which can escalate to physical violence or lead to significant mental health issues. The feeling of isolation is also a concerning risk factor.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 12:15:56"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Just reaching out. Has anyone else felt this way? Any tips on getting through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and a desire for support, but does not contain explicit suicidal ideation, self-harm plans, or imminent danger.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 12:14:55"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary how quickly things escalated. Makes you think about how fragile peace really is. Anyone else feel this lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which suggests a potential for violence, but doesn't indicate imminent danger to the poster or others. The tone is observational and reflective rather than expressing intent to harm or be harmed.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 12:13:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately. Everything feels heavy. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being overwhelmed, but doesn't contain explicit mentions of self-harm, suicide, or harming others. It appears to be a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-07 12:12:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, feeling trapped. Anyone else gone through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and feelings of being trapped, which could escalate to more serious mental health concerns.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 11:16:04"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy get shoved on the train today. He didn't do anything. Scared me. Is this just normal now? Feeling uneasy.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the event is concerning and caused unease, it describes a single instance of assault without indication of serious injury or escalation. It's reported by an observer, not the victim, and lacks details suggesting ongoing threat or imminent danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 11:15:03"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's hard to admit, but things at home haven't been good. Constant put-downs, isolating me from friends... Feels like I'm walking on eggshells. Anyone else been through this? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and social isolation, which are risk factors for mental health issues and potential escalation of the situation. The feeling of 'walking on eggshells' indicates a stressful and potentially volatile environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 11:14:02"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Frozen. Wish I'd said something, done something. Feeling sick about it. Anyone else ever witness something like that? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, even without direct involvement, can cause significant emotional distress and potentially escalate if not addressed. The poster expresses feeling sick and regret, indicating a concerning level of impact. While the event itself may be a one-off, there's a risk of future escalation if the aggressor is not held accountable, and bystander inaction reinforces the behavior.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 11:13:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is strong. Reached out to a friend, hoping it helps. It's a daily struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 11:11:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Punches thrown, screaming. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be distressing and create a sense of unease and anxiety. While no direct threat is made, the description suggests potential for public safety concerns if fights are escalating.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 11:10:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just want to disappear. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The statement expresses a desire to disappear, indicating potential suicidal ideation and emotional distress. The user is actively seeking help, which suggests a willingness to engage and mitigates immediate risk, but the feeling of being lost and the wish to disappear warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 11:09:55"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a fight downtown last night. Dude got knocked out cold. Shook me up. Makes you realize how fast things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes an isolated incident of violence witnessed by the author, it does not explicitly threaten violence or indicate the author's involvement. The author does express feeling shaken up, which warrants further assessment of their emotional state but doesn't signify imminent danger. The incident does involve physical harm, indicating a potential risk of further violence in the area.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 11:08:54"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a guy shove his girlfriend on Elm St. Shook me up. Didn't know what to do, wish I'd intervened. Anyone else witness that? Feeling sick about it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed incident of violence (shoving) suggests potential for escalation or further harm. While no specific injury is mentioned, the act itself indicates a risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 11:07:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got really bad last night and I relapsed. I'm feeling so much shame right now. I reached out to my therapist, but I just needed to tell someone. It's a struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse and feelings of shame can be precursors to more severe actions. While the person has reached out for help, the relapse indicates increased vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 11:06:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel like violence is getting worse lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault resulting in unconsciousness indicates a medium level of risk, as it demonstrates a real-world escalation of violence and potential for further harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 10:17:00"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Scary how quickly things escalated. Reminded me of my brother's situation. Anyone know resources for anger management or conflict resolution in the city?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes witnessing a fight that escalated quickly, suggesting a potential risk of violence in the area. The mention of a brother's similar situation implies a personal connection to conflict or violence. While not directly expressing violent intent, the observation and personal connection elevate the concern beyond a simple observation.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 10:15:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to a friend helped a little, but the weight is still there. Gonna try to find a therapist. It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed (\"lost\", \"underwater\", \"weight\"). The user is actively seeking help (therapist), which suggests awareness and a desire to improve, but the persistence of negative feelings warrants a medium severity rating. ",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 10:14:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post addressing suicide, aimed to sound authentic and encourage seeking help, while staying under 300 characters:\n\n**Option 1 (Seeking Help):**\n\n\"Things feel really heavy lately.  Finding it hard to cope.  Anyone know of good resources for talking to someone?  Just need to reach out.\"\n\n**Option 2 (Sharing Experience):**\n\n\"Remembering a dark time.  It DOES get better.  Please, if you're struggling, tell someone.  You're not alone in this.\"\n\n**Option 3 (Raising Awareness):**\n\n\"Lost a friend to suicide.  Breaks my heart.  Let's be kinder, check in on each other.  You never know what someone's going through.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text directly addresses suicide and suicidal ideation, although it also promotes seeking help and offers a message of hope. While encouraging help-seeking is positive, the explicit mention of suicide and dark times warrants a medium severity rating due to the potential for triggering vulnerable individuals.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 10:13:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital. OD'd last week. Scared. Realized I need help. Anyone know good resources for recovery in Philly?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Recent overdose indicates a significant risk, and while the individual is expressing a desire for help, the immediate aftermath of an overdose increases vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 10:12:53"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw two guys fighting outside my building last night. Shook me up bad. Is this normal now? Feel like I can't even walk home safe. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential for violence in the area, causing the individual to feel unsafe and question their security. While not directly threatened, the perceived risk to personal safety elevates the severity.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 10:11:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after 6 months clean. Disappointed in myself, but trying to remember recovery isn't linear. Reaching out to my therapist today. It's okay to ask for help.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential escalation of risk. While the individual is seeking help, the relapse itself signifies vulnerability and potential for further negative consequences.",
    "detected_category": "other",
    "timestamp": "2025-12-07 10:10:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Expresses a strong urge to self-harm, indicating immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 10:09:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Trying to distract myself, but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating active ideation and a struggle to resist the urge. While not explicitly stating intent or a plan, the intensity of the urge elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 10:08:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "My brother almost didn't wake up yesterday. Narcan saved his life. Please, if you or someone you know is struggling, reach out. It's not worth the risk. Resources are out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose situation requiring Narcan intervention, indicating a high risk to life.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 10:07:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like nothing matters. Reaching out to a friend tonight. Just need someone to listen, I think.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and a lack of motivation, but does not contain any explicit plans or intentions of self-harm or suicide. The individual is reaching out for support, which is a positive coping mechanism.",
    "detected_category": "other",
    "timestamp": "2025-12-07 09:17:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed, and a lack of coping mechanisms. This indicates distress and a potential vulnerability, though there's no explicit mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2025-12-07 09:16:16"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Didn't know what to do. Anyone else ever witness something like that? Feel helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, while not directly involving the user, can be emotionally distressing and lead to anxiety or fear for personal safety. The act of physical violence is a concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 09:15:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about ODs lately is scary. Lost a friend last year. Narcan saves lives, carry it if you can. Check on your people, always.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions overdose (OD) and the loss of a friend, indicating a potential risk for overdose-related harm, although it also promotes preventative measures like carrying Narcan and checking on others.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 09:14:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the ambulance lights last night was terrifying. Found my neighbor unresponsive. Narcan saved him. Please, learn the signs of overdose. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the immediate crisis was averted, the situation involved a life-threatening overdose, indicating a risk of recurrence. The neighbor's experience highlights a potential ongoing vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 09:13:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"He's been getting angry more often. Last night he broke a plate. I'm scared it's escalating. Has anyone else dealt with this? Feeling so alone right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes escalating anger and a broken object, suggesting a potential for violence. The person expressing these concerns is also expressing fear, indicating a perceived threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 09:12:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...bad. Walking on eggshells constantly. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially unsafe home environment with mentions of 'walking on eggshells' and feeling alone, suggesting emotional distress and possible abuse or conflict.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 09:11:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Just wanted to say, if you're struggling with self-harm urges, you're not alone. It's okay to reach out. Talking helps. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text acknowledges self-harm urges and encourages reaching out, indicating a potential for harm, but doesn't express immediate intent.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 09:10:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight, hoping it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, which can be indicative of a mental health crisis. While the individual is reaching out to a friend, the statement 'Like I'm underwater' can be interpreted as a metaphor for feeling suffocated or drowning in their emotions. The question 'It's okay to not be okay, right?' suggests they are seeking validation and may be struggling significantly.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 09:09:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIPs lately. Lost another friend to an OD. This sh*t is real. Please, if you're struggling, reach out. There's help available. Don't become another statistic. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions overdose (OD) and the loss of a friend, indicating an immediate and significant risk of further overdoses and potential fatalities within the individual's social circle. The phrase 'Don't become another statistic' suggests a high level of concern and the potential for further harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 09:08:05"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is anyone else feeling this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but lacks specific details about intent or plans for self-harm or harm to others. Primarily describes emotional distress and a desire for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-07 08:19:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "My neighbor OD'd last night. Narcan saved him, but it was too close. This sh*t is scary. Learn the signs and carry Narcan. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was effective, the overdose event indicates a serious risk to the neighbor's health and life. The phrase 'too close' highlights the severity. There is also a call for action to learn signs and carry Narcan, indicating the user recognizes the ongoing potential for this to happen again.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 08:18:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my friend unresponsive. Narcan worked. Waiting for paramedics. Scared. Learn how to use it. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Friend was unresponsive and required Narcan, indicating a life-threatening opioid overdose.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 08:17:33"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary. Shaking now. Does anyone know any good resources for dealing with witnessing violence? Need to process this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates distress and anxiety after witnessing a fight, but there's no indication of immediate danger to the individual or others. The person is seeking resources to cope, suggesting they are not considering harmful actions.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 08:16:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just talking about it feels like a weight lifted. If you're struggling too, please reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and encourages seeking help, indicating distress but not an immediate plan for harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 08:15:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before things get worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 82 (char 107)",
    "detected_category": "unknown",
    "timestamp": "2025-12-07 08:14:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just realized yelling and constant put-downs ARE abuse. Never thought of it that way. Feeling lost and confused. Is this normal? Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual is experiencing emotional distress and confusion related to the realization they are experiencing abuse. While there's no immediate threat of physical harm, the ongoing nature of the abuse and the emotional impact raise concerns.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 08:13:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to a friend helped a little, but it's still there. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, indicating emotional distress. While it mentions talking to a friend helped, the underlying feeling persists. This suggests a need for further support and monitoring.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 08:12:26"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just realized yelling & insults every day ISN'T normal. Feel so lost. Anyone else been through this? How did you start to heal?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user describes experiencing daily yelling and insults, indicating possible emotional abuse. While not explicitly stating intent to harm self or others, the feeling of being \"lost\" and needing to heal suggests significant distress and potential vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 08:11:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Trying to distract myself, but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions the return of 'urges' and feeling overwhelmed, suggesting a potential for self-harm or suicide. While the person is trying to distract themselves, the fact that the urges are back indicates an escalation of risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 08:10:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Reaching out because I don't know what else to do. If you've been there, how did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and a desire for support, but there is no explicit mention of self-harm, suicide, or harm to others.",
    "detected_category": "other",
    "timestamp": "2025-12-07 07:17:33"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need help. Talking to a friend tomorrow, hoping it gets better.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of hopelessness and a need for help, which suggests a potential risk of self-harm or suicide, although immediate danger is not explicitly stated. Seeking help from a friend is a positive sign, but the severity warrants monitoring.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 07:16:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\"It's hard to admit, but things at home haven't been good lately. Walking on eggshells constantly. Anyone else been through this? Feeling so alone. Need to figure out my next steps.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult situation at home, feeling alone, and the need to figure out next steps. While it doesn't explicitly mention harm, the phrase \"walking on eggshells\" suggests a potentially volatile or abusive environment which could escalate. The feeling of isolation is also a risk factor.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 07:15:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Woke up feeling like I'm walking on eggshells again. It's exhausting. Anyone else feel like they can't do anything right? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of anxiety and inadequacy, but does not contain any explicit threats or plans for self-harm, suicide, violence, or abuse. It appears to be a general expression of emotional distress.",
    "detected_category": "other",
    "timestamp": "2025-12-07 07:14:28"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Is there anyone else who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and a sense of hopelessness. The individual is reaching out for help, suggesting they are struggling to cope. While there isn't explicit mention of self-harm or suicidal ideation, the feelings described could be precursors and warrant concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 07:13:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Reached out to a crisis line, just needed to tell someone. It helped a little. Taking it one hour at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The individual expresses a strong urge to self-harm (cutting), indicating immediate risk. While they reached out for help and it provided some relief, the persistence of the urge classifies this as a high-severity situation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 07:12:25"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Makes you wonder what people are going through, you know? Feeling shaken up. Anyone else witness it? Hope everyone's okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning but doesn't indicate immediate or severe danger to the author or others. It expresses concern and unease.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 07:11:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? Feeling lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, isolation, and potential abuse (put-downs, controlling behavior). While not explicitly mentioning self-harm or suicide, the feeling of being 'lost' in the context of a negative home environment raises concerns about potential escalation if the situation worsens. ",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 07:10:23"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out on the bus today. So scary. Shaking still. Is there anywhere safe to report something like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight on a bus is a distressing event, but the text doesn't indicate ongoing harm to the individual. The person expresses fear and a desire to report the incident, suggesting they are seeking help after the fact, not currently in immediate danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 07:09:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Scared. Found my brother unresponsive yesterday. Narcan saved him. Please, if you're using, have someone with you. It almost took him. I'm still shaking.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent opioid overdose that almost resulted in death. Narcan was required to revive the individual, indicating a severe and life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 07:08:20"
  }
]