[
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Felt sick. Wish I'd said something, but froze. Anyone else ever feel like that? What can you even do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing physical violence and the poster's expressed feeling of being 'sick' indicates potential for escalation or repeated incidents. While not directly involved, the post highlights a safety risk to the victim of the shoving incident.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 15:19:45"
  },
  {
    "title": "User Story: Violence",
    "content": "My neighbor's shouting again. Sounds like things are getting physical. Called the cops before, but nothing changes. Feeling helpless. Anyone else deal with this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving potential violence and abuse occurring within earshot of the narrator. While the narrator isn't directly involved, the escalating situation and their feeling of helplessness suggest a risk of violence spilling over or the situation worsening. The previous call to the police indicates a recurring problem.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 15:18:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n\"Feeling so lost lately. Like I'm drowning and can't see the surface. Reaching out... anyone else feel this way? How do you cope?\"\n\n**Option 2 (Sharing a personal story):**\n\n\"Remembering a really dark time. Didn't think I'd make it through. Grateful for the support I got. It DOES get better.\"\n\n**Option 3 (Raising Awareness):**\n\n\"Check in on your friends, seriously. You never know what someone's going through behind the smile. A little kindness goes a long way.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses feelings of being lost and overwhelmed, potentially indicating distress and a need for support. While not explicitly suicidal, the \"drowning\" metaphor suggests significant emotional distress. The other options are supportive and positive.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 15:17:41"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Scratched last night. Again. Feels like I'm drowning. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates self-harm (scratching) and feelings of being overwhelmed and drowning, suggesting emotional distress and potential escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 15:16:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so heavy lately, like I'm underwater. Reaching out because I don't know what else to do. If you've been there too, how did you get through it?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a sense of helplessness. The individual is reaching out for help, suggesting they are struggling to cope. While not explicitly suicidal, the feelings described could indicate a potential risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 15:15:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of deep distress and hopelessness, suggesting potential risk. The individual is actively seeking help, which indicates awareness and a desire for change, but the 'underwater' metaphor and feeling 'lost' warrant concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 15:14:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but does not contain explicit suicidal ideation, self-harm, or violence.",
    "detected_category": "other",
    "timestamp": "2026-01-07 15:13:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Just trying to breathe through it. Anyone else feel that way? Talking helps, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses internal distress and a desire to cope through communication, suggesting a manageable situation. There's no explicit mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2026-01-07 15:12:31"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Hard not to just...scratch the surface. Anyone else feel this? Trying to find healthier coping skills, it's a struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 79 (char 104)",
    "detected_category": "unknown",
    "timestamp": "2026-01-07 15:11:29"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back, and I hate feeling like this. Reached out to a friend, hoping it helps. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse in urges and feelings of distress. While the person reached out for help, the focus on 'getting through tonight' suggests immediate concern and potential for escalation. The specific nature of the urges is unclear, requiring further investigation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 15:10:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Everything's just heavy. Talking to a friend helped a bit, but it's still rough. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but does not contain explicit mentions or indicators of self-harm, suicide, violence, abuse, or overdose. It describes seeking support from a friend, which suggests a coping mechanism.",
    "detected_category": "other",
    "timestamp": "2026-01-07 14:19:18"
  },
  {
    "title": "User Story: Abuse",
    "content": "Sometimes I feel like I'm walking on eggshells. He's so charming to everyone else, but at home...it's different. Is this normal in relationships? I don't know who to talk to.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and a feeling of being controlled or manipulated ('walking on eggshells'). The user expresses uncertainty and isolation ('I don't know who to talk to'), suggesting a possible escalating situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 14:18:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Talking feels impossible, but maybe someone understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of deep distress and hopelessness ('lost,' 'underwater,' 'don't know what else to do'). While it doesn't explicitly mention self-harm or suicide, the intensity of the negative emotions and the sense of being overwhelmed raise concern. The individual is reaching out, indicating a potential need for support, but the inability to talk easily is a barrier.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 14:17:14"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside my building. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel unsafe in this neighborhood lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While a fight occurred, the text primarily expresses feeling shaken and unsafe. There's no direct threat to the reporter or indication of ongoing violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 14:16:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my neighbor unresponsive. Narcan worked, thankfully. Scariest moment ever. Learn CPR, carry Narcan. It can save a life. Please be careful out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Neighbor was found unresponsive and required Narcan, indicating a life-threatening overdose event.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 14:15:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\nMy friend almost didn't wake up last night. Scary reminder of how easily things can go wrong. Learn the signs of overdose, please. Knowing could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a friend almost dying from a possible overdose, indicating a near-fatal event. Although the writer emphasizes prevention and education, the underlying event is severe.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 14:14:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Narcan saved him. Please, if you're using, carry it. It could save a life, maybe even yours.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan, indicating a high risk of death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 14:13:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Like nothing matters. Reaching out before things get worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and a desire to reach out before things worsen, indicating potential suicidal ideation but no immediate plan.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 14:12:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel trapped. Has anyone else dealt with this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, indicating a potentially abusive situation. While there is no explicit mention of physical harm or suicidal ideation, the feeling of being \"trapped\" and the plea for help suggest a significant level of distress and potential escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 14:11:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just a heavy cloud all the time. Reaching out to see if anyone else understands. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of sadness and being lost, but lacks specific intent or plan for self-harm or harm to others. Seeking connection and support is a positive sign.",
    "detected_category": "other",
    "timestamp": "2026-01-07 14:10:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scary night. Found my brother unresponsive. Narcan saved him. Please learn the signs of OD and carry naloxone if you can. It could save a life, like it did for him. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Brother experienced a near-fatal overdose requiring Narcan. While the immediate crisis is over, the risk of future overdose remains.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 13:30:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so overwhelmed lately.  Urges are back.  Anyone know any good coping mechanisms that actually work?  Just trying to get through the night.\n\n**Option 2 (Sharing a Story):**\n\n> 6 months clean. Didn't think I'd make it this far. Still a struggle, but proving to myself I can get better.  One day at a time.\n\n**Option 3 (Raising Awareness):**\n\n> It's not attention-seeking. It's a sign someone's hurting. Please be kind and offer support. You never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses active urges and a feeling of being overwhelmed, suggesting an increased risk of acting on those urges. While the individual is seeking coping mechanisms, the presence of urges elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 13:28:58"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Walking on eggshells constantly. Is this normal in relationships? Feeling so lost and scared. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 94 (char 119)",
    "detected_category": "unknown",
    "timestamp": "2026-01-07 13:27:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about an OD. Reminds me of losing my cousin. Please, if you're struggling, reach out. There are people who care and want to help. It's not worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief related to a past overdose death and encourages seeking help, suggesting potential risk for individuals currently struggling with substance use and potentially contemplating self-harm.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 13:26:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, things got bad again last night. Cleaned everything up but feeling so ashamed. Reached out to the crisis line. Hoping they can help me find a better coping mechanism. It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a recent crisis involving cleanup and shame, indicating a potential self-harm event or a relapse in a negative coping mechanism. The user is reaching out for help, showing a willingness to improve, but the recent event raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 13:25:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, having a really rough night. The urge to self-harm is so strong. Trying to distract myself but it's hard. Anyone else been there? How do you cope? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm and feelings of being alone, indicating an immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 13:24:49"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the park. So scary. My hands are still shaking. Is there anywhere safe I can take my kids to play around here?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A fight indicates potential for violence and immediate danger, causing fear and prompting a search for safer environments for children.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 13:23:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Please, if you're using, have Narcan. It could save a life. Learn how to use it, too. #addiction #overdose #narcan #recovery",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose, indicating an immediate risk of death or serious health consequences for individuals using drugs. While the message promotes harm reduction, the occurrence of an overdose signifies a high level of danger.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 13:22:45"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. My heart is racing. Said something, hope she's okay. Makes me sick to my stomach. Anyone else see it near Elm & Main?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Report of a physical assault (shoving) which constitutes violence and potential abuse. While the observer intervened verbally, the immediate safety of the victim is uncertain.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 13:21:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming I just want to feel *something* else. Scared I'll go too far one day. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to feel something else when overwhelmed and a fear of going too far, suggesting potential self-harm ideation, although not explicitly stated.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 13:20:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my building. Shook me up bad. Seeing someone get hurt like that... makes you realize how fragile things are. Anyone else ever feel that way after witnessing violence?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence, which is distressing, but there's no indication of immediate danger to the poster or others. It's a reaction to an event rather than an active threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 12:25:16"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Been having a really rough time lately. Urges are strong. Reached out to a crisis line, feels like a small step. Anyone else relate? Just feeling incredibly alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and feelings of isolation, which raises concern. Reaching out for help is positive but doesn't negate the underlying risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 12:24:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Reached out to a friend, just needed someone to listen. It helps, even a little. If you're struggling too, you're not alone. 💚",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions of \"urges\" suggests potential self-harm or suicidal ideation. Reaching out to a friend is a positive coping mechanism, mitigating the immediate risk but not eliminating it.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 12:23:13"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. The urge was really strong, but I distracted myself. Small victory. Still feels like a long road ahead. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions a strong urge, implying a potential safety risk. While the individual distracted themselves, the presence of the urge warrants attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 12:22:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD in the bathroom stall today. Scariest thing ever. They're okay now, thankfully. Please, if you're struggling, reach out. There are people who care. I promise.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, indicating a serious health risk and potential for fatality. While the person is currently okay, the event signifies a high-risk situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 12:21:09"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing in the street, escalating fast. Reminded me of my own past. Anyone know resources for de-escalation or support for people leaving abusive situations? Feeling shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially volatile situation (escalating argument) and expresses personal distress/trauma which, while not directly indicating harm, could potentially lead to a crisis. The request for resources suggests a concern for the safety of others and potentially a vulnerability of the poster.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 12:20:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Trying to fight it, but it's exhausting. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating active ideation. While the person is trying to resist, the struggle is described as exhausting, suggesting a potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 12:19:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just...heavy. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, indicating potential emotional distress and a need for support. While not explicitly mentioning self-harm or suicide, the feelings of helplessness and reaching out suggest a vulnerability that requires attention.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 12:18:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about another OD in my town. Makes me sick. A friend almost died last year. Learn the signs of an overdose. It can happen to anyone. Know how to use Narcan. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions a recent overdose death and a near-fatal overdose, highlighting the real and present danger of overdose in the user's community. Encourages awareness and Narcan use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 12:17:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm drowning and no one can see me. Reaching out because I don't know what else to do. Is there anyone else who feels this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and a sense of hopelessness. The phrase 'drowning and no one can see me' suggests a potential for self-harm or suicidal ideation, though it's not explicitly stated. The plea for help indicates a need for support.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 12:16:00"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling so overwhelmed and empty. Reaching out because I don't know what else to do. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and empty, combined with a plea for help. This suggests a potential risk of self-harm or suicidal ideation, although no specific plans are mentioned.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 11:18:21"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...not good. Walking on eggshells constantly. Anyone else been through this? Feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a difficult and potentially unsafe home environment, possibly involving emotional abuse or tension, indicated by \"walking on eggshells.\" The individual expresses feelings of isolation which can exacerbate the situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 11:17:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD downtown. Scariest thing ever. Narcan saved their life. Carry it, learn how to use it. You could save someone's life too. Please, be careful out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose, which is a life-threatening medical emergency. While Narcan was administered and the person survived, the potential for death or severe harm is very high.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 11:16:17"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the bus stop. Shaken up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text primarily expresses feeling shaken and on edge, not direct involvement or threat. The mention of escalation suggests awareness of potential danger, but the risk is currently low to the individual.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 11:15:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost and overwhelmed, hinting at possible depression or anxiety. While not explicitly stating suicidal intent, the metaphor of being 'underwater' suggests a sense of suffocation and desperation. Seeking help is acknowledged, indicating a degree of self-awareness and a desire to improve their situation, but the barrier to talking to someone raises concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 11:14:14"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a fight downtown last night. Guy just snapped. Scariest thing I've ever seen. Makes you wonder what pushes people to that edge. Anyone else feelin' on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent outburst can be unsettling and cause anxiety. The text expresses a feeling of being 'on edge,' suggesting potential distress related to the observed violence. While not directly threatening, the observation of a person 'snapping' could be a precursor of concern.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 11:13:12"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Froze. Wish I'd said something, anything. Feeling sick about it. Anyone else ever witness something like that? What do you DO?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can cause distress and potential for escalation if the situation is ongoing. While the original poster is not directly in danger, the incident described involves an act of violence that could escalate.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 11:12:10"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train. Everyone just stared. Makes you wonder when someone will actually step in. I froze. Feeling awful about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the reported incident is a single instance of violence (shoving), the potential for escalation and the bystander effect raises concern. The narrator's distress suggests a potential for future similar incidents or a negative impact on mental well-being.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 11:11:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown last night. Scary. Narcan saved them, but it was too close. Please, if you're struggling, reach out. There are people who care. 💔",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event with potentially lasting psychological impact. The use of Narcan indicates a life-threatening situation. While the person survived, the phrase \"too close\" and the broken heart emoji suggest a near-fatal outcome, raising concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 11:10:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head, I just want it to stop. Scared to admit I've been hurting myself again. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions self-harm and expresses a desire for overwhelming internal noise to stop, raising concerns about potential escalation to more severe actions.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 11:09:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Terrifying. Narcan saved them, but it shook me up. Makes you realize how fragile life is. Anyone else feel this lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived due to Narcan, the text reports an overdose incident which represents a serious health risk and potential for fatality. The mention of being 'shook up' and realizing 'how fragile life is' suggests a moderate level of emotional distress experienced by the writer.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 10:19:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park yesterday. Scary stuff. Naloxone saved him, but it shook me up. Anyone else been through something similar? Just feeling really raw about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing an overdose is traumatic but the text focuses on the emotional impact on the author, not an immediate threat to the author or others.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 10:18:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Naloxone saved him, thank goodness. Carry it if you can. Could save a life, fr.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential ongoing public health issue (drug use) with the possibility of repeated occurrences and harm to individuals. While Naloxone was used successfully, the potential for fatal outcomes exists.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 10:17:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. The urge to self-harm is strong. Reached out to a friend, feels a tiny bit better. Taking it one minute at a time. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a significant and immediate risk to the individual's safety.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 10:16:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the ambulance lights down the street. Another overdose, probably. This needs to stop. Anyone know resources for helping people get clean around here? Feeling so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text expresses concern and doesn't indicate immediate harm to the author or others, the mention of a likely overdose suggests a broader community safety risk. The author's feeling of helplessness could potentially escalate if they witness more events or are personally affected by addiction.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 10:15:31"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up. Never seen anything like that before. Makes you realize how fragile things are.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate direct personal harm or intent to harm. The emotional impact is acknowledged, but there's no indication of immediate danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 10:14:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up again. Cleaned it, bandaged, but I'm so tired of this cycle. Anyone know resources that aren't just hotlines? Need something more consistent.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text implies a recurring self-harm behavior, indicated by \"messed up again,\" \"cleaned it, bandaged,\" and \"tired of this cycle.\" While not explicitly suicidal, the consistent nature of the behavior and the desire for more consistent help than hotlines suggests a need for intervention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 10:13:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Terrifying. They're okay now, thankfully, but scared me. Anyone know where to find naloxone training around here? Feel so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential, ongoing risk of overdose in the area and evokes a strong emotional response in the reporter. While the individual survived, the incident points to a serious public health concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 10:12:25"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out downtown yesterday. So scary how quickly things escalated. Shaken up and just feeling really unsafe lately. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses fear and unease due to witnessing a fight, but doesn't indicate immediate danger or intent to harm self or others. It's a reaction to a stressful event.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 10:11:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed, suggesting potential mental health distress. While it doesn't explicitly mention self-harm or suicidal ideation, the metaphor of being underwater and unable to find the surface indicates a significant struggle and a need for support, warranting a medium severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 10:10:22"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Walking on eggshells constantly. Is this normal? Feeling so lost and alone. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult and stressful home environment, feeling lost and alone, and walking on eggshells, which can indicate potential emotional distress and possibly a risk of escalation if the situation continues or worsens. The context hints at potential abuse or a very unhealthy relationship dynamic.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 09:22:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. I'm walking on eggshells constantly. Is this normal in a relationship? Starting to feel really isolated. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse (walking on eggshells, isolation) and difficulty coping, suggesting a decline in mental well-being. While not explicitly stating harm, the isolation and difficulty pretending things are okay raise concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 09:21:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm drowning and no one can see me. Reaching out because I don't know what else to do. If anyone has felt this way, how did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, potentially indicating a mental health crisis. While there isn't explicit mention of self-harm or suicide, the feeling of 'drowning' suggests significant distress and a need for support. The act of reaching out is positive, but the depth of despair warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 09:20:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary af. Narcan saved them, but it shook me up. Anyone else been through this? Makes you realize how fragile life is.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, requiring Narcan intervention. While the person survived, the event indicates a potential ongoing risk of overdose within the person's social circle or community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 09:19:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Narcan saved them. Please, if you're using, keep it on you. Know the signs. It can happen to anyone. #overdose #narcan",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event requiring intervention. Overdoses pose an immediate and serious threat to life.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 09:18:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells lately. Everything I do feels wrong. Is this normal in a relationship? Starting to feel really small. Anyone else experience this? #abuse #emotionalabuse",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse, creating a stressful and diminishing environment for the individual. The hashtags #abuse and #emotionalabuse explicitly raise concerns.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 09:17:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scared. Found my brother unresponsive. Narcan worked, thankfully. Please, learn the signs of OD. It can happen to anyone. Know where to get help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Brother found unresponsive and revived with Narcan indicates a life-threatening overdose event.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 09:16:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it was too close. Please, if you're using, have it on hand. It's literally life or death.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event, indicating a severe and immediate risk to life. While the person survived, the phrase 'too close' highlights the potential for fatality. The urgency in the recommendation to carry Narcan reinforces the high risk associated with the situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 09:15:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, seeking help, which could indicate distress and potential for escalation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 09:14:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, having a really rough night. The urge to self-harm is so strong. Trying to stay strong and remember my coping skills. It's hard though. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses a strong urge to self-harm, indicating active risk, but also mentions coping skills suggesting some capacity for self-management.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 09:13:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... bad. Walking on eggshells constantly. I feel trapped. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a feeling of being trapped and constantly walking on eggshells, which could indicate a stressful or potentially abusive environment. While it doesn't explicitly mention violence or self-harm, the implicit distress raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 08:22:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost died last night. OD. Scariest night of my life. Please, if you're struggling, reach out. There are people who care. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a near-fatal overdose (OD) experienced by the speaker's friend. This signifies a severe, life-threatening event.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 08:21:08"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just needed to vent. Things got physical again last night. Feeling so lost and alone. Is this normal? How do you even start to get out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates physical violence, potential for escalation, and feelings of hopelessness and isolation, suggesting a significant risk of harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 08:20:06"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. My hands are still shaking. Didn't know what to do. Is there somewhere to report this without getting involved directly? Feel sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, even if the reporter wasn't directly involved, can be psychologically distressing and indicates a potential for escalation if the abuse continues. The reporter expresses feeling 'sick' and 'shaking,' indicating significant emotional distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 08:19:04"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out downtown last night. So scary. Just makes you realize how quickly things can escalate. I'm still shaken up. Anyone else feel unsafe walking alone lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused emotional distress. While unsettling, it doesn't indicate an immediate or ongoing threat of violence towards the author, nor does it suggest any specific danger besides a generalized feeling of unease about walking alone.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 08:18:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are strong. Reached out to a friend, feels a little better. Remember there are options. 988 is a good start.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges, suggesting a potential for self-harm or suicide. While the person reached out for help, the intensity of the urges raises the risk level.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 08:17:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting on the street, shouting & shoving. Made me freeze. Reminded me too much of my parents. Anyone else get triggered by stuff like that? Feel so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling triggered, but doesn't indicate immediate danger or intent to harm self or others. The feeling of helplessness is concerning but not an immediate threat.",
    "detected_category": "other",
    "timestamp": "2026-01-07 08:15:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Why is everyone so angry lately? Makes you wonder what's going on behind closed doors. Hope everyone's okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning, but doesn't indicate immediate danger or direct involvement of the author. It expresses concern and reflection rather than active participation or escalation.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 08:14:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Glad they're okay now, but it really shook me up. If you're struggling, please reach out. There's help out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a recent overdose event, indicating a potential ongoing risk for others in the same environment or social circle. While the person survived, the event itself carries a medium level of risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 08:13:55"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get shoved on the train today. Everyone just looked away. Makes you wonder if anyone would help if things got worse. Feeling pretty shaken up.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the event itself (being shoved) could have resulted in serious injury, the text also expresses concern about lack of bystander intervention and a feeling of vulnerability, hinting at potential escalation or a more serious threat if the situation worsened. The level of concern suggests more than just a minor incident.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 08:12:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home have been bad. Constant put-downs, controlling behavior... I feel trapped. Anyone else been through this? How did you find the strength to leave?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, indicating a potential abusive situation. While not explicitly mentioning physical harm, the feeling of being 'trapped' suggests a significant impact on mental and emotional well-being. The plea for advice on leaving implies an intent to change the situation, but the user is currently vulnerable.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 07:21:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, and it helped a little. Remember you're not alone. Talking can make a difference.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly states a strong urge to self-harm, indicating immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 07:20:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them. Please, learn the signs and carry it if you can. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event and indicates potential risk in the community. While the person survived, the situation highlights the presence of drug use and potential for future overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 07:19:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary stuff. Glad they're okay now, but it makes you think. If you're struggling, please reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even if the person recovered, can be a traumatic experience and highlight the prevalence of drug-related harm in the community. The message also implies that the target audience may be struggling with addiction or mental health issues, increasing the risk of future overdose or related harm.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 07:18:45"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Froze. Wish I'd said something. Feeling sick about it. Anyone else ever witness something like that? How do you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be emotionally distressing and could indicate a potential escalation of harm to the victim. While the original poster is not directly involved in the violence, the incident suggests a risk of further violence and potential harm to the individual who was shoved.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 07:17:43"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside the grocery store. Froze. Called the cops, but feel sick. Anyone else ever witness something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, especially domestic violence, can be deeply disturbing and have lasting psychological effects. While the immediate physical risk is external, the emotional distress and potential for vicarious trauma elevate the severity.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 07:16:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out to a friend, feels hard but gotta try. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and low mood, which are potential indicators of depression and suicidal ideation. Reaching out is positive, but the underlying feeling of 'nothing matters' requires further assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 07:15:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scariest thing ever. Narcan saved them. Please, if you're using, carry it. It's free and could save a life. Learn how to use it. #staysafe",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a friend's recent overdose, indicating a life-threatening situation and potential ongoing risk for others in the social circle.",
    "detected_category": "overdose",
    "timestamp": "2026-01-07 07:14:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Trying to stay strong and remember why I stopped. It's hard. Anyone else relate? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges, which suggests a potential for relapse or escalation of distress. While the individual is expressing a desire to stay strong, the presence of these urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 07:13:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Constant put-downs, walking on eggshells... is this normal? Feeling so lost and alone. Anyone else been through this? Need to figure out what to do next.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and feelings of isolation, suggesting potential for escalation. While not explicitly mentioning harm, the walking on eggshells and put-downs point to a potentially unsafe environment and the expressed feeling of being lost can indicate a deterioration of mental health.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 07:12:35"
  },
  {
    "title": "User Story: Violence",
    "content": "My neighbor's been screaming at his wife again. I can hear it through the walls. Happened last night too. Makes me sick. Should I call someone? Don't want to make it worse.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Possible domestic abuse. While the text doesn't explicitly state physical violence, screaming is a form of verbal abuse and often escalates. The repetition and the reporter's distress suggest an ongoing issue.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 06:23:28"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you wonder what's going on in people's lives to get to that point. Hope everyone's okay. Feeling shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be disturbing, but there's no direct indication of ongoing threat to the author or others. The author expresses concern and empathy, not necessarily immediate danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 06:22:26"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Frozen. Didn't know what to do. Feel sick. Anyone else ever witness something like that? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, especially physical violence like a shove, can be psychologically distressing and indicates a potential risk of escalation or further harm to the victim.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 06:21:24"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Scary how fast things escalated. Makes you think, you know? Just hoping everyone's okay.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is concerning, but the text lacks specific details suggesting severe harm to anyone directly involved. It expresses general concern rather than immediate danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 06:20:22"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Just had a really rough night. Urges were strong, but I made it through without hurting myself. Small victory, but it feels huge. Anyone else relate? Trying to stay strong.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the individual experienced strong urges to self-harm, suggesting an elevated level of distress and potential for future self-harm. Although they resisted, the intensity of the urges warrants a medium severity classification.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 06:19:21"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a man shove his girlfriend on the street today. Just like that. Broad daylight. Shook me up. Didn't know what to do. Is there a right way to react in those situations? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an instance of violence (a man shoving his girlfriend). While the text does not indicate ongoing or escalating violence directed at the user, the description suggests potential for escalation of violence and the user's emotional distress indicates potential for indirect impact.",
    "detected_category": "violence",
    "timestamp": "2026-01-07 06:18:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like I'm underwater. Reaching out because I know I need to. Anyone else ever feel this way? What helps?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a recognition of needing help. While there's no explicit mention of self-harm or suicide, the feeling of being \"underwater\" and reaching out suggests a level of distress that warrants concern and further assessment. It's important to address these feelings before they escalate.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-07 06:17:17"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of things at home. Is there anyone else who feels like they're walking on eggshells all the time? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests potential distress related to past experiences of violence or abuse (\"Reminded me of things at home,\" \"walking on eggshells\"). While not explicitly stating immediate harm, it indicates a need for support and processing of potentially traumatic events.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 06:16:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so heavy lately. Like nothing matters. Reaching out because I don't know what else to do. Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed, suggesting a potential risk of self-harm or suicidal ideation. The user is also actively seeking help, which is a positive sign, but the depth of their distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-07 06:15:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Still processing things. It's hard to admit, but I think I was being emotionally abused. Constant put-downs, isolation... Anyone else gone through this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates past emotional abuse and a request for coping strategies. While concerning, there is no immediate threat to self or others. The individual is seeking support, which is a positive sign.",
    "detected_category": "abuse",
    "timestamp": "2026-01-07 06:14:11"
  }
]