[
  {
    "title": "User Story: Suicide",
    "content": "Feeling so lost lately. Everything feels heavy, and I'm not sure how to cope. Reaching out because I need to remember I'm not alone in this. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain any direct threats of self-harm or suicide. It indicates a desire for support and advice.",
    "detected_category": "other",
    "timestamp": "2025-12-11 20:19:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "i messed up. things got bad again & i relapsed. feeling so ashamed. reaching out to my therapist tomorrow. just needed to say it somewhere.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse, which can be associated with increased risk. The individual expresses shame and is reaching out for help, suggesting awareness of the issue and a desire for support, but the relapse itself warrants a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 20:18:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk. While the person reached out to a friend, the presence of a strong urge necessitates a high-severity classification.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 20:17:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head, it feels like the only way to quiet them is to hurt. I know it's not right, but it's hard to stop. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a clear ideation of self-harm as a coping mechanism, indicating a significant risk to the individual's safety and well-being.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 20:16:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up yesterday. OD'd. Scariest thing ever. Please, if you're using, have someone with you. It's not worth the risk. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose, indicating a high risk of death or serious harm. The user expresses intense fear and shock, highlighting the severity of the situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 20:15:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...not good. Walking on eggshells all the time. Anyone else ever feel this way? Need to talk but scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially unsafe home environment. The phrases \"walking on eggshells\" and \"scared\" suggest emotional distress and possible abuse or a volatile situation. While not explicitly stating violence, self-harm, or suicidal ideation, the level of fear and distress warrants concern and further investigation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 20:14:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so heavy, I feel like I need to feel *something* else, y'know? It's not a solution, I know. Anyone else ever feel this way? Trying to find better ways to cope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a desire to feel *something* else, which could indicate emotional distress and potential for unhealthy coping mechanisms. The acknowledgment that it's \"not a solution\" suggests awareness but also a vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 20:13:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Constant put-downs, isolating me from friends... I feel trapped. Anyone else been through this? How did you find the strength to leave? I'm scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse and a feeling of being trapped, suggesting potential for escalation. The fear expressed raises concerns about immediate safety and ability to cope.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 20:12:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Things got dark last night, but I reached out to a friend. Talking helped. If you're struggling, please don't be afraid to ask for support. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions feeling overwhelmed and things getting 'dark,' suggesting a possible mental health crisis. However, the individual reached out for support, indicating a protective factor. The inclusion of a message encouraging others to seek help is also present.",
    "detected_category": "suicide",
    "timestamp": "2025-12-11 20:11:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Narcan saved him, but it shook me up. Reminded me we gotta look out for each other. Know the signs, carry Narcan if you can. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, is a distressing event with potential psychological impact on the witness. The event also highlights the presence of a serious health risk in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 20:10:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Walking on eggshells constantly. Anyone else feel like they're losing themselves in their relationship? Feeling trapped.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a feeling of being trapped in a relationship. This could escalate to more serious issues if not addressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 19:18:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been so angry lately, and I'm always walking on eggshells. Is this normal? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and an unsafe environment due to the described anger and need to 'walk on eggshells.' The feeling of isolation further increases the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 19:17:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Naloxone worked, thank God. Still shaken up. Learn CPR and how to use it, people. It saves lives. #overdoseawareness #naloxone #CPR (edited to remove hashtags as requested.)",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with successful intervention, indicates a significant risk of harm and psychological distress for the person involved and potentially others nearby. The successful administration of Naloxone indicates the overdose was life-threatening.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 19:16:42"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad lately. Constant yelling, and I feel so small. Is this normal? I don't know who to talk to.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a potentially unhealthy home environment with constant yelling, leading to feelings of insignificance. The lack of someone to talk to elevates the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 19:15:40"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out downtown. Shook me up bad. Reminded me of things I've been trying to forget. Anyone else ever feel totally drained after witnessing something like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling shaken. While distressing, it doesn't indicate immediate danger or targeting, but a negative emotional response to a violent event.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 19:14:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Scariest moment of my life. Narcan saved him. Please, if you're using, carry it. Learn how to use it. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose, indicating a high-risk situation averted by Narcan.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 19:13:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I feel like I need to hurt myself to feel *something*. It's scary. Anyone else feel this way? How do you cope? I'm trying to find healthier ways.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a desire to self-harm, even though the individual acknowledges it's a maladaptive coping mechanism and is seeking healthier alternatives. The expressed desire to hurt oneself to feel something indicates a significant level of distress and potential risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 19:12:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so heavy lately. Like I'm underwater. Reaching out because I don't know what else to do. If you've been there, how did you get through it?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feelings of being overwhelmed and a sense of helplessness. The individual is reaching out for help, suggesting they are struggling to cope. While there is no explicit mention of self-harm or suicide, the feeling of being 'underwater' and the heavy emotional state could indicate a risk of escalation if support is not provided.",
    "detected_category": "suicide",
    "timestamp": "2025-12-11 19:11:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD in our town. Scares me. Been there, almost didn't come back. If you're struggling, please reach out. There's help. You're worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a recent overdose and the author's past near-fatal experience, indicating a potential risk of relapse or triggering for others struggling with similar issues. While it encourages seeking help, the content itself is potentially destabilizing.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 19:10:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs... I feel so small. Anyone else been through this? How did you find the strength to leave? #abuseawareness",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates ongoing emotional abuse, which can have significant psychological impact and potentially escalate to physical violence. The feeling of being 'small' suggests a diminished sense of self-worth and powerlessness.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 19:09:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. Urges are back. Really trying to fight it. Anyone else know what this is like? Just feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of isolation, suggesting a potential escalation of risk. While not explicitly suicidal, the mention of 'urges' and feeling 'alone' warrants concern and potential intervention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 18:20:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want to feel *something* else. Scared myself last night. Talking to a therapist feels impossible, but I know I need help. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a desire to feel \"something\" else, followed by the user scaring themselves, indicating a potential for risky behavior. The individual acknowledges needing help but feels unable to seek it, increasing the risk. While not explicitly suicidal or self-harming, the statement warrants concern and further investigation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 18:19:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells for too long. Finally told my best friend what's been happening. It's real, it's abuse, and I'm terrified. Need to figure out what to do next. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly states abuse and terror, indicating a high risk of immediate or escalating harm. The user is seeking advice, suggesting a desire to change the situation but also a lack of resources or a clear plan.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 18:18:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. My heart is pounding. Should I have said something? Feel sick about it now. What would you have done?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence. Potential for escalation or further harm to the victim. While not directly involved or personally at risk, the situation involved physical assault.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 18:17:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"He's been yelling a lot lately. Says it's stress, but it's always *my* fault. I feel so small. Is this...normal? I don't know what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling diminished and experiencing verbal aggression which suggests emotional abuse. While there's no explicit mention of physical harm, the repeated blame and resulting feeling of helplessness raises concern for potential escalation and the mental well-being of the individual.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 18:16:37"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Guy just snapped. Makes you wonder what pushes people that far. Stay safe out there, everyone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Reports a witnessed fight, indicating a potential for violence but doesn't provide specific details about who might be at risk or the likelihood of future incidents.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 18:15:35"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy get shoved on the subway platform. Heart's still racing. Is this normal now? Feeling so unsafe lately.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent act like being shoved on a subway platform is concerning. While not directly targeted at the reporter, the potential for serious injury and the reported feeling of unsafety elevate the risk level.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 18:14:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIPs lately. Lost another friend to overdose last night. Please, if you're struggling, reach out. Don't become a memory. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses grief and concern over recent overdose deaths, including the loss of a friend. This suggests a potential for others in the network to be at immediate risk or considering similar actions. The direct plea to 'reach out' indicates a perception of imminent danger.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 18:13:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to feel *something* is to hurt. I know it's not healthy, and I'm trying to stop. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses thoughts of self-harm, although it also indicates an awareness that it's unhealthy and a desire to stop. This shows some protective factors but the presence of self-harm ideation elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 18:12:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... rough. Constant yelling, then the silent treatment. Walking on eggshells. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile and emotionally damaging home environment which could escalate to physical harm or mental health crisis. The mention of 'walking on eggshells' suggests potential for unpredictable outbursts and fear.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 18:11:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough. Walking on eggshells constantly. Anyone else experience this? Feeling so alone. Just need to know I'm not crazy.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult and stressful home environment, suggesting potential emotional distress and possible abuse. While not explicitly stating harm, the feeling of \"walking on eggshells\" and feeling alone raises concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 17:21:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thank god. Makes you realize how fragile life is. If you're struggling, please reach out. There's help out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a potentially traumatizing event and indicates the presence of a significant risk factor (drug use) in the surrounding environment. While the individual survived, the event highlights the risk of future overdoses and potential harm to others in the area.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 17:20:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news report about another OD. Makes me sick. Lost my cousin last year. If you're struggling, please reach out. There are people who care and want to help you stay alive.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about overdoses and loss, but also includes a message of hope and encouragement to seek help. The direct reference to a personal loss related to overdose increases the severity.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 17:19:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Constant yelling, put-downs... I feel so small. Anyone else gone through this? How did you cope? I need help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a potentially abusive home environment, which could escalate to more serious harm if left unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 17:18:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Relapsed after 6 months. Feeling so ashamed and alone. Reaching out to my therapist tomorrow, but tonight is rough. Just need to know I'm not the only one who struggles like this.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse and feelings of shame and loneliness. While not explicitly suicidal, the intensity of emotional distress and the phrase 'tonight is rough' suggests an elevated risk of self-harm or other negative coping mechanisms. The planned contact with a therapist is a positive factor, but the immediate vulnerability warrants a medium severity assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 17:17:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Trying to reach out instead of giving in. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential escalation of risk. While the individual is reaching out for help, the presence of urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 17:16:22"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The constant put-downs are eating away at me. Anyone else experience this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and feelings of isolation coupled with the statement of 'constant put-downs', suggesting potential abuse. While there's no explicit mention of self-harm or suicidal ideation, the deteriorating mental state warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 17:15:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain explicit ideation or intent related to self-harm, suicide, violence, abuse, or overdose. The user is reaching out for support, suggesting a desire to connect rather than harm themselves or others.",
    "detected_category": "other",
    "timestamp": "2025-12-11 17:14:19"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his dog in the park. Shaking. Don't know what to do, feel sick. Anyone else ever witness something like that? Makes you lose faith.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing animal abuse can be psychologically distressing and lead to emotional distress. While there's no immediate physical threat to humans reported, the emotional impact and potential for escalation warrant a medium severity rating.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 17:13:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n>  Relapsed after a while. Feeling so ashamed and alone. Anyone know any good coping mechanisms that actually work? Feeling desperate.\n\n**Option 2 (Sharing Experience):**\n\n>  Scars aren't for attention. They're a reminder of battles fought and survived. Still fighting some days. Be kind, you never know.\n\n**Option 3 (Raising Awareness):**\n\n>  Hard to talk about, but self-harm isn't always what you think. It can be a sign of deep pain, not just \"attention-seeking.\" Let's be more understanding.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates a relapse and feelings of desperation. While not explicitly suicidal, the relapse and feeling alone increase risk. Options 2 and 3 address self-harm, implying it's a present issue for someone.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 17:12:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed, and unsure how to cope, suggesting potential distress and need for support. The statement 'I don't know what else to do' indicates a level of desperation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 16:20:57"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Remember, you're not alone. Talking can make a difference.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating a potential risk. While the person reached out for help, the severity remains medium due to the expressed urge.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 16:19:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Trying to resist, but it's hard. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm and difficulty resisting, indicating immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 16:18:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just feeling so lost. Things at home have been rough lately, more yelling, more... controlling. Anyone else been through this? How do you even start to get out?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially escalating situation at home with controlling behavior and increased yelling, which could indicate abuse. The feeling of being 'lost' and wanting to 'get out' suggests a need for help and a possible risk of harm depending on the specifics of the situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 16:17:52"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street, got way too heated. Makes you wonder what happens behind closed doors. Anyone know resources for DV in the city? Worried about her.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a heated argument between a couple in public, with concern expressed for the woman's safety suggests a potential risk of domestic violence. The observer's worry and search for resources indicate a perception of elevated risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 16:16:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"He keeps saying he's sorry, but it keeps happening. I feel so stupid for believing him. Has anyone else been through this? How do you even start to get out?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a pattern of repeated harm and feelings of being manipulated, hinting at a potentially abusive situation. The feeling of being trapped and asking how to get out indicates a need for help.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 16:15:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me up. Please, if you're using, have someone with you and keep Narcan close. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potential for future overdoses and highlights the dangers of drug use. While the person survived, the situation was life-threatening.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 16:14:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like a dark cloud won't lift. Reaching out because I know I need to. Anyone else feel this way? Talking helps, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and a desire to connect with others for support. While indicating distress, it doesn't explicitly mention self-harm, suicidal ideation, or other immediate dangers. The user is actively seeking help.",
    "detected_category": "other",
    "timestamp": "2025-12-11 16:13:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on finding help that actually understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and being overwhelmed, indicating a potential mental health crisis. The user acknowledges the need for help but struggles to find it, suggesting a barrier to support.",
    "detected_category": "suicide",
    "timestamp": "2025-12-11 16:12:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, but it shook me up. Everyone, please learn the signs. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, a drug overdose is a serious medical event with potentially fatal consequences. The writer's distress also indicates the severity of the situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 16:11:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street. He shoved her, hard. My heart's still racing. Should I have done something? Feel so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence observed, potential for escalation or injury.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 15:19:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Walking on eggshells constantly. Feeling trapped. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult and potentially dangerous situation at home, indicating emotional distress and a feeling of being trapped. The phrase 'walking on eggshells' suggests potential emotional abuse or a volatile environment. While not explicitly stating suicidal or homicidal ideation, the feelings of being trapped and the plea for help suggest the situation warrants attention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 15:18:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after OD'ing. Scared and ashamed. Never thought it would happen to me. Anyone else been through this? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Recent overdose indicates potential for repeat occurrence and feelings of shame and fear suggest vulnerability. The person is actively seeking support.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 15:17:10"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out on the bus today. Seriously shaken. Is it normal to feel this anxious afterwards? I keep replaying it in my head.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The individual witnessed violence and is experiencing anxiety, indicating psychological distress but no immediate threat to self or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 15:16:08"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough. Walking on eggshells constantly. Anyone else ever feel like they're just waiting for the next explosion? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 62 (char 87)",
    "detected_category": "unknown",
    "timestamp": "2025-12-11 15:15:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary stuff. Narcan saved them, thank goodness. Makes you think, you know? Be safe out there. Know your limits.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests potential exposure to dangerous substances and environments. While Narcan was successful, the event itself indicates a risk of overdose in the area.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 15:14:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing a friend OD was the scariest night of my life. Narcan saved them. Please, learn how to use it. It could save someone you love. 💔",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a personal experience of witnessing a drug overdose, which is a life-threatening event. While the friend survived due to Narcan, the underlying risk of overdose remains very serious and potentially fatal.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 15:13:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just talking about it feels like a weight lifted. If you're struggling too, please reach out. You're not alone. 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and encourages seeking help, indicating distress but not immediate danger.",
    "detected_category": "other",
    "timestamp": "2025-12-11 15:12:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, thank god. Please, if you're using, carry it. It could save a life. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose incident, which is a serious medical emergency. While the person was saved, the potential for death or severe harm exists.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 15:10:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs... I feel so small. Anyone else been through this? How did you find the strength to leave?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes consistent emotional abuse which can lead to significant psychological distress and potentially escalate to other harmful behaviors. The individual is also seeking advice on leaving, suggesting a desire to escape the situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 15:09:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to distract myself, but it's hard. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which could imply urges to self-harm or suicide. The individual is struggling to cope and seeking reassurance, suggesting a potential for escalation if support is not found.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 14:19:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so numb lately. The urge to feel *something* is overwhelming. Anyone else get this? Talking helps, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of numbness and a strong urge to feel something, which could lead to risky behaviors. While not explicitly mentioning self-harm or suicide, the underlying emotional state suggests vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 14:18:36"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw two guys fighting outside my apartment last night. Really shook me up. Kept me awake. Anyone else ever feel totally helpless witnessing something like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight was upsetting, but there's no indication of immediate danger or intent to harm self or others. The person expresses feeling helpless but is primarily describing their emotional reaction.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 14:17:34"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight outside the bar last night. Dude got knocked out cold. Shook me up. Makes you think, y'know? Anyone else feel like violence is just getting worse?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is disturbing, but doesn't indicate imminent danger to the person reporting it. It describes a past event.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 14:16:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary. Narcan worked, thank god. Made me realize how close we all are to the edge. Learn CPR, carry Narcan, please. You could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a recent overdose event requiring Narcan intervention, indicating a potential ongoing risk of overdoses in the area and highlighting the seriousness of the situation. While not directly threatening or immediate, the proximity to a life-threatening situation warrants a medium severity assessment.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 14:15:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD. Makes me sick. Lost my cousin last year. Please, if you're struggling, reach out. There are people who care. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and concern about overdoses, indicating a potential risk to others who may be struggling with substance abuse and considering overdose. While not explicitly suicidal, the reference to a lost cousin and urging others to reach out suggests awareness of the potential for fatal consequences.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 14:14:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel so trapped. Anyone else been through this? How did you find help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, suggesting emotional abuse and a feeling of being trapped. While not explicitly mentioning physical violence or suicidal ideation, the situation presents a risk of escalation and potential mental health deterioration.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 14:13:25"
  },
  {
    "title": "User Story: Overdose",
    "content": "My brother almost didn't wake up yesterday. Scariest moment of my life. Narcan saved him. Please, learn the signs of an OD and carry it if you can. It's real out here.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a severe, life-threatening situation that occurred recently.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 14:12:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is getting strong again. I'm trying to resist, but it's hard. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a high risk of potential harm to the individual. While the person is trying to resist, the strength of the urge elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 14:11:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scariest thing ever. Narcan saved him, but shaken. Please, if you're using, have someone with you & have Narcan. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a recent overdose event requiring Narcan intervention, indicating a high risk of further overdose events for the individual and potentially others. The friend's experience highlights the potential for fatal consequences.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 14:10:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and 'drowning,' indicating potential distress and a need for support. While it doesn't explicitly mention self-harm or suicide, the intensity of the negative emotions warrants concern and further assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-11 13:29:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my kid's school. Shaking. Called the cops but feeling so helpless. Anyone else see anything? Worried about this neighborhood.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A fight witnessed near a school indicates a potential threat to the safety of children and others in the area. While the immediate incident is being handled by police, the poster's concern suggests a potential for ongoing issues or escalation.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 13:28:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me up. Please, if you're using, have someone with you and carry Narcan. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and highlights the risk of future overdose events. While the individual was saved, the situation indicates an active overdose risk in the user's environment and a potential need for support for the witness.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 13:27:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, but it shook me. We gotta talk more about this. Where to get help? I'm still processing.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be significantly distressing and indicates the presence of a serious and potentially life-threatening situation in the community. The mention of needing to process the event and asking where to get help suggests the individual is affected and possibly experiencing vicarious trauma.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 13:26:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...scary lately. Walking on eggshells constantly. Anyone else ever feel like they're losing themselves? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a stressful and potentially unsafe home environment. Phrases like 'walking on eggshells' and 'scary lately' suggest emotional distress and potential abuse, although the specific nature of the threat is unclear.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 13:25:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt that familiar urge again last night. Managed to distract myself with a movie, but it's exhausting. Anyone else relate? Just feeling really alone rn.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a \"familiar urge\" which, without further context, is concerning. The feelings of exhaustion and loneliness further elevate the risk, suggesting a struggle to cope.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 13:24:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and helplessness but does not contain explicit suicidal ideation, self-harm plans, or threats of violence. The user is reaching out for support, indicating a desire to connect with others.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 13:23:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Narcan saved him. Scary reminder how easily things can go wrong. Please, learn the signs of overdose. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a high risk of death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 13:22:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, isolating me from friends... feels like I'm walking on eggshells. Anyone else been through this? How did you find help? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (put-downs, isolation) and a feeling of being lost, indicating a potential risk for deteriorating mental health and possible escalation of the abusive behavior. While not explicitly stated, the feeling of being lost can lead to self-harm ideation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 13:21:41"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight outside the bar last night. Dude got knocked out cold. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel like violence is just getting worse lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A violent incident resulting in a person being knocked unconscious was witnessed. While not directly involving the reporter, it suggests a potential risk of violence in the area and could indicate a trend of escalating violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 13:20:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just realized things aren't \"just how he is.\" Gaslighting & yelling every day... feels like I'm walking on eggshells. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (gaslighting, yelling) which can escalate and lead to psychological distress and potential harm. The feeling of walking on eggshells indicates a hostile environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 12:25:26"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, isolating me from friends... Feeling trapped. Anyone else been through this? Need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, indicating a potential risk of escalation to physical harm or mental health crisis. The feeling of being trapped suggests a significant impact on the individual's well-being.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 12:24:24"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Talking to someone feels impossible, but I'm trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a need for help, indicating a potential risk that requires further assessment. While there is no explicit mention of self-harm or suicide, the low mood and feeling of impossibility in talking to someone suggest a vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2025-12-11 12:23:22"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately, urges are back. Trying to distract myself, but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which suggests a potential escalation of a negative situation. While there is no explicit mention of intent or specific plans, the expression of difficulty in coping and seeking connection implies a need for support and monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-11 12:22:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy and I don't know what to do. Talking to a friend helped a little, but it's still hard. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but there is no explicit mention or indication of self-harm, suicidal ideation, violence, abuse, or overdose. While concerning, it seems to be a general expression of distress.",
    "detected_category": "other",
    "timestamp": "2025-12-11 12:21:19"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get jumped on my way home. Shook me up bad. Called 911, but feel so helpless. Is there anything else I could've done? Need to process this...\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a violent act, causing distress to the author. While the event is serious, the author is not directly involved as a victim and has already reported it to the authorities. The focus is on their emotional response and feelings of helplessness.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 12:20:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about overdose deaths is scary. My cousin almost didn't make it last year. Narcan saved him. Please, learn how to use it, it's so important. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a near-fatal overdose and encourages Narcan use, indicating a risk of overdose in the community or personal network.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 12:19:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor being carried out by paramedics yesterday. OD. Scared me bad. Checking in on my friends today, asking if they're okay. This shit is real. Please be careful.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Neighbor's overdose suggests potential risk for others, especially given the expression of fear and concern for friends. While not explicitly stated, the text implies a shared context of potential substance use and related dangers.",
    "detected_category": "overdose",
    "timestamp": "2025-12-11 12:18:13"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw two guys fighting outside my apartment last night. Shook me up. Called the cops, but still feel uneasy. Anyone else ever witness something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence, which is unsettling, but does not indicate direct harm or immediate threat to the poster. It mainly expresses unease and a desire for coping mechanisms.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 12:17:11"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my building. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel unsafe in the neighborhood lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text doesn't indicate imminent danger to the author or others. It expresses fear and concern about neighborhood safety, but lacks specific threats or escalating action.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 12:16:10"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to a friend helped a bit, but it's still there. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but doesn't contain any explicit mention of self-harm, suicide, or harm to others. While concerning, it primarily describes a state of emotional distress. The act of reaching out to a friend is a positive coping mechanism, further suggesting a lower immediate risk.",
    "detected_category": "other",
    "timestamp": "2025-12-11 11:18:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, walking on eggshells... Is this normal? Feeling so lost. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (put-downs, walking on eggshells) and feelings of being lost, indicating a potential risk to mental well-being. While not explicitly stating intent for self-harm or harm to others, the situation warrants concern and further assessment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 11:17:13"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Guy got shoved into traffic. Shaken up. Is there anywhere to report this without giving my name? Feel sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A person was physically assaulted and pushed into traffic, indicating a high risk of serious injury or death.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 11:16:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He yelled again last night, broke a plate. I feel so trapped. Is this normal? I don't know who to talk to.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates escalating domestic abuse (yelling, breaking objects), feelings of being trapped, and isolation, suggesting a high risk of physical and psychological harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 11:15:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a crisis line, just talking helped a little. It's a hard day.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of being overwhelmed. While the person reached out for help, the fact that the urges are present suggests a notable risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-11 11:14:08"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside my building. Shook me up. Called the cops, but I'm still rattled. Anyone else ever witness something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can cause psychological distress and potential fear of escalation. The incident involves physical violence which is inherently serious.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 11:13:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's getting harder to pretend everything's okay. The put-downs are constant now. I feel so small. Anyone else been through this? How did you find the strength to leave?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, feelings of worthlessness, and a desire to escape the situation. The constant put-downs suggest a pattern of abuse, but there is no immediate threat to life or safety explicitly mentioned.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 11:12:05"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard shouting next door again last night, then a crash. Wish I knew what to do. Feels wrong to ignore it, but...\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests potential violence or abuse occurring next door, indicated by shouting and a crash. The user expresses fear and uncertainty, implying a concerning situation that warrants attention.",
    "detected_category": "violence",
    "timestamp": "2025-12-11 11:11:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are strong. Reached out to a friend, just needed someone to listen. It helped a bit. Remember you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and a rough time, suggesting distress. Reaching out for help is a positive sign, but the presence of strong urges necessitates a 'medium' severity rating.",
    "detected_category": "suicide",
    "timestamp": "2025-12-11 11:10:02"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been feeling so isolated lately. Constant put-downs disguised as \"jokes\" are really taking a toll. Anyone else experience this? How do you cope? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of isolation and distress due to ongoing emotional abuse (\"constant put-downs\"). While not explicitly suicidal or self-harming, the feeling of being \"lost\" and the impact on their well-being suggest a potential for escalation if the situation continues.",
    "detected_category": "abuse",
    "timestamp": "2025-12-11 11:09:00"
  }
]