[
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Just reaching out... has anyone else felt this way? Need some hope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed ('drowning'). While there's no explicit mention of self-harm or suicide, the intensity of the negative emotions and the cry for help suggest a potential risk that warrants attention and support.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 04:22:15"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his car after getting cut off. Scared me. Is that normal road rage? Feeling anxious now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the observer is feeling anxious and witnessed an act of aggression, the event appears isolated and the direct threat is low. The anger was directed at an object (the car) rather than a person.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 04:21:13"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shaken up. Makes you realize how quickly things can escalate. Is there anywhere to learn self-defense around here? Feeling vulnerable.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be psychologically distressing and increase feelings of vulnerability. The individual is actively seeking self-defense, indicating a perceived ongoing risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 04:20:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just want to know if anyone else feels like they're just... existing? Reaching out before things get worse.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and existing, and explicitly states they are reaching out 'before things get worse,' suggesting potential escalation of negative thoughts or feelings. This indicates a need for further assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 04:19:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary. Narcan saved them, thank goodness. Makes you realize how fragile life is. Anyone know resources for helping people struggling? Need to do something.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was successful, a person overdosing indicates a significant risk of death. The user also expresses a desire to help, implying a concern about ongoing risk to others.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 04:18:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thankfully. Please, learn the signs. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event and indicates a potential risk of future overdoses in the community. While Narcan was effective in this instance, the incident highlights the presence of a dangerous situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 04:17:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "My neighbor just OD'd. Narcan saved him, but it was close. Scared me straight. We need more help, not judgment. Anyone know resources?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the neighbor was saved, the overdose event indicates a significant risk in the immediate environment and highlights potential substance abuse issues requiring attention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 04:16:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scared me so bad. Narcan saved him, but it was too close. Learn the signs, folks. Could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and highlights the potential for fatal outcomes related to drug use in the community. While the individual survived due to Narcan, the 'too close' aspect and call to action suggest a significant risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 04:15:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Walking on eggshells constantly. Is this normal? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a stressful and potentially harmful home environment, characterized by constant tension ('walking on eggshells'). While not explicitly stating harm, the feeling of being 'lost' and the acknowledgement of 'rough' times suggest a potential for escalation and negative mental health impacts. The lack of specifics makes it difficult to gauge the immediate danger, but the indicators warrant concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 04:14:03"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just realized yelling doesn't have to leave a mark to hurt. Been walking on eggshells for so long, I forgot what it's like to breathe easy. Anyone else relate? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional distress and a sense of being lost, potentially indicative of a negative mental state. While there's no explicit mention of self-harm or suicide, the feeling of being trapped and 'walking on eggshells' suggests a potentially harmful situation. The mention of abuse is indirect but possible.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 04:13:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about overdose deaths rising again. Makes me sick. Lost my cousin last year. If you're struggling, please reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references overdose deaths and expresses grief over a personal loss related to overdose. While not explicitly suicidal, the context of rising deaths and personal loss suggests increased vulnerability and potential risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 03:39:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n**Option 1 (Seeking Help):**\n\n> Feeling really overwhelmed lately. The urge to hurt myself is strong. Anyone know some good coping mechanisms that actually work? Feeling lost.\n\n**Option 2 (Sharing a small victory):**\n\n> Had a really rough day, but I managed to resist the urge to self-harm. Small win, but it feels huge right now.\n\n**Option 3 (Raising Awareness):**\n\n> Just a reminder that self-harm is a sign of deep pain, not attention-seeking. Be kind, check in on your loved ones.\n\n---\n\n**Important Considerations:**\n\n*   These are very short and simplified examples. Real-life situations are much more complex.\n*   If you or someone you know is struggling with self-harm, please reach out for professional help. Here are some resources:\n    *   The National Suicide Prevention Lifeline: 988\n    *   The Crisis Text Line: Text HOME to 741741\n*   Creating content about self-harm should be done responsibly and with consideration for the potential impact on others.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Option 1 explicitly states a strong urge to self-harm, indicating immediate risk. While Options 2 and 3 are less urgent, the overall context deals directly with self-harm and includes a person experiencing a strong urge.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 03:38:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD...scary. Lost my cousin last year. If you're struggling, please reach out. There are people who care and want to help you get better. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and fear related to overdose, including personal loss, and includes a message of support for those struggling. While not explicitly suicidal, the mention of overdose and personal loss increases the risk level.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 03:37:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm so tired of walking on eggshells. It's never enough. Anyone else feel like they're constantly being torn down, even when they try their best? Is this...normal?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of frustration and being torn down, but doesn't indicate immediate danger or specific plans for harm. It is a general expression of emotional distress.",
    "detected_category": "other",
    "timestamp": "2025-12-20 03:36:45"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street, really escalated. Feeling shaken. Is there anywhere I can report something like that anonymously? Worried for the woman.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Potential for escalation of violence towards the woman involved. The witness is shaken, suggesting the fight was intense and potentially dangerous.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 03:35:44"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Scary how fast things escalated. Makes you think, you know? Is there anywhere safe anymore?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is concerning, but the text expresses more general anxiety and philosophical questioning rather than an immediate threat to safety. There's no indication of direct involvement, imminent danger, or targeting of a specific individual.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 03:34:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so heavy, I just want to feel *something* else. Scared I'll go too far one day. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to feel something else due to feeling overwhelmed, and includes the statement \"Scared I'll go too far one day\" which suggests potential self-harm or suicidal ideation. While it's not an immediate plan, the fear indicates a struggle and potential risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 03:33:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things are bad at home again. Walking on eggshells constantly. Anyone know resources for emotional abuse?\"\n\n**Option 2 (Sharing a story):**\n\n> \"Finally out of that relationship. Took so long to realize yelling & control *is* abuse. Healing is hard.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"People often dismiss verbal abuse. It's REAL. It hurts. Don't let anyone tell you it's 'just words.'\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 suggests ongoing emotional abuse and a need for resources, indicating potential for escalation. Option 2 describes a past abusive relationship and acknowledges the difficulty of healing, which can be a risk factor for mental health issues. Although option 3 is about raising awareness, the overall context indicates vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 03:32:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scariest thing ever. Narcan saved them, but shook me up bad. Folks, please look out for each other. Learn the signs. It could be anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a traumatic event indicating a significant risk of severe harm or death. While Narcan was administered successfully in this instance, it highlights a severe, immediate danger.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 03:31:37"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting on the street, really shouting at each other. Heard a slap. Called the cops, hope she's okay. Makes me sick. Anyone else feel helpless in these situations?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reported physical violence (a slap) indicates potential for escalation and harm to the individuals involved. While the immediate danger isn't clear, the risk is present.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 03:30:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... feels like I'm walking on eggshells. Anyone else been through this? Feeling so lost and alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving controlling behavior and emotional abuse, creating a stressful and isolating environment. While not explicitly mentioning physical harm or suicidal ideation, the emotional distress indicated by \"walking on eggshells,\" feeling \"lost and alone,\" and seeking validation suggests a potential escalation of risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 02:49:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. It's like walking on eggshells constantly. Is this normal in a relationship? Feeling trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being trapped and walking on eggshells, which can indicate a controlling or emotionally abusive relationship. While no direct threat is made, the feelings of being trapped and the need to feel 'not alone' suggest potential for escalation of distress.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 02:48:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Not gonna lie, things have been rough lately. Constant put-downs, feeling isolated... Starting to think this isn't normal. Anyone else been through this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, isolation, and a possible abusive environment (constant put-downs). While there's no explicit mention of self-harm or suicidal ideation, the combination of factors suggests a medium level of risk due to the potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 02:47:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary stuff. Narcan saved their life, but it made me realize how close we all are to the edge. Please, be careful out there. Look out for your friends.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose implies a risk of similar incidents occurring and raises awareness of potential danger in the environment. The text expresses concern about the precariousness of life and encourages caution.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 02:46:25"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on the bus. So shaken. Makes you realize how quickly things can escalate. Anyone else feel like everyday aggression is just... increasing?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a violent incident. While unsettling, it doesn't directly indicate imminent danger to the person posting or others. The observation of increased aggression is subjective and doesn't escalate the risk severity in this specific instance.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 02:45:23"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Wish I'd said something. Anyone else ever feel completely helpless in those situations? Makes me sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 73 (char 98)",
    "detected_category": "unknown",
    "timestamp": "2025-12-20 02:44:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of isolation and being overwhelmed, but lacks explicit suicidal ideation, self-harm plans, or direct threats.",
    "detected_category": "other",
    "timestamp": "2025-12-20 02:43:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home haven't been good. Constant yelling, and lately... more. Feeling lost & scared. Anyone else been through this? Need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'constant yelling' and 'more,' suggesting potential escalation to physical abuse. The user expresses feeling 'lost & scared,' indicating emotional distress and a potentially unsafe environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 02:42:19"
  },
  {
    "title": "User Story: Abuse",
    "content": "I feel so lost. It's been happening for so long, I don't even know what's normal anymore. Is this abuse? Where do I even start to get help? I'm scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of being lost, potential abuse, and fear. While there isn't an explicit mention of self-harm or suicidal ideation, the distress and question about abuse warrant a medium severity rating due to the potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 02:41:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD in the park. Scary stuff. Narcan saved them, thank god. Learn the signs, people, it could save a life. #OverdoseAwareness (edited to remove hashtag)",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, indicating a significant health risk to the individual involved, although the immediate danger was mitigated by Narcan. The potential for future overdoses remains.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 02:40:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Woke up feeling sick again. Still can't believe it happened. It's like a nightmare stuck on repeat. Anyone else feel this way after...? Just trying to feel less alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of sickness, disbelief, and being stuck in a nightmare, suggesting a potentially traumatic experience. The phrase 'after...?' implies a specific event that is causing distress and isolation. While not explicitly mentioning self-harm or suicide, the level of distress warrants concern.",
    "detected_category": "other",
    "timestamp": "2025-12-20 01:45:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n\"Feeling so lost lately. Just need someone to talk to. Anyone been through this?\"\n\n**Option 2 (Sharing a personal story):**\n\n\"Remembering a dark time. Grateful to be here now. It does get better. Reach out if you're struggling.\"\n\n**Option 3 (Raising Awareness):**\n\n\"Check in on your friends. You never know what someone's going through. A little kindness can go a long way.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and a past dark time, but focuses on seeking help, sharing a positive message, and raising awareness. It does not contain explicit mentions of harm or intent.",
    "detected_category": "other",
    "timestamp": "2025-12-20 01:44:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just feeling so lost. Things at home have been rough lately, yelling all the time, and last night... well, I don't even want to talk about it. Anyone know where I can find help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates significant distress and potential emotional abuse ('yelling all the time,' 'don't even want to talk about it'). The user is actively seeking help, suggesting they recognize the problem and want a solution. The unspecific nature of 'last night' prevents a higher severity rating, but raises concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 01:43:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Just talking about it feels like a start. Anyone else ever feel like they're drowning?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being overwhelmed and a desire to talk, but lacks specific plans or intent for self-harm.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 01:42:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Glad they're okay now, but where can I learn to help if it happens again? Need to be prepared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates the presence of potential future overdose events in the area. While the individual is currently seeking help and not directly at risk, the potential for future overdoses and the lack of immediate resources create a medium risk scenario for others.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 01:41:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Almost relapsed after 6 months clean. Reached out to a friend instead. Still shaky, but glad I didn't. It's a daily battle, you know?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a near relapse after a period of sobriety, indicating a struggle with addiction and potential risk of relapse. While the individual sought help and avoided relapse, the intensity of the urge warrants a medium severity rating.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 01:40:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Terrifying. Please, if you're struggling, reach out. Don't want anyone else to go through that. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and suggests potential risk to the author's mental wellbeing. While not explicitly stating suicidal ideation, the experience can be destabilizing.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 01:39:28"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm just going through the motions. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and going through the motions, indicating a possible state of distress. However, there are no explicit mentions of self-harm, suicide, violence, abuse, or overdose. The user is reaching out for support, which suggests a desire for help rather than an immediate plan to harm themselves or others.",
    "detected_category": "other",
    "timestamp": "2025-12-20 01:38:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Is anyone else feeling this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, indicating potential distress and a need for support. While it doesn't explicitly mention self-harm or suicidal ideation, the metaphor of being underwater and unable to reach the surface suggests a significant struggle with mental health.",
    "detected_category": "other",
    "timestamp": "2025-12-20 01:37:25"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Never realized how fast things can escalate. Anyone else feel like violence is just...closer lately? Makes me anxious.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Reports witnessing a fight and expressing anxiety, but no direct threat or intent is mentioned. The user expresses feeling 'shook up' and anxious, but this doesn't indicate an immediate risk to themselves or others. It's an expression of concern and fear stemming from witnessing violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 01:36:24"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to talk to someone. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feeling low and states they need to talk to someone, suggesting a potential for escalation if support isn't found. The dark cloud metaphor can indicate depressive symptoms.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 00:44:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. The urges are strong. Trying to distract myself but it's hard. Anyone else feel this way sometimes? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and difficulty distracting oneself, suggesting a potential for escalation. While it doesn't explicitly state suicidal ideation or self-harm, the intensity of the urges raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 00:43:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just reaching out to see if anyone else has felt this way, and how you got through it. Talking feels impossible right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and difficulty talking, suggesting emotional distress but no explicit self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2025-12-20 00:42:19"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, walking on eggshells... Feels isolating. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of emotional abuse ('constant put-downs,' 'walking on eggshells') which can significantly impact mental health and could escalate. While not explicitly stated, the isolation and emotional distress increase the risk for various negative outcomes.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 00:41:17"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just...heavy. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but it doesn't contain any specific threats, plans, or indications of imminent danger. The individual is reaching out for help, which suggests a desire to improve their situation.",
    "detected_category": "other",
    "timestamp": "2025-12-20 00:40:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved their life. Carry it, learn how to use it. You could save someone's life too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates a risk of overdose in the area. While the person survived, the event highlights the potential for fatal overdoses.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 00:39:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. They're okay now, thankfully. Please, if you're struggling, reach out. There are people who care. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests potential for future incidents and highlights the presence of drug use and its inherent risks within the individual's environment or social circle. While the person survived, the event was traumatizing and indicates a potential vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 00:38:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "> I'm so tired. Things at home have been...rough lately. Walking on eggshells constantly. Is this normal? Anyone else feel like they're losing themselves? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a potential loss of self, coupled with a difficult home environment. The phrase 'walking on eggshells' suggests tension and possible verbal or emotional abuse. While there's no explicit mention of self-harm or suicide, the overall tone warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 00:37:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my neighbor unresponsive. Narcan saved him. Scariest moment of my life. Please, if you're struggling, reach out. There's help. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an actual overdose event requiring Narcan intervention, indicating immediate and life-threatening risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 00:36:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "**(Option 1: Seeking Help)**\n\n> Been feeling so lost lately. Like I'm drowning. Reaching out... anyone know good resources for when you just can't cope?\n\n**(Option 2: Sharing a Personal Story)**\n\n> A year ago today I almost didn't make it. It gets better, even when you can't see it. Please hold on.\n\n**(Option 3: Raising Awareness)**\n\n> Check in on your friends, especially the ones who seem okay. Sometimes that's who needs it most. You never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses feelings of being overwhelmed and seeking coping resources, suggesting potential distress. Option 2 references a past suicide attempt, highlighting continued vulnerability. Option 3 encourages checking on others, implying awareness of potential struggles.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 00:35:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Is it just me, or is everyone on edge lately? Feel like I can't even walk home without looking over my shoulder.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling unsafe, but doesn't indicate imminent harm to the author or others. It expresses anxiety and fear, but lacks specific threats or plans.",
    "detected_category": "violence",
    "timestamp": "2025-12-19 23:17:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Walking on eggshells constantly. Feeling so isolated. Has anyone else experienced this? How did you cope? I need to figure something out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user describes feeling isolated and walking on eggshells, indicating potential emotional distress or abuse. The request for coping mechanisms suggests a desire to improve the situation, but the admission that things are \"not good\" warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-19 23:16:52"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard shouting next door again last night, then a crash. Wish I knew what to do. Feels wrong to ignore it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Potential for violence/abuse occurring next door. While not directly threatening the speaker, the sounds of shouting and a crash suggest a possible danger to someone nearby, and the speaker's unease implies a perceived level of risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-19 23:15:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but lacks specific details about self-harm, suicide, violence, abuse, or overdose. While concerning, it doesn't indicate imminent danger.",
    "detected_category": "other",
    "timestamp": "2025-12-19 23:14:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out to a friend, hoping it helps. It's hard to keep going sometimes.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and difficulty continuing, suggesting potential for self-harm thoughts. Reaching out to a friend is a positive sign, but the underlying distress warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-19 23:13:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good lately. Constant put-downs, walking on eggshells... I'm starting to feel worthless. Is this normal? Anyone else been through this? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (put-downs, walking on eggshells) leading to feelings of worthlessness. While there's no explicit mention of self-harm or suicide, the user expressing being 'lost' coupled with feelings of worthlessness indicates a potential escalation risk. The risk is not immediate but warrants attention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-19 23:12:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, thank goodness. Makes you realize how fragile life is. Get trained, carry it if you can. Could save someone's life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event requiring emergency intervention (Narcan). While the individual was saved, the event signifies a significant risk to life.",
    "detected_category": "overdose",
    "timestamp": "2025-12-19 23:11:44"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy get shoved on the train platform today. Scared me. Is it just me, or is everyone on edge lately? Makes you think.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a shove is concerning, but the text lacks details suggesting serious injury or intent for further violence. The author primarily expresses fear and unease.",
    "detected_category": "violence",
    "timestamp": "2025-12-19 23:10:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the gas station today. Scariest thing ever. Narcan saved their life. Carry it, learn how to use it. You could save someone's mom, brother, or best friend. It's a real lifesaver.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose event, which is a life-threatening situation requiring immediate intervention. While the person survived due to Narcan, the risk of death associated with overdose is inherently high.",
    "detected_category": "overdose",
    "timestamp": "2025-12-19 23:09:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately? Wish people would just chill.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing anxiety. While concerning, it doesn't indicate immediate danger to the author or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-19 23:08:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, which can escalate to more severe mental health issues. The user expresses feeling \"lost,\" indicating a need for support.",
    "detected_category": "abuse",
    "timestamp": "2025-12-19 22:18:11"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, I will create a short social media post that discusses suicide in a realistic and authentic way, while also being mindful of safety and support.\n\n---\n\n\"Feeling so overwhelmed lately. Like I'm underwater. Reaching out because I know I need to. If you've been there, what helped?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post expresses feelings of being overwhelmed and a desire for help, indicating potential suicidal ideation, even though it's framed as reaching out for support. The mention of feeling \"underwater\" can be interpreted as a metaphor for drowning in despair.",
    "detected_category": "suicide",
    "timestamp": "2025-12-19 22:17:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming. I relapsed last night after a few months clean. Feeling so much shame. Reaching out for support, need to remember I'm not alone in this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential vulnerability and increased risk, although the individual is reaching out for support. The mention of shame can also be a risk factor.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-19 22:16:07"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on my street. Shaken up. It's the second time this month. Anyone else in the neighborhood feeling unsafe lately? What can we even do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A fight occurred and the poster expresses feeling unsafe, indicating a potential for further violence and a negative impact on their well-being.",
    "detected_category": "violence",
    "timestamp": "2025-12-19 22:15:06"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I keep making excuses for him, but the yelling is getting worse. Last night he smashed a plate. Is this normal? Feeling so lost & scared.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Escalating yelling coupled with physical aggression (smashing a plate) suggests a potential for violence and/or abuse.",
    "detected_category": "abuse",
    "timestamp": "2025-12-19 22:14:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He yells every day, then acts like nothing happened. It's messing with my head. Anyone else experience this? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes experiencing repeated verbal abuse ('He yells every day'), which is negatively impacting the individual's mental state ('It's messing with my head'). While there's no explicit mention of self-harm, suicide, or violence, the sustained emotional distress raises concern and warrants a medium severity level. The question about coping mechanisms suggests the individual is seeking help, but the situation could escalate if unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-19 22:13:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about ODs again. Scares me. Almost lost my brother last year. Narcan saved him. Please, learn the signs and carry it if you can. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a near-fatal overdose involving the author's brother, highlighting the potential for severe harm or death related to drug use. While not directly threatening self-harm or suicide, the potential risk related to overdose is significant.",
    "detected_category": "overdose",
    "timestamp": "2025-12-19 22:12:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside the diner. Froze. Should I have done something? Feel sick about it now. Anyone else ever witness something like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an act of violence (punching) indicating potential physical harm to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-19 22:10:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so alone lately. Reaching out because I don't know what else to do. If anyone has felt this way, how did you get through it? Just need some hope right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and a desire for help and hope. While expressing distress, it doesn't contain specific threats or plans to harm oneself or others.",
    "detected_category": "other",
    "timestamp": "2025-12-19 22:09:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Please, learn how to use it. Could save a life. Really shook me up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Someone overdosed, indicating a risk to individuals engaging in substance use. While Narcan was successful, the incident highlights the potential for life-threatening situations.",
    "detected_category": "overdose",
    "timestamp": "2025-12-19 22:08:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. The constant put-downs are chipping away at me. Anyone else feel like they're slowly disappearing? Need to find a safe way out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses feelings of being chipped away at, slowly disappearing, and a need to find a safe way out. The combination of these elements indicates a significant risk of self-harm or suicide.",
    "detected_category": "suicide",
    "timestamp": "2025-12-19 21:17:29"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his partner on the street today. Frozen. Wish I'd said something, done something. Feeling sick about it now. Anyone else experience this? What do you even do?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a single incident of potential violence. While concerning, it doesn't indicate ongoing or immediate danger to anyone involved currently based on the provided context. The focus is on the witness's reaction and feelings.",
    "detected_category": "violence",
    "timestamp": "2025-12-19 21:16:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's getting harder to pretend everything is okay. Constant put-downs, controlling behavior... I feel so alone. Has anyone else gone through this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, indicating possible emotional abuse. The feeling of isolation and the question about seeking help suggest the individual is distressed and potentially vulnerable.",
    "detected_category": "abuse",
    "timestamp": "2025-12-19 21:15:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD hit way too close to home. Lost a friend last year. Please, if you're struggling, reach out. There are people who care. Don't become a statistic. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a personal loss due to overdose and expresses concern for others who might be struggling. While it doesn't explicitly mention suicidal ideation, the connection to overdose and the plea for help suggest a potential risk for self-harm or overdose in others.",
    "detected_category": "overdose",
    "timestamp": "2025-12-19 21:14:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scared me senseless. Narcan worked, thank god. We gotta do better, this can't keep happening. Where can I learn how to use that stuff myself?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and suggests a potential ongoing risk of overdose in the described environment. While the person survived, the event indicates a real and present danger.",
    "detected_category": "overdose",
    "timestamp": "2025-12-19 21:13:22"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... Feels like I'm walking on eggshells. Anyone else been through this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, indicative of emotional abuse. While not explicitly stating physical harm, the 'walking on eggshells' feeling suggests a heightened state of anxiety and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-19 21:12:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed yesterday. Didn't want to, but I relapsed. Day 1 again. Reaching out for support this time. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse and overwhelmed feelings suggest potential for continued self-harm. The text explicitly mentions a relapse which indicates a history and vulnerability. While reaching out is positive, the preceding statements warrant concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-19 21:11:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling really down and struggling to see the point of things. Reached out to a friend, which helped a little. Remember to check in on your loved ones. You never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and being \"down\", suggesting possible depression or suicidal ideation. While the person reached out to a friend, the overall sentiment warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-19 21:10:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after 6 months clean. Disappointed in myself, but trying to remember recovery isn't linear. Reaching out to my therapist today. It's okay to ask for help.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a vulnerability and potential for further risky behavior. While the individual is reaching out for help, the recent relapse increases the immediate risk level.",
    "detected_category": "other",
    "timestamp": "2025-12-19 21:09:15"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my kid's school. Shaken up. Makes you wonder what's going on in people's lives. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text primarily expresses feeling shaken and reflective rather than indicating an imminent or direct threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-19 21:08:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. Just trying to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-19 20:18:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out before it gets worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed ('underwater'), and a proactive intention to reach out 'before it gets worse.' This suggests potential emotional distress and a desire to prevent escalation, which warrants a medium severity level.",
    "detected_category": "suicide",
    "timestamp": "2025-12-19 20:17:49"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside the store. Froze. Should I have done something? Feel sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Report indicates active physical violence. The potential for escalation and severe harm to the victim is high.",
    "detected_category": "violence",
    "timestamp": "2025-12-19 20:16:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Just need to vent. Things escalated again last night. I feel so trapped. Anyone else been through this? How do you even start to get out?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates distress, feeling trapped, and a possible escalation of events, suggesting a need for help. The vague nature warrants concern, even if the specific risk is unclear.",
    "detected_category": "abuse",
    "timestamp": "2025-12-19 20:15:46"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train. Heart's still pounding. Didn't escalate further, thankfully. Is there anything you're supposed to *do* in that situation? Feels wrong to just stand there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While a person was shoved, indicating a potential for violence, the situation did not escalate and there's no indication of serious injury. The reporter is shaken but unharmed.",
    "detected_category": "violence",
    "timestamp": "2025-12-19 20:14:44"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting on the street. Really shook me up. Reminded me too much of my own childhood. Anyone else feel triggered by stuff like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes being emotionally triggered by witnessing a fight, causing distress but not indicating immediate danger to self or others. It's a request for coping mechanisms, not a declaration of intent or plan.",
    "detected_category": "other",
    "timestamp": "2025-12-19 20:13:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after OD'ing. Scared. This stuff is not a game. If you're struggling, please reach out. I don't want anyone else to go through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Recent overdose requiring hospitalization indicates a significant risk of repeated overdose and potential fatality.",
    "detected_category": "overdose",
    "timestamp": "2025-12-19 20:12:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just wanted to say it's okay to not be okay. If you're struggling, please reach out. There's help out there. I'm trying to find it too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and encourages seeking help, but doesn't contain specific threats or plans.",
    "detected_category": "other",
    "timestamp": "2025-12-19 20:11:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about Mac Miller again… it's terrifying. Lost a friend last year. If you’re struggling, please reach out. There's help out there. Don’t become another statistic. #SubstanceUse #OverdoseAwareness #MentalHealth",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about overdose and mentions personal loss due to a similar situation, suggesting potential risk related to substance use and mental health struggles. While not directly expressing intent, the context implies vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-19 20:10:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just talking about it feels like a weight lifted. If you're struggling too, please reach out to someone. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and encourages seeking help, suggesting distress but not imminent harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-19 20:09:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Just reaching out to see if anyone else knows this feeling. Need to find a way to breathe again.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed ('underwater'), and a desire to 'breathe again,' which can be interpreted as a need for relief from distress. While it doesn't explicitly mention self-harm or suicide, the metaphorical language suggests a potential for escalation if the feelings persist.",
    "detected_category": "suicide",
    "timestamp": "2025-12-19 19:16:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Like I'm underwater and can't breathe. Reaching out because I don't know what else to do. Is anyone else feeling this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of isolation, suffocation, and helplessness. While not explicitly suicidal, the language suggests significant distress and a potential risk of escalation if support is not received.",
    "detected_category": "suicide",
    "timestamp": "2025-12-19 19:15:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD on the street today. Scary stuff. Really makes you think. Know the signs, people. Naloxone saves lives. Be safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potentially dangerous situation and highlights the prevalence of drug use in the area, posing a risk to others who may be vulnerable. The text also implies possible availability of harmful substances.",
    "detected_category": "overdose",
    "timestamp": "2025-12-19 19:14:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Just talking feels impossible. Anyone else ever feel completely numb but also overwhelmed? Seriously considering reaching out for help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of numbness, overwhelm, and difficulty communicating. The phrase 'seriously considering reaching out for help' indicates awareness of a problem and potential desire to address it, but also implies a current struggle. The 'heavy' feeling and numbness, combined with overwhelm, suggest potential emotional distress beyond a simple bad mood.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-19 19:13:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw my neighbor being taken away in an ambulance. Overdose. Scared me to death. Please, if you're struggling, reach out. Don't be afraid to ask for help. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes a neighbor's overdose and expresses fear, it primarily focuses on encouraging help-seeking behavior. The overdose event itself is a serious safety concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-19 19:12:43"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Guy was shouting, then BAM. Shook me up. Is it just me, or is everyone on edge lately? Need to breathe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the text describes a violent incident, the reporter seems shaken but not directly involved or threatened. There's no indication of ongoing danger, specific threats, or escalation.",
    "detected_category": "violence",
    "timestamp": "2025-12-19 19:11:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in our town. It's terrifying. Lost a friend last year... Please, if you're struggling, reach out. There's help available. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose death and a personal loss from overdose, indicating an immediate and potentially widespread risk. While the author encourages seeking help, the presence of a recent overdose suggests a significant problem within the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-19 19:10:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on my street. Shook me up. Called the cops, but feeling really anxious now. Anyone else deal with seeing something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight can be a disturbing event, leading to anxiety and fear. While the individual is not directly involved or physically harmed, the psychological impact warrants a medium severity rating.",
    "detected_category": "violence",
    "timestamp": "2025-12-19 19:09:38"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight downtown last night. Seriously shook me up. Is it just me, or is everyone on edge lately? Makes you scared to go out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses fear and anxiety due to witnessing a fight, but doesn't indicate immediate danger or intent to harm self or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-19 19:08:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to hide the bruises. Said I was clumsy, but I know how I got them. Anyone else feel like they're walking on eggshells constantly? I don't know what to do anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions bruises and the feeling of walking on eggshells, indicating potential physical and emotional abuse. The phrase \"I don't know what to do anymore\" suggests a state of distress and potential helplessness.",
    "detected_category": "abuse",
    "timestamp": "2025-12-19 19:07:35"
  }
]