[
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed ('underwater'), indicating significant distress and a need for help. While not explicitly suicidal, the sense of desperation and reaching out suggests a potential for escalation if support is not provided.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 10:20:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Trying to distract myself but it's hard. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which suggests a potential for self-harm or other harmful behaviors. While the individual is trying to distract themselves and seeking support, the presence of urges elevates the risk beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 10:19:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"He apologized again, flowers & promises. Said it won't happen again. This is the 4th time. Is it ever going to stop? Feeling so lost & alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Pattern of repeated apologies and promises after recurring incidents suggest a potential cycle of abuse. The feelings of being lost and alone increase the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 10:18:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just... heavy. Reaching out before things get worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a desire to reach out 'before things get worse,' which suggests potential escalation towards self-harm or suicidal ideation. The user is implicitly asking for help, indicating a need that isn't being met and a desire to prevent a negative outcome.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 10:17:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, stronger than before. Trying to stay strong, but it's exhausting. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges and feelings of being overwhelmed, suggesting a potential risk of self-harm or other negative coping mechanisms. While the individual expresses a desire to stay strong, the level of exhaustion raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 10:16:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend in the street. Froze. Someone called the cops, but I feel sick. Is there anything else I could have done? Really shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessed a violent assault indicating immediate physical danger to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 10:15:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things are bad at home again. I feel so alone and don't know where to turn. Anyone else been through this?\"\n\n**Option 2 (Raising Awareness):**\n\n> \"It's not always physical. Gaslighting & emotional manipulation are abuse too. Don't let anyone diminish your feelings.\"\n\n**Option 3 (Sharing a Story):**\n\n> \"Finally left. Hardest thing ever, but I deserve peace. It's okay to choose yourself. #Survivor\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The texts suggest emotional distress, potential abuse, and a user in a vulnerable state. While not explicitly mentioning self-harm or suicide, the feelings of loneliness and the reference to leaving a difficult situation warrant moderate concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 10:14:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary. Narcan saved them, thank god. Makes you realize how close we all are to the edge. Learn CPR, carry Narcan. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event requiring Narcan intervention, indicating a serious, potentially life-threatening situation, although the individual survived. The call to action suggests the event had a significant impact.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 10:13:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park yesterday. Scariest thing ever. Narcan saved him, but it shook me up. Anyone know where to get training on how to use it? Feel like I need to be prepared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and highlights the presence of opioid use/abuse in the community. While the person survived, the potential for future overdoses and the emotional impact on the witness warrant a medium severity rating. The individual's expressed need for Narcan training reinforces the perceived risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 10:12:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things are bad at home again. Walking on eggshells. Anyone know resources for emotional abuse?\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Took me years to realize yelling & control *is* abuse. Still feels weird calling it that after all this time.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Remember abuse isn't always physical. Gaslighting & manipulation leave scars too. Don't ignore it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse, which can escalate to physical violence or contribute to mental health crises. Option 1 indicates an acute situation (\"Things are bad at home again\") and a need for resources.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 10:11:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just talking about it feels like a weight lifted. If you're struggling too, please reach out to someone. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and encourages seeking help, indicating emotional distress but not an immediate threat.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 09:24:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Reached out to a friend, waiting to hear back. Just trying to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm (cutting) and expresses difficulty coping. While the person has reached out for help, the imminent threat and active ideation indicate a high risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 09:23:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so heavy lately. Just talking to someone on 988 helped a bit. If you're struggling too, please reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of heaviness and mentions calling a suicide prevention hotline (988), suggesting potential suicidal ideation. While the user is encouraging others to seek help, the expression of personal struggle warrants a 'medium' severity.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 09:22:14"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Heart's still racing. Said something, but now I'm second-guessing everything. Anyone else ever freeze up in situations like that? Feeling useless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault (shoving) indicates potential violence. While the observer wasn't directly targeted, the event is recent and emotionally impactful. The risk is medium because it's an isolated incident reported by an observer and not directly impacting them beyond emotional distress, but represents a potential for escalation or further violence to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 09:21:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I hate it. Trying to stay strong and remember why I stopped, but it's hard. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse in urges and feelings of being overwhelmed, suggesting a potential for self-harm or other negative coping mechanisms. While not explicitly suicidal, the individual is struggling and vulnerable.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 09:20:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough lately. Walking on eggshells constantly. Is it normal to feel this scared all the time at home? Starting to feel like I'm losing myself.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a significant level of distress and fear within the home environment, suggesting potential emotional or psychological abuse. The phrase \"walking on eggshells\" implies a volatile situation, and feeling \"scared all the time\" is concerning. The loss of self further elevates the severity.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 09:19:08"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad. Constant put-downs, controlling behavior... I feel so trapped. Anyone else been through this? How did you find help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and feeling trapped, suggesting potential domestic abuse. While there is no explicit mention of physical harm or intent to self-harm, the situation warrants concern and further investigation. The severity is elevated because controlling behavior can escalate to physical violence and significantly impact mental health.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 09:18:06"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so isolated. Has anyone else experienced this? How did you find the strength to leave?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, indicative of emotional and potentially psychological abuse. The feeling of isolation is also concerning. While there's no immediate threat of physical harm explicitly stated, the situation could escalate and negatively impact the individual's mental health.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 09:17:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are strong. Reached out to a friend, feels a little better. Remember you're not alone. <3",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the presence of strong urges and a recent rough time, suggesting a potential risk. Reaching out to a friend is a positive sign, but the strength of the urges warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 09:16:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like nothing matters. Reaching out because I know I need help. If you've been there too, how did you get through it?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 85 (char 110)",
    "detected_category": "unknown",
    "timestamp": "2025-12-15 09:15:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately.  The urges are back and stronger.  Trying to resist but it's exhausting.  Anyone else relate?  Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges and feelings of being overwhelmed and alone. While it doesn't explicitly state intent, the resurgence of urges suggests a potential for escalation if support is not received.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 08:23:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. The urge to hurt myself is back. It's scary. Trying to reach out instead. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a current urge to self-harm, indicating active risk. While the individual is reaching out for help, the presence of the urge elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 08:22:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to stay strong & remember I deserve better. Reaching out to my therapist tomorrow. One day at a time, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which suggests a potential for self-harm or other harmful behaviors. While the person is actively seeking help and trying to cope, the presence of urges elevates the risk beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 08:21:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown yesterday. Scary stuff. Narcan saved him, but it made me realize how close to home this hits. If you're struggling, please reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests potential for secondary trauma or increased risk of substance use in the individual. Also highlights the prevalence of a dangerous situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 08:19:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about another OD. Scared. Lost a friend last year. If you're struggling, please reach out. There are people who care. It's not worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and grief related to overdose deaths, indicating a potential for suicidal ideation or behavior due to vicarious trauma and personal loss. The plea for help suggests the author recognizes the danger and is trying to advocate for others, but the vulnerability is evident.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 08:18:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "I lost a friend last week to an overdose. It happened so fast. Please, if you're struggling, reach out. There are people who care and want to help you get through this. Don't be afraid to ask.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent death by overdose, indicating a significant risk of similar occurrences for individuals currently struggling with substance abuse.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 08:17:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scariest thing ever. Narcan saved them, but it shook me up. Know where to get it in [City Name]? We gotta look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event that can indicate a broader problem of drug use and potential for future overdoses in the area. The need for Narcan suggests a risk of future life-threatening events.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 08:16:53"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his girlfriend on Elm St today. Shook me up. Called the non-emergency line but feel like I should've done more. Anyone else see anything? Just feeling helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical assault observed, indicating potential for escalation and ongoing harm. While reported to non-emergency, the event constitutes a violent act.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 08:15:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. People just watched, no one helped. Is this normal now? Makes you wonder what's the point sometimes.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence but doesn't directly express intent to harm self or others. It expresses distress and questions the value of life, but doesn't suggest imminent risk.",
    "detected_category": "other",
    "timestamp": "2025-12-15 08:14:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice or just someone to listen?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, indicating emotional distress. There is no explicit mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2025-12-15 08:13:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and it's exhausting fighting them. Reached out to a friend, hoping it helps. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a return of urges and feeling overwhelmed, indicating a potential risk. Reaching out to a friend is a positive sign, but the statement \"Just need to get through tonight\" suggests immediate concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 07:21:33"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them. Please, if you're struggling, reach out. There's help. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, though the person was saved, is a traumatic event that can significantly impact mental health. While the individual in the text wasn't directly harmed, the experience is described as 'scary' and causing them to shake, indicating distress and potential for vicarious trauma.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 07:20:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's getting harder to hide the bruises. Saying I'm clumsy isn't cutting it anymore. Anyone know of resources for domestic abuse in [City]? I'm scared.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates physical abuse and fear, suggesting a high risk of continued or escalating harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 07:19:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. I feel so trapped. Just need to tell someone, anyone. Is there a way out of this cycle?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped and a cyclical problem, suggesting potential distress and a need for help. The ambiguity warrants concern but doesn't explicitly indicate immediate danger.",
    "detected_category": "other",
    "timestamp": "2025-12-15 07:18:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thankfully. Please, if you're using, keep it on you. Could save a life. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Overdose occurred, requiring Narcan. While the person survived, the potential for death was present, indicating a significant risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 07:17:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, just gotta keep distracting myself. It's hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a strong urge to self-harm, which presents an immediate risk. While the person has reached out for help and is attempting distraction, the presence of strong urges elevates the severity beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 07:16:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "> It's getting harder to pretend everything's okay. He's been isolating me from my friends, and last night... I don't even want to write it down. Is this abuse? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates potential physical and/or sexual abuse ('I don't even want to write it down') coupled with social isolation, a known risk factor for further harm. The question 'Is this abuse?' suggests a realization of a dangerous situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 07:15:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Just reaching out... anyone else ever feel like they're just too tired to keep going? Could use some kind words or advice.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of exhaustion and being 'too tired to keep going,' which, while not explicitly suicidal, suggests a significant level of distress and potential risk. The user is reaching out, indicating a desire for help.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 07:14:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thank god. Makes you think. Check in on your friends, people. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose was reversed, the situation highlights a potentially life-threatening risk in the community. It indicates a need for awareness and preventative measures.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 07:13:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough. Constant put-downs, controlling behavior. I feel trapped. Has anyone else experienced this? I need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential abuse (put-downs, controlling behavior), creating a risk of psychological harm. While not explicitly stating physical harm, the feeling of being 'trapped' elevates the concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 07:12:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after 6 months clean. Disappointed but trying to be kind to myself. Reaching out for support today. It's a tough journey.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates vulnerability and a potential for escalation of substance use. While the individual is seeking support, the relapse itself represents a risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 06:23:54"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Dude got decked, just like that. Makes you realize how quickly things can turn ugly. Shaken up, honestly.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling, but the text does not indicate ongoing danger or specific threat to the speaker or others. It expresses being 'shaken up' which suggests a negative emotional impact, but not an immediate safety risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 06:22:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough few weeks. Feeling so alone, like nothing matters. Talking to a friend helped a little, but the dark thoughts keep coming back. Reaching out for professional help tomorrow. Wish me luck.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of loneliness, hopelessness, and recurring dark thoughts. While they have reached out to a friend and plan to seek professional help, the persistence of negative thoughts suggests a potential risk that warrants attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 06:21:51"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on my street. Shaken up. It's too close to home. Anyone else feel like things are getting more volatile lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is upsetting but doesn't indicate imminent danger to the person reporting. It expresses unease and a sense of increasing volatility, but lacks specific threats or indications of direct involvement.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 06:20:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home have been rough. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? How did you find help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, leading to feelings of isolation. While there's no explicit mention of physical harm or suicidal ideation, the situation indicates a potential for escalation and necessitates seeking help.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 06:19:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight. Hope it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed ('underwater'). While the individual is reaching out to a friend, the phrasing suggests a significant level of distress. The question 'It's okay to not be okay, right?' indicates a need for reassurance and validation, suggesting the individual is struggling to cope.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 06:18:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD. It hits different when it's someone you knew. Please, if you're struggling, reach out. There are people who care. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and awareness of overdose risk, indicating potential vulnerability within the author's social circle and implicitly acknowledging the prevalence of substance use issues. The reference to 'struggling' and 'don't become a statistic' suggests a concern for others who may be at risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 06:17:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Old coping mechanisms almost took over. Reached out to a friend instead. Still shaky, but here. There is another way. #YouAreNotAlone\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the person felt overwhelmed and old coping mechanisms (potentially harmful) almost took over, suggesting a risk. Reaching out to a friend is a positive sign, mitigating the immediate danger, but the shakiness implies ongoing vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 06:16:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"I keep making excuses for him, but the yelling is getting worse. Last night he broke a plate. Is this still just 'stress'? Feeling lost & scared.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Escalating yelling and property damage (breaking a plate) suggest a potential for violence and an unsafe environment. The person expresses feeling scared, indicating distress.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 06:15:42"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out at the bus stop. Shaken up. Called the cops, but still feel sick. Anyone else ever witness something like that? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence, causing emotional distress. While concerning, it doesn't indicate immediate danger to the individual or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 06:14:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Wish I'd said something, done something. Feeling sick about it now. Anyone else ever experience this? How do you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports of violence (shoving) observed in public. While not directly involving the reporter, it indicates a potential for escalation and risk of harm to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 05:22:05"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is there anyone else who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost and overwhelmed ('underwater') and is reaching out for help, indicating distress and potential vulnerability. While there's no explicit mention of self-harm or suicide, the intensity of feeling lost warrants a medium severity due to the potential for escalation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 05:21:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park today. Scary stuff. Narcan saved him, thank god. Makes you realize how close it is. Learn the signs, carry Narcan if you can. It saves lives. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose was non-fatal, the text describes a real-life overdose event requiring intervention, indicating a significant health risk present in the community. The phrase \"makes you realize how close it is\" increases the urgency.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 05:20:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Never thought I'd actually witness something like that. Is there anyone else feeling unsafe lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing the person to feel shaken and unsafe. While a fight indicates violence, the person is not directly involved or threatened in the text. The feeling of unsafety is general and not directed towards a specific threat or plan.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 05:18:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Been feeling so isolated lately. Partner's been controlling who I talk to & where I go. Walking on eggshells constantly. Anyone else experience this? It's exhausting.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional and social isolation coupled with controlling behavior from a partner, suggesting possible emotional abuse. While not explicitly stating physical violence or immediate danger, the feeling of \"walking on eggshells\" implies a stressful and potentially harmful environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 05:17:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but it does not contain any explicit or imminent threats of harm to self or others. It seems more like a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-15 05:16:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIP posts lately. OD is scary real. Lost a friend last week. Please, if you're struggling, reach out. There are people who care. Don't become another statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references overdose (OD) and the loss of a friend, indicating a potential risk, even though it also encourages seeking help. The mention of RIP posts and becoming a 'statistic' suggests the author is aware of a serious and ongoing problem.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 05:15:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Not sure what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed ('underwater') and uncertainty about what to do, indicating potential emotional distress and a cry for help.",
    "detected_category": "other",
    "timestamp": "2025-12-15 05:14:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"I used to think yelling & insults were just \"how he is.\" Now I'm realizing it's more than that. Feeling so lost & confused. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling lost and confused potentially due to verbal abuse (yelling and insults), which can escalate and negatively impact mental health.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 05:13:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes a witnessed act of violence, it doesn't indicate the poster is in immediate danger. However, it reflects a concerning event and heightened anxiety, suggesting a medium level of risk due to potential for escalation or broader safety concerns in the described area.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 05:12:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"I keep making excuses for him. Said he was stressed, tired... but is yelling and breaking things normal? Feels like I'm walking on eggshells all the time. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving yelling and breaking things, suggesting a potential risk of escalation to physical violence or abuse. The feeling of walking on eggshells indicates a consistently unsafe environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 04:33:45"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out at the park today. Just random, teenagers. It shook me up more than I thought it would. Feeling really anxious now. Anyone else experience stuff like this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, leading to anxiety. While unsettling, it doesn't indicate direct harm to the individual or imminent danger.",
    "detected_category": "other",
    "timestamp": "2025-12-15 04:32:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I hate it. Trying to stay strong and remember why I stopped. Just needed to say it out loud.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which could potentially lead to self-harm or other harmful behaviors. The user is expressing distress and struggling to cope, suggesting an elevated level of risk compared to simply feeling down.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 04:31:42"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I keep making excuses for him, but the yelling is getting worse. Last night he cornered me... I'm scared this is escalating. Has anyone else dealt with this? Need to talk.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes escalating verbal abuse and feeling cornered, indicating a potential for physical violence. The user expresses fear, suggesting a perceived threat to their safety.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 04:30:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Made me realize how easily things can escalate. Is there anywhere to volunteer, maybe help de-escalate situations? Feeling pretty helpless right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, not being involved in one or expressing intent to harm self or others. While shaken, the individual expresses a desire to help prevent escalation, indicating a prosocial response.",
    "detected_category": "other",
    "timestamp": "2025-12-15 04:29:39"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately? Stay safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which suggests potential exposure to violence. While concerning, it doesn't explicitly state a direct threat to the author or others beyond a general feeling of unease. The call to \"stay safe\" is a cautionary message rather than an indication of imminent danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 04:28:38"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you wonder what some people are going through to act like that. Hope everyone involved is okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While a fight is mentioned, the text focuses on empathy and concern for those involved. There is no direct threat or indication of escalating violence, self-harm, or other severe risks.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 04:27:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "*   \"Been feeling so numb lately. Like I'm watching my life from behind glass. Reaching out because I don't know what else to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of numbness and detachment, coupled with a sense of helplessness ('don't know what else to do'). This suggests emotional distress and a potential risk for self-harm or suicidal ideation, although there is no explicit mention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 04:26:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been walking on eggshells lately. He gets so angry over nothing. Anyone else experience this? Feels isolating and I don't know what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of feeling like one is 'walking on eggshells' due to another person's unpredictable anger. This suggests potential emotional abuse and a climate of fear, which, while not explicitly stating physical harm, indicates a harmful and potentially escalating situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 04:25:33"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a glass wall. Reaching out because I don't know what else to do. Is there anyone else who understands this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of numbness, detachment, and a plea for connection, suggesting emotional distress and a potential for escalation if left unaddressed. The phrase \"I don't know what else to do\" warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 04:24:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about another OD. Makes me think of my brother. Scariest night of my life. Narcan saved him. Please, if you're using, keep it on hand. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a past overdose of the author's brother and implies the author is concerned about the reader experiencing a similar event. While the author is promoting harm reduction rather than expressing intent, the mention of overdose and the encouragement to have Narcan on hand suggests an existing risk of overdose within the reader's social circle.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 03:48:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor OD yesterday. Terrifying. Paramedics got there fast, thankfully. Makes you realize how fragile life is. Check on your friends, people. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a neighbor's overdose indicates a serious health crisis event and potential indirect exposure to trauma, while the call to action suggests awareness and a desire to prevent further incidents.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 03:47:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Really fought the urge to hurt myself. Still feeling shaky, but I made it through. Reaching out instead. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text explicitly mentions fighting the urge to self-harm, indicating active suicidal ideation, even though the individual did not act on it. Reaching out is a positive sign, but the presence of the urge elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 03:46:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were strong, but I distracted myself with a movie. Small win, I guess. Anyone else feel like they're constantly fighting a battle with themselves?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions \"strong urges\" and a constant internal \"battle.\" While the individual reports successfully distracting themselves, the presence of strong urges suggests a potential for escalation and warrants monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 03:45:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things are bad at home. Walking on eggshells constantly. I feel so small. Is this normal? Anyone else go through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive or highly stressful home environment, characterized by fear and emotional distress (feeling 'so small'). The phrase 'walking on eggshells' suggests an unpredictable and potentially volatile situation. While not explicitly mentioning physical harm, the emotional impact and implied power imbalance raise concerns.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 03:44:48"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate imminent or direct threat to the author or others. It expresses feelings of anxiety and awareness of potential escalation but lacks specific details or plans.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 03:43:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Narcan saved them, thank god. Carry it, learn how to use it. It really can save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event and indicates the presence of a potentially life-threatening situation, even though Narcan was administered successfully. The experience can be traumatic for the witness, and the advice to carry and learn how to use Narcan highlights the ongoing risk of overdoses in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 03:42:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud is constantly over me. Reaching out because I know I need to. Talking to a therapist tomorrow. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a desire to seek help, indicating a potential risk that requires attention. The individual is taking a positive step by seeking therapy, but the underlying feelings warrant concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 03:41:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so overwhelmed lately. Like I'm drowning and can't see a way out. Talking to someone feels impossible, but I know I need to. Any resources anyone can suggest?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being overwhelmed, hopelessness ('drowning and can't see a way out'), and difficulty seeking help. While there is no explicit mention of self-harm or suicidal ideation, the distress level and feeling of being trapped suggest a need for intervention and increased risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 03:40:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about ODs lately is scary. Lost a friend last year... Narcan saves lives. Please, learn how to use it. You could save someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions overdose and the loss of a friend, indicating a risk of potential overdose incidents and highlighting the importance of Narcan. While it doesn't explicitly state an imminent risk, the personal connection and call to action elevate the severity.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 03:39:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is back. Reached out to a friend, but it's still tough. Just trying to get through the next hour. Anyone else relate? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a recurring urge to self-harm and difficulty coping, indicating a serious risk. While the individual has reached out for help, they are still struggling, signifying a potentially imminent threat to their safety.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 02:56:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. The urge to cut is so strong. Trying to resist, but it's exhausting. Anyone else get this? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating active suicidal ideation, but also mentions resisting the urge and seeking coping mechanisms, suggesting some protective factors. This places the risk at medium severity, requiring attention and support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 02:55:44"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Frozen. Should I have said something? Feel sick about it now. #domesticviolence #witness #help",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing someone being shoved indicates potential for further escalation of violence and possible injury.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 02:54:42"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Scared. My neighbor's been yelling again, worse than before. I heard crashing. Don't know what to do. Police were already here last month for a different incident.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports of escalating yelling, crashing sounds, and prior police involvement suggest a potential for violence and immediate danger to the reporting person or their neighbor.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 02:53:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just had another fight. Walking on eggshells is exhausting. Is this normal in relationships? Feeling so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses emotional distress and loneliness, but doesn't contain explicit threats of harm to self or others. The phrase \"walking on eggshells\" indicates potential relationship issues, but lacks details about physical or emotional abuse.",
    "detected_category": "other",
    "timestamp": "2025-12-15 02:52:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and exhausted, but does not contain explicit suicidal ideation, self-harm plans, or threats of violence. While concerning, the language is general and lacks immediate risk indicators.",
    "detected_category": "other",
    "timestamp": "2025-12-15 02:51:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are back, feel so ashamed. Reached out to the crisis line, just needed to tell someone. It helps, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which is a warning sign. Reaching out for help is positive, but the presence of urges suggests a potential risk that requires monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 02:50:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Called 911, they made it. Learn CPR, carry Narcan. It can happen to anyone. Please be careful out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a potentially fatal overdose situation requiring emergency medical intervention. While the person survived, the event highlights a significant risk of death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 02:49:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home have been rough. Constant yelling, put-downs... I feel so small. Anyone else been through this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of verbal abuse and emotional distress, which could escalate if unaddressed. The feeling of being 'small' suggests a potential impact on self-worth and mental health.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 02:48:34"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside the grocery. Froze. Didn't know what to do. Called 911, but I'm still shaken. Anyone else ever witness something like that? What do you DO?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an act of violence (punching a girlfriend) which constitutes a direct physical threat to another person. This falls under potential domestic violence/abuse, which often escalates.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 02:47:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "```\nJust need to vent. Constant put-downs disguised as jokes are really getting to me. Feels like I'm walking on eggshells all the time. Anyone else experience this? How do you cope?\n```",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes emotional distress due to put-downs, suggesting a potentially unhealthy environment. While it doesn't indicate immediate danger, prolonged exposure to such behavior can escalate risk over time. No direct threats or intent of self-harm or harm to others are indicated.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 01:47:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mentions of self-harm, suicide, violence, abuse, or overdose. It is a general expression of emotional distress and a desire for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-15 01:46:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so overwhelmed lately. Like I'm drowning. Anyone know any good resources for when you just... can't?\n\n**Option 2 (Personal Story):**\n\n> Thinking about a dark time. Grateful I got through it. If you're struggling, please reach out. You're not alone.\n\n**Option 3 (Raising Awareness):**\n\n> Lost a friend to suicide last year. Check in on the people you love. You never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text contains expressions of feeling overwhelmed and drowning, alongside mentions of suicide and past dark times. While not explicitly suicidal, the language indicates potential distress and vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 01:45:41"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, but it's still tough. Anyone else relate? Just trying to get through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, which indicates immediate risk. The person has reached out for help, which is a positive sign, but the feeling of being overwhelmed persists, suggesting the risk is ongoing.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 01:44:39"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Reminded me of my brother. Anyone else feel extra anxious after witnessing violence? I'm trying to stay calm.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and experiencing anxiety, but doesn't express intent to harm self or others. The individual is attempting to cope and stay calm.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 01:43:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. Yelling, then the silent treatment. Feels like walking on eggshells. Anyone else deal with this? I just feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes emotional distress and a potentially unhealthy relationship dynamic (yelling, silent treatment, feeling alone), but it doesn't explicitly mention any immediate or severe safety risks. Walking on eggshells indicates anxiety and discomfort, but not necessarily imminent danger. More information is needed to determine if this is escalating to physical abuse or violence.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 01:42:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scariest thing ever. Narcan saved them. Please, learn how to use it. It could save a life. I'm still shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, indicating a significant health risk and potential for future incidents. While Narcan was successful, the event caused distress, suggesting a concerning situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 01:41:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges are strong. Just trying to breathe and remember this feeling will pass. Anyone else relate? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and a difficult emotional state, suggesting potential self-harm or suicidal ideation. While not explicitly stated, the mention of 'urges' warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 01:40:33"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing so many RIPs lately. Lost another friend to an OD. This sh*t is relentless. Please, if you're struggling, reach out. There are people who care and want to help you get through this. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief over overdose deaths and encourages seeking help, suggesting a potential for self-harm or suicidal ideation in the struggling reader, compounded by the emotional distress related to overdose deaths. The language hints at hopelessness and a heightened risk environment.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 01:39:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD. Lost a friend last year. Scared it'll happen again. If you're struggling, please reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear of future overdose and acknowledges personal loss due to overdose, indicating potential vulnerability and raising concern for the author's well-being, though it doesn't express direct intent.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 01:38:30"
  }
]