[
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things aren't good at home. Walking on eggshells constantly. Is this normal? Feeling lost and alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Indicates potential emotional distress, a difficult home environment, and feelings of isolation. While not explicitly stating harm, the mention of 'walking on eggshells' can suggest potential abuse or conflict.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 06:21:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm drowning. Just reaching out to see if anyone else has felt this way and what helped. Seriously struggling.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and struggling, which could indicate a mental health crisis. The phrase \"drowning\" suggests a sense of being overwhelmed and potentially hopeless. While it doesn't explicitly mention self-harm or suicide, the intensity of the feelings warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 06:20:36"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting on the street, shouting and shoving. Made me so anxious. Reminded me too much of my parents. Anyone else get triggered by stuff like that? Feel like I can't breathe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes anxiety and being triggered by a fight, but there is no explicit mention of self-harm, suicidal ideation, violence directed at self or others, abuse in the present, or overdose. The individual is experiencing distress but does not appear to be in immediate danger.",
    "detected_category": "other",
    "timestamp": "2026-01-18 06:19:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed, which are potential risk factors for more serious mental health issues. The user is reaching out for help, indicating distress and a need for support.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 06:18:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad lately. Walking on eggshells constantly. Anyone else ever feel this trapped? I don't know where to even start getting help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and potentially harmful situation at home, characterized by stress and a feeling of being trapped. While no specific threat is made, the walking on eggshells description suggests a potentially abusive or violent environment. The user also expresses a lack of knowledge about accessing help, suggesting a vulnerable state.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 06:17:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD today. Scary stuff. Narcan saved him, thank god. Makes you realize how fragile life is. Know the signs, carry Narcan if you can. Could save someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome due to Narcan, indicates a serious risk of overdose in the community. The text encourages carrying Narcan, implying the potential for future incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 06:16:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is getting stronger. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a strong urge to self-harm, suggesting imminent risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 06:15:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Terrifying. Narcan worked, thank god. Please, learn the signs. It could save a life. I’m still shaking. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with successful intervention, is a significantly distressing event. While the immediate danger was averted, the experience can have lasting psychological effects on the witness. The mention of shaking indicates ongoing distress.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 06:14:27"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Never seen anything like it. Shaken up. Makes you realize how quickly things can escalate. Anyone else witness it?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is disturbing, but the text doesn't suggest imminent danger or direct threat to the individual or others. The shaken feeling indicates distress, but not necessarily risk of harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 06:13:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice or just someone to talk to would be appreciated.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but there's no explicit mention of self-harm, suicide, or harm to others. It's a general cry for help and support.",
    "detected_category": "other",
    "timestamp": "2026-01-18 06:12:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things aren't good at home. Constant put-downs and controlling behavior... I feel trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and emotional distress, suggesting a potential risk of escalation. The individual feels trapped, which can lead to negative coping mechanisms. While not explicitly mentioning violence or self-harm, the situation warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 05:20:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scariest thing ever. Narcan worked, thank god. Learn how to use it, please. It could save a life. Seriously shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event indicating potential for serious harm, although the immediate crisis was averted by Narcan.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 05:19:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs and walking on eggshells. Feels like I'm losing myself. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of emotional abuse and a feeling of losing oneself, which can escalate to more severe mental health issues. The individual is also actively seeking help, indicating some awareness and concern about their situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 05:18:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm drowning and no one can see me. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed, with implicit suicidal ideation (drowning metaphor). The user is actively reaching out for help, suggesting a willingness to engage, but the depth of distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 05:17:10"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so incredibly low lately. Like I'm underwater. Reaching out to a friend, but it's hard. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and isolation, indicating a potential risk. The act of reaching out is a positive sign, but the phrase 'like I'm underwater' suggests significant distress. It warrants further investigation to understand the individual's current state and coping mechanisms.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 05:16:09"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside my apartment. Shaking. Called the cops, but still feel sick. Anyone else feel totally drained after witnessing stuff like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence is distressing, but the text doesn't indicate direct threat or severe psychological distress. The person feels drained but is coping by seeking support.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 05:15:07"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Wish I'd said something, done something. Now I just feel sick. Anyone else ever experience this? How do you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence (the shove) suggests potential escalation or repeated behavior. While the immediate risk to the poster is low, the event indicates a risk of violence/abuse to the girlfriend and potentially to others who might intervene in future incidents. The poster's distress suggests potential psychological impact.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 05:14:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Terrifying. They're okay now, but it shook me. Please, if you're struggling, reach out. Don't go through this alone. Resources are out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a friend's overdose, indicating a potential risk of further overdose incidents or similar crises. While the friend is currently okay, the event highlights the presence of substance abuse and related dangers.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 05:13:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but shook me up. Please learn how to use it. You could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was used successfully, the text describes a recent overdose event, indicating ongoing risk of overdose in the community and potential for future incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 05:12:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Called 911, thankfully they're okay now. Please, if you're struggling, reach out. Don't let it get that far.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual survived, the event involved a life-threatening overdose requiring emergency intervention. The experience was described as 'scariest thing ever,' indicating a significant emotional impact.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 05:11:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so incredibly alone lately. Like I'm underwater and can't breathe. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of isolation, hopelessness, and being overwhelmed, which are risk factors for suicidal ideation. The explicit reaching out suggests a desire for help, but the underlying feelings are concerning.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 04:33:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, I understand. Here's a short social media post meeting your criteria:\n\n\"Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed (\"underwater\"), and a plea for help. While it doesn't explicitly mention self-harm or suicide, the tone and language suggest significant emotional distress and a potential vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 04:32:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "I'm having a really hard time lately. Feeling so lost and empty. Reaching out because I don't know what else to do. Any advice or support would be appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and empty and indicates the person is struggling and unsure of what to do, suggesting emotional distress that could escalate. While not explicitly suicidal, the lack of coping mechanisms and reaching out for help raises concern.",
    "detected_category": "other",
    "timestamp": "2026-01-18 04:31:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm drowning. Reaching out because I don't know what else to do. Any advice or just someone to listen?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and drowning, indicating significant distress and a need for support. While not explicitly suicidal, the language suggests a potential for escalation without intervention.",
    "detected_category": "other",
    "timestamp": "2026-01-18 04:30:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong, but I'm trying to resist. Reached out to a friend, hoping it helps. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating potential for imminent action. While the individual is attempting to resist and has reached out for help, the presence of the strong urge elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 04:29:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting near the bus stop. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel unsafe walking alone lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and raises general safety concerns, but there's no immediate or direct threat mentioned. The poster is expressing fear and unease, not reporting active harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 04:28:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so numb lately. Like I'm watching my life from behind a screen. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of numbness and detachment, a potential precursor to more serious mental health issues. Seeking help indicates awareness, but the depth of distress is unclear. ",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 04:27:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling really overwhelmed lately. Old urges are back. Anyone know good coping mechanisms that actually work? Scared of slipping.\n\n**Option 2 (Sharing a personal story):**\n\n> 3 weeks clean. Small victory, but it feels huge. Still fighting the bad days, but I'm fighting.\n\n**Option 3 (Raising Awareness):**\n\n> It's not attention-seeking. It's a sign someone's hurting. Please be kind. You never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates a relapse risk with the phrase 'Scared of slipping' and 'Old urges are back'. This suggests active struggles and potential for self-harm, requiring attention and support, though it does not explicitly state intent.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 04:26:37"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up. Made me realize how quickly things can escalate. Anyone else feel like things are getting angrier lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing unease. While concerning, it doesn't directly indicate immediate danger to the author or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 04:25:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Need to find a way back to the surface.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and overwhelmed, using metaphors like 'underwater' which can indicate distress and a need for help to 'surface'. While not explicitly suicidal, the language suggests a potential for escalation if not addressed.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 04:24:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately, urges are back. Reached out to a crisis line, just needed to tell someone. It helps, even a little. Taking it one day at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which suggests a potential for self-harm or suicide. While the person reached out for help, the presence of these urges elevates the risk beyond low. It's not high because they are actively seeking support.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 03:48:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved their life, thank god. Please, if you're using, keep it with you, or have a friend who does. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an actual overdose event, which is a life-threatening situation. While the person survived, the event's inherent risk is very high.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 03:47:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Walking on eggshells constantly. Feeling so isolated. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home environment, feelings of isolation, and a sense of being on edge. While not explicitly stating harm, the language suggests emotional distress and potential for escalation. 'Walking on eggshells' can be indicative of a stressful or potentially abusive environment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 03:46:10"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a fight downtown last night. Punches thrown, yelling. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning but doesn't directly indicate imminent danger or targeting of the writer. It expresses unease and awareness of potential escalation, but it is not a direct threat or report of severe harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 03:45:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so overwhelmed lately. Urges are back. Anyone know good coping mechanisms that actually work? Talking isn't cutting it rn.\n\n**Option 2 (Sharing a Personal Story):**\n\n> Scars are a reminder of a past I'm trying to outrun. It's a long road, but I'm still here.\n\n**Option 3 (Raising Awareness):**\n\n> Just a reminder that self-harm isn't attention-seeking. It's a sign someone's hurting deeply. Be kind, always.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions of urges, scars, and self-harm indicate potential risk. While immediate danger isn't explicit, the individual is struggling and seeking coping mechanisms.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 03:44:07"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy shove his girlfriend on the street. Froze. Wish I'd said something. Feeling sick about it. Anyone else ever witness something like that? How do you react?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can have psychological impacts on the observer and indicates potential for escalation or further harm to the victim.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 03:43:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Scratched again last night. Trying to find better coping mechanisms. It's a struggle. Anyone else relate? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions self-harm (scratching), indicating a risk. While there's an attempt to find coping mechanisms, the feeling of being overwhelmed elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 03:42:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw my neighbor being taken away in an ambulance. OD. So scary. Please, if you're struggling, reach out. There's help available. Don't let this happen to you or someone you know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text reports an overdose event requiring medical intervention. While not directly threatening immediate harm, it indicates a serious health and safety risk due to potential substance abuse and possible mental health struggles in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 03:41:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Relapsed after 6 months clean. Feels like square one. Reaching out to my therapist tomorrow. Just needed to tell someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety is a significant stressor and can increase the risk of mental health crisis. The individual is reaching out for help which is positive, but the feeling of being back at 'square one' suggests potential for discouragement and vulnerability.",
    "detected_category": "other",
    "timestamp": "2026-01-18 03:40:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been rough. Walking on eggshells all the time. Anyone else experience this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive or highly volatile home environment (\"walking on eggshells\") and expresses feelings of isolation. While not explicitly mentioning violence, abuse, or self-harm, the situation described significantly increases the risk of escalation to those outcomes. Requires further investigation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 03:38:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly low lately. Like there's no way out. Talking to a friend helped a little, but I'm still struggling. Anyone else ever feel this hopeless?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a lack of a way out, which are risk factors for suicidal ideation. While the person mentions talking to a friend and feeling slightly better, the persistent struggle indicates a need for further evaluation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 03:03:20"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Made me realize how quickly things can escalate. Anyone else feel anxious after witnessing something like that? Need to process.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potentially dangerous situation, but the author expresses anxiety and a need to process the event rather than indicating direct involvement or immediate threat. The risk is primarily emotional distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 03:02:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing ambulances near Elm St again. Makes me sick. Lost my cousin last year. Please, if you're struggling, tell someone. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and connects it to the presence of ambulances, indirectly suggesting potential suicidal ideation or crisis related to others in the area, while also containing a message of support. The mention of a lost cousin increases concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 03:01:17"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his car mirror after arguing with someone on the phone. Made me jump. Reminded me too much of my dad. Anyone else get triggered by stuff like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes an isolated incident of property damage fueled by anger. While potentially unsettling and triggering for the author, it doesn't indicate an immediate or significant risk of violence towards others or self-harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 03:00:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want the noise to stop. Scared to admit I've been struggling with self-harm again. Reaching out for help feels impossible, but I know I need to. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions struggling with self-harm, indicating active engagement in harmful behavior. The individual also expresses feeling overwhelmed and a desire for the noise to stop, coupled with difficulty reaching out for help, which significantly elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 02:59:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nUgh, rough night. Felt that familiar urge again. Didn't give in this time, but it was close. Reminding myself I deserve better. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a strong urge, suggesting a potential risk of relapse or escalation of the underlying issue. While the individual reports resisting the urge this time, the closeness of the situation indicates a vulnerability that requires attention. This is more than just a bad day; there is a specific struggle happening.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 02:58:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD at the gas station. Narcan saved them, thank god. Scary how fast it happens. Learn the signs, please. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a recent overdose incident requiring intervention, indicating a risk of future overdoses in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 02:57:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... scary lately. Walking on eggshells constantly. I don't know what to do anymore. Is there anyone who understands? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and frightening situation at home, suggesting potential abuse or violence. The user expresses feeling scared, alone, and uncertain, indicating emotional distress. While there's no explicit mention of self-harm, suicide, or violence directed at others, the intensity of the emotions and the 'scary' environment warrant a medium severity rating.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 02:56:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Cutting again after 6 months clean. Just need to get through tonight. Anyone else relate? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Relapse of self-harm after a period of abstinence, coupled with feelings of overwhelm, loneliness, and a stated need to 'get through tonight' indicates a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 02:55:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. They're okay now, but damn. Narcan is a lifesaver. Know the signs, carry it if you can. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the person survived, can be a traumatic event and suggests the potential for future overdoses in the area. While the immediate danger is resolved, the event indicates a recurring risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 02:54:06"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. Small things keep escalating, and I feel so trapped. Has anyone else dealt with this? Feeling really lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped and lost, with escalating small issues. This suggests a potential for harm, although the target and nature of the harm are unclear.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 01:47:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Relapsed after a few months clean. Feeling so ashamed and alone. Reaching out to my therapist tomorrow. Just needed to say it somewhere. It's a struggle.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse can increase risk for self-harm or suicide, and feelings of shame and isolation worsen the situation. Seeking therapy is a positive mitigating factor, but the immediate risk needs to be acknowledged.",
    "detected_category": "suicide",
    "timestamp": "2026-01-18 01:46:10"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling, but does not indicate immediate danger to the author or others. The author expresses feeling \"on edge,\" suggesting anxiety but not necessarily intent to harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 01:45:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Old coping mechanisms surfaced. Day 1 again. Reaching out to my therapist today. It's a process, not a failure.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse into old coping mechanisms indicates increased distress and potential for harmful behaviors. Seeking therapy is a positive step, but the immediate risk requires attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 01:44:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head, I just want to feel *something* else. Not proud of it, but trying to find healthier ways to cope. Anyone else relate? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a desire to feel *something* else when overwhelmed, implying a potential for unhealthy coping mechanisms. While not explicitly stating self-harm or suicidal ideation, the user acknowledges not being proud of their current methods and seeks alternatives, suggesting a risk that needs monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 01:43:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Hard to explain, but it makes me want to hurt just to feel something else. Anyone else ever feel this way? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to self-harm to alleviate emotional distress and feelings of being lost, indicating potential for harmful behavior.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 01:42:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Trying to resist, but it's so hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a re-emergence of self-harm urges, indicating a potential escalation of risk. While the individual is attempting to resist, the intensity of the urge suggests a need for support and monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 01:41:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so incredibly low lately. Just reaching out to see if anyone else understands. Feeling really alone right now and don't know what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and low mood but lacks specific details about self-harm, suicide, or harm to others. It appears to be a general expression of distress.",
    "detected_category": "other",
    "timestamp": "2026-01-18 01:40:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So shaken. Makes you realize how quickly things can escalate. Anyone else feel on edge lately? Wish there was more we could do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused emotional distress but doesn't indicate direct threat or immediate danger to the author or others. While unsettling, it expresses a general feeling of unease rather than a specific intent or plan.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 01:38:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel like violence is getting worse lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning, but doesn't indicate imminent danger to the author or others. It expresses unease but lacks specific threats or plans.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 01:37:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is creeping back. Scared and don't want to go down that road again. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a renewed urge to self-harm, indicating an active risk. While the person expresses fear and a desire to avoid it, the presence of the urge elevates the severity beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 00:51:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good lately. Constant put-downs, controlling behavior... Feeling trapped. Anyone else been through this? Need to find a way out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and feeling trapped, suggesting a potential abusive situation. While there's no explicit mention of physical harm or immediate danger, the situation can escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-18 00:50:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is back and it's scary. Reached out to a friend, hoping it helps. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions the return of urges to self-harm, indicating a significant risk to the individual's safety. While the person has reached out to a friend, the immediate need to 'get through tonight' suggests the risk is acute and requires immediate attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 00:48:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on the bus. Shaken. Makes you realize how quickly things can escalate. Anyone else ever witness something like that? Hard to shake it off.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight on a bus is disturbing, but the text indicates emotional distress (shaken) rather than direct physical danger to the author or high probability of immediate further escalation.",
    "detected_category": "violence",
    "timestamp": "2026-01-18 00:47:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post focusing on seeking help and sounding authentic:\n\n\"Been feeling so low lately, like I'm underwater. Reached out to a friend, and just talking helped a little. Gotta keep reminding myself it's okay to not be okay & to ask for help when I need it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The post expresses feelings of sadness and being 'low', but also indicates positive coping mechanisms like reaching out to a friend and self-affirmation about seeking help. There are no explicit mentions of self-harm, suicide, or other dangerous behaviors.",
    "detected_category": "other",
    "timestamp": "2026-01-18 00:46:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is back. Talking to my therapist tomorrow, but tonight is rough. Just trying to get through it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a current urge to self-harm, indicating a high level of distress and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 00:45:54"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Scratched again last night. Feels like I'm losing control. Anyone know where I can find online support groups that actually help? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a recurrence of self-harm (scratching) and a feeling of losing control, suggesting an escalation of risk. The individual is actively seeking help, but the mention of self-harm and feelings of isolation warrant a medium severity assessment.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 00:44:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw my neighbor being taken away in an ambulance. Overdose. It's scary how easily it can happen. Please, if you're struggling, reach out. There are people who care. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a neighbor's overdose and encourages seeking help, indicating potential for harm, although not immediate or directed at the author. Raises awareness of a serious public health issue.",
    "detected_category": "overdose",
    "timestamp": "2026-01-18 00:43:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm so tired. Things at home are... not good. Walking on eggshells all the time. Anyone else ever feel this way? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of stress and unhappiness but doesn't contain explicit threats or plans for self-harm, suicide, violence, abuse, or overdose. While the mention of 'walking on eggshells' suggests a difficult home environment, the overall tone is seeking connection and validation rather than indicating immediate danger.",
    "detected_category": "other",
    "timestamp": "2026-01-18 00:42:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Scared I'll give in. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm (cutting) and fear of giving in, indicating imminent risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-18 00:41:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "Ugh, another \"perfect\" family pic online. Makes me sick. Wish people knew the truth behind closed doors. Still trying to find the courage to leave. Advice welcome.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses unhappiness, a desire to leave a potentially difficult situation ('truth behind closed doors'), and a lack of courage. While not explicitly suicidal or self-harming, the situation described hints at potential distress and instability, increasing the risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 23:17:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Narcan worked, thank god. Makes you realize how fragile life is. If you or someone you know needs help, please reach out. There are resources.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was administered successfully, the text describes a recent overdose, indicating a significant risk event occurred. The potential for future overdoses and the mention of the fragility of life suggest ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 23:16:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need help. Talking to a friend tomorrow, but any advice for getting through tonight?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of depression and a need for immediate help. While not explicitly suicidal, the \"dark cloud won't lift\" and seeking advice for getting through the night suggests significant distress and potential risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 23:15:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately, like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit statements of intent or plans for self-harm, suicide, or harm to others. It's a general cry for help.",
    "detected_category": "other",
    "timestamp": "2026-01-17 23:14:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Just need to know I'm not alone in this. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 74 (char 99)",
    "detected_category": "unknown",
    "timestamp": "2026-01-17 23:13:16"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his girlfriend on the street today. Felt so helpless. Should I have done something? Still shaking.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent act and feeling shaken suggests potential distress and concern for the victim's safety. While the witness themselves is not directly in danger, the event indicates a potential for escalation and harm to the girlfriend.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 23:12:15"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on the bus. Shook me up bad. Anyone else get super anxious after witnessing something like that? Hard to shake it off.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused anxiety. While unsettling, there's no indication of direct threat to the author or others, nor any mention of physical harm or intent to harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 23:11:14"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n\"Been feeling so low lately. Like there's no way out. Talking to someone feels impossible, but I know I need help. Where do I even start?\"\n\n**Option 2 (Sharing a Story):**\n\n\"Lost a friend to suicide last year. Still feels unreal. Please, if you're struggling, reach out. Your life matters more than you know.\"\n\n**Option 3 (Raising Awareness):**\n\n\"It's okay not to be okay. Let's be more open about mental health. You are not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 53 (char 78)",
    "detected_category": "unknown",
    "timestamp": "2026-01-17 23:10:12"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing loudly on the street. He shoved her. It was quick, but I saw it. Didn't know what to do. Wish I'd intervened, but I froze. Feeling sick about it. Anyone else ever experience this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a physical assault (shoving), indicating a potential for escalation and further violence or abuse. While the immediate act was quick, the potential for harm is significant.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 23:09:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "Ugh, another fight. Walking on eggshells constantly. Starting to feel like I'm losing myself. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being emotionally drained and isolated within a relationship, but lacks any direct or explicit indication of self-harm, suicidal ideation, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2026-01-17 23:08:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a heavy weight I can't shake. Reaching out because I know I need to. Talking to someone tomorrow. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of depression and a desire to seek help, indicating awareness of a problem and a willingness to address it. However, the feeling of a 'heavy weight' and the generalized low mood suggests a risk that requires monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 22:17:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Scariest moment of my life. Please, if you're struggling, reach out. Naloxone saves lives. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal event involving a friend, strongly suggesting an overdose requiring Naloxone. The phrase 'almost didn't make it' is very concerning. The explicit mention of Naloxone and 'struggling' points toward a serious and immediate danger.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 22:16:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, thank god. If you or someone you know is struggling, please reach out. There's help available. It's okay to not be okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, indicating a significant risk of harm. While Narcan was successful, the event highlights a vulnerability and potential for future incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 22:15:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a screen. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of numbness and detachment, indicating emotional distress and a potential need for support. The statement \"I don't know what else to do\" suggests a feeling of helplessness, elevating the risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 22:14:24"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my building. Shook me up. Reminded me of things I'd rather forget. Anyone else feel totally drained after witnessing something like that? Trying to shake it off.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is distressing but doesn't indicate immediate danger to the individual or others. The feeling of being shaken up and drained is a normal reaction to witnessing violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 22:13:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Terrifying. Narcan saved them. We need more people trained. Where can I find a local class?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates potential ongoing risk of overdose in the community. The positive outcome (Narcan saved them) mitigates the severity somewhat, but the need for wider training highlights the potential for future incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 22:12:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is creeping back. Anyone else struggle with this? Just trying to not feel so alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses an urge to self-harm, indicating a potential risk. While not explicitly stating intent or plan, the recurrence of the urge elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 22:11:20"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of things at home. Anyone else deal with that feeling of helplessness after witnessing something like that? It's hard to shake off.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling shaken, but doesn't express intent to harm self or others. The reference to 'things at home' is vague and could suggest prior exposure to violence or abuse, but without further information, the immediate risk appears low.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 22:10:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before things get worse. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, with a proactive desire to reach out before things worsen. This suggests potential for escalation, but no explicit plan is mentioned.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 22:09:17"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Makes you realize how quickly things can escalate. Shaken up. Anyone else ever witness something like that? It's hard to shake off.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potentially disturbing event, but doesn't indicate direct involvement or ongoing threat to the individual or others. The emotional impact (feeling shaken up) is acknowledged, but there are no indications of self-harm, suicidal ideation, or severe distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 22:08:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Luckily they're okay now. Learn the signs of an overdose, people. It can happen to anyone. Know Narcan!",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic experience, and while the person survived, the event highlights the risk of future overdoses and the need for preventative measures. The text encourages awareness of overdose signs and Narcan use, indicating a perceived ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 21:16:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Talking feels impossible, but I need to find a way.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed, and a need to reach out, indicating distress and potential for escalation if support is not received. While not explicitly suicidal, the inability to talk and feeling of hopelessness are concerning.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 21:15:45"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up. Reminded me of things I'd rather forget. Anyone else ever feel triggered by stuff like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses emotional distress (being 'shook up' and 'triggered') but doesn't indicate any immediate threat or intent to harm self or others. It describes a past event and seeks shared experiences.",
    "detected_category": "other",
    "timestamp": "2026-01-17 21:14:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. urges are strong. Trying to distract myself with a movie. Anyone else get that feeling like your skin is crawling? Just trying to make it through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and a feeling of distress, suggesting potential self-harm or relapse. The individual is actively attempting to cope, but the intensity of the urges elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 21:13:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Need to find a way back up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 74 (char 99)",
    "detected_category": "unknown",
    "timestamp": "2026-01-17 21:12:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me up. Knowing where to get it & how to use it is so important. Please learn, just in case.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a significant event and indicates a potential ongoing risk of overdose in the community. While Narcan was available and effective, the event caused distress to the reporter, suggesting a level of severity beyond simply mentioning the topic.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 21:11:39"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his girlfriend on the street today. Frozen. Wish I'd said something. Anyone else ever witness something like that? Still feeling sick about it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can cause emotional distress and potential fear for the safety of the involved individuals and the witness.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 21:10:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back and stronger. Reached out to a friend, but it's still tough. Anyone else feel this way sometimes? Just trying to get through it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges and difficulty coping, suggesting a potential risk that needs to be monitored. The individual has reached out for support, which is positive, but the continued struggle warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 21:09:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found out a friend OD'd. Narcan saved them, thankfully. This stuff is scary. Learn the signs, carry Narcan. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions a recent overdose event involving a friend, highlighting the potential for severe harm but also the successful intervention of Narcan.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 21:08:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough lately. Walking on eggshells constantly. Is this normal in a relationship? Starting to feel really isolated. Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling isolated and being in a relationship where the person feels like they are 'walking on eggshells'. This suggests potential emotional abuse or a highly stressful and controlling environment. While not explicitly stating harm, the isolation and stress raise concerns.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 21:07:33"
  }
]