[
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. The urge to cut is strong. Scared I'll give in. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The individual expresses a strong urge to self-harm (cutting) and fear that they will act on it, indicating imminent risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 21:16:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Luckily they're okay now. Learn CPR, carry Narcan. It can save a life. I'm still shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event indicating potential risk of overdose in the surrounding community. The person is shaken up, suggesting emotional distress.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 21:15:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to a friend helped a little. Trying to remember I'm not alone in this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but also mentions seeking support from a friend, suggesting a coping mechanism. The language does not explicitly indicate intent to harm self or others.",
    "detected_category": "other",
    "timestamp": "2025-12-06 21:14:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. Urges were strong, but I distracted myself. One hour at a time, right? Still shaky, but reaching out feels like a small win. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and being overwhelmed, suggesting a potential escalation risk even though the individual is currently employing coping mechanisms.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 21:13:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to quiet the noise is to hurt. I know it's not, but the urge is so strong. Reaching out instead. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, though the individual acknowledges it's not the right solution and is reaching out for help. This indicates active ideation and potential risk, but also a desire to avoid acting on it.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 21:12:35"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, having a really rough night. The urge to self-harm is so strong. Trying to distract myself but it's hard. Anyone else feel this way sometimes? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating immediate risk to the individual's safety. The individual is struggling to cope and seeking connection, which suggests a need for immediate support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 21:11:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to someone feels impossible, but I know I need to. Any advice on where to start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 88 (char 113)",
    "detected_category": "unknown",
    "timestamp": "2025-12-06 21:10:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Clean for 2 weeks, then relapsed. Feeling so ashamed and alone. Reaching out before it gets worse again. Anyone know good resources?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety can increase the risk of overdose due to lowered tolerance. The feelings of shame and isolation also raise concern for potential self-harm. Seeking resources is a positive sign, but the potential for escalation is present.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 21:09:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. The urge to cut is strong. Trying to resist, but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting). While the person is trying to resist, the intensity of the urge elevates the risk to medium. The mention of self-harm is a direct indicator of potential danger.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 21:08:29"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just... need to feel *something* real. Scared I'll go too far one day. Talking to a therapist, but it's slow going. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses a need to feel something real and fears going too far, suggesting potential self-harm. While they are in therapy, the progress is described as slow, implying ongoing risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 21:07:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good lately. Walking on eggshells constantly. Is this normal? Feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a stressful and isolating home environment, potentially indicative of abuse or a volatile situation, which can lead to mental health decline.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 20:17:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a strong urge to self-harm, indicating immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 20:16:44"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw my neighbor yelling at his kid again. Sounded like hitting too. Makes me sick. Wish I knew what to do. Called non-emergency last time but nothing changed.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential ongoing issue of child abuse, including physical violence. While the reporter is not directly involved or threatened, the described behavior raises concerns about the safety and well-being of the child.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 20:15:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He keeps saying he's sorry, but then it happens again. I feel like I'm going crazy. Has anyone else been through this? I need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional distress and a possible cycle of abuse, requiring further investigation to determine the level of immediate danger.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 20:14:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Please, if you're using, carry Narcan. It can save a life. Learned CPR a while back, wish I'd been faster. Be safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a recent overdose, indicating a risk of similar incidents in the area and potential for delayed response in emergency situations. While not directly threatening, the experience suggests a real and present danger related to drug use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 20:13:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Walking on eggshells all the time. Is this normal? Where do you even start to get help? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home situation, potential emotional abuse ('walking on eggshells'), and feelings of being lost, suggesting significant distress and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 20:12:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... Scared, y'know? Lost a friend last year. If you're struggling, please reach out. There are people who care and want to help. It's okay to not be okay. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and grief related to overdose deaths, indicating potential vulnerability and highlighting the impact of substance abuse. While not explicitly suicidal or indicating imminent risk, the connection to loss and the plea for help suggest a moderate level of concern for potential mental health struggles or vicarious trauma.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 20:11:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Talking feels impossible, but I need to try.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, with an implicit plea for help. While no explicit self-harm or suicidal ideation is mentioned, the intense negative emotions and difficulty communicating raise concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 20:10:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "```\nJust feeling so lost. Things at home are getting worse. I don't know who to talk to or what to do. Feeling trapped. Anyone else been through this?\n```",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, trapped, and increasing distress at home, suggesting a potential risk of self-harm or suicidal ideation, although there's no explicit mention of either. The feeling of hopelessness warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 20:09:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things are rough at home. Constant put-downs, walking on eggshells. Is this normal? Feeling so lost and alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 86 (char 111)",
    "detected_category": "unknown",
    "timestamp": "2025-12-06 20:08:32"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my building. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately? Wish there was something we could do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing distress. While unsettling, it doesn't indicate imminent danger to the poster or others, nor does it suggest active participation in violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 19:15:56"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough few weeks. Feeling so alone and overwhelmed. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and being overwhelmed, indicating distress, but does not contain explicit mentions of self-harm, suicide, violence, or abuse.",
    "detected_category": "other",
    "timestamp": "2025-12-06 19:14:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a memorial for someone lost to OD. It hits different when it's someone you knew. Please, if you're struggling, reach out. There's help available. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a fatal overdose and encourages seeking help for struggles, suggesting potential risk of self-harm or overdose.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 19:13:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough night. Urges were strong. Didn't give in, but damn it was close. Gonna try some distraction techniques. Anyone else have go-to's that work?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges that were nearly acted upon, suggesting a potential risk of self-harm or relapse. While the individual sought coping strategies, the intensity of the urges raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 19:12:51"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, but shook me up. Makes you realize how fragile life is. If you're struggling, please reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be psychologically distressing and highlights the presence of a significant risk (overdose) in the community, even though the individual survived. The event itself carries a medium severity due to the potential for severe outcomes (death) even if averted.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 19:11:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Almost relapsed after 6 months clean. Reached out to a friend instead. Still hurts, but I made it through. Talking helps, even when it's the last thing you want to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a near relapse, indicating a vulnerability and potential for future relapse. While the individual reached out for help, the risk of relapse remains.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 19:10:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scared me half to death. Narcan saved them, thank god. Learn the signs, folks. It's real.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose implies a significant risk in the community, even though the individual was saved. It suggests the presence of dangerous substances and the potential for future overdoses.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 19:09:46"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. My neighbor's yelling again, and I heard a crash. Last time police came. Should I call again? Don't want to make things worse, but...\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Yelling, a crash sound, and a history of police intervention suggest a potential escalation of violence or abuse. The neighbor's fear indicates a perceived threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 19:08:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is anyone else feeling this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but there are no explicit statements of self-harm, suicide, violence, abuse, or overdose. It seems like a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-06 19:07:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Narcan saved him. Scariest moment of my life. Please, learn the signs of an overdose. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan, indicating a high risk situation averted by immediate intervention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 19:06:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor OD yesterday. Scariest thing ever. Narcan saved him, but shook me to my core. Anyone know good resources for families dealing with addiction? Really struggling.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates the presence of addiction in the community. While the neighbor survived, the experience is causing distress and a need for resources.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 18:20:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Just trying to take it one hour at a time. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges are back' and feeling overwhelmed, which suggests a potential risk of self-harm or other harmful behaviors. While the user is reaching out for support and trying to cope, the presence of urges elevates the risk beyond a simple expression of feeling down.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 18:19:00"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Froze. Wish I'd said something, done something. Feeling sick about it. Anyone else experience this? How do you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can cause emotional distress and potential for escalation if the situation continues. While the poster is not the direct victim, the emotional impact and the potential for future violence warrant a medium severity.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 18:17:58"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight outside the bar last night. Dude got knocked clean out. Shook me up bad. Keep replaying it in my head. Anyone else ever feel like that after seeing something like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence, which can be emotionally distressing and lead to anxiety. However, there is no indication of immediate danger, intent to harm oneself or others, or any escalation beyond feeling shaken up and replaying the event.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 18:16:57"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary how quickly things escalated. My hands are still shaking. Anyone else feel like things are getting more volatile lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling, but doesn't indicate direct personal harm or involvement. The individual expresses fear and anxiety, but not intent to harm themselves or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 18:15:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just...heavy. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but there are no explicit mentions of self-harm, suicide, violence, abuse, or overdose. The individual is reaching out for help, which suggests a willingness to find alternative solutions.",
    "detected_category": "other",
    "timestamp": "2025-12-06 18:14:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank goodness. Makes you realize how fragile life is. Learn CPR, carry naloxone if you can. It helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event indicates a potentially life-threatening situation and highlights the risk of opioid-related harm in the community. The individual survived due to intervention, but the event itself carries significant risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 18:13:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Hard not to pick. Trying to find healthier ways to cope. Anyone else relate? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 54 (char 79)",
    "detected_category": "unknown",
    "timestamp": "2025-12-06 18:12:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it feels like the only way to quiet them is to... not. Just feeling overwhelmed. Anyone else ever feel this way? Reach out if you do. I could use a friend right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses being overwhelmed and a desire to 'quiet' the noise in their head, followed by a vague statement ('not...') that could imply suicidal ideation, though it's not explicitly stated. The request for a friend suggests a need for support.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 18:11:48"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my kid's school. So scary. Called the cops, but feeling shaken. Anyone else ever witness something like that? How do you deal?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight, especially near a school, presents a potential for escalation and physical harm to bystanders. While the immediate event is over, the emotional distress and potential for future incidents warrant a medium severity rating.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 18:10:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just realized I'm always making excuses for him. Said it was my fault he yelled. Is that...normal? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential pattern of verbal abuse and manipulation, where the individual is taking responsibility for the abuser's actions. This suggests an unhealthy and potentially escalating situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 17:16:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park today. Scary stuff. Narcan saved him, but it shook me up. Know where to get it in [City]? Be prepared, folks. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the person survived, suggests a risk of further overdoses in the area and highlights the potential for fatality. It also indicates a need for increased awareness and access to resources.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 17:15:09"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside the bakery. Froze. Should I have done something? Feel sick about it. What would you have done?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be traumatizing and lead to feelings of helplessness and guilt. While the original act of violence is not directed at the person reporting, the emotional distress warrants a 'medium' severity rating.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 17:14:07"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his dog on Elm Street. Shaking. Reported it, but feel sick. Anyone know what else I can do? Feel helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing animal abuse is distressing but doesn't pose an immediate physical threat to the reporter. While the dog may be at risk, the reported incident is already handled.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 17:13:05"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... feels isolating. Anyone else been through this? Where do you even start getting help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, which indicates emotional abuse. While there's no explicit mention of physical harm, the feeling of isolation and the seeking of help suggest a significant negative impact on the individual's well-being.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 17:12:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got really bad last night & I relapsed. Feeling so ashamed. Reaching out for help again. I know I can get through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse indicates potential for harm depending on the context (substance, behavior). Expression of shame and seeking help are protective factors, but relapse requires careful assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 17:11:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough night. The urges were strong, but I managed to distract myself. One day at a time, right? If anyone else is struggling, you're not alone. We can get through this.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions \"strong urges\" which suggests a potential crisis, but the individual is actively using coping mechanisms (distraction) and expressing hope, indicating a level of self-control and a desire for positive outcomes. The nature of the urges is unclear. The message is not overtly suicidal or self-harming.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 17:10:01"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out downtown. Shook me up bad. How do you guys cope with seeing stuff like that? Feeling really anxious now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a distressing event, but there is no direct indication of immediate danger to the individual or others, or intent to cause harm. The reported anxiety suggests a negative emotional impact, but not necessarily a risk of escalation.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 17:08:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant put-downs and control... feels like I'm walking on eggshells. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and control, creating a potentially harmful environment. While not explicitly stating physical harm, the 'walking on eggshells' analogy suggests fear and anxiety, which can escalate into more severe situations. The user is also expressing feelings of isolation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 17:07:57"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to stay strong and remember why I stopped. It's a daily battle. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse in urges, suggesting a potential for self-harm or a negative coping mechanism. While the individual is trying to stay strong, the presence of these urges elevates the risk beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 17:06:56"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get jumped near my place last night. Shook me up. Called the cops, but still... makes you think. Anyone else feeling unsafe lately? What do you do?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A violent crime (assault) occurred, causing the reporter distress and raising concerns about safety in their neighborhood. While the reporter was not directly involved, the proximity and impact on their feeling of safety warrant a medium severity.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 16:18:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough week. Feeling so lost and empty. Reaching out to a friend, hoping it helps. Remember to check in on your loved ones. You never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and empty, potentially indicating depression or emotional distress. Reaching out to a friend is a positive sign, but the overall sentiment suggests a need for support and raises concern for well-being.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 16:17:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to a friend helped a bit, but it's still there. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but doesn't contain explicit mentions of self-harm, suicide, or harm to others. While the feeling of being 'underwater' could be interpreted metaphorically as a struggle, it lacks immediacy or concrete plans.",
    "detected_category": "other",
    "timestamp": "2025-12-06 16:16:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to a friend helped a bit, but it's still hard. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but doesn't explicitly mention self-harm, suicidal ideation, or harming others. Seeking support from a friend is a positive sign.",
    "detected_category": "other",
    "timestamp": "2025-12-06 16:15:20"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thankfully. Makes you realize how close it is, you know? Learn the signs, carry Narcan if you can. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Direct report of an overdose incident highlights a significant risk. While the individual survived due to Narcan, the incident underscores the potential for fatal outcomes.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 16:14:18"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been walking on eggshells lately. Partner's anger is escalating. Feels like I'm doing everything wrong. Anyone else experience this? Is this normal?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Escalating anger and feeling of walking on eggshells suggests potential for abuse. The user is asking if the situation is normal, indicating concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 16:13:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIPs lately. Lost another friend to overdose last night. Please, if you're struggling, reach out. There are people who care and want to help. Don't let this be you.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Implies recent and ongoing overdose deaths within the person's social circle, suggesting increased risk for others in the same environment. The direct plea not to let it happen to the reader indicates concern for their well-being and potential suicidal ideation related to substance use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 16:12:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Reaching out because I don't know what else to do. Any advice or just someone to talk to would be appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and 'drowning,' indicating significant emotional distress and a plea for help. While not explicitly mentioning self-harm or suicide, the depth of the distress warrants a 'medium' severity rating as it could potentially escalate without support.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 16:11:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant put-downs, controlling behavior... I feel so small. Anyone else been through this? How did you find the strength to leave?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional and psychological abuse (put-downs, controlling behavior). While there's no explicit threat of physical harm or intent to self-harm, the feeling of being 'small' and the question about leaving suggest significant distress and potential for escalation. The risk stems from the potential for long-term psychological damage and possible future physical harm or dangerous situations if the abuse continues.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 16:10:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just left. Again. My head's spinning. Is it really my fault every time? Feeling so lost and alone. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, alone, and repeated negative experiences leading to distress. While not explicitly mentioning self-harm or suicide, the spinning head and questioning of fault suggest significant emotional distress and potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 16:09:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, feels a little lighter. Remember we're not alone in this. <3",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a relapse or increase in distress. While the person has reached out for help, the presence of urges elevates the risk beyond just feeling overwhelmed. ",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 15:16:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling really lost lately. Like I'm underwater. Anyone know good resources for when things get dark?\n\n**Option 2 (Sharing a Story):**\n\n> Almost lost my best friend last year. Suicide is closer than you think. Please check in on your loved ones.\n\n**Option 3 (Raising Awareness):**\n\n> It's okay to not be okay. Talking about suicide doesn't cause it. Let's break the stigma.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While not explicitly stating suicidal intent, the text expresses feeling \"underwater\" and mentions suicide being \"closer than you think,\" indicating potential distress and increased risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 15:15:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on finding the strength to reach out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, indicating distress. The individual acknowledges a need to reach out but struggles to do so, suggesting potential barriers to seeking help. While there's no explicit mention of self-harm or suicide, the underlying distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 15:14:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like nothing matters. Reaching out because I know I need help. If you've been there, how did you get through it?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a lack of meaning, indicating a potential risk of self-harm or suicidal ideation. While the person is reaching out for help, the depth of their distress warrants a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 15:13:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately, like I'm underwater. Reaching out because I don't know what else to do. If you've been there, how did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a plea for help, suggesting potential emotional distress and a possible risk of self-harm or suicidal ideation. The user is actively reaching out, which is a positive sign, but the intensity of the feelings warrants a 'medium' severity.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 15:12:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so heavy lately. Just talking feels impossible. Reached out to the crisis line, hoping it helps. It's okay to not be okay, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feeling heavy, difficulty communicating, and reaching out for help. While not explicitly suicidal, these are concerning signs of distress and potential mental health crisis.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 15:11:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, stronger than before. Trying to resist but it's exhausting. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges' that are stronger than before and being 'overwhelmed,' suggesting a potential escalation of distress. While the specific nature of the urges isn't clear, the statement indicates a struggle and a need for support. This warrants a medium severity rating due to the potential for the urges to lead to harmful actions.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 15:10:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but damn, shook me up. Know where to get it trained, just in case. You never know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome due to Narcan, indicates a moderate risk level. While the individual survived, the event was traumatic and highlights the presence of a dangerous situation. The person's concern and seeking Narcan training suggests awareness and potential future involvement.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 15:09:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thankfully. Makes you realize how close we all are to the edge sometimes. Learn CPR and Narcan training folks, it could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Observed overdose event indicates a risk of harm, even though the individual survived. The proximity to a life-threatening event increases the risk level.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 15:08:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "Ugh, another fight. Walking on eggshells is exhausting. I just want it to stop. Anyone else feel this way? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of exhaustion and isolation due to ongoing conflict. While it indicates distress, it lacks specific details about self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2025-12-06 15:07:36"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight outside my kid's school. Shaken up. Makes you wonder what's going on with people. Is anyone else feeling this lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't indicate imminent or severe harm to the author or others. The post expresses concern and unease, not a direct threat or ongoing danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 14:16:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Trying to distract myself, but it's hard. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating a current struggle and potential risk of acting on those urges. While the individual is attempting distraction, the struggle suggests the coping mechanisms may not be fully effective.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 14:15:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD in the park. Narcan saved them, but it was scary. Please, if you're struggling, reach out. There's help available. Don't let it get that far.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan intervention was successful, a person experiencing an overdose presents a significant health risk with potentially fatal consequences. The mention of struggling and seeking help suggests a potential for future incidents if underlying issues are not addressed.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 14:14:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Another fight. I feel so drained. Is this normal in relationships? Feeling like I'm walking on eggshells all the time. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive or controlling relationship dynamics, characterized by constant tension and fear ('walking on eggshells'). While not explicitly stating violence or direct harm, the emotional distress is significant and warrants attention. It could escalate if unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 14:13:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been isolating me from my friends, and the put-downs are constant. Feels like I'm walking on eggshells all the time. Anyone else been through this? How did you find the strength to leave?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse and isolation, which can escalate. The question about finding the strength to leave suggests a desire to escape a potentially harmful situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 14:12:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. The constant put-downs are eating away at me. Anyone else feel like they're walking on eggshells all the time? Is this normal? I'm starting to think it's not.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests emotional distress and a potential abusive situation due to 'constant put-downs' and 'walking on eggshells'. While not explicitly stating intent to harm self or others, the growing feeling that things are not okay indicates a need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 14:11:35"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a fight outside my kid's school today. Shook me up. Makes you wonder what kind of world we're bringing them into. Anyone else feel this way? Just trying to process.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be upsetting, but the text doesn't indicate imminent danger or a high probability of serious harm to anyone. It primarily expresses concern and emotional distress.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 14:10:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Just trying to take it one day at a time. Anyone else relate? Talking helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential relapse or escalation of a pre-existing struggle. The user is reaching out, indicating a need for support. While not explicitly stating intent, the return of urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 14:09:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD hit way too close to home. Lost a friend last year. Please, if you're struggling, reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and acknowledges the potential for struggle and encourages seeking help, indicating a risk awareness level that may be relevant to harm reduction. The mention of a friend's overdose suggests proximity to high-risk behavior.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 14:08:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...not good. Walking on eggshells all the time. Is this normal? Feeling lost. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a stressful home environment ('walking on eggshells') and feelings of being lost, suggesting potential emotional distress and a possible risk of escalation if the situation worsens.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 14:07:28"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost and overwhelmed, a sense of isolation, and acknowledges a need for help. While not explicitly suicidal, the feeling of being 'underwater' suggests significant distress and difficulty coping, warranting concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-06 13:22:42"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train platform. Scared me half to death. Everyone just walked past. Is this normal now? Feeling so shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical assault occurred, potentially causing injury to the victim. The fact that no one intervened is also concerning and could indicate a broader social issue.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 13:21:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of drowning and desperation, suggesting significant emotional distress and potential for self-harm. The user is reaching out for help, indicating a degree of self-awareness and a desire to find solutions, which tempers the severity, but the depth of the expressed despair warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-06 13:20:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank god. Makes you realize how fragile life is. Anyone know local resources for folks struggling? Want to help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes a single overdose event successfully reversed by Narcan, it indicates a real-world acute risk to life. There is also potential that others in the area are at risk of overdose as well.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 13:19:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about overdoses is scary. Lost a friend last year. Please, if you're struggling or know someone who is, reach out. There are people who want to help. It's not worth losing everything.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references overdoses and the loss of a friend, indicating potential risk to individuals struggling with substance abuse. While it promotes seeking help, the context suggests a heightened vulnerability to overdose.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 13:18:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Never thought it would hit so close. Lost a friend to overdose last night. Please, if you're struggling, reach out. There are people who care and want to help. Don't be afraid.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text reports a recent overdose death of a friend, indicating exposure to a high-risk situation and potential for grief and emotional distress, which can increase vulnerability. While not explicitly suicidal, the context and language suggest a heightened risk environment for others struggling with similar issues.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 13:17:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scared. Found my brother unresponsive. Narcan worked, thank god. Anyone know resources for aftercare and support for us both? He needs help, and so do I. Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Brother experienced an overdose reversed by Narcan. This indicates a significant substance use issue requiring immediate support and aftercare. The poster expresses feeling lost and in need of support, suggesting potential emotional distress. While not directly stating suicidal ideation, the situation is precarious and requires proactive intervention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 13:16:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, isolating me from friends... feels like I'm walking on eggshells. Anyone else been through this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse, isolation, and a feeling of constantly walking on eggshells, indicating a potentially harmful situation and a desire for help. While not explicitly stating physical violence or suicidal ideation, the context points to a concerning level of distress.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 13:15:31"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight on the street today. Just spiraled out of nowhere. Shook me up pretty bad. Makes you realize how quickly things can turn. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused emotional distress but doesn't indicate any direct threat to the author or others. It expresses a general feeling of unease rather than a specific plan or danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 13:14:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scariest thing ever. Narcan saved their life. Learn the signs, carry it if you can. You never know who might need it. 💔",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a recent overdose incident requiring Narcan, indicating potential for recurrence and ongoing risk in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 13:13:27"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on the way home. Shook me up bad. Makes you realize how fragile things are. Anyone else feel like violence is just... everywhere lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence, causing distress, but does not indicate direct involvement or immediate threat to self or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 12:22:16"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get punched outside the bar. Shook me up. Didn't intervene, wish I did. Anyone else ever freeze like that? Feeling guilty.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence can be distressing, but the text indicates no direct threat to the author or ongoing risk. The incident is described as a single punch, suggesting a lower level of violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 12:21:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\nIt's so hard to admit, but things at home have been... not okay lately. Constant yelling, put-downs. Feeling really trapped. Anyone else been through this? How did you get out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially escalating situation of verbal abuse and feelings of being trapped, which could lead to negative mental health outcomes.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 12:20:13"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard shouting next door again last night, then a crash. Wish I knew what to do. Feel helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Potential for violence next door, causing fear and feeling of helplessness. While not directly targeting the individual, the proximity and nature of the disturbance indicate a potential risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 12:19:12"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude was totally out of control, yelling and shoving. Scared the crap out of me. Is this getting worse, or am I just noticing it more?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Observed uncontrolled violence (shoving, yelling) indicating a potential risk of escalation or injury to those nearby.",
    "detected_category": "violence",
    "timestamp": "2025-12-06 12:18:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "```\nJust feeling so lost. Things at home have been...rough. Walking on eggshells all the time. Anyone else ever feel like they're just existing, not living? Need to find a way out.\n```",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a desire to escape a difficult home situation. While there's no explicit mention of self-harm or suicide, the phrase \"Need to find a way out\" combined with feeling \"lost\" and \"just existing\" raises concern. The description of the home environment as \"rough\" and involving \"walking on eggshells\" suggests potential emotional distress and instability.",
    "detected_category": "other",
    "timestamp": "2025-12-06 12:17:09"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been rough lately. Constant put-downs, controlling behavior... I feel so lost. Anyone else been through this? How did you find the strength to leave? #abuse #domesticviolence",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, suggesting emotional abuse. While there's no explicit mention of physical harm, the situation warrants concern for the individual's well-being and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 12:16:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them. Please, if you're using, carry it. You could save a life, even your own. Stay safe, everyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests immediate risk in the community, and the reference to 'using' implies ongoing drug use which carries inherent overdose risk. While the person survived, the risk of future overdose is present.",
    "detected_category": "overdose",
    "timestamp": "2025-12-06 12:15:05"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy punch his dog in the park today. Just reeled back and WHAM. I froze. Should I have said something? Still feel sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes a single instance of violence towards an animal, the act suggests a potential for escalated violence or disregard for well-being. The observer's distress also indicates the seriousness of the event.",
    "detected_category": "abuse",
    "timestamp": "2025-12-06 12:14:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so incredibly alone lately. Like I'm underwater. Just reaching out...has anyone else felt this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of loneliness and isolation, but lacks explicit indicators of suicidal intent, self-harm, or harm to others. It's a general expression of emotional distress.",
    "detected_category": "other",
    "timestamp": "2025-12-06 12:13:02"
  }
]