[
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. So scary how quickly things escalated. Makes you think twice about going out alone. Anyone else feel like things are getting worse?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Reports witnessing a fight and expresses general concern about safety. No direct threats or immediate danger implied.",
    "detected_category": "violence",
    "timestamp": "2025-12-27 21:16:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Terrifying. Narcan saved them, thank god. Makes you realize how fragile life is. If you're struggling, please reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event. While the person survived, the event highlights the risk of fatal consequences associated with drug use. The mention of Narcan implies a potentially life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 21:15:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... scary lately. Constant yelling, walking on eggshells. I feel trapped. Has anyone else gone through this? I just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive home environment, indicating emotional distress and a feeling of being trapped. While there's no explicit mention of physical harm, the constant yelling and 'walking on eggshells' suggest a risk of escalation or long-term psychological damage.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 21:14:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Scared and don't want to go down that road again. Any advice on coping skills that actually work?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of self-harm urges, expressing fear and a desire for coping mechanisms, suggesting a potential for harm but also a willingness to seek help.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 21:13:49"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, stronger than before. Just trying to get through today without giving in. Anyone else relate? Sending love. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges and a struggle to resist them, suggesting an escalation of distress and potential self-harm risk. While not explicitly stating intent, the intensity warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 21:12:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD...scares me. Lost a friend last year. If you're struggling, please reach out. There's help available, you don't have to go through it alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern and fear related to overdoses and past loss of a friend. While not explicitly suicidal or indicating immediate danger, the mention of overdose and loss suggests potential vulnerability and highlights the risk associated with substance abuse. It also implies the author may be dealing with grief and trauma.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 21:11:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Has anyone else felt this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but lacks specific details of intent or plan. General plea for support.",
    "detected_category": "other",
    "timestamp": "2025-12-27 21:10:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight. Hope it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The statement expresses feelings of being lost and overwhelmed, using the metaphor of being underwater, which can indicate a sense of desperation and isolation. Reaching out is a positive step, but the question 'It's okay to not be okay, right?' suggests uncertainty and a need for reassurance. This warrants a medium severity level due to the potential for escalating distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-27 21:09:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough patch lately. Feeling so isolated, like nothing matters. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of isolation, hopelessness, and a lack of purpose. While it doesn't explicitly mention self-harm or suicide, the user is clearly distressed and reaching out for help, suggesting a potential risk that requires attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-27 21:08:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Lost a friend last night to overdose. Feels surreal. Please, if you're struggling, reach out. There are people who care and want to help you stay here. Don't let this happen to anyone else.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent death due to overdose, indicating a significant risk of further overdoses or suicidal ideation in those struggling with similar issues.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 21:07:41"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. The urge to self-harm is strong. Reached out to a crisis line, feels like a small step. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 20:18:17"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight break out on the bus today. Scared the hell out of me. Is it just me, or is everyone on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight on a bus is unsettling and causes fear, but there's no indication of direct threat to the author or intent to harm others. The general feeling of unease is mentioned, but without specific threats or targets.",
    "detected_category": "violence",
    "timestamp": "2025-12-27 20:17:16"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed yesterday, urges were strong. Distracted myself with a movie, made it through. Small win, but it counts. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the presence of strong urges, suggesting a potential risk of self-harm. While the individual managed to cope, the experience of overwhelming urges necessitates a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 20:16:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Relapsed after a few months clean. Just trying to get through today. Anyone know any good coping skills that actually work?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse increases risk, coupled with feeling overwhelmed. Seeking coping skills suggests a desire to manage the situation, but the relapse indicates potential for further escalation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 20:15:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. OD is real. Scariest thing I've ever experienced. Please, if you're using, have someone with you & Narcan. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose, indicating a very serious and immediate threat to life.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 20:14:12"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got decked, totally out cold. Shook me up. Makes you realize how fast things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault resulting in unconsciousness suggests a real and immediate risk of harm to individuals. While the original poster (OP) is not directly involved, the event indicates a lack of safety in the reported area.",
    "detected_category": "violence",
    "timestamp": "2025-12-27 20:13:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad lately. Walking on eggshells constantly. I'm scared but don't know what to do. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates fear and a potentially unsafe home environment. The phrase \"walking on eggshells\" suggests emotional abuse or tension, and the person expresses being scared, indicating potential harm. While not explicitly stating violence, abuse or suicidal ideation, the level of fear expressed warrants a medium severity assessment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 20:12:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Learn how to use it, people. It saves lives. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose and the potential for future occurrences indicates a high risk environment. The fact that Narcan was needed signifies a life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 20:11:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things aren't good at home. Walking on eggshells constantly. I feel so alone. Anyone else been through this? Need to know I'm not crazy.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a stressful and isolating home environment. While it doesn't explicitly mention harm, the phrase \"walking on eggshells\" and feeling \"alone\" suggest a potential for escalating distress. The user is also seeking validation, indicating a need for support.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 20:10:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just reaching out to see if anyone else has felt like this and what helped. Talking feels impossible.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and isolation but does not contain any explicit suicidal ideation, self-harm plans, or intent to harm others. While concerning, it primarily indicates a need for support rather than imminent danger.",
    "detected_category": "other",
    "timestamp": "2025-12-27 20:09:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Trying to stay strong & remember why I stopped. If anyone understands, please reach out. Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges and a struggle to maintain previous positive behaviors. While there is no explicit mention of self-harm or suicide, the user is clearly distressed and seeking support, suggesting a potential risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 19:16:05"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so lost lately. Like I'm just going through the motions. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and going through the motions, indicating distress but lacking specific threats or plans for self-harm or harm to others. The individual is reaching out for advice, suggesting a desire to find solutions.",
    "detected_category": "other",
    "timestamp": "2025-12-27 19:15:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them. Please, learn CPR & how to use it. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and highlights the risk of future overdoses in the community. The event already happened but could happen again.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 19:14:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Glad they're okay now, thanks to the EMTs. Makes you think... Naloxone saves lives. Learn how to use it. #MentalHealth #AddictionRecovery #OverdoseAwareness",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose incident, which is a significant health risk, even though the person survived. The event's impact on the observer suggests potential psychological distress or increased awareness of a prevalent safety issue.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 19:13:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the bathroom at work today. Scared me senseless. Narcan worked, thank god. Learn CPR, people. It could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event with potential psychological impact on the witness. While the situation was resolved with Narcan, the potential for future occurrences and the general impact of drug use on the workplace contribute to a medium severity level.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 19:11:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things aren't good at home. Walking on eggshells constantly. I feel so trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult and potentially dangerous home situation, indicating emotional distress and a feeling of being trapped. While it doesn't explicitly mention harm, the phrase 'walking on eggshells' often points to a volatile or abusive environment. The risk of escalation to violence or self-harm cannot be ignored, even if not directly expressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 19:10:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD. Terrifying. Naloxone worked, thankfully. Please, learn how to use it. Could save a life, maybe even someone you know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event. While the person survived, the event indicates the presence of potentially life-threatening drug use, and the risk of future overdoses remains. The text prompts others to learn how to administer Naloxone, suggesting a perceived need.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 19:09:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, feels a little better. Remember you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, which indicates a significant risk. While the person reached out for help and feels a little better, the underlying urge remains a concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 19:08:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just reaching out to see if anyone else understands. It's hard to keep going sometimes.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and difficulty coping, suggesting potential risk of self-harm. While not explicitly suicidal, the statement 'hard to keep going sometimes' warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-27 19:07:53"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown today. Just senseless. Makes you wonder what's going on in people's lives to make them that angry. Hope everyone involved is okay, physically and mentally.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessed a fight, indicating a potential for violence but no specific individuals are identified as being at imminent risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-27 19:06:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just wanted to say if you're struggling, you're not alone. Talking helps, even if it feels impossible. 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and encourages seeking help, suggesting emotional distress but not explicitly indicating immediate harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 18:20:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but shook me up bad. Is there anywhere to learn more about helping in these situations? Feel helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was administered successfully, the text describes a recent overdose event, indicating an immediate risk. The individual is also expressing feeling 'helpless,' which can escalate risk if future events occur.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 18:19:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Naloxone saved him, but shook me up bad. Carry it, people. You never know. Learn how to use it. #ODAwareness",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event indicating a potential for further overdose incidents in the area. While naloxone was available and used successfully, the event highlights a risk to the broader community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 18:18:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n>  Rough day. Feeling the urge to self-harm again. Reached out to a friend, but it's still hard. Any tips for coping in the moment?\n\n**Option 2 (Sharing a Struggle):**\n\n> Scars are a reminder of a dark past. Working hard to stay clean, but it's a constant battle.  It's okay not to be okay.\n\n**Option 3 (Raising Awareness):**\n\n>  Self-harm isn't attention-seeking. It's a sign of deep pain. Let's be kind and understanding to those who are struggling.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text explicitly mentions urges to self-harm and past self-harm, indicating a potential risk. While the person has reached out to a friend, the urge is still present.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 18:17:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out before it gets worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and overwhelmed (\"underwater\"). The phrase \"before it gets worse\" suggests a potential escalation of distress if left unaddressed, indicating a risk of negative outcomes.",
    "detected_category": "suicide",
    "timestamp": "2025-12-27 18:16:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. Urges were strong, but I distracted myself. Small win. Anyone else relate? Just trying to get through it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The mention of \"strong urges\" suggests a potential for escalation, even though the person reports using distraction techniques. The lack of specifics makes it difficult to assess the exact nature of the urges, but the intensity warrants attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 18:15:35"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a fight outside the bar last night. Dude got decked, just like that. Shook me up. Makes you realize how quickly things can escalate. Anyone else ever witness something like that? Still processing it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling and indicates potential for violence, but the text doesn't suggest ongoing or imminent danger to the individual or others. It primarily describes a past event and the person's emotional reaction.",
    "detected_category": "violence",
    "timestamp": "2025-12-27 18:14:33"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Guy got knocked out cold. Shook me up bad. Makes you realize how fragile things are. Anyone else ever witness something like that? Feeling pretty disturbed.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A physical assault resulting in a loss of consciousness was witnessed. While the poster wasn't directly involved, witnessing such violence can cause significant psychological distress.",
    "detected_category": "violence",
    "timestamp": "2025-12-27 18:13:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank god. Learn CPR and how to use it, could save a life. Be safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a prevalent risk of overdose in the area, although the person survived thanks to Narcan. The call to 'be safe' implies recognition of ongoing danger.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 18:12:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD in my town. Scared, tbh. My brother's been struggling lately. Anyone know good resources for families? Want to help him before it's too late.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions a brother struggling, concern about overdose (OD), and fear of it being \"too late\". Indicates potential risk, although not immediate or certain.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 18:11:29"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so incredibly alone lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of profound loneliness and isolation, using metaphors suggestive of being overwhelmed and struggling. While not explicitly suicidal, the stated inability to cope (\"don't know what else to do\") and reaching out for help indicates distress and potential vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2025-12-27 17:16:15"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got seriously hurt. Makes you think, you know? Stay safe out there, folks.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a serious injury resulting from a fight, indicating a potential for significant harm to individuals in the area. While not explicitly stating ongoing risk, the severity of the injury suggests a potential for escalation or similar incidents.",
    "detected_category": "violence",
    "timestamp": "2025-12-27 17:15:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Feels like I'm drowning. Reached out to a friend, but it's still hard. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and the return of urges, suggesting a potential risk of self-harm or suicidal ideation. The individual has reached out for help, which is a positive sign, but the overall tone indicates significant distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-27 17:14:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n>  It's getting harder to pretend everything's okay.  I'm constantly walking on eggshells. Anyone know resources for emotional abuse? I feel so lost.\n\n**Option 2 (Sharing a realization):**\n\n>  Realizing now that the constant put-downs & isolation weren't \"normal relationship stuff.\"  It was abuse.  It's scary to admit.\n\n**Option 3 (Raising awareness):**\n\n>  Don't let anyone tell you yelling and controlling your money isn't abuse. It is. You deserve better.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being abused and lost, suggesting potential for escalation if the situation continues. While not directly indicating immediate danger, the underlying emotional distress warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 17:13:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant yelling, put-downs... feels like I'm walking on eggshells. Anyone else been through this? How did you cope? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with emotional abuse (yelling, put-downs) which can lead to significant psychological distress. The feeling of being 'lost' indicates a potential vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 17:12:09"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, walking on eggshells... I feel so small. Anyone else been through this? How did you find the strength to leave?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of emotional abuse and a desire to escape, suggesting potential for escalation or negative coping mechanisms. While not explicitly stating intent to harm self or others, the vulnerability and plea for help indicate a need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 17:11:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. I feel so stupid for letting him back in. Just need someone to tell me I'm not crazy for feeling like this is wrong.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a recurring negative situation involving another person ('It's been happening again,' 'letting him back in'). The phrases 'I feel so stupid' and 'feeling like this is wrong' indicate emotional distress and potential manipulation or abuse. The need for validation ('Just need someone to tell me I'm not crazy') further suggests a potentially unhealthy or harmful relationship. The lack of specifics makes it difficult to assess the exact risk, but the recurring nature and emotional impact warrant a medium severity rating.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 17:10:05"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. Walking on eggshells constantly. Is this normal? Anyone else feel this way? Feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a stressful and potentially abusive home environment (walking on eggshells). While not explicitly stating harm, the emotional distress and feeling of isolation suggest a heightened risk of negative outcomes.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 17:09:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just finding it hard to cope. Reached out to a helpline, hoping it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being low and struggling to cope, indicating potential mental health distress. They've reached out for help, suggesting awareness of the issue, but the severity is medium due to the possibility of escalation if support is insufficient. The phrase 'It's okay to not be okay, right?' might indicate a level of acceptance but also could be a sign of normalization of a potentially concerning situation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 17:08:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Please, if you're struggling, reach out. There are people who care & want to help. Don't let shame silence you.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a friend experienced a serious health event ('almost didn't wake up') that suggests a potential risk, though the specific cause is unclear. The plea for help suggests the friend might be struggling with something significant, and that others could be too.",
    "detected_category": "other",
    "timestamp": "2025-12-27 17:07:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Just wanna feel *something* else, y'know? Trying to stay strong, but it's hard. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a desire to feel something different, which could indicate a potential for self-destructive behavior. The statement about trying to stay strong but finding it hard suggests a struggle with mental health.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 16:18:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things are bad at home again. Walking on eggshells constantly. Anyone know where I can find resources in [City]? Feeling lost.\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Took me years to realize yelling & control *is* abuse. It's not \"just how he is.\" Still processing.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Don't dismiss emotional manipulation. It's insidious and damaging. Learn the signs.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 suggests potential domestic abuse and a feeling of being lost, requiring resources for support. While not explicitly stating immediate danger, the situation warrants concern. Option 2 confirms past emotional abuse and trauma, which can have long-term effects. Option 3 is about raising awareness, which is less severe but related to the overall theme of abuse.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 16:17:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are strong. Reached out to a friend, feels a little better. Remember you're not alone. 988 is there if you need it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and struggles, but also active coping mechanisms (reaching out to a friend, remembering resources like 988). This suggests a present risk, though the individual is taking steps to manage it. The 'urges' are concerning, but not explicitly defined as self-harm or suicide, though the inclusion of 988 implies the author is aware of that possibility.",
    "detected_category": "suicide",
    "timestamp": "2025-12-27 16:16:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel so trapped. Has anyone else been through this? I don't know where to start to get help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving controlling behavior and constant put-downs, indicating a potential abusive relationship. The user expresses feeling 'trapped' and seeking help, suggesting a level of distress and potential escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 16:15:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough few weeks. Feeling so incredibly alone. Just reaching out... does anyone else ever feel like they're drowning?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of loneliness, hopelessness ('drowning'), and reaching out for help, suggesting potential mental health distress that could escalate if unaddressed. While not explicitly suicidal, the language indicates significant emotional distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-27 16:14:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's hard to admit, but things at home haven't been good lately. Constant put-downs, controlling behavior... I feel so isolated. Has anyone else gone through this? How did you find help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, which can escalate to more serious safety risks over time. While there's no immediate threat explicitly mentioned, the controlling behavior and put-downs raise concern for potential escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 16:13:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's a daily struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a high level of immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 16:12:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Reached out to a friend, just need someone to listen. It helps, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The return of 'urges' with increased strength indicates a potential risk. While the individual is actively seeking support by reaching out to a friend, the overwhelming feelings and stronger urges warrant a 'medium' severity. The exact nature of the urges is unknown, but the distress is evident.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 16:11:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been isolating me from my friends, saying they're \"bad influences.\" Anyone else experience this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Isolation is a common tactic in abuse and can significantly impact mental health. The user expresses feeling alone and suggests a controlling dynamic, raising concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 16:10:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Been walking on eggshells lately. Partner's temper flares up over the smallest things. Is this normal? Starting to feel really trapped. Anyone else experience this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Implies potential for escalation due to partner's temper and feeling trapped, suggesting possible emotional or psychological abuse. Risk of physical harm not explicitly stated, but emotional distress is significant.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 16:09:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so lost lately. Just need to find a reason to keep going. Anyone else been there? How did you get through it?\n\n**Option 2 (Personal Story - Vague):**\n\n> I remember a time when I didn't think I'd make it. Glad I did. There is hope.\n\n**Option 3 (Raising Awareness):**\n\n> Check in on your friends, especially the quiet ones. You never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and needing a reason to keep going, which suggests potential suicidal ideation. While it's not explicitly stated, the context and question about how others got through similar experiences raise concern. The other options hint at past struggles and the importance of checking on others, further reinforcing the potential risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-27 15:17:06"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the subway. People just stared. Is this normal now? Makes me sick. Wish someone had helped. Feeling really shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes a completed act of violence (shoving), it primarily expresses the observer's distress and feelings of unease. The risk is medium because it details a real-world violent event that could have resulted in serious injury and may indicate a broader issue of public safety or desensitization to violence. It doesn't explicitly indicate imminent danger to the author or another identifiable individual, but the event is concerning.",
    "detected_category": "violence",
    "timestamp": "2025-12-27 15:16:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's getting harder to pretend everything's okay. The constant put-downs are chipping away at me. Anyone else experience this? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feeling worn down by 'constant put-downs,' indicating ongoing emotional distress. While there is no direct mention of self-harm or suicide, the statement suggests a potential for escalation if the situation continues. The user is reaching out for coping mechanisms, implying a desire to address the problem, but also acknowledging its impact.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 15:15:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Relapsed after a few months clean. Just reaching out... anyone else get through this? Could use some support right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety can be a significant trigger for increased vulnerability. The user is expressing feeling overwhelmed and seeking support, indicating a potential need for intervention and monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 15:14:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Narcan saved them. Please, if you or someone you know needs help, reach out. Don't wait.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potential for harm and highlights the presence of dangerous substances in the environment. While the person survived, the event was described as scary, indicating a significant emotional impact and a real risk of future incidents.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 15:12:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm so tired. Things at home have been rough lately. Feeling isolated and like I'm walking on eggshells. Anyone else been through this? Need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of isolation, being emotionally vulnerable ('walking on eggshells'), and general distress due to difficult home circumstances. While it doesn't explicitly mention self-harm or suicide, the expressed emotional state indicates a potential risk that warrants further attention.",
    "detected_category": "other",
    "timestamp": "2025-12-27 15:11:57"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n>  Things got really bad tonight. I need to find a way to cope that doesn't involve this. Where do I even start?\n\n**Option 2 (Sharing Experience):**\n\n>  It's been [Number] days clean. Some days are still a huge struggle, but I'm trying.\n\n**Option 3 (Raising Awareness):**\n\n>  Just a reminder that self-harm is a sign of pain, not attention seeking. Be kind, always.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions feeling overwhelmed and needing to cope with something unspecified, but bad. The mention of being '[Number] days clean' implies past self-harm, suggesting ongoing vulnerability. While not explicitly suicidal, the need for coping mechanisms and past self-harm experience increases risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 15:10:56"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on where to start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 74 (char 99)",
    "detected_category": "unknown",
    "timestamp": "2025-12-27 15:09:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling really overwhelmed and like I'm drowning. Reached out to a helpline, just needed someone to talk to. It helped a little. Taking it one day at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Feeling overwhelmed and like 'drowning' suggests significant distress. While reaching out to a helpline is a positive coping mechanism, the depth of the initial distress warrants a medium severity level.",
    "detected_category": "suicide",
    "timestamp": "2025-12-27 15:08:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so overwhelmed lately.  Hard to explain.  Anyone know where to find help that *actually* gets it?  Not feeling okay.\n\n**Option 2 (Sharing Experience):**\n\n> Been clean for 3 months.  Small victory, but feels huge.  It's possible.  Keep fighting.\n\n**Option 3 (Raising Awareness):**\n\n> Seeing a lot of triggering stuff online.  Remember to take care of yourselves.  You're not alone if you're struggling.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses feeling overwhelmed and \"not feeling okay,\" suggesting potential mental health distress and a need for help. While not explicitly suicidal, the language indicates a vulnerability that warrants concern. The other options are supportive and positive, but the distress in Option 1 is the primary focus for severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 15:07:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. It's terrifying. Lost a friend last year... Please, if you're struggling, reach out. There's help available. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a recent overdose death and personal loss, indicating potential vulnerability and risk related to substance use. While not explicitly stating intent, the message expresses concern and encourages seeking help.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 14:17:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "```\nBeen feeling so isolated lately. Constant put-downs from my partner, saying I'm worthless. Is this normal? Starting to believe it. Need to talk to someone.\n```",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Experiencing emotional abuse (put-downs, feeling worthless) can lead to significant distress and potential escalation of harm if unaddressed. The statement 'Starting to believe it' suggests the abuse is impacting self-worth and could lead to further mental health issues. The user expresses a need to talk to someone, indicating a desire for help, but also highlights the seriousness of their situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 14:16:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Relapsed last night. Feels like I'm back at square one. Reaching out to my therapist today. Just need to get through this.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse suggests a return to previous harmful behaviors. While the person is seeking help, the immediate risk level is elevated compared to baseline. Requires monitoring and support.",
    "detected_category": "other",
    "timestamp": "2025-12-27 14:15:06"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. So messed up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which implies potential for violence. However, it doesn't indicate direct involvement, imminent threat, or specific targets. The feeling of being 'on edge' suggests anxiety but not necessarily an elevated risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-27 14:14:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scary stuff. Thankfully, paramedics got there fast. Narcan is truly a lifesaver. Learn CPR, folks. You never know when you might need it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While paramedics responded successfully, a person overdosing represents a serious health risk with potential for death. The prompt also indicates possible community health risks, because the situation happened in a public location and required emergency response. Though help arrived quickly, the situation warranted immediate attention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 14:13:03"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. Constant put-downs disguised as \"jokes\" are really chipping away at me. Anyone else experience this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential for a negative mental health trajectory due to ongoing abuse. The feeling of isolation exacerbates the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 14:12:02"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Never seen anything like it. Shook me up. Is there any way to help process something like that? Feeling anxious now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The individual expresses anxiety after witnessing a fight but doesn't indicate any direct threat to themselves or others. The anxiety seems reactive to the event.",
    "detected_category": "other",
    "timestamp": "2025-12-27 14:11:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Rough night. The urge was strong, but I distracted myself. One day at a time, right? Anyone else relate? Feeling kinda alone rn.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates a struggle with urges and feelings of loneliness, but no explicit plan or intent to harm self or others.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 14:09:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just realized this isn't normal. Always walking on eggshells, apologizing for things I didn't do... feels suffocating. Anyone else experience this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling suffocated and alone due to consistently feeling the need to walk on eggshells and apologize. This suggests a potentially emotionally abusive or highly stressful environment, which could escalate to mental health crisis if unaddressed. While not explicitly stating harm, the level of distress indicates a need for support and makes it more than a low risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 14:08:57"
  },
  {
    "title": "User Story: Abuse",
    "content": "I keep making excuses for him, but the yelling is getting worse. Last night he broke a plate. Is this normal? I feel so trapped. Anyone else been through this? I need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes escalating verbal abuse and an act of property destruction (breaking a plate), which could indicate a potential for escalation to physical violence. The feeling of being trapped also raises concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 14:07:55"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He yelled again last night, over nothing. Just need to vent. It's getting harder to pretend everything is okay. Anyone else been through this? Need advice.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse (yelling, pretense) and a growing struggle for the individual. While not explicitly mentioning violence or self-harm, the escalating situation and need for advice suggest a concerning level of distress and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 13:24:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things aren't good at home. Constant put-downs, controlling behavior... Feels like I'm walking on eggshells all the time. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, creating a potentially unsafe environment at home. While there is no explicit mention of physical harm or immediate danger, the psychological impact of such abuse can escalate over time.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 13:23:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Please, if you're using, have Narcan. It can save a life. Learned CPR, too. Gonna carry it always now. Be safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose indicates a life-threatening situation. The text implies a high risk of overdose incidents in the user's environment.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 13:22:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to distract myself, but it's hard. Anyone else relate? Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a return of urges and feelings of being overwhelmed and alone, suggesting a potential risk for self-harm or suicidal ideation. While there's no explicit mention of intent or plans, the reemergence of urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 13:21:10"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a plea for help, suggesting potential emotional distress and a need for support. While not explicitly suicidal, the feeling of being 'underwater' and not knowing what to do indicates a significant level of distress.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 13:20:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like nothing matters. Reached out to a friend, and just talking helped a little. Still feels like a long road.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and lack of meaning, which can be precursors to more severe mental health crises. Reaching out to a friend is a positive sign, but the statement 'still feels like a long road' indicates continued distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-27 13:19:07"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so lost lately. Like I'm drowning and can't find the surface. Talking about it feels impossible, but I know I need to. Any advice on where to start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and drowning, suggesting significant emotional distress and a potential risk of self-harm. The individual acknowledges a need to talk but finds it difficult, indicating a barrier to seeking help. While there is no explicit mention of suicide or self-harm, the intensity of the described feelings warrants a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 13:18:05"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up seeing someone get hurt like that. Makes you wonder what's going on in people's lives. Stay safe out there, everyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight suggests a potential for violence and harm in the area, even if the original poster was not directly involved. The mention of someone getting hurt indicates actual physical harm occurred.",
    "detected_category": "violence",
    "timestamp": "2025-12-27 13:17:03"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"It's hard to admit, but things at home haven't been good lately. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? Feeling lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and isolation, which are indicators of abuse. While it doesn't explicitly state physical harm, the emotional distress and feeling of being lost raise concerns for potential escalation of the situation and the individual's well-being.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 13:16:02"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on the street. So scary. My hands are still shaking. Anyone else feel like things are getting more aggressive lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessed a fight, experiencing emotional distress but no direct threat to self or others is indicated.",
    "detected_category": "violence",
    "timestamp": "2025-12-27 13:15:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but shaken up. Anyone know resources for dealing with this kind of trauma? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be a significantly traumatizing event, leading to potential psychological distress and requiring support. While the individual who overdosed was saved, the witness is experiencing trauma.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 12:22:29"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just a heavy cloud over everything. Reaching out in case anyone else knows this feeling and has any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but doesn't contain any explicit suicidal ideation, self-harm, or threats of violence. It is a general expression of distress and a request for advice.",
    "detected_category": "other",
    "timestamp": "2025-12-27 12:21:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm finally out. It was so hard to leave, but I did it. Still processing everything. Any advice on healing after emotional abuse? Feeling lost and scared.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates emotional distress and a history of emotional abuse, but there are no explicit threats of self-harm, suicide, or violence. The individual is seeking advice on healing, suggesting a desire to recover and move forward.",
    "detected_category": "abuse",
    "timestamp": "2025-12-27 12:20:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Naloxone worked, thank god. Makes you realize how fragile life is. Learn the signs, carry Narcan if you can.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event requiring intervention. While the person survived, overdoses are inherently life-threatening and indicate a significant risk to life. The encouragement to learn the signs and carry Narcan suggests a perceived ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 12:19:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to feel *something* is to hurt. I know it's not healthy, but the urge is so strong. Trying to find better coping mechanisms. Any tips that have helped you?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a direct urge to self-harm, indicating a potential risk. While the individual acknowledges it's unhealthy and seeks coping mechanisms, the strength of the urge elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 12:18:24"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his girlfriend on the street today. Just froze. Still feel sick about it. Wish I'd done something. What would you have done?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault (shoving) indicates potential for escalation and harm to the victim. While it's a single incident, the act itself constitutes violence and potential abuse.",
    "detected_category": "violence",
    "timestamp": "2025-12-27 12:17:22"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Rough night. The urges were strong, but I managed to distract myself. One day at a time, right? Anyone else feel this way sometimes?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes experiencing strong urges and actively using distraction as a coping mechanism. While it indicates distress, it also shows an attempt to manage the situation safely and reach out for support. The nature of the urges is unspecified.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-27 12:16:21"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Froze. Wish I'd said something. Feeling sick about it. Anyone else ever experience this? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports of observed violence, although not directly involving the reporter, indicate a potential risk of escalation or further harm to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-27 12:15:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scariest thing ever. Narcan saved them. Please, if you're using, carry it. It could save a life, or yours. Learn how to use it. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose implies a high risk environment with potential for future overdoses and highlights the immediate life-threatening nature of opioid use. The text also indirectly acknowledges the user's involvement in drug use, increasing the risk of future overdose.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 12:14:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved their life, thank goodness. We need more access to it. Know the signs, folks, it could be anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was administered and the person survived, a potentially fatal overdose occurred, indicating a significant risk. The call for increased Narcan access highlights the ongoing concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-27 12:13:16"
  }
]