[
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary. Makes you realize how easily it can happen. Please, if you're struggling, reach out. There's help available.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a risk in the environment, and the text acknowledges the potential for similar events. While not directly expressing intent, it highlights a dangerous situation and indirectly suggests vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 23:18:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling overwhelmed. The urge to self-harm is strong tonight. Anyone know any good distractions or coping mechanisms that actually work? Just trying to get through this.\n\n**Option 2 (Sharing Experience):**\n\n> 3 weeks clean from self-harm. Still a struggle, but taking it one day at a time. Small victories matter.\n\n**Option 3 (Raising Awareness):**\n\n> It's not attention-seeking. Self-harm is a sign of deep pain. Please be kind and understanding to those struggling.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Option 1 expresses a strong, current urge to self-harm, indicating immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-09 23:17:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. They're okay now, but damn. Makes you think. If you're struggling, please reach out. There's help. I'm here to listen too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person who overdosed is now okay, the text describes a recent overdose event, indicating a potential risk for others struggling with similar issues. The mention of reaching out suggests the writer recognizes an ongoing struggle.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 23:16:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Glad they're okay now, but it really shook me. Makes you realize how fragile things are. Anyone else ever dealt with this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a past overdose event, which, while resolved, indicates a significant health risk and could have been fatal. The user expresses emotional distress related to the event.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 23:15:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It helps, even a little. Remember you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential for self-harm or other negative coping mechanisms. While the individual is reaching out for help, the presence of urges elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-09 23:14:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw two guys fighting outside the bar last night. One was bleeding bad. Shook me up. Makes you realize how quickly things can escalate. Anyone else ever witness something like that? Hard to shake it off.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent fight with significant injury (bleeding badly) suggests a moderate risk level due to potential psychological impact and the presence of real-world violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-09 23:13:02"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells lately. He gets so angry over nothing. Just feel so drained. Anyone else ever deal with this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling drained and walking on eggshells due to someone else's anger, suggesting potential emotional or verbal abuse. While there's no explicit threat, the situation described can escalate and indicates a stressful and potentially harmful environment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 23:12:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good lately. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? Need to figure out my next step.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, indicating a potentially unsafe environment and mental distress. While not explicitly stating intent to harm self or others, the feelings of isolation and need for help suggest a significant risk for escalation if the situation continues.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 23:10:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to see if anyone else knows this feeling? Really struggling to find my way back up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, struggling, and a desire to find a way 'back up' which can be interpreted as a metaphor for struggling with depression or a difficult life situation. The phrase 'underwater' can indicate feeling overwhelmed. While not explicitly suicidal, the language suggests significant emotional distress and warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-09 23:09:57"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been yelling more, and last night... I don't know what to do. Feeling so lost. Is this normal?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes escalating verbal abuse and implies a potentially unsafe situation ('last night... I don't know what to do'). The vagueness suggests something potentially harmful occurred, requiring further investigation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 23:08:55"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. Every day feels like walking on eggshells. I don't even recognize myself anymore. Is this normal in a relationship? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, feelings of isolation, and a potentially unhealthy relationship dynamic. The phrase \"walking on eggshells\" suggests a coercive or controlling environment, raising concerns about emotional abuse.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 22:18:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scariest thing ever. Paramedics got there fast, thank god. Seriously folks, be careful out there. Know your limits & look out for each other. This stuff is no joke.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event indicates a potential public health risk and the possibility of further overdose events. While the individual received medical attention, the incident highlights the presence of dangerous substances and potential harm to others.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 22:17:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post focusing on seeking help:\n\n\"Feeling so overwhelmed lately. Like I'm underwater. Reached out to the crisis line, just needed to talk. It helped a little. Taking it one hour at a time.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feeling overwhelmed and \"underwater,\" indicating significant distress. While they sought help from a crisis line, the relief was only partial. This suggests an ongoing struggle and a potential risk that requires further monitoring.",
    "detected_category": "suicide",
    "timestamp": "2026-01-09 22:15:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Old coping mechanisms keep creeping back. Reached out to a friend, which helped a little. Remember there are options. Taking it one hour at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feeling overwhelmed and a return to old coping mechanisms, suggesting potential for self-harm or unhealthy behaviors. Reaching out to a friend is a positive sign, but the overall tone suggests ongoing struggle and risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-09 22:14:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, thank God. Please, if you or someone you know is struggling, reach out. There's help available. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event requiring Narcan intervention, indicating a high risk situation that could have resulted in death. The event's recency and the inherent life-threatening nature of an overdose necessitate a high severity assessment.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 22:13:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Just burned my hand again. I know I shouldn't, but it's the only thing that makes me feel something other than numb. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes self-harm behavior (burning) which indicates emotional distress and potential for escalation or more severe self-injury. While not explicitly suicidal, the reference to numbness and seeking sensation through pain is concerning.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-09 22:12:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them. Carry it, learn how to use it. It could save a life. I'm still shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even though the person was saved, indicates a situation with potential for severe health consequences and emotional distress. The recommendation to carry and learn how to use Narcan suggests the possibility of future overdose events.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 22:11:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. The urge to self-harm is getting strong again. Reached out to a crisis line, feels like a small step. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly states a strong urge to self-harm, indicating an imminent risk. Reaching out to a crisis line is a positive step, but the urge itself signifies a high level of distress and potential danger.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-09 22:10:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to resist, but it's hard. Anyone else relate? Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of being overwhelmed and alone, suggesting increased vulnerability and potential for acting on those urges. While not explicitly stating suicidal ideation or intent, the context warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-09 22:09:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got really bad last night and I relapsed. Trying to be kind to myself, but it's hard. Anyone else been there? Just feeling so alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse and feelings of isolation can escalate risk, particularly without support. The phrase \"things got really bad\" raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-09 22:08:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost, signaling potential emotional distress and a need for help. While not explicitly suicidal, the metaphor of being underwater and reaching out indicates a struggle that could escalate if unaddressed.",
    "detected_category": "suicide",
    "timestamp": "2026-01-09 21:18:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them. Please, learn the signs & carry it if you can. You could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a significant event that can cause distress. The mention of Narcan indicates a potentially life-threatening situation requiring immediate intervention. While the person survived, the risk of future overdoses for individuals in that environment remains a concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 21:17:08"
  },
  {
    "title": "User Story: Abuse",
    "content": "I keep making excuses for him, but the yelling is getting worse. Last night he broke a plate. I'm scared. Is this normal? Anyone been through this? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The escalation of yelling and the act of breaking a plate, coupled with the expressed fear and feeling of isolation, strongly suggests a risk of escalating violence and potential for physical harm. The victim is showing fear, which should always be taken seriously.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 21:16:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, having a really rough night. The urges are strong. Just trying to breathe and remember I've gotten through this before. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges, suggesting a potential risk. While not explicitly stating intent, the 'rough night' and need to 'breathe and remember I've gotten through this before' implies a struggle with something serious.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-09 21:15:05"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside the deli. Froze. Called 911, but I feel sick. Has anyone else been in a situation like that? What do you even do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an act of violence (punching) which can result in serious physical harm. While the victim is not the author, the potential for escalation and continued harm is significant.",
    "detected_category": "violence",
    "timestamp": "2026-01-09 21:14:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so numb lately. Everything's just... heavy. Reaching out to a friend, hoping it helps. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expressing feelings of numbness and heaviness can be indicative of underlying mental health concerns, potentially depression. Reaching out to a friend is a positive step, but the overall sentiment warrants monitoring.",
    "detected_category": "suicide",
    "timestamp": "2026-01-09 21:13:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good lately. Walking on eggshells constantly. Anyone else experience this? Feeling so isolated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially unsafe home environment and feelings of isolation, which can be precursors to more serious mental health issues. 'Walking on eggshells' suggests potential emotional or verbal abuse.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 21:12:00"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm just going through the motions. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and going through the motions, indicating a possible struggle with mood or motivation. While it expresses a need for connection, there's no explicit mention of self-harm, suicide, or harm to others.",
    "detected_category": "other",
    "timestamp": "2026-01-09 21:10:58"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm finally leaving. Years of walking on eggshells, and I'm done. Scared, but I deserve peace. Any advice for starting over?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a history of abuse or a very stressful situation (walking on eggshells) and expresses fear, suggesting vulnerability. While not explicitly stating harm, the desire for 'peace' after a long period of stress could indicate potential for self-neglect or risky behaviors.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 21:09:57"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get too much and I just want the pain to stop. Reached out to a friend tonight. Talking helped, even just a little. There's a helpline if anyone else needs it. 988.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire for pain to stop, which can be interpreted as suicidal ideation. However, the individual sought help from a friend and mentions a helpline, indicating some coping mechanisms are in place, mitigating the immediate risk somewhat.",
    "detected_category": "suicide",
    "timestamp": "2026-01-09 21:08:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt really low yesterday and relapsed. Day 1 again. Reaching out to my therapist today. It's so hard sometimes, but I'm not giving up.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse and expression of low mood indicate a potential risk. Reaching out to a therapist is a positive sign, but the relapse itself elevates the risk beyond low severity.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-09 20:19:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Lost a friend last week. OD. Hurts so bad. Please, if you're struggling, reach out. There are people who care. Don't let it get this far.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes the loss of a friend due to an overdose, implying potential grief and vulnerability in the writer. While not explicitly stating suicidal ideation, the statement 'Don't let it get this far' suggests awareness of a dangerous path and could indicate some level of personal struggle or contemplation. The mention of reaching out is a positive aspect, but the recent loss increases concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 20:18:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm underwater and can't find the surface. Talking feels impossible. Anyone else ever feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, with difficulty communicating. While not explicitly mentioning self-harm or suicide, the language suggests significant emotional distress and potential for escalation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-09 20:17:29"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Things got bad last night, and I'm not proud of it. Reaching out because I know I need help. Any advice on where to start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feeling overwhelmed, admits to a negative event ('Things got bad last night') they are not proud of, and acknowledges needing help. This suggests a potential crisis, though the specific nature of the risk is unclear. The admission of a negative event warrants concern.",
    "detected_category": "other",
    "timestamp": "2026-01-09 20:16:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to my doctor next week, hoping for some clarity. It's exhausting pretending I'm okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and exhausted, but indicates help-seeking behavior by mentioning an upcoming doctor's appointment. No explicit mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2026-01-09 20:15:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need help. Talking feels impossible, but I'm trying. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of hopelessness and acknowledges needing help. While there is no explicit mention of self-harm or suicide, the feelings of low mood and lack of motivation indicate a potential risk that requires further assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-09 20:14:24"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, and seeks support, but doesn't indicate immediate harm.",
    "detected_category": "other",
    "timestamp": "2026-01-09 20:13:22"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. Constant put-downs disguised as \"jokes\" are really taking a toll. Anyone else experience this kind of thing? Feeling so isolated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional distress and isolation caused by ongoing negative interactions. While it doesn't explicitly mention self-harm or suicidal ideation, the feeling of being isolated and the impact of 'constant put-downs' suggest a potential risk that warrants attention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 20:12:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but lacks specific details of self-harm or suicidal intent. Seeking connection and support suggests a desire to cope.",
    "detected_category": "other",
    "timestamp": "2026-01-09 20:11:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. The urge to self-harm was really strong. Trying to ride it out. Anyone else relate? Just feeling alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a potential risk. While the person is trying to cope, the intensity of the urge elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-09 20:10:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, days like today are so rough. The urges are strong. Just trying to breathe and remember it won't last forever. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges, suggesting potential self-harm or suicidal ideation, though it also indicates an attempt to cope. The lack of specific details makes it difficult to assess the immediacy of the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-09 19:18:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Narcan saved his life. Please, learn the signs of OD. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a high risk event.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 19:17:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Naloxone saved their life. Please, if you're using, carry it. It's free and could save someone you love. #recovery #harmreduction #overdoseprevention (This post is longer than 300 characters and includes hashtags, breaking the prompt's instructions)\n\nOkay, here's a better attempt:\n\nWitnessed an OD. Horrifying. Luckily had Narcan. Please, learn the signs and carry it if you can. Could save a life. Thinking of everyone struggling.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes witnessing an overdose, a life-threatening medical emergency. While the person survived, the risk of future overdose remains, and the situation itself indicates a high level of immediate danger.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 19:16:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary. Narcan saved their life, but it made me think. We gotta do better at helping folks BEFORE it gets to that point. Anyone know of local resources for addiction support?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes a successfully reversed overdose, it highlights the ongoing risk of overdose and the need for preventative measures. The situation described indicates a community safety concern regarding addiction.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 19:15:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to a friend helped a little, but the darkness is still there. Anyone else feel this way? Where do you even start to find help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed (\"lost\", \"underwater\", \"darkness\"). While there's no explicit mention of self-harm or suicide, the user is seeking help and acknowledging the presence of negative feelings, suggesting a potential risk that warrants attention.",
    "detected_category": "suicide",
    "timestamp": "2026-01-09 19:14:39"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are strong. Just trying to get through the next hour. Anyone else feel this way? It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges and feelings of exhaustion, suggesting a potential risk of self-harm or a mental health crisis. The user is actively struggling and reaching out for support.",
    "detected_category": "suicide",
    "timestamp": "2026-01-09 19:13:37"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get jumped on my street last night. Shook me up bad. Makes you realize how quickly things can turn. Anyone else feel unsafe around here lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault indicates a tangible threat of violence in the area and a possible escalation of crime. The poster also expresses feeling unsafe, suggesting a perceived vulnerability and potential for further incidents.",
    "detected_category": "violence",
    "timestamp": "2026-01-09 19:12:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a glass wall. Reaching out because I don't know what else to do. Is anyone else feeling this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses numbness and detachment from life, indicating potential emotional distress and a cry for help. The user is actively seeking connection, suggesting a willingness to engage, but the underlying feelings warrant concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-09 19:11:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Need to find a way back up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, using metaphorical language ('underwater'). While not explicitly suicidal, the phrase 'Need to find a way back up' suggests a desire to escape a difficult situation and a potential risk of escalation if support is not found.",
    "detected_category": "suicide",
    "timestamp": "2026-01-09 19:10:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. If anyone's been there, how did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and acknowledges a need for help. While it doesn't explicitly mention self-harm or suicide, the expression of persistent low mood and seeking support indicate a moderate level of risk that warrants attention and further assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-09 19:09:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's getting harder to pretend everything's okay. The yelling... it's constant now. I feel so trapped. Is this normal? Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of constant yelling and feeling trapped, suggesting a potentially abusive or highly conflictual environment. While not explicitly stating harm, the distress and feeling of being trapped indicate a medium level of risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 18:22:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just feeling so lost. Constant put-downs from my partner are chipping away at me. Is this normal? Starting to think I deserve it. Feeling trapped.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, feelings of being trapped, and potential internalization of abuse, raising concern for mental well-being.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 18:21:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Been feeling so lost lately. Like I'm just going through the motions. Anyone else ever feel this way? Kinda need to know I'm not alone.\n\n**Option 2 (Sharing a story):**\n\n> Lost a friend to suicide last year. Still doesn't feel real. Check in on your loved ones, seriously. You never know what someone's going through.\n\n**Option 3 (Personal Story):**\n\n> Some days are just so hard. Today is one of them. Trying to remember why I'm still here. Taking it one breath at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 3 expresses thoughts of questioning the reason for living, suggesting potential suicidal ideation, although not explicitly stated. The user is trying to cope, but the statement is concerning.",
    "detected_category": "suicide",
    "timestamp": "2026-01-09 18:20:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Hard not to just... scratch at the noise, y'know? Anyone else feel this? Starting therapy next week, hoping it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to \"scratch at the noise\" in their head, which is vague but suggests potential self-harm. The user is actively seeking help through therapy, which is a positive sign, but the underlying feeling warrants a medium severity.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-09 18:19:28"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Just reaching out... anyone else feel this way? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and being overwhelmed, but doesn't contain explicit threats of self-harm or suicide. The user is reaching out for connection and support.",
    "detected_category": "other",
    "timestamp": "2026-01-09 18:18:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "Lost a friend last week to overdose. Hurts so bad. Please, if you're struggling, reach out. There are people who care and want to help you get through this. Don't let it be too late.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses grief and loss due to a recent overdose death, and contains an appeal to those struggling to seek help, implying potential suicidal ideation or risk of overdose among the audience.",
    "detected_category": "suicide",
    "timestamp": "2026-01-09 18:17:24"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary how quickly things escalated. Shaking. Anyone else feel like things are getting more volatile lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and can cause anxiety, but doesn't indicate imminent danger to the individual or others. It expresses a general feeling of unease about increasing volatility.",
    "detected_category": "violence",
    "timestamp": "2026-01-09 18:16:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Please, if you're struggling, reach out. There are people who care and want to help you stay safe. Don't be afraid to ask.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Direct report of an overdose event, indicating immediate danger and potential for further incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 18:15:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm underwater. Reaching out because I don't know what else to do. Any advice or just someone to listen?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain explicit statements of self-harm, suicidal ideation, violence, abuse, or overdose. It's a general cry for help and support.",
    "detected_category": "other",
    "timestamp": "2026-01-09 18:14:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Reaching out because I don't know what else to do. Is anyone else struggling?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of loneliness and seeking support, but lacks specific ideation or plans for self-harm.",
    "detected_category": "other",
    "timestamp": "2026-01-09 18:13:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD on the street today. Scary stuff. Narcan saved him, thankfully. Makes you realize how fragile things are. Learn CPR & how to use Narcan, folks. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event suggests a risk of potential harm, including the possibility of future overdoses in the area or affecting the witness. While Narcan was effective, the initial event indicates a significant health risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 17:20:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"He's been isolating me from my friends lately. Says they're bad influences. It's just... unnerving. Has anyone else experienced this? Starting to feel really alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Isolation from friends and controlling behavior are potential indicators of emotional abuse and can escalate to more dangerous situations. While there's no explicit mention of violence or self-harm, the isolation and unnerving feeling warrant attention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 17:19:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things aren't good at home. Constant yelling, put-downs... feels like I'm walking on eggshells. Anyone else been through this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with emotional abuse (yelling, put-downs). While not explicitly stating physical harm, the feeling of 'walking on eggshells' suggests anxiety and potential for escalation. The lack of specific details makes it hard to assess the full extent of the risk, but warrants attention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 17:18:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Trying to stay strong, but it's exhausting. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges and feelings of being overwhelmed, suggesting a potential risk. While there's no explicit mention of self-harm or suicide, the return of stronger urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-09 17:17:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I'm really trying not to give in. Talking to my therapist tomorrow, but tonight is rough. Anyone else been there? Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges and feelings of being overwhelmed. While the individual expresses a desire to resist these urges and has a therapy appointment scheduled, the current state of being 'rough' and feeling 'really alone' suggests a potential for escalation of risk. ",
    "detected_category": "self-harm",
    "timestamp": "2026-01-09 17:16:23"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out downtown. Shook me up bad. Made me realize how much anger is simmering under the surface. Anyone else feel that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be distressing, but the text doesn't indicate imminent danger to the author or others. It expresses a feeling of unease rather than a direct threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-09 17:15:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Called 911, they're okay now. Makes you realize how close to home this is. Please, know the signs and carry Narcan if you can.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual is now okay, the event signifies a potential for future overdose incidents and highlights the accessibility and presence of drug use in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 17:14:19"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Made me realize how fragile things are. Anyone else feel extra anxious after witnessing something like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused anxiety but does not directly indicate immediate danger to the individual or others. It expresses a feeling of being shaken and anxious but does not mention any specific threats or actions being contemplated.",
    "detected_category": "violence",
    "timestamp": "2026-01-09 17:13:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Please, if you're using, have someone with you & know where to get Narcan. It can save a life. I'm still shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a significant risk of harm, though the text is primarily about the experience of witnessing rather than directly expressing intent to harm oneself or others. The person is shaken, but there's no immediate indication of intent to take action.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 17:12:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, coupled with a plea for help. While not explicitly suicidal, the distress and helplessness indicate a need for intervention and raise concern for potential escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-09 17:11:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD in the park. Scary. Narcan saved them, but it really shook me up. Anyone know where to get trained on how to use it? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the immediate danger is resolved (the person was saved), the text describes a recent overdose event indicating ongoing risk of further overdoses in the area. The witness is also experiencing distress and seeking help, indicating a potential for further indirect exposure or feeling overwhelmed which could escalate to other mental health concerns.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 16:19:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel trapped. Has anyone else gone through this? How did you find the strength to leave?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, suggesting an abusive environment. The user expresses feeling trapped, indicating potential emotional distress and a desire to escape the situation. While not explicitly stating violence, self-harm, or suicidal ideation, the situation described warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 16:18:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Called 911, hope they're okay. Narcan is a lifesaver. Learn how to use it, it could save someone you know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose incident, which is a serious medical emergency with potential for severe harm or death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 16:17:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to quiet the noise. Trying to find healthier coping mechanisms, but it's hard. Anyone else feel this way? Just looking for some support.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of distress and difficulty coping, hinting at potential self-harm or suicidal ideation, although it doesn't explicitly state intent. The user is seeking support, indicating awareness of the problem but also a need for help.",
    "detected_category": "suicide",
    "timestamp": "2026-01-09 16:16:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw two guys fighting outside my building last night. Shook me up bad. Is it just me, or is everyone on edge lately? Makes me scared to walk home alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight and expressing fear for personal safety suggests a potential threat. While no direct threat is made, the fear and anxiety warrant attention.",
    "detected_category": "violence",
    "timestamp": "2026-01-09 16:15:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Always walking on eggshells. Feels isolating. Anyone else ever feel this way? Just need to know I'm not alone. \"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a difficult and isolating home environment, potentially involving emotional abuse or conflict ('walking on eggshells'). While there is no direct mention of harm, the feeling of isolation and constant stress elevates the risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 16:14:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank goodness. Learn how to use it, it could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was successful in this instance, an overdose is a life-threatening medical emergency with potentially severe consequences. The text highlights a real-world incident.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 16:13:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough at home lately. Constant yelling, walking on eggshells... Feels like I can't do anything right. Anyone else experience this? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a stressful and potentially emotionally abusive home environment. While not explicitly stating harm, the mention of \"constant yelling, walking on eggshells...Feels like I can't do anything right\" indicates a potentially harmful situation that could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 16:12:33"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his girlfriend on the street today. Just... why? It shook me up. Is there anything you can even *do* in that situation without making it worse?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed incident of violence (shoving). While the reporting individual is not directly harmed, the incident indicates a potential risk of escalation or further harm to the victim.",
    "detected_category": "violence",
    "timestamp": "2026-01-09 16:11:31"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing on the street, escalated so fast. Makes me sick how easily people resort to violence. Wish I knew how to help in those situations. Scared to get involved, but feel guilty doing nothing.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing an argument, potential for violence, but no direct threat to the reporting person or others is stated.",
    "detected_category": "violence",
    "timestamp": "2026-01-09 16:10:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank goodness. Makes you think, you know? Stay safe out there, everyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests potential risk of exposure to dangerous situations or substances. While Narcan was successful, the event indicates a real and present danger in the environment.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 15:18:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mentions of self-harm, suicide, violence, abuse, or overdose. It appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2026-01-09 15:17:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "I keep making excuses for him. \"He's stressed, it was just a joke...\" But it's happening more. I feel so small. Has anyone else dealt with this? I don't know what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a pattern of behavior that is making the speaker feel small and unsure. This could be indicative of emotional or verbal abuse, which can escalate. The speaker is also seeking help, suggesting a level of distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 15:16:45"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on the bus today. Two guys went at it. Shook me up bad. Makes you realize how close it all is, y'know? Anyone else feel like violence is just... everywhere lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While a fight occurred, the text primarily expresses feeling shaken and generally anxious about violence, but does not indicate an immediate or specific threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-09 15:15:44"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Scary how fast things escalated. Reminded me of my brother's situation. Anyone know good resources for anger management? He needs help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a fight and expresses concern about a brother's anger management issues. While it doesn't explicitly state violence or immediate threat, the escalation of a fight and the brother's need for anger management suggest a potential for future violent behavior.",
    "detected_category": "violence",
    "timestamp": "2026-01-09 15:14:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling overwhelmed. Urges are strong tonight. Anyone else get this? Just trying to get through it.\n\n**Option 2 (Personal Story):**\n\n> Clean for 3 weeks. Small victory but feels huge. One day at a time, right?\n\n**Option 3 (Raising Awareness):**\n\n> It's not attention-seeking. It's a sign someone's hurting. Be kind. Listen.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates active urges which suggests potential for self-harm. Although the person is seeking support, the intensity of the urges raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-09 15:13:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness, isolation, and being overwhelmed, but does not contain explicit mentions of self-harm, suicide, or violence. It's a general expression of distress and a plea for connection.",
    "detected_category": "other",
    "timestamp": "2026-01-09 15:12:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is back. Reached out to a friend, waiting to hear back. Just trying to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a re-emergence of self-harm urges and feelings of being overwhelmed. While the individual has reached out for help, the explicit mention of self-harm urges necessitates a high severity assessment.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-09 15:11:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough at home lately. Walking on eggshells constantly. Is this normal in relationships? Feeling lost and scared.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being scared and lost, combined with a home environment described as 'walking on eggshells.' While it doesn't explicitly state violence or harm, the underlying stress and fear warrant concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 15:10:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm drowning. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed ('drowning'), and a sense of desperation ('don't know what else to do'). While it doesn't explicitly mention suicidal ideation, the intensity of the negative emotions and the plea for help suggest a significant level of distress that requires attention and could potentially escalate if unaddressed.",
    "detected_category": "suicide",
    "timestamp": "2026-01-09 15:09:32"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. I should have said something. Feeling sick about it. Anyone else ever feel that helpless?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence is a risk factor for mental health issues for the witness. While the original act was targeted at someone else, the poster is now experiencing distress. There is no indication of intent for violence/abuse, but the distress level is concerning.",
    "detected_category": "violence",
    "timestamp": "2026-01-09 14:19:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good lately. Walking on eggshells constantly. Anyone else ever feel like they're just waiting for the next explosion? Need to figure out how to cope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a volatile and potentially abusive home environment. While no specific threats are made, the feeling of 'walking on eggshells' and waiting for an 'explosion' indicates a significant risk of emotional distress and potential escalation to violence or abuse.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 14:18:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough week. Feeling so drained and like nothing matters. Reaching out before things get worse. Anyone else ever feel this empty?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of emptiness, hopelessness, and a proactive reach out before things potentially escalate. While not explicitly suicidal, the statement suggests a decline in mental wellbeing and a desire for help before reaching a crisis point.",
    "detected_category": "suicide",
    "timestamp": "2026-01-09 14:17:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy and I don't know where to turn. Just reaching out, hoping someone understands.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but lacks explicit suicidal ideation or plans.",
    "detected_category": "other",
    "timestamp": "2026-01-09 14:16:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm drowning and no one can see it. Reaching out... anyone else feel this way? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed, lost, and a sense of isolation, which could indicate a risk of self-harm or suicidal ideation. The explicit plea for connection suggests a need for immediate support.",
    "detected_category": "suicide",
    "timestamp": "2026-01-09 14:15:21"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just had another fight. He apologized, said he didn't mean it. I want to believe him, but I feel so lost. Anyone else been through this cycle? How do you break free?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potential cycle of abuse, including a fight followed by an apology. While there's no explicit mention of physical violence, the poster feels 'lost' and asks about breaking free, suggesting emotional distress and a potentially harmful situation. The potential for escalation warrants a medium severity rating.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 14:14:19"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Getting worse. Feeling trapped and don't know where to turn. Anyone else been through this? Need advice.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates distress, a feeling of being trapped, and worsening conditions at home, suggesting a potential crisis. The user is seeking advice, indicating a need for support and potentially a lack of coping mechanisms. While not explicitly stating intent, the situation warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-09 14:13:17"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Heart's still pounding. Wish I'd said something. Anyone else ever feel that helplessness?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence indicates a potential risk to the victim and raises concerns about escalation or repeated abuse. While the reporter is not directly involved, witnessing violence can be traumatizing.",
    "detected_category": "violence",
    "timestamp": "2026-01-09 14:12:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw on the news about another OD in my town. Scares me. My brother's been struggling and I'm so worried. Does anyone know where I can find Narcan training or support groups for families?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about a brother's substance use struggles and a recent overdose in the town, indicating potential risk of overdose. The user is seeking Narcan training and support, suggesting awareness of a possible overdose situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-09 14:11:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just needed to vent. Things got bad again last night. Feeling so lost and alone. Is there anyone else who understands this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feeling lost, alone, and that 'things got bad again,' suggesting potential emotional distress and a possible escalation of negative experiences. The specific nature of 'bad' is unknown, but the overall tone warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-09 14:10:12"
  }
]