[
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain specific plans or intentions of self-harm or harm to others. It appears to be a general cry for help and support.",
    "detected_category": "other",
    "timestamp": "2025-12-10 22:18:17"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Reaching out because I don't know what else to do. If anyone has felt this way and found a way through, I could really use some hope right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a desire for help, suggesting potential emotional distress and a need for support. While not explicitly mentioning self-harm or suicide, the statement 'I don't know what else to do' indicates a potential escalation risk if support is not provided.",
    "detected_category": "suicide",
    "timestamp": "2025-12-10 22:17:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it was too close. Please, if you're using, carry it. And know how to use it. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent, near-fatal overdose incident, indicating a high risk for the individual involved and potential risk for others who may be using substances.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 22:16:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so overwhelmed lately. Like I'm drowning and can't see the surface. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and helpless, suggesting potential emotional distress and a lack of coping mechanisms. The phrase 'drowning and can't see the surface' can be interpreted as a metaphor for a severe mental health crisis. While not explicitly mentioning self-harm or suicide, the level of distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-10 22:15:11"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate immediate danger to the author or others. The feeling of being 'on edge' is subjective but doesn't suggest a specific imminent threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 22:14:09"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and can cause anxiety, but there's no indication of direct threat or intent to harm self or others. The text describes a reaction to an event rather than an active threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 22:13:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Narcan saved them, but shook me up bad. Learn CPR and how to use it, please. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event with potential for secondary trauma. While Narcan was successful, the event highlights the risk of fatal overdose in the community and the need for preparedness.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 22:12:06"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Finally left. Scared but free. Years of walking on eggshells... I don't even know who I am anymore. Any advice on rebuilding after emotional abuse?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Indicates emotional distress and potential vulnerability after leaving an abusive situation. While not explicitly stating intent to harm self or others, the mention of fear, loss of identity, and years of abuse suggests a need for support and increases the risk of mental health decline.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 22:11:04"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough week. Feeling so drained and like nothing matters. Reaching out before things get worse. Talking to someone tomorrow. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a significant decline in mental well-being and a fear of things worsening, suggesting potential for self-harm or suicidal ideation. The proactive step of seeking help tomorrow is a positive sign, but the overall tone and explicit statement about things potentially worsening necessitate a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2025-12-10 22:10:02"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Frozen. Should I have said something? Feel sick about it. Wish I knew what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence; potential for escalation or ongoing abuse. The witness is also showing signs of emotional distress, which requires consideration.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 22:09:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Woke up from another nightmare. Still feel like I'm walking on eggshells even when he's not here. Anyone else ever feel completely drained after years of this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling drained and like they're 'walking on eggshells,' suggesting ongoing emotional distress and potential for escalation. The reference to 'nightmares' and feeling this way even when 'he' is not there points towards potential abuse or a very unhealthy relationship dynamic.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 21:18:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Everything feels heavy. Reaching out to a friend, but it's tough. Anyone else been there? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and isolation, but there's no explicit mention of self-harm, suicidal ideation, violence, or abuse. The person is reaching out for support, which suggests a desire to cope.",
    "detected_category": "other",
    "timestamp": "2025-12-10 21:17:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just needed to vent. Things escalated again last night. Walking on eggshells constantly. Anyone else feel this way? Feeling so alone. :(\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of stress, isolation, and being in a difficult situation ('walking on eggshells'). While concerning, it lacks explicit statements of harm or intent to harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 21:16:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw my neighbor being taken away by paramedics. OD. This sh*t is too real. Please, if you're struggling, reach out. There are people who care. Don't become another statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a neighbor's overdose and expresses concern about others struggling, suggesting potential risk for those struggling with addiction or mental health issues. While not explicitly mentioning self-harm or suicide by the author, the content is concerning and warrants attention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 21:15:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. I thought I was strong enough, that I could handle it. But I'm not. Where do I even start to get help? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, with an implied return of a previous struggle. This suggests a potential mental health crisis that requires attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-10 21:14:35"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Terrifying. Paramedics got there fast, thank goodness. Makes you realize how fragile things are. Anyone know where I can learn more about overdose prevention?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be traumatizing and indicate a risk of future incidents in the area. The person is also seeking information about overdose prevention, suggesting concern and potential indirect involvement or proximity to risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 21:13:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant put-downs, feeling isolated. Anyone else been through this? Just feeling lost and don't know where to start.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential abuse, leading to feelings of isolation and being lost. While there's no explicit mention of self-harm or suicide, the combination of factors raises concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 21:12:32"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Frozen. Didn't know what to do. Feeling sick. Anyone else ever witness something like that? Wish I'd intervened.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an act of violence (shoving). While it seems to be a single incident, the impact on the witness is significant, suggesting potential for escalation or repeated abuse. The witness's distress and regret indicate a sense of urgency.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 21:11:31"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, stronger than before. Reached out to a friend, just needed to vent. It helps, even a little. Remember you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges and feelings of being overwhelmed, suggesting a heightened risk. While the person has reached out for help, the presence of urges necessitates a 'medium' severity assessment due to the potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 21:10:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been so angry lately, and I feel like I'm walking on eggshells. Has anyone else dealt with this? Feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse or a volatile situation. While not explicitly mentioning violence, the 'walking on eggshells' and 'so angry lately' phrases suggest a risk of escalation. The feeling of isolation also increases concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 21:09:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it's hard to breathe. Just trying to get through tonight without hurting myself. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a struggle with intense internal distress and a stated desire to avoid self-harm, indicating an elevated risk level. The question to others suggests a search for support, which is a mitigating factor, but the risk remains.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 20:19:37"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing in the street, escalated so fast. Dude shoved her, I froze. Wish I'd said something. Feeling sick about it. Anyone else ever witness something like that? How did you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault is a serious event. While the original poster was not directly physically harmed, the witnessed violence can cause significant emotional distress and potential long-term psychological impact. The act of physical violence (shoving) indicates a potential for further escalation and harm to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 20:18:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Didn't know what to do. Is calling the non-emergency line the right move next time? Feeling sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical altercation and expressing feeling sick indicates potential for harm and distress. While the observer wasn't directly harmed, the event points to violence occurring and a need for intervention or reporting.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 20:17:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been feeling so isolated lately. Walking on eggshells constantly. Is this normal in relationships? Starting to think maybe it's not. Anyone else experience this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of isolation and walking on eggshells, which are indicators of potential emotional abuse or unhealthy relationship dynamics. This raises concern for the individual's well-being.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 20:16:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Walking on eggshells constantly. Is this normal? Feeling lost and scared. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home environment with fear and uncertainty, suggesting potential emotional or psychological distress. \"Walking on eggshells\" indicates possible conflict or abuse, although the specific nature is unclear. The user's expression of feeling \"lost and scared\" warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 20:15:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, with a desire for help but difficulty reaching out. This suggests emotional distress that could potentially escalate if unaddressed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-10 20:14:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Relapsed after a few months clean. Feeling so ashamed. Reaching out here because I don't know where else to turn. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of being clean combined with feelings of shame and not knowing where to turn indicates potential for escalation. While there is no explicit mention of self-harm or suicide, the user is clearly in distress and needs support. ",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 20:13:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm finally out. It's terrifying and I'm broke, but breathing without walking on eggshells feels...good. Still figuring things out. Any advice on rebuilding after leaving a toxic relationship? #domesticviolence",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a recent escape from a toxic/abusive relationship (domestic violence). While the immediate danger might have subsided, the individual is now vulnerable and facing significant challenges in rebuilding their life, including financial instability and emotional distress. The potential for re-victimization or development of mental health issues related to the trauma is present.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 20:12:25"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused emotional distress. While unsettling, it doesn't indicate an immediate or direct threat of harm to the individual or others, but expresses general anxiety and awareness of potential violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 20:11:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, thank goodness. Makes you realize how fragile things are. If you're struggling, please reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while thankfully resolved by Narcan, indicates a potential risk of fatal outcome in similar situations and highlights the prevalence of drug use and associated dangers.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 20:10:22"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Shook me up. Didn't know what to do. Is there somewhere to report that even if I don't know them? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an act of violence suggests a risk of escalation or further harm to the individual who was shoved. While the witness is not directly in danger, the event is concerning and warrants attention.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 19:17:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to distract myself but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of being overwhelmed, suggesting a potential risk. While not explicitly stating intent, the mention of 'urges' warrants attention and elevates the risk beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 19:16:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm stuck in a dark hole. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being overwhelmed, but lacks specific plans or intentions for self-harm or suicide. The person is reaching out for support.",
    "detected_category": "other",
    "timestamp": "2025-12-10 19:15:06"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train. Scary how quickly things escalate. Makes you wonder what's going on in people's heads. Stay safe out there, everyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing someone being shoved on a train indicates a potential for violence and physical harm, though the outcome and long-term impact are unknown. The observed event could trigger fear or anxiety.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 19:14:05"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. The constant put-downs are chipping away at me. Anyone else feel like they're slowly disappearing? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being worn down by negativity and a sense of disappearing, coupled with a direct question about seeking help. While not explicitly suicidal, the mention of disappearing and struggling to cope raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 19:13:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm underwater. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, indicating potential emotional distress. The phrase \"don't know what else to do\" suggests a sense of helplessness and a need for support, which could escalate if unaddressed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-10 19:12:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Terrifying. Called 911, they're ok now, but shaken. Makes you realize how close we all are to losing someone. Learn the signs, carry Narcan if you can. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, requiring emergency intervention. While the person survived, the incident indicates a risk to individuals in the described environment and highlights the potential for future, possibly fatal, overdoses.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 19:11:00"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost, indicating potential emotional distress and a lack of coping mechanisms. The phrase \"don't know what else to do\" suggests a sense of helplessness.",
    "detected_category": "other",
    "timestamp": "2025-12-10 19:09:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. The urge to hurt myself is strong. Reached out to a friend, but it's still hard. Anyone else feel this way? Any tips on coping?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating an elevated risk. While the individual has reached out for help, the feeling persists.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 19:08:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but lacks explicit mention of self-harm, suicidal ideation, or plans. It appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-10 19:07:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but shook me up bad. Please, if you're using, carry it. Know the signs. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates the presence of potentially life-threatening drug use in the environment. While the individual survived, the situation highlights an immediate risk and promotes awareness of harm reduction.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 18:22:03"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...bad lately. Walking on eggshells constantly. Just need to feel less alone. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a difficult and potentially volatile home environment, indicated by 'walking on eggshells.' While not explicitly mentioning harm, the situation described can be a precursor to various negative outcomes, including mental health issues or escalation to abuse or violence.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 18:21:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scary night. Found my roomie unresponsive. Narcan saved their life. Learn the signs of OD. It could be someone you love. Please be careful out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a life-threatening overdose requiring Narcan intervention, indicating a high risk event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 18:19:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD in my town. Scares me. Been there, almost didn't make it. If you're struggling, please reach out. There's help out there. I promise.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose and the author's past near-fatal experience with overdose, suggesting ongoing risk in the community and potential vulnerability for the author.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 18:18:58"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy, and I'm not sure how to cope. Reaching out to see if anyone else has felt this way and has any advice. Just need a little hope right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness, hopelessness, and being lost. While these are signs of emotional distress, there is no explicit mention of self-harm, suicide, violence, abuse, or overdose. The individual is reaching out for support and advice, indicating a desire to cope rather than harm themselves or others.",
    "detected_category": "other",
    "timestamp": "2025-12-10 18:17:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Rough day. Urges are strong. Just trying to breathe through it. Anyone else feel like they're constantly fighting their own brain?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and a struggle with internal conflict, suggesting a potential risk of self-harm or a related negative outcome.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 18:16:55"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy get shoved on the subway. Everyone just stared. Felt so helpless, wish I'd done something. Is there ever a right way to intervene?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was physically assaulted, which constitutes a violent act. The event has already occurred, indicating an ongoing risk of violence in the environment, even if this particular victim is no longer at immediate risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 18:15:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so small. Is this abuse? Where do I even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, which can escalate to physical violence and have long-term psychological effects. The user is questioning if it is abuse, suggesting a growing awareness of the seriousness of the situation, but also potentially a lack of concrete support.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 18:14:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. The urge to hurt myself is back. Trying to stay strong and remember why I stopped. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a re-emergence of the urge to self-harm, indicating a potential risk. While the individual is actively trying to resist the urge, the presence of the urge itself elevates the severity beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 18:13:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about someone OD'ing. Scared me. My brother's struggled for years. Narcan saves lives. Learn the signs, please. It's closer than you think.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose and the writer's fear related to their brother's struggle, indicating a potential ongoing risk and proximity to a dangerous situation. It also highlights the importance of recognizing overdose signs.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 18:12:49"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to feel *something* is to hurt. I know it's not healthy, trying to find better coping mechanisms. Anyone else relate? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to self-harm as a coping mechanism, which is a concerning indicator of potential risk. The individual acknowledges it's unhealthy but seeks validation, suggesting they may be struggling to find alternatives and are feeling lost. While there's no immediate plan, the ideation and feeling of being lost elevates the risk beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 17:19:57"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's hard to admit, but things at home aren't good. Constant yelling, walking on eggshells... I don't know what to do anymore. Has anyone else been through this? Feeling so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a distressing home environment with constant yelling and a feeling of being alone, suggesting emotional distress. While it doesn't explicitly mention self-harm or suicidal ideation, the level of distress warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 17:18:55"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Just had another 'episode' with him. Walking on eggshells constantly. Is this normal in relationships? Feeling so lost & scared.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse or a volatile situation ('walking on eggshells', 'scared'). While not explicitly mentioning physical violence, the fear and loss suggest a situation that requires further investigation and could escalate.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 17:17:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Terrifying. Narcan saved them, but damn. Learn the signs, carry it if you can. It really does happen. #BePrepared",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event involving a friend, indicating a serious, life-threatening situation. While the friend was saved, the experience highlights the potential for fatal outcomes associated with drug use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 17:16:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a high level of distress and potential for immediate danger. While the person reached out to a friend, the presence of the strong urge elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 17:15:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scariest thing ever. Narcan worked, thank god. Please, everyone, carry it. You could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was effective, the overdose event indicates a significant risk to the individual who overdosed and highlights the potential for future overdose events in the community. It also highlights a potential public health concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 17:14:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Some guy just snapped. Makes you wonder what pushes people that far. Scared me, honestly. Hope everyone involved is okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence indicates a potential threat to public safety, though the extent and likelihood of further incidents are unclear.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 17:13:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mentions or plans related to self-harm, suicide, violence, abuse, or overdose. It is a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-10 17:12:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post that discusses suicide, focusing on seeking help and sounding authentic:\n\n\"Been feeling really low lately. Like, is-there-even-a-point low. Reaching out because I know I need to. If you've been there, what helped? Talking to someone feels impossible right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 53 (char 76)",
    "detected_category": "unknown",
    "timestamp": "2025-12-10 17:11:42"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Walking on eggshells constantly. Anyone else feel like they're losing themselves? I don't know what to do anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult and potentially harmful home environment ('walking on eggshells') and feelings of loss and desperation ('losing themselves', 'don't know what to do anymore'). While not explicitly stating intent, the distress expressed suggests a potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 17:10:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Narcan saved their life, but it shook me up. Please, if you or someone you know is struggling, get help. It's out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual survived due to Narcan, an overdose event indicates significant risk of future occurrences and potential fatality. The text expresses distress and concern, suggesting a potentially destabilizing situation in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 16:20:54"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Clean for a few weeks, but relapsed tonight. Feels like I'm back at square one. Anyone else feel this way? How do you cope after?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates vulnerability and potential for negative consequences. While the text doesn't explicitly mention self-harm or suicide, the feeling of being 'back at square one' can be demoralizing and increase risk.",
    "detected_category": "other",
    "timestamp": "2025-12-10 16:19:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so numb lately. The urge to feel *something* is overwhelming. Reached out to a friend, hoping it helps. It's scary how easily I slip back.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses numbness, an overwhelming urge to feel something, and a sense of fear/instability. While explicitly reaching out for help, the ease of slipping back is concerning.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 16:18:50"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy get shoved on the train today. Just trying to get home from work. It shook me up. Anyone else witness something like that lately? Feeling kinda helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While concerning, the text describes a single incident of violence witnessed by the author, not directed at them. There's no immediate threat indicated.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 16:17:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been feeling so isolated lately. Walking on eggshells constantly. Is this normal in a relationship? Starting to think it's not just \"stress\" anymore. Anyone else been through this? #abuse #domesticviolence #relationships",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and a feeling of being controlled ('walking on eggshells'). While not explicitly stating physical harm, the use of hashtags #abuse and #domesticviolence raises concern and suggests the situation could escalate. Isolation is also a risk factor.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 16:16:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Said something, hope she's okay. Makes you sick. Anyone know resources for that kind of situation? Feel helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a man shove his girlfriend suggests potential violence and/or abuse. While the immediate outcome is unknown, the act itself indicates a risk of harm. The witness expressing concern and helplessness further underscores the seriousness.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 16:15:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Been having a rough time lately. The urge to self-harm is strong. Reached out to a friend, feels a tiny bit lighter. Anyone else relate? Just trying to get through this.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, which indicates a potential risk. While the person has reached out for help, the risk remains due to the intensity of the urge.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 16:14:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been really bad lately. Walking on eggshells constantly. Is this normal? Feeling so alone. Need to figure out what to do next.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and potentially volatile home environment, characterized by anxiety and isolation ('walking on eggshells', 'feeling so alone'). While not explicitly stating violence or abuse, the described situation suggests a level of distress that requires attention and could escalate.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 16:13:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not okay. Constant yelling, walking on eggshells. Feeling trapped. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with constant yelling and a feeling of being trapped, which indicates potential emotional distress and a risk of escalation. While it doesn't explicitly mention self-harm, violence, or suicide, the level of distress suggests a need for support and monitoring.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 16:12:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post that discusses suicide, aiming for authenticity and help-seeking, while remaining within the 300-character limit:\n\n\"Things have been really dark lately. Feeling overwhelmed and like I'm drowning.  Anyone know of resources or just someone who gets it?  Need to find a lifeline.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post expresses feelings of being overwhelmed and drowning, coupled with a desire for help and a 'lifeline.' This indicates suicidal ideation, even if not explicitly stated, and a potential for self-harm. The request for resources also suggests an awareness of needing help, but the overall tone and content warrant a medium severity rating due to the potential for immediate risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-10 16:11:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but it shook me up. Makes you realize how close it can be. Anyone know where I can get trained on using it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be psychologically distressing, suggesting a medium level of impact on the individual's well-being. The person is also seeking Narcan training, indicating a concern for potential future overdoses in their environment.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 15:20:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It helps. If you're struggling too, you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges are back,' indicating a potential relapse of harmful thoughts or behaviors. While the person is reaching out for help, the presence of urges elevates the risk beyond a simple feeling of overwhelm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 15:18:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to feel *something* is to hurt. I know it's not right, but the urge is so strong. Anyone else relate? Trying to find better coping mechanisms.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating a risk of acting on those feelings. While the individual acknowledges it's not right and seeks help, the presence of the urge elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 15:17:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Just reaching out to say if you're struggling, you're not alone. Talking really does help. I'm trying to find the strength to keep going. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of heaviness and struggling to find the strength to keep going, indicating potential emotional distress and a risk of escalation. The heart emoji suggests a desire for connection and support, but the overall tone warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-10 15:16:55"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells lately. Partner's temper is getting scary. Not sure what to do. Anyone else experience this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential for escalating abuse due to the partner's increasing temper and the user's fear.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 15:15:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them. Carry it, learn to use it. You could save a life. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose indicates a severe situation with immediate life-threatening risk. While Narcan was used and successful, the potential for fatality exists, making this a high-severity risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 15:14:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been walking on eggshells lately. Partner's temper is scary. Just needed to say it somewhere. Anyone else feel this way? Feeling so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Implies potential for physical or emotional abuse due to partner's temper, causing significant distress and fear.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 15:13:50"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up. Makes you realize how quickly things can escalate. Anyone else ever witness something like that? Still processing it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, especially a knockout, can be psychologically distressing and suggests a potential for escalation in the environment. Although not directly involved, the witness expresses being 'shook up,' indicating a significant impact. While not an immediate threat, the experience could contribute to anxiety or fear.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 15:12:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad lately. Constant put-downs, controlling behavior... Feels like I'm walking on eggshells. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, indicating a potentially harmful situation, although there is no explicit mention of physical harm or suicidal ideation. The feeling of 'walking on eggshells' suggests a stressful and potentially escalating environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 15:11:46"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Wish I'd said something, done something. Feeling sick about it. Anyone else ever experience this? How do you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be psychologically distressing and indicates a risk of escalation or repeated incidents. While the reporter is safe, the victim is at risk of further harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 15:10:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Walking on eggshells constantly. Anyone else ever feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 90 (char 115)",
    "detected_category": "unknown",
    "timestamp": "2025-12-10 14:19:29"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but doesn't contain explicit mentions of self-harm, suicide, or violence. The user is reaching out for support, suggesting a desire for help rather than immediate danger.",
    "detected_category": "other",
    "timestamp": "2025-12-10 14:18:27"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing on the street. Escalated so fast. He shoved her, I froze. Feel sick. Wish I'd done something. Anyone else ever feel this helpless?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence (shoving). While the observer wasn't directly harmed, witnessing violence can be traumatizing and suggests a potential for escalation or further violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 14:17:25"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park yesterday. Scary stuff. Narcan saved him. Makes you realize how fragile life is. Learn CPR and how to use Narcan. Could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was successful, the overdose event indicates a significant risk of death. The text also encourages learning life-saving skills in case a loved one overdoses, suggesting a potential ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 14:16:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a sense of helplessness ('don't know what else to do'). While not explicitly suicidal, the statement 'feeling so heavy lately. Like I'm underwater' suggests significant distress and a need for support, indicating a potential risk that requires further assessment. The plea for advice is a positive sign, but the level of distress warrants caution.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 14:15:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of intense isolation and a sense of being overwhelmed (\"underwater\"). While it doesn't explicitly mention self-harm or suicide, the desperation and reaching out for help suggests a significant level of distress that requires attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-10 14:14:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but indicates help-seeking behavior by reaching out to a friend. No explicit mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2025-12-10 14:13:16"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Walking on eggshells constantly. Feeling isolated. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling isolated and 'walking on eggshells,' suggesting potential emotional distress and an unstable or potentially abusive home environment. While not explicitly mentioning harm, the situation warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 14:12:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor being carried out by paramedics today. OD. This sh*t's too real. Knowing he's got kids... Makes you think. If you're struggling, please reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a neighbor experiencing an overdose, suggesting potential risk to others in the community and highlights the serious consequences of substance abuse. The author expresses concern and urges people to seek help, implying the issue is pervasive.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 14:11:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"He's been getting angrier lately. Small things set him off, and I'm always walking on eggshells. Is this normal? I feel so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes escalating anger in another person, leading the speaker to feel unsafe and alone. While not explicitly stating violence, the description of \"walking on eggshells\" suggests potential for verbal or emotional abuse, and the escalation is concerning.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 14:10:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, feeling so overwhelmed lately. The urge to self-harm is strong. Trying to stay strong and remember my coping skills, but it's hard. Anyone else relate? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating immediate risk. While the person is attempting to use coping skills, the intensity of the urge necessitates immediate concern and potential intervention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-10 13:29:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD. Makes me sick. Lost my cousin last year. Please, if you're struggling, reach out. There are people who care. It doesn't have to end like this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and acknowledges the risk of overdose, which is a serious health risk. While not explicitly suicidal, the context implies potential vulnerability and highlights a fatal outcome related to substance use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 13:28:25"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a guy get shoved on the train today. Just stood there frozen. Wish I'd said something, anything. Feel sick about it now. Is there anything you *can* do in those situations?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was physically assaulted (shoved) on a train. While the text doesn't indicate serious injury, the act of violence itself and the witness's distress suggest a moderate level of risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 13:27:23"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw two guys fighting outside my work today. Scared the crap out of me. One was bleeding bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a violent altercation with one person bleeding badly, indicating a potential for serious harm. While the author was not directly involved, witnessing such violence can be traumatizing and highlights a general risk of violence in the environment.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 13:26:21"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Been walking on eggshells lately. Partner gets so angry over the smallest things. Is this normal? Feels like I'm doing everything wrong. Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse. The phrase \"walking on eggshells\" suggests a pattern of unpredictable anger and control, leading to anxiety and feeling constantly wrong. While not explicitly stating physical harm, the emotional impact could escalate.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 13:25:19"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Finally left. Scared & broke, but free. Years of emotional & financial control...it's over. Any advice for starting over? Feels impossible right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a history of emotional and financial control, suggesting potential abuse. The person is now in a vulnerable state (\"scared & broke\") and the feeling of \"impossible\" can be a precursor to further distress. While there's no explicit mention of self-harm or suicide, the circumstances warrant a medium severity due to the potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-10 13:24:17"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside the bar. Shaken up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing unease but no direct threat to the individual. While the mention of escalation is concerning, there's no indication of immediate danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-10 13:23:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Talking feels impossible but I need to try.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost and overwhelmed, indicating emotional distress and a need for help. While there is no explicit mention of self-harm or suicidal intent, the metaphor of 'being underwater' suggests a feeling of being trapped and struggling, which warrants concern and further assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-10 13:22:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to a friend helped a little. Remember to reach out, even if it's hard. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but also mentions seeking support from a friend, indicating a coping mechanism. No explicit mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2025-12-10 13:21:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, but it was close. Learn CPR, carry Narcan. Could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the person survived, indicates a potentially ongoing risk of overdose in the area and the near-fatal outcome implies significant harm. Also serves as a call to action for the responder.",
    "detected_category": "overdose",
    "timestamp": "2025-12-10 13:20:10"
  }
]