[
  {
    "title": "User Story: Overdose",
    "content": "---\n\nJust found out a friend OD'd. Narcan saved them, thankfully. Scary reminder how easily this can happen. Learn the signs, carry Narcan if you can. It saves lives. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose situation which is inherently dangerous, even though Narcan was successful. It acknowledges the ease with which such events can occur, suggesting a potential ongoing risk within the friend's social circle.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 08:20:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me up bad. Please, if you're using, carry it. Learn how. It can save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event requiring Narcan intervention, indicating a significant risk of severe health consequences or death. While the person survived, the situation underscores the high potential for fatal outcomes associated with substance use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 08:19:03"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The yelling, the put-downs... I'm starting to believe them. Anyone else feel this lost? Where do I even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, feelings of worthlessness due to verbal abuse, and a cry for help. While not explicitly stating self-harm or suicidal ideation, the feeling of being 'lost' and the impact of the abuse suggest a need for intervention and monitoring.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 08:18:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. Makes me sick. Lost my cousin last year. Please, if you're struggling, reach out. There are people who care. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a recent overdose death and expresses concern, indicating potential risk for others struggling with similar issues. The mention of losing a cousin also suggests personal connection to the issue, potentially increasing the poster's own vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 08:17:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved their life. Learn CPR & where to get it, seriously. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a stressful event and highlights the risk of overdose to others. While Narcan was effective, the situation indicates a potential ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 08:15:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, I understand. Here's a short social media post focusing on seeking help and sounding authentic:\n\n\"Been feeling so low lately. Like, really low. Reached out to a friend, and it helped a little. Thinking of calling a helpline tomorrow. Just gotta keep going. One step at a time.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being \"really low\" and reaching out for help. While the individual is taking steps to improve their situation, the depth of their negative emotions warrants a medium severity rating due to potential risk of escalation if support is not consistent or sufficient.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 08:14:57"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, walking on eggshells... Is this normal in relationships? Feeling lost and scared. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 51 (char 76)",
    "detected_category": "unknown",
    "timestamp": "2025-12-14 08:13:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up bad. Is there anywhere safe to walk around here after dark anymore? Feeling really unsafe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feeling unsafe due to witnessing a fight, but it doesn't indicate immediate danger to the individual or others. It's a general expression of fear and concern about safety in the area.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 08:12:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just realized how much I've normalized the yelling. It's constant. Is that... normal? Starting to think maybe not. Feel so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the individual is experiencing constant yelling, which suggests a potentially abusive environment. This is causing them distress and feelings of being lost.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 08:11:53"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Never seen anything like that in person before. Anyone else feel like things are getting more aggressive lately? Feeling anxious.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses anxiety and unease after witnessing a fight, but doesn't indicate any direct threat to self or others, or involvement in the violence.",
    "detected_category": "other",
    "timestamp": "2025-12-14 08:10:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are strong. Reached out to a friend, hoping it helps. Just trying to get through the day.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges and acknowledges a 'rough time,' indicating distress. While the person is reaching out for help, the intensity of the urges suggests a need for monitoring and potential intervention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 07:17:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need to get through tonight. It's okay to not be okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential for self-harm or harmful behavior. While the person has reached out for support, the presence of urges elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 07:16:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back and stronger. Reached out to a friend, feels a bit better to not be alone with it. Still scary though.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of strong urges and feelings of being scared. While reaching out to a friend is a positive coping mechanism, the intensity of the urges suggests a need for further support and monitoring. The specific nature of the urges is unknown but warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 07:15:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD in the park. Terrifying. Called 911. Please, people, be careful out there. Naloxone saves lives. Know how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A witnessed overdose suggests immediate danger to the individual experiencing it and highlights a broader public health risk in the area.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 07:14:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got decked. Shook me up. Makes you wonder what's going on with people. Anyone else feeling this lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing an act of violence (a fight), but does not suggest the author is in immediate danger, planning violence, or at imminent risk. While disturbing, it's a secondhand account and expresses more unease than immediate threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 07:13:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like too much. Scared to admit I relapsed. Reaching out because I don't want this anymore. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse and a desire to stop, suggesting potential risk. While not explicitly suicidal, the feeling of 'too much' and relapse elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 07:12:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant yelling, put-downs... I feel so small. Is this normal? Anyone else go through this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (yelling, put-downs) and feelings of worthlessness and being lost. While not explicitly mentioning self-harm or suicide, the emotional distress described increases the risk for potential escalation to those behaviors.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 07:11:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... scary lately. Walking on eggshells all the time. Is this normal? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially unsafe home environment and emotional distress, suggesting a risk of harm to the individual. While not explicitly stating violence or abuse, 'walking on eggshells' implies a threatening atmosphere.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 07:10:35"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. Urges are back, and it's hard to fight them. Reached out to a friend, just need someone to listen. It helps, even a little. #mentalhealth",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges, which suggests a potential risk. While the person is reaching out for help, the presence of urges elevates the risk beyond just feeling low.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 07:09:34"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a fight outside the bar last night. Dude got knocked out cold. Shook me up. Is this normal now? Feeling anxious about going out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault and feeling anxious about future safety suggests a moderate level of distress and potential risk of future exposure to violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 07:08:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating emotional distress and a need for support. The phrase 'underwater and can't find the surface' suggests feelings of hopelessness, but there is no direct mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2025-12-14 06:21:24"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain any explicit or imminent threats of harm to self or others. It seems like a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-14 06:20:22"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant yelling, put-downs... feels like I'm walking on eggshells. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile and emotionally abusive home environment which, while not explicitly mentioning physical harm, indicates significant emotional distress and potential for escalation. Walking on eggshells is a key indicator of a stressful and potentially volatile situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 06:19:21"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside my apartment. Called the cops, but I feel sick. Is there anything else I can do? Witnessing that was awful.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Report of active physical assault indicates a high risk of serious injury to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 06:18:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Reached out to a friend, but still struggling. Any advice on getting through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Expresses a strong urge to self-harm (cutting) and acknowledges ongoing struggle despite reaching out for help, indicating imminent risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 06:17:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a screen. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of numbness and detachment, which can be precursors to more serious mental health issues. Reaching out for help indicates some level of awareness and a desire to change, but the lack of specific ideation or plans keeps it from being high severity.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 06:16:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Old coping mechanisms keep popping up. Really trying to resist. Anyone else relate? Just feeling alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and relying on old coping mechanisms. While concerning, it doesn't explicitly mention self-harm, suicide, or violence. The individual is actively resisting the coping mechanisms and reaching out for connection, which suggests a degree of self-awareness and a desire to manage their feelings.",
    "detected_category": "other",
    "timestamp": "2025-12-14 06:15:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head I just want it to stop. Scared to admit it, but the urge to cut is back. Reached out to a friend, hoping it helps. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a strong urge to self-harm (cutting) and mentions wanting the mental distress to stop, suggesting a potential crisis situation. While the person reached out for help, the risk remains high until support is confirmed and effective.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 06:14:13"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the subway. Scary how fast things escalate. Shook me up pretty bad. Anyone else witness that near Grand Central around 5pm?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A physical assault (shoving) occurred on a subway, indicating potential for injury. While no injury severity is explicitly stated, the potential for escalation and the witness's distress suggest a moderate risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 06:13:12"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my kid's school. Shook me up bad. Makes you wonder what's going on in these kids' lives. Anyone else seeing more anger lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't indicate imminent or severe danger. It raises concerns about community violence but lacks specifics suggesting a high level of risk to specific individuals.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 06:12:10"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a guy punch his dog in the park today. Shaking. Feel sick. Didn't know what to do. Anyone else ever witness something like that? Wish I'd intervened.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing animal abuse is upsetting and can cause distress, but the immediate risk of physical harm to a human is low. The poster expresses emotional distress but does not indicate any intent to harm themselves or others.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 05:18:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost and overwhelmed, indicating a potential mental health crisis. The statement \"Talking to someone feels impossible, but I know I need to\" suggests a desire for help despite difficulty reaching out.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 05:17:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Finally left. Heart's pounding. Not sure what's next, but I'm safe. Any advice for rebuilding after emotional abuse? Feels like I don't even know myself anymore.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates the person has left an abusive situation and is now safe. While they are experiencing emotional distress and uncertainty, there is no immediate threat of harm to themselves or others. The focus is on rebuilding, suggesting a desire to move forward.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 05:16:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thank god. Makes you realize how fragile life is. Reach out if you're struggling, please. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential risk of harm, even though intervention was successful. The experience can be emotionally distressing and highlights the presence of dangerous substance use in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 05:15:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Cutting again after a long time clean. It's like the only thing that quiets the noise, even if it's just for a bit. Reaching out because I don't know what else to do. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions self-harm (cutting) after a period of abstinence, indicating a relapse and a potential escalation of distress. The individual is actively seeking help, suggesting they are struggling to cope and are aware of the seriousness of their situation. They are using self-harm to cope with overwhelming feelings, implying a significant level of emotional pain.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 05:14:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. Urges are back. Reached out to a friend, just need someone to listen. It helps. Please don't judge.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential risk of self-harm or suicide. Reaching out to a friend is a positive coping mechanism, but the presence of urges elevates the severity beyond 'low'.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 05:13:05"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, indicating a potential for mental health distress. The user is actively seeking help, which suggests they recognize the problem, but the depth of their distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 05:12:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Narcan saved him, thank God. Makes you realize how fragile life is. Anyone know where to get more training? Just in case...",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a significant event that can cause psychological distress. The question about Narcan training suggests a concern about future incidents and a desire to be prepared for potentially life-threatening situations.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 05:11:02"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on Elm St. Shook me up. Called the cops, hope she's okay. Makes you realize how easily things can escalate. Anyone else seen something similar? Feeling sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent act (shoving) indicates a potential for escalation and harm to the victim. While the immediate physical harm might be limited to the shove, the potential for further violence and the psychological impact on the victim warrant a 'medium' severity rating.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 05:10:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things at home are...rough. Walking on eggshells all the time. Anyone know resources for emotional abuse? Feeling so lost.\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Took me years to realize yelling and control *is* abuse. It's not normal. I'm still healing from it.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Gaslighting is real and it messes with your head. Don't let anyone tell you your feelings aren't valid.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and gaslighting, which can significantly impact mental health and potentially escalate to physical harm or self-harm in the long term.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 05:08:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Reminded me of my brother, he's been struggling with anger. Anyone know resources for anger management? It's getting scary.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A fight broke out, causing distress. While the focus is on the brother's anger management, the description \"getting scary\" indicates a potential escalation of violence is possible.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 04:30:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... Feels like I'm walking on eggshells. Anyone else been through this? How did you find the strength to leave?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation indicative of emotional abuse and controlling behavior which can escalate over time and negatively impact the person's mental and physical well-being. The person is seeking help and expressing a desire to leave the situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 04:29:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Just trying to make it through the night without hurting myself. Anyone else feel this way? Feeling so alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text explicitly mentions the desire to avoid self-harm, indicating a risk. While not stating intent, it expresses a struggle and feelings of loneliness, suggesting potential vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 04:28:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just realized the \"normal\" arguments are...not normal. Constant yelling, name-calling? Feels like I'm walking on eggshells. Anyone else experience this? Is this abuse? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of verbal abuse and emotional distress, indicating a potentially harmful situation that warrants further investigation. The user feels unsafe ('walking on eggshells').",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 04:27:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed ('underwater'), and a plea for understanding, suggesting emotional distress that warrants attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 04:26:41"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy shove his girlfriend on the street. Shook me up. Called the non-emergency line, hope she's okay. Makes you realize how close it is, you know?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a witnessed act of violence (shoving), indicating a potential risk of physical harm to the girlfriend. While the immediate outcome is unknown, the act itself warrants concern and justifies a medium severity level.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 04:25:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nJust saw a story about another OD. Makes me sick. Happened to a friend last year. Please, if you're struggling, reach out. There are people who care & want to help you stay safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose (OD) and implies the author's friend also overdosed and died last year. While the author encourages seeking help, the mention of overdose and a past loss indicates a potential risk for others who may be struggling.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 04:24:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Talking feels impossible but I need help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed, and a need for help, suggesting potential emotional distress and vulnerability, though no explicit suicidal ideation is present.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 04:23:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been...rough. Walking on eggshells all the time. Anyone else ever feel like they're losing themselves trying to keep the peace? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a difficult and stressful home environment, potentially involving emotional manipulation or abuse (\"walking on eggshells\"). The feeling of \"losing themselves\" indicates a potential for negative mental health consequences. While not explicitly stating harm, the situation described increases the risk of depression, anxiety, or self-harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 04:22:36"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge after seeing something like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling, but doesn't directly indicate imminent harm to the author or others. The author expresses feeling shaken and on edge, but not necessarily that they are in danger or planning violence themselves.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 04:21:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Learn how to use it, seriously. Could save a life. #reallife",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event indicating potential for future risk. While Narcan was successful, the event highlights the presence of dangerous drug use and the potential for future, possibly fatal, overdose incidents.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 03:46:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, I understand. Here's a short social media post that discusses suicide, aiming for authenticity and help-seeking, while avoiding hashtags:\n\n\"Been feeling so low lately, like I'm trapped. Just talking feels impossible. Anyone else ever feel this way? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The post expresses feelings of being trapped and low, directly linking to suicidal ideation. The explicit mention of difficulty talking and seeking help, while positive in intention, indicates a significant level of distress and potential risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 03:45:19"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Shaking. Is there anywhere safe to walk around here anymore? Feeling really anxious now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses anxiety and fear after witnessing a fight, but does not indicate immediate danger to self or others. The individual is seeking a safe space, suggesting a desire to avoid further harm rather than inflict it.",
    "detected_category": "other",
    "timestamp": "2025-12-14 03:44:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is back. It's like a twisted comfort. Talking to my therapist tomorrow, gotta hold on til then. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions the return of urges to self-harm, indicating a significant escalation of risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 03:43:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to resist but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges' which implies a potential risk of self-harm or other harmful behaviors. The struggle to resist suggests the individual is currently in distress and vulnerable.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 03:42:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw on the news about another OD. It's scary. Lost a friend last year. If you're struggling, please reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose death and the loss of a friend to an overdose, indicating a potential risk, although it primarily focuses on encouragement and support.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 03:41:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough week. Feeling so drained and empty. Reaching out because I don't know what else to do. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being drained, empty, and not knowing where to turn. While not explicitly stating suicidal intent, the language suggests emotional distress and a need for support, indicating a potential risk that requires attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 03:40:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing I've ever witnessed. Narcan saved their life. Please, learn how to use it. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was effective, an overdose indicates a significant risk of death or serious harm. The event's impact on the observer also suggests a potentially disturbing situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 03:39:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, but it was close. Please, if you're struggling, reach out. There's help. Don't be afraid. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a near-fatal overdose, indicating a serious risk event and potential ongoing risk to others who may be struggling with addiction.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 03:38:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. Urges were strong, but I distracted myself with music. Still shaky. Anyone else get through tough moments like this? Just looking for support.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and ongoing shakiness, suggesting distress and potential vulnerability. While the person distracted themselves, the intensity of the urges implies a need for support and monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 03:37:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n\"Relapsed after a few months. Feeling so ashamed and alone. Reaching out for support again. It's a daily struggle.\"\n\n**Option 2 (Sharing a Personal Story):**\n\n\"Scars aren't weakness, they're proof I survived something I thought would kill me. Still healing.\"\n\n**Option 3 (Raising Awareness):**\n\n\"It's not attention-seeking. It's a sign someone's hurting. Please be kind and listen.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates a relapse and feelings of shame and isolation, which are risk factors. Option 2 mentions scars and survival, implying past self-harm. Option 3 calls for general awareness.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 02:57:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just needed someone to listen. It helps. If you're struggling too, please don't be alone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges are back,' which indicates a potential risk of self-harm or other harmful behaviors. While the person reached out for help and found it beneficial, the presence of urges necessitates a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 02:56:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. OD is real and scary. Please, if you're struggling, reach out. Don't let fear win. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event, indicating a high risk of recurrence and potential fatality. The language used (\"OD is real and scary\", \"almost didn't wake up\") suggests a close call with a life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 02:55:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Just reaching out...anyone else ever feel this way? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and being lost, but there's no explicit mention or direct indication of self-harm, suicide, or harm to others. It's a general expression of distress and a desire for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-14 02:54:14"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend, hoping it helps. It's exhausting pretending I'm okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, with exhaustion from pretending to be okay. Reaching out to a friend is a positive sign, but the depth of despair warrants attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 02:53:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant yelling, put-downs... I feel so small. Has anyone else dealt with this? How do you even start to cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive and emotionally damaging home environment. While there is no explicit mention of physical harm, the constant yelling and put-downs suggest emotional abuse and a significant impact on the individual's well-being. This could escalate to other issues if not addressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-14 02:52:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is back. It's scary. Reached out to a friend, hoping it helps. Remember to be kind to yourselves.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly states an urge to self-harm, which indicates a significant risk. Reaching out to a friend is a positive coping mechanism, but the presence of the urge necessitates a high severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 02:51:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. The urge to cut is strong. Reached out to a friend, just needed to vent. It helps, but it's still a struggle. Any tips for coping?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a strong urge to self-harm (cutting), which indicates a risk. While the person reached out for help, the struggle persists, suggesting the risk is not immediately resolved.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 02:50:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. The urge to cut is strong. Trying to distract myself, but it's hard. Anyone else feel this way sometimes? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting). While the individual is attempting to distract themselves, the presence of the urge indicates a significant risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 02:49:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm drowning and can't see the surface. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost, suggestive of distress and potential for self-harm ideation, but lacks explicit mention of suicide or self-harm plans.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 02:48:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing I've ever seen. Makes you realize how fragile life is. If you're struggling, please reach out to someone. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event, indicating potential risk to the individual who overdosed, even though the author is reporting it. The encouraging message at the end suggests awareness and concern for others who might be struggling, raising it to medium.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 01:46:19"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing outside the store, escalated so fast. He shoved her. Shaken. Called the non-emergency line, hope she's okay. Makes you realize how quickly things can turn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence (shoving) occurred, indicating a potential for further escalation and harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 01:45:17"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and overwhelmed, indicating a potential mental health crisis. The metaphor of being 'underwater' suggests feelings of suffocation and helplessness. Reaching out is a positive sign, but the lack of specific details requires further assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 01:44:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scary stuff. Please, if you're using, have someone with you, and Narcan. It saves lives. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal event (almost didn't wake up) strongly suggestive of an overdose, indicating a high risk to life. The advice to use with someone present and have Narcan readily available further supports this interpretation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 01:43:14"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need help. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a lack of meaning, which are potential indicators of suicidal ideation or depression requiring support. The individual is explicitly asking for help, suggesting awareness of a problem.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 01:42:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD. Scared. Lost a friend last year, and it still hurts. If you're struggling, please reach out. There's help out there. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and grief related to overdose, mentioning a past loss. While it encourages seeking help, the expression of fear and the recent loss elevate the risk level beyond 'low'. There's a potential for vicarious trauma or increased vulnerability due to the reminder of the friend's death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 01:41:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to distract myself but it's hard. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The mention of 'urges' suggests a potential risk of self-harm. While the individual is trying to distract themselves, the urges being 'back' indicates a relapse or worsening of their condition.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 01:40:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Really wanted to relapse, but distracted myself with a movie. Still feeling shaky. Anyone else get that 'almost there' feeling? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a strong urge to relapse, suggesting vulnerability. While the individual did distract themselves, they are still feeling shaky and experiencing the 'almost there' feeling, indicating ongoing risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 01:39:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up yesterday. Narcan saved him. Learn the signs of an overdose, please. It's not just junkies, it could be anyone. 💔",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose situation requiring Narcan intervention, indicating immediate and serious health risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 01:38:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Clean for 3 months, almost slipped. Reached out to a friend instead. Still shaky, but I made it. It gets so hard sometimes.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a near relapse in sobriety which could lead to negative health outcomes. The user explicitly mentions feeling overwhelmed and almost slipping, suggesting a vulnerability.",
    "detected_category": "other",
    "timestamp": "2025-12-14 01:37:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. Urges are back. Reached out to a friend, just gotta get through tonight. It's okay to not be okay, right? 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and low mood, suggesting a potential risk for self-harm or suicide. Reaching out to a friend is a positive step, but the phrase 'just gotta get through tonight' implies a struggle and immediate risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-14 00:49:21"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Froze, didn't know what to do. Still shaking. Anyone know the best way to intervene safely in situations like that? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence in public. While the original poster wasn't the target, the observed assault indicates a risk of escalation or further violence. The poster's distress also suggests a potential impact on their mental well-being.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 00:48:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Clean for a week, then relapsed. Feeling so ashamed and lost. Reaching out before it gets worse. Anyone know of resources that actually help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses shame and feeling lost after a relapse, indicating potential distress. The statement 'Reaching out before it gets worse' suggests an awareness of escalating risk and a desire to prevent further harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 00:47:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it was too close. Learn the signs, carry Narcan if you can. It really works.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose and the near-fatal outcome indicates a high-risk situation involving potential death. While Narcan was effective, the phrase 'too close' highlights the extreme danger.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 00:46:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Scratched again last night. Feeling so ashamed & lost. Anyone else get stuck in this cycle? Need to find a way out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates self-harm (scratching) and feelings of shame and being lost. The mention of a 'cycle' suggests this is a recurring behavior, increasing the risk. While not explicitly suicidal, the negative emotional state warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 00:45:16"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Frozen. Called the cops, hope she's okay. Makes me sick. Anyone know resources for DV victims in the city? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Observed violence (physical assault). While the immediate danger to the original poster is low, the incident indicates a potential risk of escalation for the victim of the assault.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 00:44:14"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Called the non-emergency line, hope she's okay. Anyone else ever witness something like that? Still feel sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault is potentially traumatizing and indicates a real-time safety risk to the victim, though the extent of injury is unknown.",
    "detected_category": "violence",
    "timestamp": "2025-12-14 00:43:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Called 911, they're gonna be ok. Seriously considering carrying Narcan now. Anyone else carry it? Where'd you get it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a recent overdose event, indicating a potential risk to others nearby experiencing similar events. The individual is considering carrying Narcan, acknowledging the potential for future overdoses.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 00:42:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, thank God. Carry it, learn how to use it. You could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event requiring intervention. While the person survived, overdose events can easily lead to death, indicating a significant risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-14 00:41:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Just trying to take it one minute at a time. Anyone else relate? Feeling pretty alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges and feelings of isolation, suggesting potential self-harm risk. While not explicitly suicidal, the mention of 'urges' and feeling 'alone' warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-14 00:40:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to someone feels impossible, but I know I need to. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of hopelessness and being overwhelmed, indicating a potential mental health crisis. They acknowledge the need for help but are struggling to reach out.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 23:17:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown yesterday. Scary stuff. Narcan saved him, but it shook me up. Makes you realize how fragile life is. Anyone else feeling this heavy lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be a traumatic experience leading to psychological distress. While the person survived due to Narcan, the event's impact on the individual sharing the text warrants attention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 23:16:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, and indicates a lack of coping mechanisms. While not explicitly suicidal, the feelings of heaviness and seeking help suggest a potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 23:15:17"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and being overwhelmed, but lacks explicit statements of harm or intent. It seeks connection and suggests talking as a coping mechanism.",
    "detected_category": "other",
    "timestamp": "2025-12-13 23:14:15"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out downtown last night. Just yelling at first, then fists. Scared me half to death. Is this normal now? I don't feel safe anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical altercation and expressing feelings of fear and unsafety suggests a potential for harm, although it's based on observation rather than direct threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-13 23:13:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It helps. If you're struggling too, you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges are back' and feeling overwhelmed, which suggests a potential risk of self-harm or suicidal ideation. The person is seeking help, which is a positive sign, but the return of urges elevates the risk above low.",
    "detected_category": "suicide",
    "timestamp": "2025-12-13 23:12:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved their life, thankfully. Please, learn how to use it. Could save someone you love. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a serious health crisis and potential for further overdoses in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 23:11:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them. Please, if you're struggling, reach out. There's help out there. Don't want to lose anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests potential risk for others in the community and highlights the ongoing opioid crisis. While the person survived, the event indicates the presence of a serious health risk and potential for fatal outcomes.",
    "detected_category": "overdose",
    "timestamp": "2025-12-13 23:10:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Cutting again after a long time clean. Don't know how to stop. Anyone else relate? Just need to feel less alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a relapse of self-harm (cutting) and a feeling of being overwhelmed, suggesting a significant risk of continued or escalated self-harm. The individual also expresses a lack of control and a need to feel less alone, which highlights their vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-13 23:09:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Walking on eggshells all the time. Is this normal? Feeling so lost and alone. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, feeling unsafe ('walking on eggshells'), and isolation. While not explicitly mentioning harm, the situation suggests a potentially volatile or harmful home environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-13 23:08:05"
  }
]