[
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight outside my building. Shook me up. Makes you realize how easily things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused unease. While potentially disturbing, it doesn't indicate immediate danger to the poster or others, nor does it suggest plans for violence or harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 13:32:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thank god. Makes you realize how fragile life is. Anyone know where I can learn more about overdose prevention?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose was averted, the event indicates a potential ongoing risk of overdose in the area, and the observer expresses concern. The event also raises the possibility of second-hand trauma for the witness.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 13:31:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells lately. Is it normal to feel scared of someone you love? Starting to think this isn't healthy. Where do you even begin to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a fear of a loved one and questioning the healthiness of the relationship, suggesting potential abuse or a dangerous dynamic. The question about seeking help indicates a desire to change the situation, suggesting risk is present and acknowledged.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 13:30:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Constant put-downs are chipping away at me. Anyone else been through this? Feeling so lost and alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and feelings of isolation due to ongoing negative interactions. While it doesn't explicitly mention self-harm or suicidal ideation, the cumulative effect of 'constant put-downs' can escalate the risk over time.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 13:29:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Clean for a few weeks, then relapsed tonight. Feeling so ashamed. Reaching out to my therapist tomorrow. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety can increase risk-taking behavior. While the individual is seeking help from a therapist and expressing a desire to 'get through tonight,' the shame and potential for continued use create a moderate level of concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 13:28:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Please, if you're using, have someone with you and know the signs of an overdose. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose, indicating a high risk of death or serious harm.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 13:27:41"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight outside my kid's school. Shaken up. Makes you wonder what's going on at home for these kids. Anyone else seeing more aggression lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text doesn't suggest immediate or direct threat to safety. The concern is more general about increased aggression.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 13:26:39"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw two guys fighting outside my apartment last night. Scared the crap out of me. Called the cops, but still shaken. Anyone else ever deal with something like that? Just feeling really uneasy today.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the poster doesn't indicate direct threat or ongoing danger to themselves or others. They are experiencing emotional distress (unease) but have taken action (calling the police).",
    "detected_category": "violence",
    "timestamp": "2026-01-26 13:25:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. Walking on eggshells constantly. Is this normal in a relationship? Feels like I can't do anything right. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feelings of constant stress and a perceived inability to do anything right in a relationship. While not explicitly mentioning abuse or self-harm, the phrase \"walking on eggshells\" is often associated with emotionally abusive or controlling relationships, which can negatively impact mental health. The user is also seeking validation, suggesting they are distressed and unsure if their experience is normal.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 13:24:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Trying to remember my coping skills, but it's hard. Anyone else feel like they're fighting a losing battle sometimes? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse in urges and difficulty coping, suggesting a potential escalation of risk. The individual is reaching out for support, which is a positive sign, but the feeling of fighting a losing battle warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 13:23:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. It's been a while. Trying to stay strong and find healthy coping mechanisms. It's a daily struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges to self-harm (cutting), suggesting increased distress and potential for harm despite attempts to cope.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 12:26:26"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the bus stop. Scary stuff. Reminded me of when my brother and I used to go at it. Never solved anything, just made things worse. Wish we'd learned better ways to deal with anger.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While a fight occurred, the text describes it as past tense observation and reflection on sibling rivalry. There's no indication of imminent danger or escalation, just a description of a potentially scary situation and a desire for better conflict resolution skills.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 12:25:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so lost lately. Everything's just...heavy. Reaching out to a friend, hoping it helps. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but lacks specific details of self-harm or suicidal ideation. Seeking support is a positive sign.",
    "detected_category": "other",
    "timestamp": "2026-01-26 12:24:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just talking about it feels like a weight lifted. If you're struggling too, please reach out to someone. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and encourages seeking help, but doesn't indicate immediate plans or intent to harm oneself or others. It's a general expression of feeling low and a positive suggestion to reach out.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 12:23:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just talking about it feels impossible. Reaching out to a friend tomorrow. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feeling \"low\" and finds it difficult to talk about it. While they plan to reach out to a friend, the statement indicates potential emotional distress requiring monitoring.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 12:22:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Things got dark again last night. Day 1 of trying to stay clean. Anyone else relate? Just feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions feeling overwhelmed, 'dark again,' and alone while starting a clean streak, suggesting potential relapse risk and emotional distress.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 12:21:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan worked, thank god. Please, if you're using, carry it. And tell someone. I’m still shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event that can cause significant distress and potential for vicarious trauma. The text highlights the risk associated with drug use and the importance of harm reduction measures.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 12:20:17"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough lately. Walking on eggshells constantly. Is it normal to feel this anxious around someone you love? Starting to wonder if this is more than just a 'bad patch'.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially unhealthy relationship dynamic characterized by anxiety and uncertainty, raising concerns about emotional or psychological abuse.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 12:19:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm drowning and no one can see me. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost, with a sense of hopelessness and isolation ('drowning and no one can see me'). Reaching out indicates a desire for help, suggesting a potential risk that could escalate without intervention.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 12:18:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, walking on eggshells... Anyone else feel like they're losing themselves? Need to figure out how to get out of this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive home environment with emotional distress. While no explicit threats are made, the feeling of 'losing themselves' and the need to 'get out of this' suggests a significant negative impact on mental well-being. The situation warrants concern and potential intervention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 12:17:13"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing loudly on the street corner. It escalated so fast. Made me think of my sister, she's dealing with similar stuff. Anyone know resources for domestic disputes? Scared for her.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially escalating domestic dispute situation, where the poster expresses fear for their sister. While there's no explicit mention of violence or harm, the rapid escalation of the argument and the sister's situation suggest a risk of harm that warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 11:19:24"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shaken up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing the author to feel shaken and on edge. While concerning, it doesn't indicate direct involvement, intent to harm, or a specific plan. It primarily expresses fear and anxiety.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 11:18:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. If anyone has felt this way and found something that helped, please share.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a desire for help, indicating distress. While it doesn't explicitly mention self-harm or suicide, the phrase \"dark cloud won't lift\" and reaching out for help suggest a significant level of emotional pain and potential vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 11:17:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Things got really dark last night, and I hurt myself. I'm safe now, but I know I need help. Where do I even start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly states the person hurt themselves, indicating an act of self-harm and a potential risk of repeated or escalated behavior.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 11:16:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are back and stronger than ever. Reached out to a friend, hoping it helps. Just trying to take it one day at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of strong urges, which could lead to self-harm or other negative outcomes. Reaching out to a friend is a positive step, but the strength of the urges elevates the risk beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 11:15:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, coupled with a plea for help. This suggests emotional distress and potential vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 11:14:16"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want the pain to stop. Talking to a friend helped last time, but I feel so ashamed even bringing it up again. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire for pain to stop, which is a significant risk factor for suicidal ideation. While the individual mentions a past coping mechanism (talking to a friend), the shame associated with seeking help again suggests a decreased willingness to engage in protective factors. The question 'Anyone else ever feel this way?' could be a cry for help or validation of their feelings.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 11:13:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He says he's sorry after, but the yelling is escalating. I don't know what to do anymore. Is this normal? Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates escalating yelling, which suggests a potential for physical or emotional abuse. The writer expresses distress and uncertainty, indicating a possible crisis.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 11:12:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough. Constant put-downs, controlling behavior. I feel trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, suggesting emotional abuse and a feeling of being trapped. While it doesn't explicitly mention physical violence, the emotional distress warrants a medium severity rating due to the potential for escalation and mental health consequences.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 11:11:11"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight downtown last night. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling, but doesn't indicate immediate danger or direct involvement for the author or others. The expressed feeling of being 'on edge' suggests anxiety but not necessarily intent to harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 11:10:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It helps. If you're struggling too, please don't go through it alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, implying a potential risk of self-harm or suicide. The person is seeking help from a friend, which is a positive sign, but the presence of urges elevates the risk beyond 'low'.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 10:21:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "I'm having a really hard time lately. Feeling so overwhelmed and like I'm drowning. Just reaching out... has anyone else felt this way? Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and drowning, which could indicate a mental health crisis. While not explicitly suicidal, the feelings expressed warrant concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 10:20:17"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Things have been rough at home lately. Feeling so isolated and scared. Is there anyone else who understands what it's like to feel trapped like this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of isolation, fear, and being trapped, suggesting potential emotional distress and a need for support. While not explicitly mentioning self-harm or suicide, the intensity of these feelings warrants concern.",
    "detected_category": "other",
    "timestamp": "2026-01-26 10:19:15"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Scary how fast things escalated. Makes you think about de-escalation tactics... Anyone know any good resources?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text mentions witnessing a fight, but doesn't indicate direct involvement or imminent threat to the poster or others. It expresses concern and interest in de-escalation, suggesting a desire to avoid violence rather than incite it.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 10:18:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... feels isolating. Anyone else been through this? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, which can lead to significant psychological distress and potentially escalate to other forms of abuse or mental health crises. The feeling of isolation also raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 10:17:12"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Dude got sucker punched, just like that. Shaken up. Makes you realize how quickly things can escalate. Anyone else ever witness something like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence can be upsetting, but the text doesn't indicate ongoing danger or imminent threat to the speaker or others. It's a report of a past event.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 10:16:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... Feeling lost. Anyone else been through this? How did you find support?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, suggesting an abusive environment. The individual also expresses feeling 'lost,' indicating potential emotional distress and vulnerability. While there's no explicit mention of physical violence, self-harm, or suicide, the situation warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 10:15:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before it gets too dark. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, with a concerning phrase 'before it gets too dark,' hinting at escalating distress and a need for help before a potential crisis.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 10:14:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... getting worse. I feel trapped. Has anyone else ever felt like they're walking on eggshells all the time? I just want it to stop.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of being trapped and constantly walking on eggshells, suggesting a potentially harmful situation at home. While not explicitly stating self-harm or suicidal ideation, the desire for it to stop raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 10:13:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough week. Urges are strong. Reached out to a friend, gonna try distracting myself. It's exhausting, but I'm trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and exhaustion, suggesting a potential risk of self-harm or suicidal ideation. While the individual is reaching out for help, the intensity of the urges elevates the risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 10:12:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling really overwhelmed lately. Old habits are creeping back in. Anyone know some good distraction techniques that actually work? Need to find something to pull me out of this.\n\n**Option 2 (Sharing a Personal Story):**\n\n> Made it 3 weeks clean. Small victory, but it feels huge. Still have bad days, but I'm trying. One step at a time, right?\n\n**Option 3 (Raising Awareness):**\n\n> Just a reminder that self-harm isn't always about suicide. Sometimes it's about coping. Doesn't make it okay, but it deserves understanding, not judgement.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses feeling overwhelmed, old habits creeping back, and mentions self-harm as a coping mechanism. While not explicitly suicidal, it indicates a vulnerability and potential risk for self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 09:26:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Didn't cope well. Reaching out for help today. Anyone else been there? Just feeling really alone right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of overwhelm, poor coping, and loneliness which are risk factors. Seeking help is a positive sign, but the intensity of the negative feelings warrants a medium severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 09:25:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Trying hard to resist, reaching out instead. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses active urges to self-harm (cutting), indicating a risk that requires attention. While the individual is reaching out for support, the presence of the urge elevates the severity beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 09:24:13"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it gets so loud in my head. Scratched my arm again last night. Feels awful admitting it, but I just needed the noise to stop. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes self-harm (scratching arm) and expresses a need to stop internal noise, indicating a potential for escalation if coping mechanisms are insufficient.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 09:23:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are back, and I feel so ashamed. Reached out to a helpline, hoping it helps this time. Just need to make it through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges and feelings of shame, suggesting a potential for self-harm or suicidal ideation. The individual is seeking help, but the immediate concern is making it through the night.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 09:22:10"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Not sure what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, suggesting possible distress and a need for support. The metaphor 'underwater' can indicate feeling suffocated or unable to cope. While not explicitly suicidal, the uncertainty ('Not sure what to do') warrants attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 09:21:09"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, isolating me from friends... feels like I'm walking on eggshells. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, which can escalate to more serious harm over time. The phrase \"walking on eggshells\" indicates a stressful and potentially volatile environment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 09:20:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just need to vent. Constant put-downs disguised as \"jokes\" are wearing me down. Makes me feel so small. Anyone else deal with this? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses emotional distress and feelings of being belittled due to ongoing negative interactions, but doesn't indicate immediate danger or specific plans for self-harm, suicide, or violence.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 09:19:06"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing loudly on the street. Escalated quick. He shoved her. I froze. Wish I'd done something. Feeling sick about it. Anyone else ever witness something like that? What do you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence (shoving) occurred, indicating potential for further harm and escalation. The witness is also showing signs of distress, though not directly threatened.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 09:18:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside the deli. Froze. Someone called the cops, I think. Still shaking. What do you even DO in that situation? Feel so useless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing domestic violence implies a risk of serious physical and psychological harm to the victim. While the text doesn't indicate immediate danger to the original poster, the violence itself is a high-severity event.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 09:17:03"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting near the bus stop. Shook me up bad. Reminded me of my brother. Anyone else feel anxious after witnessing something like that? Need to process.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is upsetting, but there's no indication of immediate danger to the author or others. The post expresses anxiety and a need for processing, not an active threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 08:23:19"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I feel so lost. Things at home have been escalating, yelling turned into something else. I don't know who to talk to. Anyone been through this? I feel so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential escalation of conflict at home, possibly involving violence or abuse (\"yelling turned into something else\"). The individual expresses feelings of being lost, alone, and unsure of who to talk to, suggesting a level of distress that warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 08:22:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head. Hard to explain. Just feeling overwhelmed and trying to cope. Anyone else ever feel this way? Talking helps a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feeling overwhelmed and seeking support, but lacks specific threats or plans.",
    "detected_category": "other",
    "timestamp": "2026-01-26 08:21:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Talking to someone tomorrow. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of depression and acknowledges a need for help. While they are taking steps to address their feelings by talking to someone, the expression of a persistent 'dark cloud' indicates a potential risk of self-harm or suicidal ideation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 08:20:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant put-downs, walking on eggshells... I feel so small. Anyone else been through this? How did you find the strength to leave? I need help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional distress and a potentially abusive situation ('constant put-downs,' 'walking on eggshells'). While not explicitly stating physical harm or immediate danger, the user expresses feeling 'small' and needing help to leave, suggesting the situation is negatively impacting their well-being and could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 08:19:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Like a dark cloud is just stuck over me. Reaching out because I don't know what else to do. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of isolation and a persistent negative mood, indicating emotional distress. The user is reaching out for help, suggesting they are struggling to cope on their own. While not explicitly suicidal, the darkness and plea for advice warrant concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 08:18:11"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw two guys fighting outside my apartment last night. Shook me up. Called the cops, but still feel uneasy. Anyone else ever deal with something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate direct threat to the poster. The uneasy feeling is a normal reaction to a stressful event.",
    "detected_category": "other",
    "timestamp": "2026-01-26 08:17:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n>  Relapsed after a while. Feeling so ashamed and alone. Anyone know good resources for dealing with urges?\n\n**Option 2 (Sharing Experience):**\n\n>  It's been 6 months clean. Still have bad days, but proving I can get through them.  You're stronger than you think.\n\n**Option 3 (Raising Awareness):**\n\n>  Just a reminder that self-harm isn't attention-seeking. It's a sign of deep pain. Be kind to those struggling.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 mentions relapse and feelings of shame and loneliness, which can be indicative of increased vulnerability. While not explicitly suicidal, the relapse increases the risk of self-harm or other negative coping mechanisms. Option 3 also mentions self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 08:16:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Anyone else ever feel this way? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and being overwhelmed, but does not contain specific threats or plans for self-harm or harm to others. It seems like a general expression of distress.",
    "detected_category": "other",
    "timestamp": "2026-01-26 08:15:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, thank goodness. Seriously, learn how to use it. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event indicating potential risk for others in the environment who may be using drugs. While Narcan was effective, the situation highlights the presence of drug use and the potential for future, possibly fatal, overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 08:14:04"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm drowning and no one can see me. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed ('drowning'). While it doesn't explicitly mention self-harm or suicide, the intensity of the emotional distress suggests a potential risk that warrants attention.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 07:24:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just realized yelling doesn't just \"happen.\" It's constant, then insults...I'm starting to think this isn't normal, healthy arguing. Anyone else feel this way with their partner? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of escalating verbal abuse (yelling, insults) which suggests a potentially unhealthy and unsafe relationship dynamic. The individual expresses feeling 'lost,' indicating emotional distress and potential for further harm if the situation continues.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 07:23:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, indicating potential mental distress. The phrase \"underwater\" could be interpreted as a metaphor for feeling suffocated or trapped, suggesting a potential risk to well-being. The explicit reaching out for help implies a need for support.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 07:22:32"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight break out downtown. Shook me up bad. Reminded me of things I'd rather forget. Anyone else get triggered by stuff like that? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling triggered, but doesn't express any intent to harm self or others. The mention of being 'shook up' and 'reminded of things' indicates distress but lacks specific details suggesting imminent danger.",
    "detected_category": "other",
    "timestamp": "2026-01-26 07:21:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Still reeling from what happened last night. He apologized, said it wouldn't happen again... but I don't know if I can believe him this time. Feeling so lost. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a possible abusive relationship. While there's no explicit mention of violence, the phrase \"what happened last night\" coupled with the apology and feeling lost indicates a potentially harmful situation and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 07:20:29"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before it gets worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, and a proactive effort to seek help \"before it gets worse.\" This suggests a potential risk that the situation could escalate, warranting a medium severity assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 07:19:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD in the park. Narcan saved them, thank God. This sh*t is scary. If you're struggling, please reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a recent overdose incident requiring intervention, indicating a potential for future incidents and highlighting the presence of dangerous substances and vulnerable individuals. While a life was saved, the event itself signifies a significant safety risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 07:18:26"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Constant put-downs and control... feels suffocating. Has anyone else been through this? Need to know I'm not alone and maybe find resources.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of emotional abuse and control, which can escalate to other forms of abuse or lead to mental health issues. While there's no immediate threat of physical harm or suicide explicitly stated, the described situation indicates significant distress and potential for harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 07:17:25"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad lately. Constant yelling, put-downs... feeling trapped. Anyone else been through this? How did you even start to get out? I feel so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a negative home environment with verbal abuse and feelings of being trapped, which can be precursors to more serious harm. The user is seeking help on how to escape the situation, implying they perceive a significant threat to their well-being.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 07:16:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Reached out to a friend, but just needed to say it somewhere. It's a battle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges and feelings of being overwhelmed. While the specific nature of the urges is not stated, and the person has reached out to a friend, the re-emergence of these urges and the statement \"it's a battle\" suggest an escalating risk requiring attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 07:15:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved their life. Please, learn how to use it. It's so important. #addiction #overdose #narcan",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose indicates a high risk of fatal outcome, even with intervention. The event also underscores the prevalence of a potentially life-threatening situation in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 06:25:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. Narcan saved them. Please, learn how to use it. It can happen to anyone. #harmreduction",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports an overdose event, indicating potential for severe harm or death, although intervention was successful.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 06:24:25"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Been walking on eggshells lately. Partner's moods are so unpredictable. Is this normal in a relationship? Feeling lost and unsure what to do next.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Unpredictable partner moods can indicate emotional abuse, potentially escalating to other forms of abuse. The feeling of being 'lost and unsure' suggests significant distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 06:23:24"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm underwater. Just reaching out... anyone else ever feel this way? Talking helps, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, suggesting emotional distress. While the user is reaching out, there's no explicit mention of self-harm or suicidal ideation, making the immediate risk appear low. The statement 'Talking helps, right?' indicates a desire for support and connection, which can be a protective factor.",
    "detected_category": "other",
    "timestamp": "2026-01-26 06:22:22"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nUgh, relapsed last night. Feeling so ashamed and lost. Reaching out to my therapist today. This cycle is exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse and feelings of shame and being lost suggest a potential risk. While no immediate harm is indicated, the relapse suggests vulnerability and the exhaustion with the cycle could escalate.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 06:21:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, stronger than before. Reached out to a crisis line, just need to make it through tonight. It's okay to ask for help, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a recurrence of strong urges and the individual reached out to a crisis line, suggesting a significant risk of self-harm or suicide.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 06:20:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head, the only way I know how to quiet them is... not healthy. Trying to find better coping mechanisms. Anyone else relate? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates unhealthy coping mechanisms are being used to deal with overwhelming thoughts, suggesting a potential risk of self-harm or other harmful behaviors, though the specific nature is unclear and the individual is actively seeking healthier alternatives.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 06:19:17"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm so tired. It's like walking on eggshells constantly. He says he loves me, but then he yells and calls me names. Is this normal? I don't know what to do anymore.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional and verbal abuse. The phrase \"walking on eggshells\" suggests a consistently stressful and potentially volatile environment. While there's no explicit mention of physical violence, the emotional distress is significant and warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 06:18:16"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy shove his girlfriend on the street today. Broad daylight. I froze. Wish I'd said something. Anyone else ever feel that helplessness? Makes me sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault (shoving) indicates a potential for escalation and ongoing harm, even if the immediate threat is over. While no direct threat to the reporter is present, the vicarious experience can be distressing and hints at a broader issue of violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 06:17:14"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a heavy cloud is just stuck over me. Reaching out because I know I need to talk to someone. Any advice on finding a good therapist?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a desire to seek help, indicating a potential risk. While not explicitly suicidal, the feeling of being 'so low' and needing to talk to someone suggests a need for intervention and monitoring.",
    "detected_category": "other",
    "timestamp": "2026-01-26 06:16:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant yelling, controlling behavior... I feel so trapped. Anyone else been through this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and feeling trapped, which suggests a potential for escalation to abuse or violence. While not explicitly stated, the feeling of being lost adds to the concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 05:27:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thankfully. Makes you think. Know the signs, carry it if you can. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential for further overdoses in the area, suggesting a systemic risk. While the person survived due to Narcan, the event highlights a significant health and safety issue.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 05:26:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Just wanted to say if you're struggling too, you're not alone. Reaching out feels impossible, but maybe we can get through this together. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feeling overwhelmed and struggling, with an implicit acknowledgment of mental health challenges. While not explicitly suicidal, the difficulty reaching out and desire for shared experience suggests a potentially vulnerable state requiring attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 05:25:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them. Please, if you're using, carry it. It's free and could save a life. Learn how to use it too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose incident, which is a life-threatening medical emergency. While the person survived due to Narcan, the event itself carries a high risk of death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 05:24:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD at the park. Narcan saved them, but it was scary. Keep an eye on your friends, folks. It can happen to anyone. Knowing the signs can save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, indicates a risk of overdose in the community. The event was described as \"scary\", highlighting the potential for psychological distress to witnesses and first responders. While the situation was resolved, the potential for future, potentially fatal, overdoses remains.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 05:23:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them. Please, if you're using, have it with you. Could save a life. It's free at most pharmacies.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event, and while Narcan was effective, the potential for future overdoses and associated risks remains. The text highlights the immediate danger and the need for preventative measures.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 05:22:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is getting stronger. Talking to my therapist tomorrow, but tonight is rough. Just need to get through it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The individual expresses a strengthening urge to self-harm and acknowledges the current night is particularly difficult. This indicates a high level of immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 05:21:13"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out on my street last night. Shook me up bad. Scared to walk home alone now. Anyone else deal with this anxiety after witnessing violence? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence has caused anxiety and fear for personal safety. While not directly threatened, the individual is experiencing significant distress impacting their daily life (fear of walking home). This indicates potential for escalation of anxiety or further safety concerns depending on circumstances.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 05:20:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Glad they're okay now, but it really shook me. Be careful out there, friends. Know your limits.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event that can be emotionally distressing. While the person survived, the event indicates a potential for severe harm and reflects an immediate danger in the environment.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 05:19:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking help):**\n\n> Things have been rough at home lately. Feeling isolated and unsure where to turn. Anyone know of any resources for dealing with emotional abuse?\n\n**Option 2 (Sharing experience):**\n\n> Finally out of that situation. It's hard to admit, but I was being controlled and manipulated for so long. Still trying to heal.\n\n**Option 3 (Raising awareness):**\n\n> Gaslighting is a real thing, and it's so insidious. Don't let anyone make you doubt your own reality. Trust your gut.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates someone currently experiencing a difficult situation (emotional abuse) and seeking resources, suggesting a potential risk for escalation if help isn't found. Option 2 confirms past abuse and ongoing healing, indicating a vulnerability. Option 3 is informational but relevant. While no direct threats are made, the context of emotional abuse and isolation warrants medium severity.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 05:18:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so heavy, y'know? Like tonight. Feels like I'm drowning. Reached out to a friend, hoping it helps. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and 'drowning,' which suggests significant emotional distress. The act of reaching out to a friend is a positive sign, but the overall tone indicates a potential risk that warrants attention.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 04:41:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Scared me straight. If you're struggling, please reach out. There are people who care and want to help. It's not worth risking everything.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and highlights the risk of overdose to others, even though the text doesn't explicitly express suicidal intent.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 04:40:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mentions of self-harm, suicide, violence, abuse, or overdose. It appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2026-01-26 04:39:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head, it feels like the only way to quiet them is to hurt. Trying so hard to find a better way to cope. Anyone else relate? Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses thoughts of self-harm as a coping mechanism, indicating a risk, though it also mentions seeking alternative coping strategies, which suggests some level of protective factors. The direct mention of 'hurt' elevates the concern beyond a low-risk scenario.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-26 04:38:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Cleaned the cut, but feeling so ashamed. Reached out to a friend, hoping they'll answer. Just need someone to talk to right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 57 (char 82)",
    "detected_category": "unknown",
    "timestamp": "2026-01-26 04:37:30"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of things at home. Anyone else feel triggered by public violence sometimes? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes feeling triggered by public violence and seeking coping mechanisms. While the experience is distressing, there's no direct indication of intent to harm self or others.",
    "detected_category": "other",
    "timestamp": "2026-01-26 04:36:29"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Yelled at him, hope she's okay. Makes you realize how easily things escalate. Anyone know resources for bystander intervention? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical altercation (shoving) indicates a potential for escalation and harm. While the victim's immediate status is unknown, the act itself constitutes violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-26 04:35:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Walking on eggshells constantly. I feel so alone. Anyone else been through this? I don't know where to turn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home situation with feelings of isolation and walking on eggshells, suggesting potential emotional or psychological distress. The lack of a clear threat prevents a 'high' severity, but the plea for help warrants attention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-26 04:34:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend, but it's hard. Anyone else ever feel this way? Just looking for a little hope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and being overwhelmed, indicating potential distress and vulnerability. Reaching out is a positive sign, but the intensity of the feelings warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-26 04:33:25"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the gas station today. Scary stuff. Called 911, hope they're okay. Reminded me how fragile life is. Keep Narcan handy, people. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an observed overdose, indicating a medical emergency with potential for severe harm or death. While the writer was not directly involved, the event highlights a significant safety risk in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-26 04:32:23"
  }
]