[
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the gas station today. Scared me to death. Narcan saved them. Carry it, people. You never know. #overdoseprevention",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event that suggests a potential public health issue. While the individual was saved, the event highlights the prevalence of overdose risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-11 04:36:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post that discusses suicide, aiming for authenticity and help-seeking:\n\n\"Things have been really dark lately. Feeling overwhelmed and like I'm running out of options. Reaching out because I don't know what else to do. Any advice or support would be appreciated.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The post explicitly mentions feeling overwhelmed, running out of options, and reaching out as a last resort, all of which are strong indicators of suicidal ideation. The mention of 'things have been really dark lately' further suggests a depressed state, increasing the risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-11 04:35:42"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my building. Shook me up. Makes you wonder what's going on in people's lives to get to that point. Hope everyone involved is okay. Feeling pretty anxious now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be upsetting and cause anxiety, but the text does not indicate any immediate or direct threat of harm to the author or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-11 04:34:40"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his girlfriend on the street today. Frozen. Didn't know what to do. Still feel sick about it. Wish I'd said something. Anyone else ever feel this helpless?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, even if not directly involved, can be a significant stressor and may indicate a pattern of abuse in the relationship. The reporter expresses distress and helplessness, suggesting emotional impact.",
    "detected_category": "violence",
    "timestamp": "2026-01-11 04:33:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and a sense of helplessness. Reaching out for help suggests a struggle, but there's no explicit mention of self-harm or suicidal ideation. The feeling of being 'underwater' can be a metaphor for depression.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-11 04:32:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Everything's just... heavy. Reaching out because I don't really know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of numbness and heaviness, indicating emotional distress. While concerning, there's no explicit mention of self-harm or suicidal ideation. The person is reaching out for support, suggesting a willingness to seek help.",
    "detected_category": "other",
    "timestamp": "2026-01-11 04:31:36"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you realize how quickly things can escalate. Feeling shaken. Anyone else witness it? Hope everyone's okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text reports witnessing a fight, indicating a potential for violence in the area, but the reporter is not directly involved or threatened. They express concern and hope for the well-being of others, suggesting a general sense of unease rather than imminent danger to themselves or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-11 04:30:35"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy shove his partner on the street. Froze. Should I have done something? Feeling sick about it now. Is there a right way to intervene?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence, potential for escalation and future harm. Feeling of distress suggests concern and possible emotional impact.",
    "detected_category": "violence",
    "timestamp": "2026-01-11 04:29:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Just wanted to say if you're struggling with self-harm, you're not alone. Talking to someone helped me. There are resources out there, please reach out. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text acknowledges struggles with self-harm and encourages seeking help, indicating a current or recent risk. While it doesn't express immediate intent, the presence of self-harm ideation elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-11 04:28:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been rough. Constant yelling, put-downs... feels like I'm walking on eggshells. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and potentially emotionally abusive home environment, with mentions of yelling, put-downs, and feeling like walking on eggshells. While it doesn't explicitly mention physical violence or suicidal ideation, the description suggests significant emotional distress and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-11 04:27:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor OD yesterday. Scariest thing ever. Narcan saved him. Please, if you're struggling, reach out. There's help out there. Don't be afraid.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose incident, which is a life-threatening event. While the neighbor survived due to Narcan, the proximity and recency of the event indicate a potentially heightened risk environment for the person sharing the text, warranting a high severity rating.",
    "detected_category": "overdose",
    "timestamp": "2026-01-11 03:49:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown. Scary stuff. Called 911 but still shook. Knowing naloxone saved his life makes me think everyone should carry it. Learn how to use it. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a serious situation with potential for harm or death. While the individual survived due to naloxone, the event itself and the call for widespread naloxone use suggest an ongoing risk of overdose in the area.",
    "detected_category": "overdose",
    "timestamp": "2026-01-11 03:48:12"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary how quickly things escalated. Makes you wonder what sets people off. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which indicates potential violence in the area, but it doesn't directly threaten or involve the author or any specific individual. The overall tone suggests anxiety and unease rather than imminent danger. No specific threat is made, only an observation of a disturbance.",
    "detected_category": "violence",
    "timestamp": "2026-01-11 03:47:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Cutting again after 6 months clean. It's like the only way to feel *something*. Reaching out to my therapist tomorrow. Wish me luck.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Relapse of self-harm after a period of recovery indicates a significant escalation of distress and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-11 03:46:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, but it was close. Please, learn the signs and carry it if you can. It's easier than you think to get.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event that nearly resulted in death. While Narcan was successful, the situation highlights a significant risk of fatal overdose.",
    "detected_category": "overdose",
    "timestamp": "2026-01-11 03:45:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up yesterday. Scariest thing ever. Please, if you're struggling, reach out. Don't let it get that far. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a friend experienced a near-fatal event potentially related to mental health struggles, suggesting a high risk of self-harm or suicide. The urgency in the language ('almost didn't wake up') and the plea for help reinforce the severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-11 03:44:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just needed to say it out loud. It helps, even a little. Taking it one day at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports of returning urges indicate increased risk, however, the individual has reached out for support which is a positive coping mechanism. The phrase 'one day at a time' suggests a struggle.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-11 03:43:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, thank goodness. Please, learn how to use it. It can really make a difference. #OverdoseAwareness #NarcanSaves #GetTrained",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential safety risk due to the possibility of others being at risk or the witness experiencing trauma. While the person survived, the risk of future overdoses in the same environment remains.",
    "detected_category": "overdose",
    "timestamp": "2026-01-11 03:42:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm just going through the motions. Reaching out because I don't know what else to do. Is anyone else feeling this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and going through the motions, indicating a low mood and potential distress. There's no explicit mention of self-harm, suicide, violence, or abuse.",
    "detected_category": "other",
    "timestamp": "2026-01-11 03:41:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. Just trying to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Expresses a strong urge to self-harm and feeling overwhelmed, indicating immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-11 03:40:00"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of things back home I thought I'd left behind. Anyone else feel like violence just...finds you sometimes, no matter where you go?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potentially dangerous situation, but it focuses on the emotional impact on the speaker. There is no explicit threat of violence against self or others, only a feeling of unease and a statement about violence being pervasive.",
    "detected_category": "violence",
    "timestamp": "2026-01-11 03:04:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary. Narcan saved him, thankfully. Makes you realize how fragile life is and how easily things can go wrong. Reach out if you're struggling, please. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates the presence of significant risk in the community. While Narcan was administered successfully, the situation highlights the potential for fatal outcomes and could trigger distress in the observer.",
    "detected_category": "overdose",
    "timestamp": "2026-01-11 03:03:17"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post that addresses the topic of suicide, focusing on seeking help and sounding authentic:\n\n\"Been feeling really low lately. Like, lower than low. Reached out to a friend, and it helped to just talk. If you're struggling too, please don't keep it in. There are people who care. 988 is there if you need it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text mentions feeling low and struggling but focuses on seeking help and provides a resource (988). While the topic is sensitive, the message promotes a positive action.",
    "detected_category": "suicide",
    "timestamp": "2026-01-11 03:02:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The statement expresses feelings of being lost and overwhelmed (\"underwater\") and indicates a lack of coping mechanisms (\"don't know what else to do\"). While not explicitly suicidal, the distress level warrants concern and suggests potential for escalation.",
    "detected_category": "other",
    "timestamp": "2026-01-11 03:01:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been so angry lately, and I feel like I'm walking on eggshells. Anyone else experience this? Feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential for escalating conflict and emotional distress, suggesting an unsafe environment. The mention of anger and feeling like 'walking on eggshells' implies potential emotional or verbal abuse. While not explicitly stated, the situation could escalate to physical violence or lead to self-harm or suicidal ideation due to prolonged emotional distress and isolation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-11 03:00:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so incredibly alone lately. Just a heavy cloud that won't lift. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of intense loneliness and helplessness, indicating emotional distress and a need for support. The statement 'I don't know what else to do' suggests a potential for escalation if the situation worsens.",
    "detected_category": "suicide",
    "timestamp": "2026-01-11 02:59:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good lately. Constant put-downs, isolating me from friends... I feel trapped. Anyone else been through this? How did you find a way out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional and social isolation consistent with abusive behavior. The feeling of being 'trapped' and the request for advice on 'finding a way out' suggest a significant level of distress and potential for escalation. While not explicitly stating intent of harm, the situation warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-11 02:58:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. If you've been there, what helped?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of depression and a need for help. While not explicitly stating suicidal intent, the mention of a persistent 'dark cloud' and reaching out suggests potential risk and warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-11 02:57:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scary night. Found my roomie unresponsive, barely breathing. Narcan saved their life. Please, learn how to use it. It's not just for \"junkies,\" it's for anyone. Could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a life-threatening overdose situation where the individual was unresponsive and barely breathing, requiring Narcan to be revived.",
    "detected_category": "overdose",
    "timestamp": "2026-01-11 02:56:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy, and I'm not sure how much longer I can carry it. Reaching out before things get worse. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost, overwhelmed, and unsure how much longer they can cope, suggesting potential for escalation. They are reaching out for help, indicating awareness of the problem but also vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2026-01-11 02:55:04"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a guy get shoved on the train today. Everyone just looked away. Makes you wonder what you'd actually do in that situation. Feeling sick about it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be distressing and lead to feelings of unease and fear about personal safety and bystander responsibility. The description of the event suggests potential for serious harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-11 01:47:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after a near-OD. Scared straight. This stuff is no joke. If you're struggling, please reach out. I almost didn't make it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The individual explicitly states they had a near overdose and almost died. This indicates a recent, very serious health risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-11 01:46:22"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed yesterday I relapsed. Trying not to beat myself up more. Reached out to a friend, and that helped a little. Just taking it one hour at a time.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse indicates a return to a potentially harmful behavior. While the individual is seeking support and using coping mechanisms, the relapse itself presents a moderate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-11 01:45:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Just wanted to say, if you're struggling too, you're not alone. Reaching out is scary, but it's worth it. Talking helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and encourages seeking help, but there's no direct mention of self-harm, suicide, violence, abuse, or overdose. It focuses on the positive action of reaching out for support.",
    "detected_category": "other",
    "timestamp": "2026-01-11 01:44:19"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad lately. Constant yelling, and last night...it got physical. I don't know what to do. Feeling lost and scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes physical violence occurring in the home, indicating a high risk of further harm and potential escalation. The individual expresses feeling lost and scared, suggesting a significant lack of safety and resources.",
    "detected_category": "abuse",
    "timestamp": "2026-01-11 01:43:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about someone OD'ing. Scared me. Reminded me of my brother. Please, if you're struggling, reach out. There's help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about a recent overdose and acknowledges personal connection to the issue, suggesting potential distress and increased vulnerability in the speaker. While not explicitly stating suicidal intent, the association with personal loss elevates the risk level.",
    "detected_category": "overdose",
    "timestamp": "2026-01-11 01:42:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Anyone else ever feel like there's no way out? Talking helps, even if it's just a little.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed ('underwater'), and hopeless ('no way out'). While mentioning talking helps suggests seeking support, the initial expressions warrant concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-11 01:41:15"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Scared me senseless. Reminded me of my brother, still dealing with PTSD from that bar brawl last year. Wish there was more support for victims.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is scary and upsetting, and the text evokes past trauma, but there's no immediate threat to the speaker or others. The mention of PTSD and a desire for victim support highlight the lingering effects of violence but don't indicate current risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-11 01:40:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIP posts lately. Lost another friend to overdose. Please, if you're struggling, reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a friend's death from overdose and encourages people struggling to reach out, suggesting potential suicidal ideation or self-harm due to drug use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-11 01:39:12"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard yelling next door again last night, then a crash. Wish I knew what to do. Called non-emergency last time, but nothing changed. Feeling helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential violence or abuse occurring next door, including yelling and a crash. The reporter expresses fear and helplessness, and prior reporting did not resolve the issue. This suggests an ongoing and escalating situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-11 01:38:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, stronger than before. Scared I'll give in. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges and fear of acting on them, suggesting a potential for self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-11 00:51:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud is just stuck over me. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 75 (char 100)",
    "detected_category": "unknown",
    "timestamp": "2026-01-11 00:50:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells lately. Is this normal in a relationship? Starting to feel like I'm losing myself trying to avoid upsetting them. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests potential emotional abuse and a loss of self, which can escalate into more serious mental health issues if left unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2026-01-11 00:49:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, rough day. Really wanted to relapse, but I called the hotline instead. Still feeling shaky, but a little proud I made it through. One day at a time, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses a strong urge to relapse, indicating a vulnerability and potential for harm. While they took a positive step by calling a hotline, the persistent feeling of being 'shaky' suggests the risk is ongoing and requires continued support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-11 00:48:26"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home haven't been good lately. Feeling trapped & unsure what to do. Has anyone else been through this? Any advice helps.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being trapped and seeking advice, but there is no explicit mention of self-harm, suicide, violence, abuse, or overdose. While concerning, it doesn't indicate immediate danger.",
    "detected_category": "other",
    "timestamp": "2026-01-11 00:47:25"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... feels like I'm walking on eggshells. Anyone else been through this? Just feeling so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of emotional abuse, including put-downs and controlling behavior. While not explicitly stating physical harm, emotional abuse can escalate and significantly impact mental health, increasing the risk of other negative outcomes. The feeling of being alone is also a concerning factor.",
    "detected_category": "abuse",
    "timestamp": "2026-01-11 00:46:23"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good lately. Constant put-downs, controlling behavior... Feels like I'm walking on eggshells. Anyone else been through this? How did you find the strength to leave/cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, creating a potentially unsafe environment. While it doesn't explicitly mention physical violence or immediate danger, the phrase \"walking on eggshells\" suggests a heightened state of anxiety and fear, indicating a potentially escalating situation. The individual is also actively seeking advice on coping or leaving, which acknowledges the problematic situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-11 00:45:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, a common symptom of depression or other mental health issues. The individual is reaching out for help, suggesting they are struggling to cope. While there is no explicit mention of self-harm or suicide, the level of distress indicates a need for intervention.",
    "detected_category": "other",
    "timestamp": "2026-01-11 00:44:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "> Things have been rough at home lately. Walking on eggshells constantly. Is this normal in relationships? Feeling so isolated. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a stressful and isolating home environment, potentially indicative of emotional abuse or a relationship in distress. \"Walking on eggshells\" suggests fear and anxiety.",
    "detected_category": "abuse",
    "timestamp": "2026-01-11 00:43:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a bit. Remember you're not alone. Talking about it is a start.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Strong urge to self-harm indicates a significant risk of immediate harm to self. Seeking help is positive, but the intensity of the urge suggests high severity.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-11 00:42:17"
  },
  {
    "title": "User Story: Suicide",
    "content": "I'm having a really hard time lately. Feeling so low and empty. Reaching out to see if anyone else has felt this way and what helped. Could use some hope right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being low and empty, indicating potential depression. While it doesn't explicitly mention self-harm or suicide, the user is seeking hope, suggesting they are struggling significantly. This warrants a 'medium' severity due to the potential for escalation if support isn't received.",
    "detected_category": "suicide",
    "timestamp": "2026-01-10 23:17:24"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside the deli. Froze. Called the cops after, but I feel sick. Anyone else ever witness something like that? How do you shake it off?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing violence like this can be psychologically damaging and suggests a serious incident of interpersonal violence is occurring.",
    "detected_category": "violence",
    "timestamp": "2026-01-10 23:16:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thank goodness. Makes you realize how fragile life is. Learn CPR and where to get Narcan, just in case.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, can be emotionally distressing and highlights a serious public health issue. The suggestion to learn CPR and Narcan indicates awareness of a potentially life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-10 23:15:22"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. The urge to cut was strong, but I distracted myself. Still feeling shaky. Anyone else get through this? Need some support right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a strong urge to self-harm (cutting) and feeling shaky, indicating distress and risk, even though the individual distracted themselves. The need for support suggests ongoing vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-10 23:14:20"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on the bus. So scary. My hands are still shaking. Is there anywhere to report stuff like that anonymously?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potentially dangerous situation. However, the person is reporting fear and anxiety rather than direct involvement or ongoing threat. The shaking hands indicates a stress response, but not necessarily immediate danger to them or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-10 23:13:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice or just someone to listen?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost and overwhelmed, metaphorically stating they feel \"underwater\" and are actively seeking help. This indicates distress and a potential need for support, but doesn't explicitly mention self-harm, suicide, or violence.",
    "detected_category": "other",
    "timestamp": "2026-01-10 23:12:17"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Always walking on eggshells. It's exhausting. Anyone else feel like they're losing themselves? I need to figure out a way out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and potentially harmful home environment, causing significant emotional distress and a desire to escape. The phrase 'losing themselves' suggests a potential impact on mental well-being. While not explicitly suicidal or violent, the situation warrants concern and further investigation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-10 23:11:16"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, rough day. Feeling the urge to relapse. Reached out to my therapist, waiting to hear back. Just need to get through the next hour. Anyone else been there?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual is experiencing a strong urge to relapse, indicating a potential risk. While they've taken a positive step by reaching out to their therapist, the immediate need to 'get through the next hour' suggests a current vulnerability and escalation possibility if support is not received.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-10 23:10:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Really trying to fight it. Anyone else relate? Just feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates active thoughts of self-harm (cutting) and a feeling of being overwhelmed and alone. While the person is trying to fight the urge, the presence of the urge itself elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-10 23:09:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a memorial for someone gone too soon. OD's are hitting hard lately. Please, if you're struggling or know someone who is, reach out. There are resources. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a recent overdose death and urges people to seek help for struggles, indicating potential risk of overdose and/or suicide within the target audience.",
    "detected_category": "overdose",
    "timestamp": "2026-01-10 23:08:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just feeling so lost. Things at home have been...rough. Walking on eggshells constantly. Don't know who to talk to. Is this normal? Feeling trapped.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, feelings of being trapped, and difficulty coping with a difficult home environment. While there is no explicit mention of self-harm or suicide, the feelings of hopelessness and isolation raise concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-10 22:17:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so lost lately. Everything's just... heavy. Anyone know where to find resources for tough times? Need to talk.\n\n**Option 2 (Personal Story):**\n\n> Remembering a dark time and how hard it was to ask for help. It DOES get better. Reach out if you're struggling. You matter.\n\n**Option 3 (Raising Awareness):**\n\n> Check in on your friends, especially the quiet ones. You never know what someone's going through. A little kindness goes a long way.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of distress and a need for support, but it doesn't contain explicit suicidal ideation, plans, or intent. While there is a reference to a 'dark time' and 'struggling,' the overall message encourages seeking help and highlights the importance of checking in on others.",
    "detected_category": "other",
    "timestamp": "2026-01-10 22:16:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Cutting again after 6 months clean. Just need to get through tonight. Any advice that isn't \"just stop\"? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Relapse of self-harm after a period of abstinence indicates increased risk. Expressed feelings of being overwhelmed and alone further heighten the severity. Implied suicidal ideation through focus on 'getting through tonight'.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-10 22:15:34"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight on the street today. Just broke out of nowhere. Makes you realize how quickly things can escalate. Shook me up pretty bad. Anyone else ever witness something like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused emotional distress but doesn't indicate direct personal harm or intent to harm others.",
    "detected_category": "violence",
    "timestamp": "2026-01-10 22:14:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short social media post:\n\n\"Been feeling really down lately. Like, is there even a point? Reaching out because I know I need to talk to someone. Any advice on finding a therapist?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and questioning the point of living. While it doesn't explicitly mention suicide, the phrase \"is there even a point?\" suggests suicidal ideation. The user is also reaching out for help, indicating they recognize they need support, which is a positive sign but doesn't negate the concerning content.",
    "detected_category": "suicide",
    "timestamp": "2026-01-10 22:13:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD at the gas station. Narcan saved them, but it shook me. Scared me. How can we get more people trained on using it? It's so readily available and yet...",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual in the text was not the one overdosing, witnessing an overdose is a traumatic event and raises concerns about access to life-saving resources (Narcan). The individual's expression of fear and a desire for more training on Narcan suggests a potential for indirect harm or escalation of the situation if more overdoses occur and people are not equipped to respond. The situation itself (an overdose) is inherently high severity, but the text focuses on the impact on the observer.",
    "detected_category": "overdose",
    "timestamp": "2026-01-10 22:12:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Please, if you're using, carry Narcan. It could save a life. Learned that the hard way.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event, implying a significant and immediate risk of death or serious health consequences related to drug use. The urgency in carrying Narcan further highlights the severity.",
    "detected_category": "overdose",
    "timestamp": "2026-01-10 22:11:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Trying to find healthier ways to cope, but it's a struggle. Anyone else feel this way? Any tips that have helped you?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The individual expresses a struggle with internal noise and seeks healthier coping mechanisms, indicating awareness and a desire to improve. While the experience is unpleasant, there is no explicit mention of self-harm, suicide, or harm to others. The user seeking tips also indicates a willingness to engage with positive solutions.",
    "detected_category": "other",
    "timestamp": "2026-01-10 22:10:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scariest thing ever. Thankfully, we had Narcan. Everyone, please learn how to use it. Could save a life. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event, which is a life-threatening medical emergency. Although Narcan was available, the situation indicates a significant risk of death or serious health consequences.",
    "detected_category": "overdose",
    "timestamp": "2026-01-10 22:09:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Been feeling so overwhelmed lately. Things got dark again last night. Reaching out to my therapist today. Just gotta keep reminding myself it's a temporary feeling.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feeling overwhelmed, mentions \"things got dark again last night,\" and acknowledges needing to reach out to their therapist. This suggests a recurrence of concerning feelings and potential distress, warranting concern despite the hopeful statement that it's a temporary feeling. The context suggests potential risk requiring monitoring, even though active intent is not stated.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-10 22:08:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to see if anyone else knows this feeling? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and being lost, but does not contain explicit suicidal ideation, self-harm plans, or violent intentions. It's a general expression of distress and a desire for connection.",
    "detected_category": "other",
    "timestamp": "2026-01-10 21:16:53"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Dude was on the ground, not moving. Called 911, but I feel sick. Anyone else ever witness something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent fight with a person unconscious and unmoving suggests a potentially life-threatening situation and significant emotional distress for the witness.",
    "detected_category": "violence",
    "timestamp": "2026-01-10 21:15:52"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Guy got knocked out cold. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel like anger is just boiling over everywhere lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While no one is explicitly threatened, a violent act resulting in incapacitation occurred. This indicates a potential for serious harm and widespread aggressive behavior.",
    "detected_category": "violence",
    "timestamp": "2026-01-10 21:14:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to see if anyone else knows this feeling? Really need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and a desire to talk, indicating emotional distress but no explicit mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2026-01-10 21:13:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm drowning. Reaching out because I don't know what else to do. Is anyone else struggling? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed with a potential cry for help. The phrase 'drowning' suggests significant distress, although there's no explicit mention of self-harm or suicide.",
    "detected_category": "other",
    "timestamp": "2026-01-10 21:12:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately? Feeling kinda vulnerable.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feeling vulnerable and shaken after witnessing a fight, but doesn't indicate immediate danger to self or others. It's a reaction to an event, not a plan or intent.",
    "detected_category": "violence",
    "timestamp": "2026-01-10 21:11:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Terrifying. Narcan saved them, but it shook me up. Where can I learn to use it? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event that can lead to psychological distress and a desire to intervene in future situations. The person is actively seeking resources (Narcan training) suggesting a concern for future overdose events.",
    "detected_category": "overdose",
    "timestamp": "2026-01-10 21:10:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Called 911, they're gonna be okay. Please, if you're struggling, reach out. There are people who care and want to help. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose event, which is a life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-10 21:09:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**(Option 1: Seeking Help)**\n\n> Feeling so overwhelmed lately. Urges are strong. Anyone know good coping mechanisms that actually work? DMs open if you've been there.\n\n**(Option 2: Sharing a Milestone)**\n\n> One week clean from self-harm. Small victory, but it feels huge. Taking it one day at a time.\n\n**(Option 3: Raising Awareness)**\n\n> Scars aren't always visible. Be kind, you never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates active urges, suggesting potential for self-harm. Option 2 shows recovery, while Option 3 promotes awareness.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-10 21:08:41"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it feels like the only way to quiet them is to... not. Been clean for a while, but the urge is back. Reaching out instead. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a relapse risk and the feeling that the only way to quiet internal turmoil is to cease to exist, suggesting potential suicidal ideation even if indirectly expressed. The person is actively reaching out, which is positive, but the underlying thoughts are concerning.",
    "detected_category": "suicide",
    "timestamp": "2026-01-10 21:07:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, I understand. Here's a short social media post that attempts to meet your criteria:\n\n\"Been feeling so incredibly lost lately. Like I'm drowning and can't see the surface. Just reaching out... has anyone else felt this way? Need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post expresses feelings of being lost and drowning, which suggests a potential for emotional distress and possibly suicidal ideation. While not explicitly stating suicidal intent, the language indicates significant mental health struggles.",
    "detected_category": "suicide",
    "timestamp": "2026-01-10 20:18:17"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things aren't good at home. I feel so isolated and scared all the time. Is there anyone else who understands what this is like? I need to feel less alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of isolation, fear, and a need to feel less alone, which could indicate a mental health crisis or vulnerability. While not explicitly stating intent to harm self or others, the intensity of the emotions warrants attention.",
    "detected_category": "other",
    "timestamp": "2026-01-10 20:17:15"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else ever feel that way after witnessing something like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't directly indicate immediate danger to the individual or others. The emotional distress is noted, but there are no explicit threats or indications of intent to harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-10 20:16:13"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Froze. Wish I'd said something, done something. Feeling sick about it. Anyone else ever experience this? How do you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can have a significant emotional impact, potentially leading to psychological distress. While not directly involving the author, the witnessed event raises concerns about potential escalation of violence and the author's emotional well-being.",
    "detected_category": "violence",
    "timestamp": "2026-01-10 20:15:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Been feeling so incredibly lost lately. Like there's no way out. Talking to someone feels impossible, but I know I need to. Any advice on finding help?\"\n\n**Option 2 (Sharing a Story):**\n\n> \"I remember feeling like nothing would ever get better. It did. It took time and help, but it did. There is hope, even when you can't see it.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"It's okay to not be okay. Let's be there for each other and listen without judgment. You never know what someone is going through.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses feelings of hopelessness and a desire for help, indicating potential risk. While not explicitly suicidal, the language suggests a need for intervention.",
    "detected_category": "suicide",
    "timestamp": "2026-01-10 20:14:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it gets so loud in my head, I just want it to stop. Found a number to text for help, gonna try that. Hope it works.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses a desire to stop internal suffering and seeks help, indicating potential self-harm risk but also an effort to mitigate it.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-10 20:13:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need help. Any advice on finding a good therapist?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of depression and a desire for help, indicating a potential for escalation if not addressed.",
    "detected_category": "suicide",
    "timestamp": "2026-01-10 20:12:06"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Constant put-downs, isolating me from friends. Feeling trapped. Anyone else been through this? Need to figure out my next steps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and feelings of isolation and being trapped, which could escalate to more serious harm. The individual is seeking help, indicating awareness of the problem but also highlighting its impact.",
    "detected_category": "abuse",
    "timestamp": "2026-01-10 20:11:05"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary. My hands are still shaking. Anyone else feel like things are getting more volatile lately? Makes me not want to leave the house.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be upsetting, causing anxiety and fear, but it doesn't indicate an immediate threat or targeted violence towards the individual. The shaking hands and reluctance to leave the house suggest distress but not an imminent dangerous situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-10 20:10:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD in the bathroom today. Scary stuff. Luckily, they were okay. It made me realize how close we all are. Learn to recognize the signs. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, the event was an overdose, which carries inherent risk and potential for fatality. The text explicitly mentions the scary nature of the situation and the potential to save a life, highlighting the urgency.",
    "detected_category": "overdose",
    "timestamp": "2026-01-10 20:09:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so heavy lately, like nothing matters. Reaching out because I know I need to. Talking to someone tomorrow. It's a start.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and acknowledges a need for help. While a plan or immediate intent is not stated, the expression of feeling 'heavy' and like 'nothing matters' warrants a medium severity rating. Talking to someone tomorrow is a positive sign.",
    "detected_category": "suicide",
    "timestamp": "2026-01-10 19:16:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want to feel *something* else. It's not about wanting to die, just... a break from the noise. Anyone else ever feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses a desire for emotional relief and a break from feeling overwhelmed, but explicitly states it's \"not about wanting to die.\" While concerning, the absence of suicidal ideation or self-harm intent suggests a lower risk.",
    "detected_category": "other",
    "timestamp": "2026-01-10 19:14:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nUgh, having a really rough night. The urge to cut is so strong. Trying to resist and just breathing. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating a potential risk. While the person is trying to resist, the intensity of the urge elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-10 19:13:57"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs... I feel so small. Anyone else been through this? How do you even start to get out?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes constant put-downs and feeling small, indicating emotional abuse. While not explicitly stating physical harm or suicidal ideation, the negative impact on mental well-being and the desire to \"get out\" suggests potential for escalation if the situation continues.",
    "detected_category": "abuse",
    "timestamp": "2026-01-10 19:12:55"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not okay. I feel trapped. Is there anyone who understands what it's like to feel constantly on edge? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped and constantly on edge, suggesting significant distress and potential mental health concerns. The question about where to get help indicates a desire to improve the situation but also acknowledges difficulty in navigating available resources.",
    "detected_category": "other",
    "timestamp": "2026-01-10 19:11:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Just reaching out... hoping someone understands.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, with a plea for understanding. While not explicitly stating suicidal ideation, the language suggests significant distress and potential vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-10 19:10:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many friends gone. Narcan saves lives, learn how to use it. Seriously. It's not just \"their problem,\" it's our community.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a potential overdose situation within the community due to the mention of losing friends and the need for Narcan. While not explicitly stating an imminent overdose, it implies a risk of overdose and highlights the importance of preventative measures.",
    "detected_category": "overdose",
    "timestamp": "2026-01-10 19:09:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Trying to stay strong and remember I deserve better. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text explicitly mentions the urge to cut, indicating active self-harm ideation. While the individual is trying to cope, the presence of the urge elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-10 19:08:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... it's terrifying. Lost a friend last year. Please, if you're struggling, reach out. There are people who care & want to help. Don't be another statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and grief related to overdoses, indicating a heightened awareness of the risk of overdose and potential suicidal ideation due to loss. While it encourages seeking help, the direct mention of a friend's death due to overdose increases the severity.",
    "detected_category": "overdose",
    "timestamp": "2026-01-10 19:07:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy, and I'm not sure how to cope. Reaching out here because I don't know where else to turn. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness, loss, and difficulty coping but lacks specific details about self-harm, suicide, or harm to others. It appears to be a general cry for help.",
    "detected_category": "other",
    "timestamp": "2026-01-10 19:06:46"
  }
]