[
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Everything feels heavy and pointless. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of loss, hopelessness, and a lack of purpose. The statement 'I don't know what else to do' suggests a potential escalation if support is not received.",
    "detected_category": "suicide",
    "timestamp": "2026-01-15 03:47:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Old coping mechanisms surfaced. Day 1 again. Reached out to a friend, which helped a little. It's a long road, but I'm still here.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse into old coping mechanisms after feeling overwhelmed. While the person reached out to a friend, the specific nature of the coping mechanisms is unknown, and the relapse to 'day 1 again' suggests a significant setback, increasing the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 03:46:51"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a memorial for another friend lost to overdose. This stuff is relentless. Learn the signs, carry Narcan if you can. It really can save a life. Please reach out if you're struggling. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a friend's death due to overdose and urges carrying Narcan, indicating a significant risk of overdose events in the individual's social circle and potential for personal exposure.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 03:45:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend, hoping it helps. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, which can be indicative of emotional distress. However, it also shows proactive coping by reaching out to a friend. There is no explicit mention of self-harm, suicide, or violence.",
    "detected_category": "other",
    "timestamp": "2026-01-15 03:44:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He yelled again last night, smashed a plate. I feel like I'm walking on eggshells. Is this normal? I don't know what to do anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential for escalating violence and emotional abuse, creating a harmful and unstable environment. The mention of smashed plates suggests physical aggression, and the feeling of 'walking on eggshells' points to ongoing emotional distress and fear.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 03:43:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Constant yelling, and lately...more. Feeling lost and scared. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and potentially abusive home environment. The phrase 'lately...more' suggests an escalation of the situation, potentially involving physical violence. The user expresses feeling 'lost and scared' and seeking help.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 03:42:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "I'm having a really tough time lately. Feeling so lost and overwhelmed. Reaching out because I don't know what else to do. Any advice or support would be appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, seeking advice and support. While concerning, it doesn't explicitly mention self-harm, suicide, or harm to others.",
    "detected_category": "other",
    "timestamp": "2026-01-15 03:41:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm underwater. Talking to my doctor tomorrow. Hope things start looking up soon.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates feelings of sadness and low mood, but also shows help-seeking behavior (talking to a doctor) and hope for improvement. There is no explicit mention of self-harm, suicide, or harm to others.",
    "detected_category": "other",
    "timestamp": "2026-01-15 03:40:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Constant put-downs, yelling... I feel so small. Anyone else experience this? How do you cope? I'm starting to feel really trapped.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress (feeling small, trapped) due to negative interactions at home (put-downs, yelling). While not explicitly stating suicidal ideation or self-harm, the feeling of being trapped can escalate to more severe outcomes if not addressed.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 03:39:39"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside my building. Shook me up bad. Is there anywhere I can go to just...talk about feeling unsafe? Feel like I can't breathe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The individual expresses feeling unsafe and shaken up after witnessing a fight, but doesn't indicate direct threat or harm to themselves. There is a request for resources to talk about feeling unsafe. No indication of escalation or imminent danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-15 03:38:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just needed to say it out loud. It helps, even a little. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of being overwhelmed, suggesting a potential risk of self-harm or suicidal ideation. While the individual reached out for support, the presence of urges elevates the risk level. The phrase 'urges are back' implies this is a recurring issue and not just a transient feeling.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 02:57:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I feel like I need to hurt myself just to feel *something*. Anyone else ever feel this way? It's scary, and I don't know how to cope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a desire to self-harm as a coping mechanism, indicating significant emotional distress and potential for immediate danger.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 02:56:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Hard not to just...scratch the itch, y'know? Trying really hard to find a different way to turn the volume down. Anyone else feel this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The phrase \"scratch the itch\" can be interpreted as a euphemism for self-harm. The user expresses a desire to find alternative coping mechanisms, suggesting awareness of the potential for harm and a willingness to avoid it, but the initial impulse raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 02:55:02"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. I said something, but now I'm wondering if I should've done more? Anyone else ever been in that situation? Feeling uneasy.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an instance of violence (shoving), which is a form of physical assault. While it's a single incident and the observer intervened verbally, the potential for escalation and further harm exists for the girlfriend. The observer also expresses personal unease, suggesting they recognize the seriousness of the situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-15 02:54:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Clean for a month, then relapsed last night. Feeling so much shame. Reaching out before it gets worse again. Anyone know good online resources?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates vulnerability and potential for escalating substance use, increasing the risk of negative health consequences, including accidental overdose. The expressed shame and desire to seek help suggest a degree of self-awareness and a proactive approach, but the potential for further relapse and its consequences warrants a medium severity assessment.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 02:52:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, feeling so overwhelmed lately. Old coping mechanisms keep popping into my head. Trying so hard to resist. Anyone else relate? What helps you get through it? Need some new ideas.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The mention of \"old coping mechanisms\" and \"trying so hard to resist\" suggests a struggle with potentially harmful behaviors. While not explicitly stated, the context implies a risk that needs further exploration.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 02:51:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been walking on eggshells lately. Partner's anger is getting scary. Anyone else ever feel like they're losing themselves to keep the peace? Is that...normal?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential for escalation to physical or emotional abuse. The partner's anger is described as 'scary', suggesting a perceived threat. The individual also expresses a loss of self to maintain peace, which is a significant concern. While there's no explicit mention of violence, self-harm, or suicide, the situation warrants attention due to the potential for harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 02:50:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, feeling so overwhelmed lately. The urges are back and I hate it. Just trying to take things one minute at a time. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions the return of urges and feelings of being overwhelmed, which suggests a potential risk of self-harm or other negative coping mechanisms. While the individual is trying to cope, the presence of urges warrants a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 02:49:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Reached out to a friend, feels a little better to not be alone with it. Anyone else relate? Just trying to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which suggests a potential risk. While the individual has reached out for support, the statement \"Just trying to get through tonight\" implies a current struggle and potential vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 02:48:51"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a guy punch his girlfriend in the street today. Froze. I wish I'd done something. Feeling sick about it. Anyone else ever witness something like that? What do you even do?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can have psychological impacts on the witness, potentially leading to anxiety, fear, or feelings of helplessness. While there is no immediate physical danger to the witness, the secondary trauma needs acknowledgement.",
    "detected_category": "violence",
    "timestamp": "2026-01-15 02:47:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan worked, thank god. Makes you realize how close to the edge we all are sometimes. Check on your friends, seriously. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event indicating potential risk to the individual who overdosed and highlights the prevalence of substance use issues in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 01:47:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Lost my cousin to an OD last night. Hurts like hell. Please, if you're struggling, reach out. Don't let it get this far. There are people who care.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent death due to overdose, indicating a high risk that the author or someone they know may be vulnerable to similar circumstances or experiencing acute grief and potential suicidal ideation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 01:46:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just waves of sadness. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses sadness and a desire for help, but does not contain explicit statements of suicidal ideation, self-harm plans, or imminent danger.",
    "detected_category": "other",
    "timestamp": "2026-01-15 01:45:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "Sometimes I feel like I'm walking on eggshells. He gets so angry over the smallest things. Is this normal? I'm starting to feel really isolated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests emotional distress and potential abuse ('walking on eggshells,' 'angry over the smallest things,' 'isolated'). While not explicitly stating violence, self-harm, or suicidal ideation, the feelings of isolation and fear warrant concern. The unspecified 'he' could be a partner, family member, or other individual, making the situation potentially dangerous.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 01:44:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. They're okay now, but it shook me up. Makes you realize how close to home this stuff is. Be careful out there, folks. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived the overdose, the event highlights a serious safety risk and could indicate a broader issue of drug use in the community. The observer expresses significant emotional distress, suggesting the incident was impactful.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 01:43:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. Really bad. Feeling the urge to... you know. Trying to breathe through it. Anyone else get this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 93 (char 118)",
    "detected_category": "unknown",
    "timestamp": "2026-01-15 01:42:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a glass wall. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of numbness, detachment, and a plea for help, suggesting emotional distress and potential for escalation. While not explicitly suicidal, the feeling of disconnect warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-15 01:41:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm just going through the motions. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and going through the motions, indicating a possible struggle with mental health. While it shows distress and a call for help, there is no explicit mention or implication of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2026-01-15 01:40:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things are rough at home lately. Feeling isolated and scared. Anyone know of good resources for domestic abuse in [City]? Just need to talk to someone.\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Still processing what happened. Never thought someone I loved could hurt me like that. It's not okay. It's never okay.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Gaslighting is real. It messes with your head and makes you doubt yourself. Don't let anyone control your reality.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential domestic abuse and emotional distress. While there's no explicit mention of immediate danger, the feeling of being scared and hurt by a loved one warrants a medium severity level. Option 1 shows a desire to seek help, which is a good sign, but the underlying situation could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 01:39:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD in the bathroom. Scary stuff. Called 911, hope they're okay. Naloxone saves lives. Learn how to use it. You never know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A person is actively experiencing a life-threatening overdose requiring immediate medical intervention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 01:38:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Walking on eggshells constantly. Anyone else feel like they're suffocating? Need to figure out how to get out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 88 (char 113)",
    "detected_category": "unknown",
    "timestamp": "2026-01-15 00:44:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Please, if you're struggling, reach out. There's help available, you're not alone. I'm worried sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event, which is a serious medical emergency. While it doesn't directly involve the author, witnessing it can be traumatizing and prompts concern for others who may be struggling.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 00:42:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend on Elm Street. Froze up, didn't know what to do. Wish I'd intervened. Feeling sick about it. Anyone else seen stuff like this? How do you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing a violent assault (punching) indicates a high risk of serious physical harm to the victim.",
    "detected_category": "violence",
    "timestamp": "2026-01-15 00:41:56"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Just reaching out to see if anyone else understands. Talking feels impossible right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a lack of motivation, which are risk factors for mental health decline and potentially suicidal ideation. While there's no explicit mention of self-harm or suicide, the statement 'like nothing matters' suggests a significant level of distress and requires further assessment. The unwillingness to talk openly ('talking feels impossible') is also concerning.",
    "detected_category": "suicide",
    "timestamp": "2026-01-15 00:40:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just...heavy. Reaching out because I don't know what else to do. Any advice or just someone to listen?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and a plea for help, suggesting a potential for escalation if support is not received. While not explicitly suicidal or self-harming, the 'heavy' feeling and reaching out indicate distress.",
    "detected_category": "other",
    "timestamp": "2026-01-15 00:39:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD in my town. Makes my stomach churn. Lost a friend last year. If you're struggling, PLEASE reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose in the author's town and the loss of a friend, indicating potential exposure to a distressing situation and increased risk. While the author encourages reaching out for help, the underlying issues are serious and require attention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-15 00:38:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Relapsed after a few months clean. Feeling so ashamed and alone. Need to remember my coping skills. Anyone else been there?\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Scars don't define us, but they tell a story. Mine's about survival. It gets better. Please reach out if you're struggling.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Hard day. Urges are strong. Just a reminder that self-harm is a sign of pain, not attention-seeking. Be kind to yourself and others.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 explicitly mentions relapse, shame, and loneliness which can be indicators of increased risk. Option 3 mentions strong urges related to self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 00:37:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He yells all the time, then acts like nothing happened. Is this normal? Feeling trapped. Need to talk to someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feeling trapped and a need to talk, which could indicate emotional distress and potential for escalation. The yelling suggests a possible abusive environment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-15 00:36:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Just trying to get through tonight. 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-15 00:35:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm just going through the motions. Reaching out because I don't know what else to do. Is anyone else feeling this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and going through the motions, indicating a possible struggle with mental health. However, there's no explicit mention of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2026-01-15 00:34:43"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy shove his girlfriend on the street today. Broad daylight. I froze. Should I have said something? Still feel sick about it. Anyone else ever witness something like that? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes a single instance of violence, the potential for escalation or repeated harm exists. The witness also expresses emotional distress, indicating the incident had a significant impact.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 23:17:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Luckily, Narcan worked. Please, learn the signs and carry it. Could save a life. Don't want anyone to go through that.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a recent overdose event. While Narcan was effective, the potential for fatal outcome exists, indicating moderate risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 23:16:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I yelled, he ran. Shaking. Did I do the right thing? Wish I knew what happened after. Feel so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed an act of violence (shoving) which suggests potential for escalation and harm to the victim. The witness also expresses distress and concern, indicating the potential impact on their well-being.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 23:15:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on my street. Shaken up. Called the cops, but feeling helpless. Anyone know of local resources for de-escalation or community safety? Seriously worried.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A fight broke out, causing the individual to feel shaken and helpless. While they called the police, the incident suggests a potential risk of further violence in the area and a feeling of insecurity. Although the individual is not directly involved and police have been contacted, the exposure to violence and expressed worry indicate a notable level of risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 23:14:52"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy get punched outside the bar last night. Shook me up. It was so sudden. Anyone else feel like things are getting more aggressive lately? Makes me scared to go out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence (a punch), which is concerning, but the immediate threat is low as the violence occurred in the past and the user expresses fear/anxiety about future events rather than being in immediate danger. The user did not report physical harm to themselves.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 23:13:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Narcan saved them, but it was close. Please, learn how to use it. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates a potential risk of future overdoses in the area. The close call suggests a high potential for fatality.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 23:12:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but does not contain explicit ideation, intent, or plans for self-harm or suicide. It's a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2026-01-14 23:11:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got too much last night. Day 1 again. Reaching out before it gets worse. Anyone know good coping skills that actually work?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse ('Day 1 again') and a potential for escalation ('before it gets worse'). While it doesn't explicitly mention self-harm or suicide, the individual is clearly struggling and actively seeking help, suggesting a moderate level of risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 23:10:45"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on the bus. Shook me up. My hands are still trembling. Makes you realize how quickly things can escalate. Is there anywhere to report something like that anonymously?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight on a bus is unsettling, but the reporter was not directly involved or physically harmed. The description focuses on emotional distress and seeking anonymous reporting, suggesting a concern about the event's potential consequences rather than immediate danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 23:09:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me. Learn the signs, please. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event, indicating a risk of further overdose events and potential mental health impact on the witness.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 23:08:41"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, stronger than before. Reached out to a friend, just need someone to listen. It's a struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The return of stronger urges suggests an escalation of distress and potential risk, even though the individual is seeking support. The specific nature of the urges is unknown but warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 22:18:22"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> Things at home are getting scary. Walking on eggshells constantly. Anyone know where I can find local resources? Feeling trapped.\n\n**Option 2 (Sharing Experience):**\n\n> He said it was \"just a joke,\" but it really hurt. It's happening more often. Is this normal in a relationship? Feeling confused.\n\n**Option 3 (Raising Awareness):**\n\n> Emotional abuse is real. It leaves scars you can't see. Don't let anyone tell you your feelings aren't valid. You deserve better.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While there's no explicit mention of immediate physical danger, Options 1 and 2 suggest potential emotional or psychological abuse/distress, which can escalate. Feeling trapped and experiencing hurtful behavior that is increasing in frequency are concerning.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 22:17:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "My brother almost didn't make it last night. Narcan saved him. Learn the signs of an overdose, please. It could save someone you love. I'm so shaken up right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan, indicating a high risk event has already occurred and could happen again.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 22:16:17"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly low lately. Just reaching out to see if anyone else has felt this way and what helped. Seriously struggling to find any light.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of profound sadness and a struggle to find hope. While it doesn't explicitly mention self-harm or suicide, the intensity of the emotional distress and the feeling of being unable to find 'any light' indicates a potential risk that requires attention and support.",
    "detected_category": "suicide",
    "timestamp": "2026-01-14 22:15:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Narcan saved him, but it shook me up. Makes you realize how fragile things are. Be safe out there, everyone. Look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual was saved, witnessing an overdose can be a traumatic experience with potential psychological impact on the observer. The availability of Narcan mitigates the immediate danger, but the event highlights the ongoing presence of high-risk behavior in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 22:14:13"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. Urges were strong, but I distracted myself. Small victory. Still feel shaky. Anyone else relate? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user mentions \"strong urges\" which, while unspecified, suggests a potential risk. Feeling \"shaky\" and overwhelmed further indicates distress.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 22:13:11"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel unsafe walking alone at night lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling and raises concerns about personal safety. However, it does not directly indicate imminent danger or involvement. The expressed feeling of unsafety is a general concern rather than a specific threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 22:12:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thank goodness. Makes you realize how fragile things are. Please, look out for each other. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose was addressed, the event indicates a risk of overdose in the community and the potential for future, possibly fatal, incidents. The text implies the event was public, increasing the likelihood of broader community impact.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 22:11:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD. It's terrifying. Lost a friend last year... Narcan saves lives, people. Please, if you're struggling, reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions overdose (OD) and losing a friend, indicating potential distress and risk to self or others indirectly.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 22:10:05"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight break out downtown last night. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel like violence is getting worse lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning, but doesn't indicate immediate danger to the author or others. It expresses concern about violence in general.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 22:09:04"
  },
  {
    "title": "User Story: Violence",
    "content": "Heard shouting next door again. Makes my stomach churn. Wish I knew what to do. Called the non-emergency line before, felt like a waste of time. Anyone else dealt with this? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a recurring disruptive and potentially concerning situation next door (shouting). While not directly threatening, the writer expresses distress ('stomach churn', 'feeling helpless') and prior unsuccessful attempts to address the issue. The potential for escalation exists.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 21:18:33"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately? Stay safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing unease, but doesn't indicate imminent danger to the author or others beyond a general cautionary statement.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 21:17:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater and can't find the surface. Anyone else ever feel this way? Just trying to feel less alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and being lost, but does not contain explicit mentions of self-harm, suicidal ideation, violence, abuse, or overdose. It appears to be a general expression of emotional distress.",
    "detected_category": "other",
    "timestamp": "2026-01-14 21:16:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scariest thing ever. They're okay now, but it made me realize how close we all are. Learn the signs, carry Narcan if you can. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests potential ongoing risk of overdose within the social circle. While the person survived, the experience highlights vulnerability and the need for preventative measures.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 21:15:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so overwhelmed lately. Urges are back. Anyone know good coping mechanisms or resources? Just trying to get through tonight.\n\n**Option 2 (Personal Story):**\n\n> Clean for 3 months. It's hard, some days are brutal. But every day I choose to keep going. You can too.\n\n**Option 3 (Raising Awareness):**\n\n> Scars aren't attention-seeking. They're a sign someone was fighting a battle you knew nothing about. Be kind.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates a return of urges and a desire to find coping mechanisms, suggesting potential self-harm. The user is actively seeking help, which mitigates the risk, but the presence of urges elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 21:14:26"
  },
  {
    "title": "User Story: Abuse",
    "content": "Sometimes I feel like I'm walking on eggshells. He's so charming to everyone else, but at home... it's different. I don't know who to talk to. Is this normal?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 70 (char 95)",
    "detected_category": "unknown",
    "timestamp": "2026-01-14 21:13:23"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the bus stop. Shook me up. Reminded me of stuff I thought I'd buried. Anyone else get triggered by random violence? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a stressful event, and experiencing a triggered emotional response. While potentially distressing, it doesn't indicate immediate danger to the author or others. The individual is also seeking coping mechanisms, suggesting an attempt to manage their feelings.",
    "detected_category": "other",
    "timestamp": "2026-01-14 21:12:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need help. Any advice on finding a therapist?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of hopelessness and seeks help, indicating a need for mental health support. While not explicitly stating suicidal intent, the low mood and feeling that 'nothing matters' raises concern and warrants further assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-14 21:11:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Old coping mechanisms keep creeping back in. Trying to stay strong and remember I deserve better. Anyone else relate? How do you guys get through those tough moments?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates feelings of overwhelm and reliance on old, potentially negative, coping mechanisms. While concerning, there is no explicit mention of self-harm, suicide, or harm to others. The individual is expressing a desire to stay strong and seeking support, suggesting a willingness to cope positively.",
    "detected_category": "other",
    "timestamp": "2026-01-14 21:10:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, thankfully, but I'm still shaken. Learn the signs, carry Narcan if you can. It saves lives. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose implies a significant health risk event occurred. While the individual survived, the event indicates the presence of dangerous drug use and potential for future, possibly fatal, occurrences.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 21:09:15"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Punches thrown, yelling... shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling, but doesn't indicate direct personal threat or involvement. The author expresses being shaken and feeling on edge, indicating emotional distress, but not imminent danger or severe risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 20:18:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming I just want to feel *something* else. Scared myself last night. Anyone else feel like this? How do you cope? Really need some advice.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to feel something else due to feeling overwhelmed, and mentions scaring themselves. This suggests potential self-harm ideation, although not explicitly stated. The plea for advice also indicates a need for help.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 20:17:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. Narcan saved their life. Learn how to use it, you could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event. While Narcan was effective in this instance, the incident highlights the potential for serious harm and death related to drug use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 20:16:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Relapsed after a long time clean. Just trying to get through the day without making things worse. Anyone else been there? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential escalation of risky behavior. The user expresses feeling overwhelmed and is focused on just getting through the day, suggesting limited coping mechanisms and increased vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 20:14:58"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... rough. Constant put-downs, controlling behavior. I feel so isolated. Is this normal? Anyone else gone through this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional abuse and isolation, indicating a possible risk of escalation or negative mental health outcomes. While not explicitly stating suicidal ideation or intent to harm, the feelings of isolation and being lost, combined with the description of 'rough' home life including put-downs and controlling behavior, suggest a need for support and further assessment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 20:13:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just trying to process things. He apologized, said it wouldn't happen again. But now I'm doubting everything. Is this normal? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses emotional distress and doubt but doesn't contain explicit threats or indications of immediate danger. It suggests a possible past event that the speaker is trying to process, leading to feelings of being lost, but lacks specific details to classify it as a high-risk situation.",
    "detected_category": "other",
    "timestamp": "2026-01-14 20:12:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urges are getting stronger, and I hate it. Reached out to a friend, but still feeling shaky. Anyone else relate? Just trying to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates increasing urges and feeling shaky despite reaching out to a friend, suggesting a potential escalation of distress and some risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-14 20:11:53"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on the bus. My hands are still shaking. Is there any way to report something like that without getting involved directly? Feel so helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A fight occurred, indicating potential for physical harm. While the reporter was not directly involved, witnessing the event caused distress (shaking hands, feeling helpless), suggesting a moderate level of impact.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 20:10:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Heard shouting next door again last night. Makes me so anxious. Called the cops once before, but nothing changed. Anyone else dealt with this? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates repeated disturbances and feelings of helplessness, suggesting a potential escalation of the situation. While there is no explicit threat, the anxiety and previous call to the police indicate a potentially unsafe environment. The neighbor's shouting could involve domestic violence or other forms of abuse. It is important to consider the pattern of events and the potential for harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 20:09:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things at home have been rough lately. Walking on eggshells all the time. Is this normal? Feeling so lost and alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates distress and a feeling of being unsafe ('walking on eggshells'). While there's no explicit mention of harm, the feelings of being lost and alone in conjunction with a potentially volatile home environment raise concern. It suggests emotional abuse or a potentially escalating situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 20:08:47"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight break out on the train today. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel more on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight on a train is unsettling and may cause anxiety, but doesn't indicate an immediate or significant threat of harm to the individual or others. The text expresses feeling 'on edge' but lacks specific details suggesting intent or planning of violence, self-harm, or other critical safety risks.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 19:17:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are strong. Reached out to a friend, feels a little lighter. Remember you're not alone. Talking helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates active struggles and strong urges, suggesting elevated risk. Reaching out to a friend is a positive step, but the presence of urges still requires concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-14 19:16:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "I keep making excuses for him, but the yelling is escalating. Last night he broke a plate. Is this...normal? Feeling lost and scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Escalating yelling and property damage (breaking a plate) suggest a potential for further escalation and physical violence. The user expresses fear, indicating a perceived threat.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 19:15:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... feels like I'm walking on eggshells. Anyone else been through this? Feeling so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, indicating emotional abuse. While there's no explicit mention of physical harm or suicidal ideation, the feeling of being alone and walking on eggshells suggests significant emotional distress and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 19:14:28"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately, like I'm underwater. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and reaching out for help, suggesting potential emotional distress. The phrase 'underwater' can be interpreted metaphorically as a struggle to stay afloat emotionally.",
    "detected_category": "suicide",
    "timestamp": "2026-01-14 19:13:26"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, walking on eggshells... I'm starting to feel worthless. Anyone else been through this? How did you get out? #abuseawareness",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse and feelings of worthlessness, which could escalate to more severe mental health issues or self-harm if not addressed.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 19:12:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Scariest night of my life. Found my friend unresponsive. Narcan saved them. Learn the signs, carry it if you can. It really does work. Please be careful out there.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a life-threatening overdose situation where the friend was unresponsive and required Narcan. This indicates a high risk of fatality if intervention had not occurred.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 19:11:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Anyone else ever feel this way? Just looking for a little light.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and seeking support, which could indicate distress but lacks specific details about self-harm or suicidal ideation. The phrase \"looking for a little light\" suggests a desire for help rather than imminent harm.",
    "detected_category": "other",
    "timestamp": "2026-01-14 19:10:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Is there anyone else who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed, and a plea for help. While not explicitly mentioning self-harm or suicide, the heavy feelings and sense of desperation indicate a potential for escalation if support is not received.",
    "detected_category": "suicide",
    "timestamp": "2026-01-14 19:09:18"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Constant yelling, and lately... more. Feeling trapped. Anyone else been through this? How did you even start to get out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult and potentially escalating situation at home, including 'constant yelling' and 'more,' suggesting possible domestic abuse. The user also expresses feeling 'trapped,' indicating a potential crisis.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 19:08:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it feels like the only way to quiet them is to feel something else, even if it hurts. I know it's not healthy. Trying to find better ways to cope. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to self-inflict pain as a coping mechanism for overwhelming thoughts, indicating a potential risk for self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 18:22:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Reached out to a crisis line, just need to get through tonight. It's hard, but I'm trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions the return of the urge to cut (self-harm), indicating a potential escalation of risk. While the person has reached out to a crisis line, the statement of needing to 'get through tonight' suggests immediate and significant distress.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 18:21:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Relapsed after 6 months clean. Just reaching out... anyone else know this feeling? Need to remember I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential crisis. The user is feeling overwhelmed, which can increase the risk of further relapse or other negative coping mechanisms. Reaching out is a positive sign, but the relapse itself elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 18:20:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt that familiar urge again tonight. It's been a while. Reached out to a friend instead. Still shaky, but talking helped. It's a battle, not a defeat.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a recurrence of a potentially harmful urge, although the individual reached out for help and is managing the situation. The 'shaky' feeling suggests the urge was significant.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 18:19:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a friend OD. Scary stuff. Narcan saved their life. Learn CPR & recognize the signs, it could save someone you know. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing a drug overdose and the need for Narcan indicates a severe and potentially life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 18:18:21"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw two guys fighting outside my work today. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel like anger's just... everywhere lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate imminent danger to the speaker or others. It expresses concern about anger but does not imply direct involvement or threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 18:17:19"
  },
  {
    "title": "User Story: Abuse",
    "content": "I used to think it was normal to be yelled at for every little thing. Now I realize it's not okay. It's exhausting. Anyone else feel like they're walking on eggshells all the time? Is there a way out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of being yelled at and feeling like they are constantly walking on eggshells. This suggests a potentially abusive or emotionally volatile environment, which can have significant negative impacts on mental health and well-being. While not explicitly stating suicidal ideation or intent to harm others, the exhaustion and feeling trapped ('Is there a way out?') raises concern for potential escalation of distress. The level of potential harm is substantial, but it is not actively a crisis, and thus rated medium.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 18:16:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary stuff. Narcan worked, thank god. Makes you realize how fragile life is. Anyone know local resources for helping people struggling?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports an overdose event, indicating potential for future overdoses and potential fatalities in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 18:15:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan worked, thank goodness. Makes you realize how easily it can happen. Anyone know where to get trained on using it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose implies a potential for similar events, and the expressed concern about training suggests a perceived risk and desire to be prepared for future emergencies.",
    "detected_category": "overdose",
    "timestamp": "2026-01-14 18:14:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential domestic abuse (put-downs, controlling behavior, isolation). While there's no explicit mention of physical harm or suicidal ideation, the feeling of isolation and being in a potentially abusive environment raises concerns.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 18:13:12"
  }
]