[
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm stuck in a dark hole. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of hopelessness and being 'stuck,' indicating potential for self-harm. Reaching out is a positive sign, but the depth of their distress warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 20:17:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the ambulance outside my neighbor's again. So scared. ODs are way too common. If you're struggling, please reach out. There are people who care. Don't let it be you.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a nearby overdose event ('ambulance outside my neighbor's again') and expresses fear, indicating a direct and potentially life-threatening health risk in the community. The mention of 'ODs are way too common' suggests a recurring issue.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 20:16:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n\"Things got bad again. Not proud, but I relapsed. Reaching out before it spirals. Anyone know resources that actually help?\"\n\n**Option 2 (Sharing Experience):**\n\n\"Been clean for 6 months. It's a daily battle. Just wanted to say if I can do it, so can you. Keep fighting.\"\n\n**Option 3 (Raising Awareness):**\n\n\"It's not attention-seeking, it's a coping mechanism. Let's try to understand instead of judge. There's always a reason.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates a recent relapse and a concern about things spiraling. While not explicitly suicidal, the language suggests vulnerability and potential escalation of risk if support is not obtained. The other options do not indicate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 20:15:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So messed up. Scared me half to death. Is there anywhere safe to walk anymore? Feeling anxious.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and experiencing anxiety, but does not indicate direct involvement, immediate danger to the person, or intent to harm self or others. The feeling of anxiety could escalate, but currently is a reaction to an external event.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 20:14:45"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get jumped on my way home. Shook me up bad. Called the cops but still feel sick. Anyone else ever witness something like that? How do you deal?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault can cause significant psychological distress and anxiety, potentially leading to negative coping mechanisms. While there's no immediate physical danger to the author, the event is impactful and requires attention.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 20:13:43"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. My neighbor's been yelling for hours, sounds like things are being thrown. Called the non-emergency line but they haven't come. Anyone else hear this on Elm St? I don't know what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The neighbor's yelling, sounds of things being thrown, and the prolonged duration suggest a potential escalation of violence or abuse. While the exact nature is unclear, the situation warrants concern and the lack of police response elevates the risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 20:12:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight, hoping it helps. It's exhausting fighting this alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, suggesting potential depression or mental health struggles. The individual is reaching out for help, indicating awareness of the need for support, but the feeling of being 'underwater' and 'exhausted' implies a level of distress that warrants attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 20:11:40"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight downtown last night. Shook me up bad. Just random anger exploding. Makes you realize how fragile things are. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence, causing unease, but doesn't indicate immediate danger to the author or others, nor does it explicitly promote violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 20:10:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and being overwhelmed, but doesn't explicitly mention self-harm, suicide, or violence.",
    "detected_category": "other",
    "timestamp": "2025-12-20 20:09:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. Remember you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating an immediate risk to the person's safety. While the person reached out to a friend, the intensity of the urge necessitates a high-risk classification.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 20:08:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm starting to realize things at home aren't normal. Constant yelling, being told I'm worthless... Is this abuse? I feel so lost and scared.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (yelling, belittling) and expresses feelings of fear and being lost, indicating a potential for escalation and negative impact on mental well-being.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 19:16:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are strong, and I'm trying so hard to resist. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and exhaustion from resisting them, suggesting potential for self-harm or a crisis. Reaching out to a friend is a positive sign, but the overall tone warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 19:14:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary. Shaking. Is anyone else feeling like things are getting more volatile lately? I'm worried about my kids.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight can be a distressing experience, and the user expresses fear and concern for their children's safety, suggesting a moderate level of perceived risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 19:13:57"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out downtown last night. So scary how quickly things escalated. Made me realize I need to learn some basic self-defense. Any recommendations for classes around here?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight caused concern and a desire for self-defense training. No indication of direct threat or involvement in violence, just a desire to prepare for potential future situations.",
    "detected_category": "other",
    "timestamp": "2025-12-20 19:12:55"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, isolating me from friends... feels like I'm walking on eggshells. Anyone else experience this? Where do you even start getting help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of emotional abuse (put-downs, isolation) which, while not explicitly mentioning physical harm, creates a hostile and controlling environment. This suggests an elevated risk of psychological distress and potential escalation. The individual is also actively seeking help, indicating awareness of a problem but uncertainty about solutions.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 19:11:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Please, if you're struggling, reach out. There are people who care & want to help. Don't let it get this far.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal event (almost didn't wake up), strongly suggesting a suicide attempt or severe overdose. The plea to seek help implies the friend was struggling significantly.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 19:10:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things aren't good at home. Constant put-downs, controlling behavior... I feel trapped. Anyone else been through this? How did you find help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and emotional abuse leading to a feeling of being trapped. While there's no explicit mention of physical harm, the situation suggests potential for escalation or development of mental health issues. The individual is also seeking help, indicating awareness of a problem.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 19:09:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible but I know I need to. Any advice on where to start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and overwhelmed, suggesting potential mental health distress. While not explicitly suicidal, the metaphor of being \"underwater\" and the feeling that talking is \"impossible\" indicates a need for support and could escalate if unaddressed.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 19:08:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just wanted to say if you're struggling, you're not alone. Reaching out is scary, but it's worth it. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and encourages seeking help, suggesting potential distress but without explicit indication of self-harm or suicidal intent.",
    "detected_category": "other",
    "timestamp": "2025-12-20 19:07:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were strong. Didn't give in this time, but it was close. Anyone else feel like they're constantly fighting a battle?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and a close call with giving in, suggesting a potential risk of escalation if support is not available.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 19:06:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIPs lately. Lost another friend to OD last night. Please, if you're struggling, reach out. There are people who care and want to help. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and mentions overdose (OD) as a cause of death, suggesting potential exposure to substance use or a difficult environment, and indirectly references struggling individuals. While it encourages seeking help, the mention of recent deaths and OD indicates a concerning situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 18:19:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just found out my \"friend\" has been isolating his gf from everyone. Red flag, right? Happened to me before. Makes me sick to see it again. Anyone know resources in [City]?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of potential abuse (isolation), which is a serious concern. The poster expresses distress and seeks resources, indicating awareness of the severity and potential harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 18:18:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough lately. Walking on eggshells all the time. Is this normal? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home environment with a sense of constant tension and feeling lost. While not explicitly mentioning violence or harm, \"walking on eggshells\" suggests potential verbal or emotional abuse, and the feeling of being lost warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 18:17:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs, isolating me from friends... Feels like I'm walking on eggshells. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, which can escalate into more severe situations or contribute to mental health issues.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 18:16:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, but still struggling. Anyone else feel this way sometimes? Need to remember I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Expresses a strong urge to self-harm, indicating immediate risk. While the individual reached out to a friend, the struggle persists.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 18:15:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out to a friend, hoping it helps. It's hard to keep going sometimes.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed, and difficulty continuing, suggesting emotional distress and potential for self-harm thoughts. Reaching out to a friend is a positive coping mechanism, but the underlying issues require monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 18:14:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Just reaching out... anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of sadness and isolation, but lacks specific details about self-harm or suicidal ideation. Reaching out for connection suggests a desire for support.",
    "detected_category": "other",
    "timestamp": "2025-12-20 18:13:45"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Makes me sick. Happened so fast, wish I knew what to do. Anyone else feel helpless witnessing stuff like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, expressing feelings of helplessness and unease, but doesn't indicate direct involvement, immediate danger to self or others, or specific threats. It's a reaction to a potentially isolated incident.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 18:12:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to distract myself, but it's hard. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential escalation of risk. While not explicitly stating suicidal intent, the feeling of being overwhelmed and the difficulty in distracting oneself raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 18:11:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Just wanted to say if you're struggling, you're not alone. Reaching out is scary but can help. Talking to someone today. 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and encourages seeking help, suggesting a potential struggle but not explicitly indicating immediate danger.",
    "detected_category": "other",
    "timestamp": "2025-12-20 18:10:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... rough. Walking on eggshells all the time. I feel so isolated. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult home environment potentially involving emotional abuse (walking on eggshells, isolation). While there's no explicit mention of harm, the situation suggests potential for escalation and negatively impacts mental wellbeing.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 17:16:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a strong urge to self-harm, indicating imminent risk. Although reaching out to a friend is a positive coping mechanism, the intensity of the urge elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 17:15:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges are strong. Trying to distract myself, but it's hard. Anyone else relate? Just feeling incredibly alone right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and feelings of isolation, which can be precursors to self-harm or suicidal ideation. While there's no explicit mention of intent, the intensity of the urges and the feeling of being alone warrant a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 17:14:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Scariest thing ever. Please, if you're using, have someone with you. Narcan saves lives. I'm so shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal experience, suggesting a severe overdose event requiring Narcan. The phrase 'almost didn't make it' implies a life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 17:13:04"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Talking to someone tomorrow. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of depression and acknowledges needing help, indicating a potential risk. The fact they are reaching out and have scheduled a conversation is a positive mitigating factor, but the depth of their despair is unknown.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 17:12:02"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He yelled again last night, said I was worthless. It's getting worse. Does anyone know where I can find help? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates increasing verbal abuse and feelings of isolation, which are risk factors for escalation. The user is also actively seeking help.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 17:11:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so lost. Things at home are getting worse. Is there anyone who can recommend a good therapist or support group? I just need to talk to someone.\n\n**Option 2 (Sharing Experience):**\n\n> It took me years to realize it was abuse, not just \"tough love.\" Still unpacking all that baggage. It's exhausting.\n\n**Option 3 (Raising Awareness):**\n\n> Remember that abuse isn't always physical. Emotional manipulation is just as damaging. Know the signs and protect yourself.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text doesn't explicitly mention suicidal ideation or intent to harm others, the user's feeling of being \"lost\" and the worsening situation at home, coupled with the mentions of abuse (emotional and physical), suggests a potential for escalation and warrants concern. The user is actively seeking help, which indicates awareness of their situation and a desire for positive change, but the underlying issues could still pose a risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 17:09:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy and I don't know what to do. Talking to a friend later, hoping it helps. Just need a little light.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and heavy-hearted, seeking support from a friend, suggesting a coping mechanism is in place. No explicit mention of self-harm, suicide, or harm to others.",
    "detected_category": "other",
    "timestamp": "2025-12-20 17:08:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the subway platform. Scared me senseless. Everyone just stared. Is this normal now? Feeling so unsafe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was physically assaulted, indicating a potential for injury. While the extent of the injury is unknown, the act itself constitutes a violent event in a public space.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 17:07:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him. Makes you think... Know the signs, carry Narcan if you can. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event indicates a significant risk of overdose in the community. While Narcan was available and used successfully, the event highlights the potential for fatal outcomes.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 17:06:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, just need someone to listen. It helps a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant immediate risk. While the person has reached out for help, the urge is still present, requiring immediate attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 16:18:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "> Been walking on eggshells lately. Constant criticism, nothing I do is right. Is this...normal in a relationship? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests emotional distress and potential emotional abuse, which can escalate to more serious issues if not addressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 16:17:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so low lately. Like I'm underwater. Reaching out to a friend, but it's hard to talk about. Anyone else been there?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and difficulty communicating, indicating emotional distress. The metaphor of being 'underwater' suggests a sense of being overwhelmed. Reaching out is a positive sign, but the difficulty in talking raises concern. While not explicitly suicidal, the overall tone warrants attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 16:16:25"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant yelling, walking on eggshells... feels like I'm losing myself. Anyone else been through this? How did you cope? #abuseawareness",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive situation at home with constant yelling and feeling like one is losing themselves. While it doesn't explicitly state physical abuse, the mention of 'walking on eggshells' suggests a controlling or intimidating environment which could escalate. The user is seeking support suggesting they are distressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 16:15:23"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and isolation, which can escalate to more serious mental health issues. While not explicitly stating intent to harm self or others, the mention of controlling behavior and feeling isolated raises concerns.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 16:14:22"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"It's hard to admit, but things at home aren't good. Always walking on eggshells. Is this normal? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a distressed state and potentially unhealthy home environment, implying emotional or psychological abuse and a feeling of helplessness. 'Walking on eggshells' suggests fear and tension.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 16:13:20"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how easily things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text doesn't indicate direct involvement or specific threats. It expresses a general feeling of unease.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 16:12:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the gas station today. Scary stuff. They were ok after Narcan, but damn. Makes you realize how close to home this is. Anyone know where to find free training in my area?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived due to Narcan, the text describes an overdose event, indicating a potential for severe harm or death. The individual witnessing the event expresses concern and seeks training, suggesting a recognition of ongoing risk in their community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 16:11:17"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good lately. Constant put-downs, walking on eggshells... feels isolating. Anyone else been through this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving constant put-downs and feeling isolated, suggesting emotional abuse and a potentially unhealthy home environment. While not explicitly stating violence, self-harm, or suicidal ideation, the description of 'walking on eggshells' and feeling isolated raises concerns about the individual's well-being and potential escalation of the situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 16:10:15"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. My neighbor's been yelling & throwing things all night. Called the non-emergency line, but they haven't come. Don't know what to do. Anyone else hear anything?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Neighbor's violent behavior (yelling, throwing things) poses a potential threat, though the target isn't specified. The person is scared and has already contacted authorities. The delay in response increases the risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 16:09:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Woke up with that familiar knot in my stomach. Just remembering last night. Is it really abuse if he says he loves me after? Feeling so lost. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests potential emotional and/or physical abuse, with the individual questioning the nature of the relationship and expressing feelings of distress and being lost. The phrase \"familiar knot in my stomach\" hints at repeated instances and negative emotional impact.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 15:17:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm constantly underwater. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 75 (char 100)",
    "detected_category": "unknown",
    "timestamp": "2025-12-20 15:16:00"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit suicidal ideation, self-harm, or threats of violence. It's a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-20 15:14:58"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but lacks explicit suicidal ideation, self-harm plans, or threats. The user is reaching out for support.",
    "detected_category": "other",
    "timestamp": "2025-12-20 15:13:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm drowning and no one sees it. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and being overwhelmed, suggesting potential for self-harm or suicidal ideation. The phrase \"drowning and no one sees it\" indicates a level of distress requiring attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 15:12:56"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so incredibly lost lately. Just reaching out to see if anyone else has felt this way and found a path forward. It's hard to see any light right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of lostness and hopelessness, but does not contain explicit suicidal ideation, self-harm behaviors, or threats of violence. It primarily seeks connection and support.",
    "detected_category": "other",
    "timestamp": "2025-12-20 15:11:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary how quickly things escalated. Makes you think, you know? Anyone else feel like things are getting more tense lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text mentions a fight and expresses feelings of tension, but doesn't contain any specific threats or indications of imminent danger. It's more observational and expresses a general feeling of unease.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 15:10:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about overdose awareness. Scared me. Lost a friend last year. Narcan is so important, learn how to use it. You could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses overdose and mentions a personal loss due to overdose, which indicates a potential emotional impact and the presence of a significant health risk in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 15:09:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Been feeling so low lately. Just existing is exhausting. Talking to someone feels impossible, but I know I need help. Where do I even start?\n\n**Option 2 (Sharing Experience):**\n\n> I remember that dark place. It DOES get better. Hold on. Reach out. You're not alone in this fight.\n\n**Option 3 (Raising Awareness):**\n\n> Check in on your friends, even the seemingly happy ones. You never know what someone's going through. A little kindness can go a long way.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses feelings of exhaustion and acknowledges a need for help, suggesting potential for escalation if support isn't received. Options 2 and 3 are supportive and preventative, but the initial statement raises concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 15:08:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been feeling so isolated lately. Constant put-downs, controlling behavior... Is this normal in a relationship? Starting to think it's not. Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feelings of isolation and experiences of put-downs and controlling behavior, suggesting potential emotional abuse. While it doesn't explicitly mention self-harm or suicidal ideation, the feeling of being 'lost' and questioning the normality of the relationship raises concerns.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 15:07:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the gas station. Narcan saved them, but it was scary. Makes you think... Know where to get it & how to use it. It could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose, a life-threatening event requiring immediate intervention. While Narcan was successful, the situation itself indicates a significant risk of harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 14:17:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so heavy. Relapsed after 6 months clean. Feeling ashamed, but reaching out. Anyone know good coping strategies that aren't just \"take a bath\"? Need real help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a struggle with addiction, and feelings of shame can contribute to further risky behavior. The individual is reaching out for help, which is a positive sign, but the expressed need for \"real help\" suggests current coping mechanisms are insufficient.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 14:16:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things aren't good at home. Walking on eggshells all the time. Is this normal? I feel so lost and alone. Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a difficult and potentially harmful situation at home, including feeling lost and alone, and walking on eggshells which can indicate emotional distress and potentially abuse.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 14:14:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... It hits different when it's someone you know. Please, if you're struggling, reach out. There's help available, even if it doesn't feel like it. I'm here to listen too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references an overdose death of someone known to the author, suggesting potential grief and vulnerability, and implicitly acknowledges the possibility of others struggling with similar thoughts or actions. While the author offers support, the context indicates a heightened risk environment.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 14:13:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... it's terrifying. Lost a friend last year. If you're struggling, please reach out. There are people who care. Don't become another statistic. 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about overdoses and mentions the loss of a friend, suggesting potential vulnerability in the audience and prompting outreach for help. While not explicitly suicidal, the topic and related loss elevate the risk compared to general sadness.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 14:12:55"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on my way home. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel extra on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate direct involvement or immediate danger to the author or others. It expresses feeling shaken and on edge, suggesting anxiety but not necessarily a severe risk.",
    "detected_category": "other",
    "timestamp": "2025-12-20 14:11:53"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary how quickly things escalated. My hands are still shaking. Is there anywhere to volunteer to help de-escalate situations like that? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The individual witnessed a fight and expresses feeling shaken and helpless, but is not directly involved or threatened. The focus is on their reaction and desire to help, not imminent danger.",
    "detected_category": "other",
    "timestamp": "2025-12-20 14:10:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are strong. Reached out to a friend, feels a little better. Remember it's okay to ask for help. 988 is there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates active suicidal ideation ('urges are strong') but also protective factors (reaching out to a friend, awareness of 988). The presence of urges elevates the risk beyond low, but the active help-seeking prevents it from being immediately high.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 14:09:49"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it feels like the only way to quiet them is to hurt. Trying to find better coping mechanisms. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses thoughts of self-harm as a coping mechanism, indicating a potential risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 14:08:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but lacks explicit mention of self-harm, suicide, or harm to others. It seems like a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-20 14:07:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been...not good. Walking on eggshells constantly. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home situation involving walking on eggshells, suggesting potential abuse or a highly stressful environment. The user expressing feeling alone elevates the concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 13:23:22"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so low lately. Urges are back. Trying to stay strong but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of being low, suggesting a potential risk of self-harm or suicidal ideation. While not explicitly stated, the struggle to stay strong warrants a medium severity level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 13:22:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just reaching out to see if anyone else understands. It's hard to keep going sometimes. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and difficulty coping, suggesting potential suicidal ideation. While there is no explicit mention of self-harm or suicide plans, the phrase 'hard to keep going sometimes' raises concern and warrants further assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 13:21:19"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else ever feel that way after witnessing something like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate imminent danger to the author or others. It primarily expresses emotional distress after the event, not intent to harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 13:20:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Reaching out because I don't know what else to do. Anyone else ever feel like they're just...drowning?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of intense loneliness and a sense of being overwhelmed (\"drowning\"). While it doesn't explicitly mention self-harm or suicide, the feeling of being overwhelmed and the plea for help suggest a potential risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 13:19:16"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Reached out to a friend, feels a little better to not be alone with it. If you're going through it too, please reach out. You're not alone either.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a relapse or worsening of a mental health condition. Reaching out is a positive step, but the presence of urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 13:18:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\"I keep making excuses for him, but the yelling is getting worse. Last night he cornered me... I don't know what to do. Is this normal? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes escalating yelling, being cornered, and feeling lost, which indicates a potentially dangerous situation of emotional and possibly physical abuse. The escalation suggests a high risk of further harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 13:17:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scared. Found my brother unresponsive. Narcan worked, thank god. Still waiting for the ambulance. Addiction is a monster. Learn the signs, carry Narcan. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Brother was found unresponsive and required Narcan, indicating a potentially life-threatening overdose situation. The immediate danger has passed with Narcan administration, but the situation necessitates further medical attention and highlights an ongoing risk due to addiction.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 13:16:11"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, suggesting potential emotional distress and a need for help. While not explicitly suicidal, the metaphor of being \"underwater\" indicates a struggle and warrants concern.",
    "detected_category": "other",
    "timestamp": "2025-12-20 13:15:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after almost losing a friend to an OD. Scariest night of my life. Please, if you're using, have someone with you, and know the signs. Naloxone saves lives. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event, indicating a significant risk of severe harm or death related to drug use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 13:14:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I hate it. Trying to stay strong and remember why I stopped. Anyone else get this? Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a return of urges, indicating a potential for self-harm or relapse, coupled with feelings of loneliness and being overwhelmed. While there's no explicit plan, the combination warrants a 'medium' severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 12:22:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. The constant put-downs are chipping away at me. Is this normal in a relationship? Feeling lost and don't know where to turn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional distress, feeling lost, and experiencing potentially abusive behavior (put-downs). While there is no explicit mention of self-harm or suicidal ideation, the feeling of being 'chipped away' indicates significant negative impact and a potential escalation risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 12:21:14"
  },
  {
    "title": "User Story: Suicide",
    "content": "Sometimes it feels like I'm underwater, just trying to breathe. Reaching out because I don't know what else to do. Has anyone else felt this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and struggling, with a sense of helplessness. While not explicitly stating suicidal intent, the feeling of being underwater and reaching out can be interpreted as a cry for help and potential distress that could escalate if not addressed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 12:20:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough lately. Constant put-downs, isolating me from friends... feels like I'm walking on eggshells. Is this normal in a relationship? Starting to feel really lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, which can escalate and significantly impact mental well-being. The feeling of being 'lost' suggests distress.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 12:19:11"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his dog on Elm St. Shaken. Reported it, but feel like I should've done more? Anyone else witness it? Wish I'd yelled something. Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence (dog being punched) indicates a potential for escalation or further harm to the animal. While not directly involving the reporter, it's a concerning act of violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 12:18:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately, urges are back. Reached out to a friend, just talking helped a bit. Remember you're not alone, even when it feels like it. <3",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential for self-harm or relapse into harmful behaviors. While the individual reached out for help, the presence of urges necessitates a 'medium' severity rating as the risk is not immediately imminent but requires attention and support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 12:17:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so heavy, y'know? Just trying to find healthier ways to cope. Anyone else feel like they're just barely holding on?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and struggling to cope, but it doesn't explicitly mention self-harm, suicide, or harm to others. The mention of \"healthier ways to cope\" suggests an intention to find positive solutions, lowering the immediate risk.",
    "detected_category": "other",
    "timestamp": "2025-12-20 12:16:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost and overwhelmed, potentially indicating depression or a mental health crisis. The statement 'don't know what else to do' suggests a lack of coping mechanisms and a need for support. While not explicitly mentioning self-harm or suicide, the intensity of the feelings warrants concern and further assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 12:15:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after Narcan saved my life. Scared. This stuff is everywhere. Getting help tomorrow. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Recent life-threatening overdose requiring Narcan intervention indicates a high risk of recurrence. Expressed fear and feeling of isolation compound the risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 12:14:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough week. Urges are back, stronger than before. Reached out to a friend, just needed to vent. It helps, even a little. Taking it one day at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges, suggesting a potential for escalation. While the person reached out for help, the persistence of strong urges necessitates monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 12:13:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just wanted to say if you're struggling, you're not alone. Talking to someone helps, even if it's just a little. Reach out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and encourages seeking help. While it mentions struggling, it doesn't contain explicit suicidal ideation or plans.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 11:16:11"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out at the bus stop. Shaken up. Makes you realize how quickly things can escalate. Anyone else ever witness something like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but the individual only expresses feeling shaken up, indicating no direct harm or imminent threat to themselves or others. The event is a past occurrence.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 11:15:10"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on the street. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't indicate immediate danger to the individual or others. The person expresses feeling 'on edge' which indicates stress but not necessarily an imminent threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 11:14:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were strong. Didn't act on them, though. Small victory. Anyone else relate? Just feeling really alone right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions strong urges, implying a struggle with potentially harmful thoughts or behaviors. While the individual states they didn't act on them, the presence of strong urges and feelings of isolation warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 11:13:07"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of distress and being overwhelmed, but does not contain specific plans or threats of harm.",
    "detected_category": "other",
    "timestamp": "2025-12-20 11:12:05"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Shook me up. Said something, but feel like I should've done more. Anyone else ever freeze in a situation like that? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence indicates potential for escalation or further harm. While no immediate threat is mentioned to the witness, the event itself points to a risk of physical harm to the shovee.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 11:11:04"
  },
  {
    "title": "User Story: Suicide",
    "content": "Ugh, things have been so dark lately. Feeling really lost and overwhelmed. Talking to someone feels impossible, but I know I need to. Any advice on where to start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of darkness, being lost, and overwhelmed, coupled with the acknowledgement of needing help but feeling unable to reach out. This suggests a potential for escalation if support is not received.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 11:10:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mentions of self-harm, suicide, violence, abuse, or overdose. It appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-20 11:09:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got decked. Makes you think, y'know? Is this just how things are now? Feeling kinda shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling, causing anxiety, but doesn't indicate imminent danger or a high probability of severe harm to the person who wrote the text.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 11:08:00"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just...heavy. Reaching out to a friend, hoping it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and heavy, suggesting emotional distress, but lacks specific details about self-harm, suicide, or harm to others. Seeking support from a friend indicates a coping mechanism.",
    "detected_category": "other",
    "timestamp": "2025-12-20 11:06:58"
  }
]