[
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just feeling so lost. Things escalated again last night. Don't know who to turn to anymore. Is this normal? Feels like I'm walking on eggshells all the time.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential escalation of conflict, feelings of being lost, and constant anxiety (\"walking on eggshells\"). While not explicitly mentioning self-harm or suicide, the emotional distress and lack of support suggest a need for intervention and the potential for further escalation. It's important to investigate further.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 03:04:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scary night. Found my roommate unresponsive. Narcan saved him. Please, if you're using, carry it. Could save a life, like it did last night. Learn how to use it. It's not hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a life-threatening overdose situation where the individual was unresponsive and required Narcan to be revived, indicating a significant risk of death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 03:03:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy and I don't know where to turn. Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness, loneliness, and being lost, but lacks specific suicidal ideation, self-harm plans, or threats. It seems like a general cry for help and support.",
    "detected_category": "other",
    "timestamp": "2026-01-04 03:02:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park today. Scariest thing ever. Narcan saved him, thank God. This sh*t is real. Please, if you're struggling, reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a high-severity event. While the person survived due to Narcan, the event indicates a significant risk of fatal overdose in the community and potential trauma for the witness.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 03:01:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... Feels like I'm walking on eggshells. Anyone else been through this? How did you find help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, indicating a potential for emotional or psychological abuse. While not explicitly stating physical violence, the feeling of 'walking on eggshells' suggests a volatile and potentially unsafe environment. The user is actively seeking help, which suggests they recognize the severity of the situation and its negative impact.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 03:00:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got too much last night. Cleaned up now, but feeling so ashamed. Reaching out to my therapist today. Just gotta get through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a past crisis and feelings of shame, suggesting a potential risk of self-harm or suicidal ideation. While the individual is reaching out for help, the initial statement implies a significant emotional distress.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 02:59:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Narcan saved him, thankfully. Makes you realize how fragile life is. If you're struggling, please reach out. There's help out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose was non-fatal, it indicates a serious and immediate health risk. The availability of Narcan mitigated the potential for death, but the event itself points to a significant issue with drug use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 02:58:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor OD last night. Terrifying. Narcan saved him, but it shook me up bad. Folks, please be careful out there. Know the signs, carry Narcan. It really can save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a neighbor's overdose, indicating a potential risk of overdose in the community and highlighting the importance of harm reduction measures. While Narcan was successful, the event was described as 'terrifying' and impactful.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 02:57:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my friend OD last night. Terrifying. Narcan saved him, but it shook me up bad. Anyone else been through this? Feels like I can't breathe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Friend's overdose suggests potential exposure to dangerous substances and associated trauma/stress. The user expresses distress and difficulty breathing, indicating a possible anxiety or panic attack related to the event.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 02:56:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He yells every day, even when I do everything \"right.\" It's never enough. Does anyone else deal with this? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and feelings of isolation, which could escalate to more severe mental health issues if left unaddressed. The phrase \"He yells every day\" and the feeling of it never being \"enough\" suggest a pattern of verbal abuse.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 02:55:26"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy get shoved on the train today. Just trying to get home. Scared the crap out of me. Is everyone okay out there? Feeling so on edge lately.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While a violent act occurred, the text describes a single incident and expresses fear and anxiety but does not indicate ongoing threat or high probability of further violence. The target of the violence was not the author of the text.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 01:47:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is back, and it's scary. Reached out to a friend, and it helped a little. Just trying to get through today. Any advice is welcome.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions the return of urges to self-harm, indicating an active risk. While the person reached out to a friend, the severity remains high due to the presence of self-harm ideation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 01:46:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain any explicit mentions of self-harm, suicide, violence, abuse, or overdose. It is a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2026-01-04 01:45:14"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up bad. Reminded me of things I've been trying to forget. Anyone else get triggered by stuff like that? Need to breathe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes feeling shaken up and triggered by witnessing a fight, but doesn't indicate immediate danger to self or others. It expresses a need to 'breathe,' suggesting a coping mechanism is being employed.",
    "detected_category": "other",
    "timestamp": "2026-01-04 01:44:13"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Just trying to take it one hour at a time. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges are back' suggesting a relapse or increase in distress, and feeling 'overwhelmed' indicates a diminished capacity to cope. While not explicitly stating intent, the mention of 'urges' and seeking support online points to a potential risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 01:43:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Finally left. Scared but free. Years of walking on eggshells... anyone else ever feel like they were losing themselves? Any advice on rebuilding?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text implies a history of abuse or a controlling situation ('walking on eggshells') which can have long-term psychological impacts. The user expresses fear and feeling like they were 'losing themselves', indicating emotional distress and potential vulnerability. The risk of self-harm or other negative outcomes is elevated, but not immediately apparent.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 01:42:10"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Just reaching out to see if anyone else has felt this way and found a way through. Need some hope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed, but does not contain any explicit or imminent plans for self-harm or suicide. It is a general expression of distress and a request for help.",
    "detected_category": "other",
    "timestamp": "2026-01-04 01:41:09"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Scary how quickly things escalated. Makes you think, ya know? Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is concerning, but lacks specific threats or targeted harm. The generalized feeling of being 'on edge' doesn't indicate immediate danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 01:40:07"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Froze. Wish I'd said something. Anyone else ever feel that helplessness? Makes me sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can indicate a potential risk of escalation or repeated incidents, and the author expresses distress related to the event.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 01:39:06"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his partner on the street today. Broad daylight. Frozen. Didn't know what to do. Still shaking. Is there somewhere to report that even if I don't know them?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault, even if a single shove, indicates potential for further harm or escalation. The witness's distress suggests a serious event.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 01:38:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Paramedics got there fast, thank god. Makes you realize how fragile life is. Is there anything we can really DO to help people?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be traumatizing and trigger vicarious trauma. The text expresses concern and a desire to help, which suggests the user may be impacted by the event.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 00:51:45"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street. Really scary. Made me remember things I try to forget. Anyone know resources for dealing with past trauma? Feeling shaky.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling 'shaky' after witnessing a fight, triggering past trauma. While not explicitly suicidal or self-harming, the mention of 'things I try to forget' and seeking resources for trauma indicates distress and potential vulnerability. It's possible the distress could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 00:50:44"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up. People just stood there filming. Is this normal now? Makes me sick.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused emotional distress but doesn't indicate imminent harm to anyone. It expresses concern and disgust, not direct involvement or threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 00:49:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so overwhelmed lately. Just talking about it helps a little. Anyone else ever feel like they're drowning?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and feeling like they are drowning, which suggests emotional distress, but there's no explicit mention of self-harm, suicide, or harm to others. It seems to be a general expression of feeling overwhelmed and seeking support.",
    "detected_category": "other",
    "timestamp": "2026-01-04 00:48:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train platform. Heart's still racing. Is there anything you're supposed to DO in that situation besides call for help? Feels like I froze.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was physically assaulted (shoved) on a train platform. While the outcome is unknown and not explicitly stated as a serious injury, the potential for severe injury or death exists due to proximity to a train and the nature of a shove. The witness's distress suggests a significant event.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 00:47:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "**(Option 1 - Seeking Help):**\n\n> Feeling so lost lately.  Everything's just...heavy.  Anyone know any good resources for when you're really struggling?  Need to find a way through this.\n\n**(Option 2 - Personal Story):**\n\n> Been there.  Dark place.  It DOES get better.  Talking helped me.  Don't give up.  You're not alone.\n\n**(Option 3 - Raising Awareness):**\n\n> Check in on your friends, even the \"strong\" ones. You never know what someone's going through. A little kindness goes a long way.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and struggling, but it also seeks help and promotes support for others. There's no explicit mention of self-harm or suicidal ideation, and the overall tone suggests a desire to find solutions.",
    "detected_category": "other",
    "timestamp": "2026-01-04 00:46:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Scratched my arm again last night. Feeling so ashamed. Reaching out here because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes self-harm (scratching), feelings of shame, and a sense of desperation, indicating a moderate level of distress and potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 00:45:36"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing on the street, got really heated. Made me think of my sister's situation. Anyone know resources for domestic violence in the city? Worried about her.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about a potential domestic violence situation. While there's no direct threat mentioned, the concern for the sister's safety elevates the risk level.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 00:44:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just want to know if anyone else feels like they're just going through the motions. Talking feels impossible, but I need to reach out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and disconnected, but does not contain explicit threats or plans for self-harm or harm to others. The individual expresses a desire to reach out, which suggests a potential for seeking help.",
    "detected_category": "other",
    "timestamp": "2026-01-04 00:43:33"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Didn't know what to do. Has anyone else been in that situation? Feel helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can have psychological effects. While the poster wasn't directly harmed, the event was disturbing and caused distress. The potential for escalation of violence exists, even if the poster isn't directly involved.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 00:42:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately, urges are back. Trying to distract myself but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges and feelings of being low, suggesting potential self-harm ideation, although not explicitly stated. The person is seeking support, indicating some level of awareness and a desire to cope.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-03 23:17:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, and just talking helped a little. Still feels like a long road.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating active ideation and potential risk. While the person reached out for help and felt a slight improvement, the feeling of a 'long road' suggests ongoing vulnerability and the need for continued support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-03 23:16:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so lost lately. Like I'm underwater. Reaching out before I can't anymore. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, using the metaphor of being underwater and reaching out before it's too late. This suggests a potential for self-harm or suicidal ideation, warranting further assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-03 23:15:32"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up bad. Reminded me of my brother, and how angry he used to get. Anyone else deal with lingering trauma from family violence? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and experiencing emotional distress related to past family violence. While upsetting, it doesn't express imminent danger to self or others, nor does it describe ongoing violence or abuse.",
    "detected_category": "other",
    "timestamp": "2026-01-03 23:14:31"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Managed not to, but the urge was strong. Reaching out to my therapist today. It's exhausting fighting this.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a strong urge related to an unspecified negative feeling (likely self-harm or suicidal ideation). While the person managed to resist the urge, the intensity and active seeking of help suggest a moderate level of risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-03 23:13:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital. OD'd last week. Scariest thing ever. Please, if you're struggling, reach out. Don't let it get this far. I almost lost everything.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The individual reports a recent overdose, indicating a serious and potentially life-threatening event. The phrase \"almost lost everything\" also suggests a significant impact.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 23:12:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "Ugh. Another fight. Walking on eggshells all the time. I feel so drained. Anyone else ever feel like they're losing themselves in their relationship? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses emotional distress and a feeling of being drained, but it doesn't contain any explicit threats or plans for self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2026-01-03 23:11:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank goodness. Made me realize how close we all are to the edge. Get trained, carry it. You could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the immediate risk to the author isn't explicitly stated, the text describes a potentially fatal overdose situation experienced by someone nearby. This suggests a risk of overdose in the surrounding environment, and the author's proximity to this event makes it a medium risk. The call to action to get Narcan training and carry it reinforces the likelihood of future events.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 23:10:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Scariest night of my life. Narcan saves lives. Please, if you or someone you know is struggling, carry it. Learn how to use it. It's not worth the risk. #overdose #naloxone #harmreduction",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose, indicating a high level of risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 23:09:22"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Dude was really hurt. Makes you think, you know? Is there anywhere safe anymore? Anyone else feel like things are escalating lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is disturbing but doesn't indicate immediate or direct threat to the speaker or others. It expresses concern and anxiety about general safety, but lacks specifics pointing to a high-risk situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-03 23:08:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n>  Felt so overwhelmed today.  Urges were strong.  Didn't act, but it was close.  Anyone know resources that actually help in the moment?  Feeling lost.\n\n**Option 2 (Sharing Experience):**\n\n>  2 weeks clean. Longest in a while. Still shaky, but taking it day by day. Small wins matter, right?\n\n**Option 3 (Raising Awareness):**\n\n>  It's not attention-seeking. It's a coping mechanism.  If you're judging, you're part of the problem.  Listen instead.\n\n**Important Considerations:**\n\n*   These are very brief examples. A real conversation would likely be more nuanced.\n*   Anyone expressing these feelings should be met with support and resources.\n*   If you or someone you know is struggling with self-harm, please reach out for help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates strong urges and feeling close to acting, suggesting imminent risk. Option 2 shows progress but ongoing instability. Option 3 addresses coping mechanisms associated with potential self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-03 22:17:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Naloxone saved them, but it could've been so different. Learn CPR, carry Narcan. It's a lifesaver.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potential for life-threatening situations. While naloxone was effective in this instance, the risk of fatal outcomes remains.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 22:16:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "**(Option 1: Seeking Help)**\n\n> Feeling so lost lately. Like I'm underwater. Anyone know of good resources for when you just... don't want to be here anymore?\n\n**(Option 2: Sharing a personal story)**\n\n> Hard week. Anniversary of my brother's passing. Suicide is a thief. Reach out to your loved ones, please.\n\n**(Option 3: Raising awareness)**\n\n> Just want to remind everyone to be kind. You never know what someone is going through. A little support can go a long way.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Option 1 directly expresses suicidal ideation ('don't want to be here anymore') and seeks resources, indicating immediate distress.",
    "detected_category": "suicide",
    "timestamp": "2026-01-03 22:15:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. They're okay now, thankfully. Makes you realize how fragile life is. If you're struggling, please reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event. While the person survived, the incident highlights the presence of substance use and potential for future harm, suggesting a need for support and awareness.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 22:14:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a friend get Narcan'd. Scariest thing ever. Please, if you're using, even occasionally, carry it. And tell someone. This shit is real.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent, direct experience of a friend experiencing an overdose requiring Narcan administration. The use of phrases like \"Scariest thing ever\" and \"This shit is real\" conveys a sense of urgency and imminent danger.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 22:13:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a bit. Remember we're not alone in this. There's help out there. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, which is a significant risk factor. While the individual reached out to a friend, indicating some coping mechanisms, the intensity of the urge warrants a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-03 22:12:10"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get punched outside my building. Shook me up. Called 911 but still feel sick. Anyone else ever witness something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be distressing and have psychological impact. While the original poster (OP) was not the target, the event caused a negative emotional reaction indicating a potential impact on mental well-being.",
    "detected_category": "violence",
    "timestamp": "2026-01-03 22:11:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got too much & I relapsed. Feeling so ashamed, but trying to be kind to myself. I'm reaching out for help again. It's a long road, but I'm not giving up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse and feelings of shame, suggesting a potential vulnerability and a need for support, but the person is also actively seeking help and expressing a desire to continue fighting.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-03 22:10:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Reached out to a friend, feels a little better to not be alone with it. Still scary.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges (unspecified, but concerning), suggesting a potential for self-harm or other negative behaviors. Reaching out is a positive coping mechanism, but the feeling of fear suggests the urges are still strong and potentially dangerous.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-03 22:09:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately.  Little urges are back, and I hate it. Trying to distract myself, but it's hard. Anyone else relate? Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of 'little urges,' suggesting a potential relapse into harmful behaviors. While not explicitly stating suicidal or self-harm intentions, the feelings of being overwhelmed, alone, and struggling to distract oneself raise concern and warrant monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-03 22:08:03"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on my street. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel like their neighborhood's changed lately? Feeling unsafe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text reports witnessing a fight and expresses feelings of unsafety and concern about neighborhood changes, suggesting a potential increase in local violence or instability. While not directly threatened, the user's anxiety and perceived risk indicate a moderate level of concern.",
    "detected_category": "violence",
    "timestamp": "2026-01-03 21:16:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Rough night. Urges were strong. Feeling drained and alone. Anyone else relate? How do you cope?\n\n**Option 2 (Personal Story):**\n\n> 3 months clean. Didn't think I'd make it this far. Still have bad days, but fighting. There's hope.\n\n**Option 3 (Raising Awareness):**\n\n> Seeing a lot of jokes about self-harm lately. It's not a joke. It's a real struggle for many. Be kind.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates active urges and feelings of isolation which are risk factors for self-harm or suicide. Option 3 highlights the normalization of jokes about self-harm which can be triggering.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-03 21:15:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things aren't good at home. Constant put-downs... I feel so small. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 51 (char 76)",
    "detected_category": "unknown",
    "timestamp": "2026-01-03 21:14:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Narcan saved them, but it shook me up bad. Makes you realize how close this stuff is. Anyone else feel like we need more resources in our community?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event indicating potential harm and proximity of substance use. While the individual survived due to Narcan, the incident highlights a risk in the community and potential for future overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 21:13:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"He's been isolating me from my friends lately, saying they're 'bad influences.' Makes me feel so alone. Is this normal? I don't know what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Isolation from friends is a common tactic in abusive relationships, potentially escalating to further control and harm. The person expresses feeling alone and unsure, indicating emotional distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-03 21:12:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant yelling, controlling behavior... Feels like I'm walking on eggshells. Anyone else been through this? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially abusive environment characterized by controlling behavior and constant yelling, creating a stressful and isolating situation. While there's no direct mention of violence, self-harm, or suicide, the description of 'walking on eggshells' and feeling 'lost' suggests significant emotional distress and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-03 21:11:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were strong, but I distracted myself with a movie. Small win, I guess. Anyone else get that 'almost gave in' feeling?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates the person experienced strong urges (unspecified), but actively distracted themselves. While concerning, there is no immediate threat indicated and the individual is seeking connection and validation, suggesting they are trying to cope.",
    "detected_category": "other",
    "timestamp": "2026-01-03 21:10:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about Mac Miller still hits hard. Lost a friend last year the same way. Naloxone training saved my life. Learn it. Carry it. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a personal loss due to overdose and advocates for Naloxone training, suggesting a potential risk of overdose, though not necessarily imminent.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 21:09:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Called 911, they're ok now. Learn to recognize the signs. Naloxone saves lives. Please be careful.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person who overdosed is now okay, the text indicates a recent overdose event, highlighting the potential for future overdoses and the need for awareness and preventative measures. The situation required emergency intervention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 21:08:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so lost lately. Like I'm underwater. Reaching out to a friend, hoping it helps. It's so hard to keep going sometimes.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and struggling to keep going, suggesting potential for escalating distress and need for support. Implies passive suicidal ideation but no active plan.",
    "detected_category": "suicide",
    "timestamp": "2026-01-03 21:07:33"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling really low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Any advice on finding help that actually understands?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of depression and acknowledges needing help, which suggests a potential for escalation if left unaddressed. The phrase 'dark cloud won't lift' implies persistent negative feelings.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-03 20:18:05"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy get shoved on the train platform. Scared me half to death. Is this normal now? Feeling shaky and anxious.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical assault occurred (shoving) which could have resulted in serious injury or death, though the specific outcome is unknown. The witness also expresses significant emotional distress (scared, shaky, anxious).",
    "detected_category": "violence",
    "timestamp": "2026-01-03 20:17:03"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a fight break out downtown. Shaken up. Reminded me of things I've been trying to forget. Anyone else feel this way after witnessing violence?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be distressing and trigger negative emotions, but the text doesn't indicate immediate danger or intent to harm self or others. It primarily expresses being shaken and reminded of past traumas.",
    "detected_category": "other",
    "timestamp": "2026-01-03 20:16:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, thank god. Makes you realize how fragile life is. Please, be careful out there. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, indicates potential exposure to a life-threatening situation and highlights the prevalence of drug-related risks in the surrounding environment. The mention of 'scariest thing ever' suggests significant emotional impact.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 20:15:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... feeling trapped. Anyone else been through this? Where do I even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation indicating potential emotional abuse and a feeling of being trapped, which raises concern for the individual's well-being. While not explicitly stating intent to harm self or others, the context suggests a significant level of distress and need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-03 20:13:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park yesterday. Scary stuff. Paramedics got there quick, thankfully. Makes you realize how fragile things are. Learn the signs, people. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be traumatic and indicates a potential risk of further overdoses in the area, although the individual received medical attention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 20:12:57"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Trying to remember my coping skills but it's hard. Anyone else relate? Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions the return of urges and feelings of isolation, suggesting a potential escalation of distress. While not explicitly stating intent to harm, the difficulty in using coping skills indicates increased vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-03 20:11:55"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> Things at home are getting scary. Constant yelling, then silence. I feel so trapped. Is this normal? Anyone else go through this?\n\n**Option 2 (Sharing a Story):**\n\n> I used to think love meant control. It doesn't. It's been 6 months since I left, and I'm finally feeling like myself again. You deserve better.\n\n**Option 3 (Raising Awareness):**\n\n> Isolation is a weapon. Abusers cut you off from support. Don't let them. Reach out to someone, anyone. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 describes a potentially escalating situation with yelling and feelings of being trapped, suggesting a risk of abuse or violence. While not explicitly stated, the situation warrants concern and suggests a need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-03 20:10:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Scary night. Found my roommate unresponsive. Narcan saved their life. Please, if you're using, even occasionally, carry it. It's free and could save someone you love.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a high risk event.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 20:09:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out to a friend tonight. Hope it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed ('Everything feels heavy'). While the individual is reaching out for help, these feelings can be indicative of a deeper struggle and warrant further attention. The phrase 'It's okay to not be okay, right?' shows acknowledgement of distress, which can be present in more serious cases.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-03 20:08:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "```\nBeen feeling so isolated lately. Constant put-downs, controlling behavior... Is this normal in a relationship? Starting to think maybe not. Anyone else been through this? Feeling lost.\n```",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feelings of isolation and controlling behavior, which are indicators of potential abuse. While there's no explicit mention of violence or intent to harm self or others, the feelings of being 'lost' and questioning the relationship's normalcy suggest emotional distress and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-03 19:15:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post addressing suicide, focusing on help-seeking:\n\n\"Things have been really dark lately.  Reaching out because I need to remember I'm not alone.  Anyone know good resources for when you just feel...empty?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post expresses feelings of darkness and emptiness, and acknowledges a need for help. While it's not explicitly suicidal, the language used indicates a significant level of distress and potential risk. The user is actively seeking resources, which is a positive sign, but the severity warrants attention.",
    "detected_category": "suicide",
    "timestamp": "2026-01-03 19:14:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good lately. Walking on eggshells constantly. Is this normal? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 89 (char 114)",
    "detected_category": "unknown",
    "timestamp": "2026-01-03 19:13:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Please, if you're using, even just sometimes, carry Narcan. It saves lives. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event, indicating a high potential for serious harm or death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 19:12:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thank goodness. Makes you realize how fragile life is. Get help if you need it, please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose, a potentially life-threatening situation. While Narcan was successful, the event highlights a significant risk to individuals struggling with substance use.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 19:11:49"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight break out downtown last night. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potential safety risk. While it caused distress, there is no indication of direct threat or intent to harm oneself or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-03 19:10:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Trying to distract myself, but it's hard. Anyone else relate? Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting) and feelings of loneliness. While there is no immediate plan or explicit intent, the presence of the urge and inability to easily distract oneself elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-03 19:09:46"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get jumped on my way home. Shook me up bad. Didn't know what to do. Is there somewhere to report something like that anonymously? Feeling so helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent assault is psychologically distressing and indicates a risk of violence in the area. While the individual wasn't directly harmed, the event caused significant emotional distress and concern.",
    "detected_category": "violence",
    "timestamp": "2026-01-03 19:08:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after a few months clean. Feeling incredibly disappointed in myself. Reaching out to my therapist today. It's a tough cycle.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential escalation of mental health distress. While the individual is reaching out for help, the relapse itself presents a moderate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-03 19:07:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved their life. Please, if you or someone you know is struggling, get help. It's out there. Don't wait.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan intervention was successful, the overdose event itself indicates a significant risk to life. The text also highlights the potential for recurrence and the importance of seeking help.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 19:06:42"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Frozen. Didn't know what to do. Feel sick. Has anyone else been in this situation? What CAN you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault (shoving) indicates a potential for escalation of violence and possible injury. The observer's emotional distress suggests a significant impact, highlighting the seriousness of the situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-03 18:20:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to talk to someone. Any advice on finding affordable therapy?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of depression and acknowledges a need to talk to someone, seeking affordable therapy. This indicates a potential risk of escalation if support isn't received, but there are no explicit mentions of self-harm or suicide.",
    "detected_category": "other",
    "timestamp": "2026-01-03 18:19:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's hard to admit, but things at home haven't been good. Constant put-downs, isolating me from friends... Is this normal? Feeling so lost and alone. Any advice or resources would be appreciated.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, which are risk factors for mental health issues. While not explicitly mentioning self-harm or suicide, the feelings of being 'lost and alone' warrant concern and further investigation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-03 18:18:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... rough. Walking on eggshells all the time. Anyone else experience this? Feeling so alone. Need to figure out my next steps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and potentially volatile home environment ('walking on eggshells'). While not explicitly stating harm, the feelings of isolation and need to plan 'next steps' suggest a need to escape or resolve a stressful situation which could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-03 18:17:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but it made me realize how close we all are to losing someone. Where can I learn more about helping in these situations?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be traumatizing and highlights the prevalence of drug-related emergencies. The individual is seeking information on how to help, suggesting concern and a desire to intervene in future situations.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 18:16:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Narcan saved him. Scariest night of my life. Please, learn the signs of OD & carry Narcan if you can. It really works.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a severe and immediate health risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 18:15:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, walking on eggshells... I'm starting to feel worthless. Anyone else been through this? How did you cope? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional distress due to constant put-downs and feeling worthless, suggesting an abusive environment and potential for escalation of mental health issues.",
    "detected_category": "abuse",
    "timestamp": "2026-01-03 18:14:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to feel *something* is to hurt. I know it's not healthy, but it's hard to stop. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses thoughts of self-harm as a coping mechanism, indicating a potential for harm. While it doesn't explicitly mention suicide, the link between feeling nothing and hurting oneself is concerning.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-03 18:13:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed yesterday. Didn't cope well. Reached out to a friend, which helped a little. Still feeling shaky today. Anyone else get through this? How?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of being overwhelmed and not coping well, suggesting emotional distress. While the individual reached out for help, they are still feeling shaky, indicating the distress is ongoing. This suggests a need for continued support and monitoring.",
    "detected_category": "other",
    "timestamp": "2026-01-03 18:12:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges are strong. Just trying to breathe and remember I've gotten through this before. Grateful for the crisis line. #selfharm #mentalhealth \"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges related to self-harm, though the individual is actively using coping mechanisms (breathing, remembering past successes, crisis line). This suggests an elevated risk but also active engagement in self-preservation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-03 18:11:21"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train platform. Scared me senseless. Is everyone okay lately? Feels like so much anger everywhere. #violenceprevention #safety",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was physically assaulted (shoved), indicating a potential for injury. While the extent of injury is unknown, the act itself constitutes violence and poses a risk to public safety.",
    "detected_category": "violence",
    "timestamp": "2026-01-03 17:16:33"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Seriously, learn how to use it. Could save a life. #overdoseprevention",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was successful, the text describes a recent overdose event, indicating a potential for future occurrences and highlighting the seriousness of the situation. The immediate threat has passed, but the risk remains.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 17:15:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about another OD. Makes me sick. Lost my cousin last year, same thing. If you're struggling, please reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses grief and encourages seeking help, but doesn't indicate imminent risk to the author or others. It mentions a past overdose death, but only in the context of loss and advocacy.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 17:14:30"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on the way home. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling, but doesn't indicate the individual is in immediate danger or planning harm to themselves or others. There's a general feeling of being 'on edge' which suggests anxiety, but it's not expressed in a way that indicates imminent crisis.",
    "detected_category": "other",
    "timestamp": "2026-01-03 17:13:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Getting yelled at constantly, feeling worthless... Does anyone else go through this? I don't know what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and feelings of worthlessness, indicating potential for escalation to self-harm or suicidal ideation. The user is seeking help, suggesting they are struggling to cope.",
    "detected_category": "abuse",
    "timestamp": "2026-01-03 17:12:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Trying to reach out instead of giving in. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential risk of self-harm or other negative coping mechanisms. The individual is reaching out for help, which is a positive sign, but the presence of urges elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-03 17:11:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Things got really dark last night, and I hurt myself again. I hate this. I'm trying to find a therapist, but it's so hard. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates recent self-harm, feelings of being overwhelmed and experiencing a 'dark' period, and a cry for help while seeking professional help. This combination suggests an elevated risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-03 17:10:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mentions of self-harm, suicide, violence, abuse, or overdose. The user is reaching out for support, which suggests they are not immediately acting on harmful thoughts.",
    "detected_category": "other",
    "timestamp": "2026-01-03 17:09:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw my neighbor being taken away by ambulance. Think it was OD. Scared. This is happening too much. Is there anyone I can talk to who understands? Need some support.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a possible overdose situation involving a neighbor, causing the author distress and a need for support. While the author is not directly expressing harm to themselves, the second-hand exposure to a potentially life-threatening event and the expressed fear and need for support elevates the severity beyond low.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 17:08:20"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about overdose deaths again. Lost a friend last year, still hurts. If you're struggling, please reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references overdose deaths and expresses grief from losing a friend, suggesting potential vulnerability and emotional distress. While it encourages seeking help, the mention of overdose and personal loss elevates the risk beyond a simple expression of sadness.",
    "detected_category": "overdose",
    "timestamp": "2026-01-03 17:07:18"
  }
]