[
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just want to know if anyone else feels like they're drowning sometimes. It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and exhausted, using the metaphor of 'drowning.' While it doesn't explicitly mention self-harm or suicide, the intense negative emotion and feeling of being overwhelmed suggest a potential risk that warrants further attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 17:17:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scary night. Found my brother unresponsive. Narcan saved him. Please, if you're using, have someone with you and carry Narcan. It works. Where can I get more for free?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Brother found unresponsive and required Narcan, indicating a life-threatening overdose situation. Repeated overdose is likely without intervention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 17:16:11"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just a heavy cloud. Reaching out to a friend, hoping it lifts soon. It's okay not to be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but there are no explicit indications of self-harm, suicide, or violence. The individual is reaching out for support, suggesting a willingness to cope.",
    "detected_category": "other",
    "timestamp": "2025-12-26 17:15:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Felt so overwhelmed today. Urges were strong. Managed to distract myself, but it's exhausting. Anyone else relate? How do you cope?\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Clean for 3 weeks. Small victory, but it feels huge. Still struggling, but trying to focus on the progress.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"It's not about attention. It's about pain. Please be kind to those who are struggling. You never know what someone's going through.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses strong urges, indicating a potential risk. Options 2 and 3 are less severe, but collectively, the presence of urges suggests a concerning situation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 17:14:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. It's terrifying. Lost a friend last year. If you're struggling, please reach out. There's help available. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a recent overdose death and past loss of a friend, indicating a local problem with drug use and the potential for others to be at risk. While the text encourages seeking help, the mention of a recent overdose and personal loss elevates the risk level.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 17:13:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but it was too close. Learn the signs, people. It could be someone you love. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a potentially fatal overdose event requiring emergency intervention (Narcan). While the person survived, the event's intensity and risk to life are significant.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 17:12:04"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy get punched outside my building. Shook me up. Called the cops, but feeling really anxious now. Anyone else witness this? Need to talk.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While a violent act occurred, the text describes witnessing the event and experiencing anxiety, not direct threat or participation. The author contacted the police, indicating appropriate action.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 17:11:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nScared. Found my brother unresponsive last night. Narcan saved him, but it was so close. Please, learn the signs of OD. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Brother experienced a near-fatal overdose requiring Narcan, indicating a significant and immediate health risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 17:10:00"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on the bus. Shaken up. Is it just me, or is everyone on edge lately? Makes you wonder...\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be upsetting, but the text doesn't indicate direct involvement or ongoing threat. The person expresses being shaken up but does not indicate they are in immediate danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 17:08:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my kid's school. So scary. Makes you wonder what's going on in people's lives. Wish there was more support available.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight near a school indicates a potential risk of violence escalating or involving others, including children.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 17:07:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so lost lately. Like I'm just going through the motions. Reaching out because I don't know what else to do. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and going through the motions, indicating distress but lacks any explicit mention or direct implication of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2025-12-26 16:18:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "I feel so lost. Things at home have been bad lately. He yells all the time, and last night... I just don't know what to do anymore. Is this normal?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential domestic abuse (yelling), suggesting a need for support and further assessment. The user expresses feeling 'lost' and questioning the normality of their situation, hinting at a potential crisis.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 16:17:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Like I'm underwater. Reaching out to a friend, hoping it helps. It's so hard to keep going sometimes.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 60 (char 85)",
    "detected_category": "unknown",
    "timestamp": "2025-12-26 16:16:48"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train. My heart is still racing. Is there anything I could have done? Feeling so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person posting wasn't directly harmed, they witnessed a violent act (shoving) on a train. This indicates a potential risk of violence to others in the environment and caused distress to the witness.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 16:15:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just realized this isn't normal. He yells, then cries & says he's sorry. It's a cycle. Anyone else experience this? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a concerning cycle of yelling, crying, and apologizing, which could indicate a pattern of abuse or emotional instability. The user also expresses feeling lost, suggesting a lack of support and potential vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 16:14:45"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight downtown. Shook me up. Reminded me of things at home growing up. Anyone else feel like that sometimes? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling, and expresses feeling shaken. It elicits shared feelings and coping mechanisms. The potential for imminent harm seems low.",
    "detected_category": "other",
    "timestamp": "2025-12-26 16:13:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, controlling behavior... I feel so isolated. Anyone else gone through this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress due to controlling behavior and put-downs, potentially indicating abuse and feelings of isolation. While not explicitly stating intent to harm self or others, the feeling of being 'lost' and the description of the situation warrant concern and a need for further assessment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 16:12:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scared me. Narcan worked, thank god. Makes you realize how fragile life is. Anyone else feel like this is happening too often? Need to find a better way.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event that can have psychological impact. While Narcan was effective, the event points to a serious public health issue and potential for future overdose incidents.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 16:11:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Please, if you're using, even occasionally, carry Narcan. It could save a life. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event, indicating a very high risk of death. The mention of Narcan strongly suggests opioid overdose.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 16:10:38"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a fight break out at the bus stop. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text indicates a personal reaction (feeling shaken) rather than imminent danger to the author or others. No specific threats are mentioned.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 16:09:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I feel so alone. He says he loves me, but then he yells & calls me names. It's getting worse. Is this normal? I don't know what to do anymore.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional and verbal abuse, which is escalating and causing distress. While there's no explicit mention of physical harm or immediate danger, the user's feelings of isolation and despair warrant concern and further assessment for potential risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 15:17:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but shook me up bad. Learn CPR, carry Narcan. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose was successfully reversed, the event highlights the presence of a serious risk (overdose) and the potential for future occurrences affecting the reporter or others. The call to action to learn CPR and carry Narcan suggests an ongoing concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 15:16:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight, hope it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed ('underwater'), and implicitly acknowledges struggling ('It's okay to not be okay, right?'). While it shows an attempt to cope by reaching out to a friend, the intensity of the distress warrants a 'medium' severity rating, requiring further assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 15:15:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm underwater. Reaching out before I sink further. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and sinking, suggesting a potential risk of worsening mental health. The act of reaching out is positive, but the depth of the negative feelings warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 15:14:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to a friend helped a little, but it's still hard. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but also mentions seeking support from a friend. While concerning, there's no explicit mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2025-12-26 15:13:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly low lately. Just reaching out to say if you're struggling, you're not alone. Talking helps, even if it feels impossible. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses low mood and encourages seeking help, but there's no explicit mention of self-harm or suicidal ideation. It's a general message of support.",
    "detected_category": "other",
    "timestamp": "2025-12-26 15:12:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are getting stronger. Anyone else relate? Just trying to get through it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates increasing urges, suggesting a potential escalation of a negative situation. While the exact nature of the urges is unclear, the statement 'trying to get through it' implies a struggle and a possible risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 15:11:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Cleaned the cuts, but feeling so ashamed. Reached out to a crisis line. Hoping they can help me get through tonight. Just needed to tell someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates self-harm (cuts) and a high level of emotional distress, requiring immediate support and intervention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 15:10:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thank god. Makes you realize how fragile things are. Anyone know where I can learn more about overdose prevention?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a moderate risk level due to potential vicarious trauma and increased awareness of the issue, leading to questions about prevention. The fact that Narcan was used indicates a life-threatening situation occurred. The individual is now seeking information on overdose prevention, which suggests a potential increased awareness and concern for themselves or others.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 15:09:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Shook me up. Said something but I froze. Anyone else ever feel helpless in those situations? Wish I'd done more.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence (pushing) in public, indicating potential for escalation. The observer's distress suggests a non-trivial impact.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 15:08:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\nIt's so hard to admit, but things at home have been bad lately. Walking on eggshells constantly. Anyone else feel like they're losing themselves? Need to find some support.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially unsafe home environment where the individual feels they are 'walking on eggshells.' This suggests potential emotional or psychological abuse. The feeling of 'losing themselves' also points to a decline in mental well-being and a need for support.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 14:18:03"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. My heart's still racing. Wish I'd said something, but I froze. Anyone else ever feel that helpless? What can you even DO?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an instance of violence (shoving). While it's a single instance and the partner's condition is unknown, physical violence always carries a risk of injury.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 14:17:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD downtown. Scary stuff. Narcan saved their life, but it makes you think. Please, if you're struggling, reach out. There's help available. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan reversed the overdose, the event indicates a significant risk of future overdose or other harm related to substance abuse. The user expresses concern and encourages seeking help.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 14:16:00"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight outside my kid's school. Makes me sick. Is everyone okay? How do we stop this from happening again? Feeling so helpless right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight, especially near a school, indicates potential for physical harm to individuals, including children. While the text doesn't specify injuries, the strong emotional response ('makes me sick', 'feeling so helpless') suggests a distressing event with potential for escalation or future incidents.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 14:14:58"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Seriously shaken up. Dude got clocked hard. Makes you think, you know? How do you even process something like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence is unsettling and can cause anxiety, but the text doesn't indicate imminent danger to the speaker or others. The speaker expresses reflection, not necessarily a plan or desire to engage in violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 14:13:57"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been isolating me from friends & family, and the yelling...it's constant. Is this normal in a relationship? Feeling lost and scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Isolation, constant yelling, and fear are significant indicators of escalating abuse. The victim is expressing being 'lost and scared,' signaling significant distress and potential danger.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 14:12:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and drowning, indicating significant emotional distress and a potential risk of escalation if not addressed. The phrase 'don't know what else to do' suggests a lack of coping mechanisms.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 14:11:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "Ugh, another fight. Walking on eggshells constantly. Is this normal in a relationship? Feeling so drained. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses emotional distress and fatigue due to relationship conflict, but it lacks any explicit or direct indicators of immediate danger or harm to self or others.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 14:10:52"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight downtown last night. Scary how quickly things escalated. Made me realize how important it is to de-escalate situations, not add fuel to the fire. Anyone else ever witness something like that? Still shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate immediate danger or direct involvement. The user expresses being shaken up, but no intention of harm to self or others is implied.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 14:09:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary how quickly things escalated. Shaking still. Anyone else witness that? Feeling really unsafe now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent event can be psychologically distressing and lead to feelings of unsafety and anxiety, suggesting a potential for negative mental health impacts. While there's no immediate physical danger to the individual based on the text, the reported shaking and feeling unsafe indicate a significant emotional response.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 14:08:49"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes a witnessed act of violence (assault), there's no indication of direct threat to the speaker or imminent danger. The speaker expresses being 'shook up' and 'on edge,' suggesting psychological impact, but not necessarily immediate physical risk. The escalation to unconsciousness suggests the potential for severe physical harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 13:26:56"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but doesn't contain explicit statements of self-harm or suicidal intent. The user is reaching out for help, suggesting a desire to connect rather than harm themselves.",
    "detected_category": "other",
    "timestamp": "2025-12-26 13:25:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just feeling so lost. Things at home have been...rough lately. Walking on eggshells all the time. Anyone else ever feel like they're losing themselves?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and general distress, but lacks specific mentions of self-harm, suicide, violence, abuse, or overdose. The user is describing feeling emotionally strained and disconnected from themself, which indicates a potential risk but does not suggest imminent danger.",
    "detected_category": "other",
    "timestamp": "2025-12-26 13:24:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately.  Little urges are back, and I'm trying so hard to resist.  Anyone else relate?  Just feeling really alone right now.  Need to remember my coping skills.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions the return of 'little urges' which the person is trying to resist, suggesting potential self-harm or relapse. Feeling overwhelmed and alone increases the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 13:23:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing on the street. Escalated so fast. He shoved her, I froze. Wish I'd done something. Anyone else ever feel that helpless?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence (shoving) occurred, indicating potential for further escalation and harm to the victim. The observer also expresses distress, suggesting a potentially impactful event.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 13:22:49"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to distract myself, but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, implying previous struggles and a potential escalation of risk. While the individual is trying to distract themselves, the statement \"it's hard\" suggests the coping mechanisms are failing.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 13:21:48"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the park. Shook me up bad. My hands are still trembling. Is there somewhere safe to talk about this? Feeling really lost right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight can be traumatizing and cause significant distress. The trembling hands and feeling 'lost' suggest a need for support and processing the event.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 13:20:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw another ambulance downtown. Makes you think, you know? Lost a friend last year to an OD. Narcan saves lives. Carry it, learn how to use it. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a past overdose death and encourages carrying Narcan, indicating an ongoing risk of overdose events. While not explicitly stating an immediate threat, the implicit concern and call to action elevate the severity.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 13:19:45"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel anxious after witnessing something like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be distressing and cause anxiety, but the text doesn't suggest ongoing threat or intent to harm self or others.",
    "detected_category": "other",
    "timestamp": "2025-12-26 13:18:43"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. This keeps happening, feel like I'm losing it. Is there anywhere to go when you feel unsafe walking home?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and a feeling of unsafety in a public place, and expresses a sense of losing control due to repeated violent events. The user is also seeking a safe place, indicating a need for immediate assistance.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 13:17:42"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, suggesting potential for violence, but doesn't indicate direct involvement or personal threat to the author or others. There is a general feeling of unease expressed, but no specific imminent danger is mentioned.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 12:23:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just reaching out... anyone else ever feel like they're just going through the motions? It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and exhausted, which are indicative of low mood and potential distress, but does not contain any explicit threats or plans for self-harm.",
    "detected_category": "other",
    "timestamp": "2025-12-26 12:22:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Trying to resist but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges, suggesting a potential for self-harm. While the individual is attempting to resist, the struggle implies a risk that needs attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 12:21:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just realized the constant put-downs aren't normal. Feeling so lost and confused. Is this abuse? Anyone else experience this? Need to figure out what to do next.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential abuse, which can escalate to more serious harm if not addressed. The individual is seeking help and acknowledging something is wrong, but the uncertainty and confusion increase the risk level.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 12:20:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, and it helped a little. Remember you're not alone. Talking really does make a difference. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a high level of immediate risk. While the person reached out for help, the presence of the urge itself warrants high severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 12:19:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about overdose deaths is scary. My friend almost died last year. It can happen to anyone. Please be careful & look out for each other. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions overdose deaths and a friend's near-fatal overdose, indicating a real and potentially life-threatening risk. The call for caution and recognizing signs also suggests awareness of potential danger.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 12:18:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so numb lately. Urges are back, stronger than before. Reached out to the crisis line. Just gotta keep breathing.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a return of strong self-harm urges and feelings of numbness. While the person reached out for help, the presence of strong urges signifies a high risk of acting on them.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 12:17:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. This hits hard. Lost a friend last year. Please, if you're struggling, reach out. There's help available. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a recent overdose death and expresses concern, indicating a potential risk of overdose within the community, even though it doesn't directly indicate imminent harm to the author. The mention of losing a friend suggests a personal connection to the issue, increasing the potential impact.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 12:16:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "I keep making excuses for him. Said he was stressed, tired. But the yelling's getting worse, and now... I don't know what to do anymore. Is this normal? Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates escalating verbal abuse (yelling getting worse) and the speaker's uncertainty and distress. While there's no explicit mention of physical violence, the escalating nature and the speaker's feeling of helplessness suggest a potentially dangerous situation. Further investigation would be needed to assess the risk of violence.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 12:15:42"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just need to vent. Said it was \"just a joke\" again after yelling. Makes me feel so small. Anyone else deal with this? How do you cope? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and a feeling of being lost, which suggests potential for escalation or negative coping mechanisms.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 12:14:40"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Scary how quickly things escalated. Makes you think, you know? Stay safe out there, everyone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text mentions a fight, indicating potential violence, but provides no specific details about injuries, weapons, or ongoing threats. It expresses concern and a general warning, but lacks immediate urgency or specifics that would suggest a higher risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 11:17:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just realized yelling & insults every day IS abuse. I thought it was just \"how he is.\" Feeling so lost & confused. Anyone else gone through this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of ongoing verbal abuse, which can have significant psychological impact and potential for escalation. While there's no immediate threat of physical harm mentioned, the emotional distress warrants a medium severity rating.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 11:16:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank goodness. Learn the signs, people. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be psychologically distressing and indicates the presence of a significant public health issue with potential for further harm, although the individual was saved.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 11:15:35"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, but it really shook me up. Knowing it could happen to anyone... makes you think. Is there anything *I* can do to help prevent this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and highlights the risk of overdose in the community. While the individual survived due to Narcan, the event caused emotional distress and prompted a desire to help prevent future occurrences.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 11:14:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm so tired of feeling small. He yells, then apologizes, then does it again. Is this normal? I feel like I'm losing myself. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential cycle of verbal abuse (yelling followed by apologies). The user expresses feeling diminished and losing themselves, suggesting emotional distress. While there's no explicit mention of physical harm, the repeated yelling can escalate and the emotional impact poses a risk to mental well-being.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 11:13:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. Walking on eggshells constantly. Anyone else ever feel like they're just waiting for the next explosion? Need to figure out how to cope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a home environment characterized by fear and tension, suggesting potential emotional or verbal abuse and a heightened risk of escalation to physical violence. The phrase 'walking on eggshells' indicates a constant state of anxiety and potential danger.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 11:12:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank goodness. Makes you think. Please, if you're struggling, reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event which carries inherent risk of death or serious health complications, even though Narcan was administered successfully. The reference to struggling and reaching out indicates awareness of potential harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 11:11:29"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately, urges are back. Trying to distract myself but it's hard. Anyone else relate? Just need to know I'm not alone rn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges which, coupled with feelings of being low, suggests a potential risk of self-harm. While the person is trying to distract themselves, the struggle indicates that they are having difficulty coping.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 11:10:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Need to find a way back up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed ('underwater'). The phrase 'need to find a way back up' implies a struggle and a desire to escape a negative state, suggesting potential but not immediate risk. The user reaching out indicates a willingness to seek help.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 11:09:26"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on Elm St. Shook me up. Didn't know what to do, wish I'd intervened. Anyone else ever witness something like that? Still feeling sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault (shoving) indicates a potential for escalating violence or further abuse, though no direct injury is explicitly stated. The emotional distress also contributes to the medium severity.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 11:08:24"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so incredibly lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Has anyone else felt this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and a cry for help. While not explicitly stating suicidal intent, the metaphor of being underwater suggests a feeling of being overwhelmed and potentially struggling, warranting further investigation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 10:18:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed, and seeking help, suggesting distress but no explicit suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2025-12-26 10:17:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I keep making excuses for him, but the yelling is getting worse. Last night he cornered me... I don't know what to do. Is this normal? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes escalating verbal abuse and being cornered, suggesting a high risk of physical harm and emotional distress. The individual expresses feeling lost and uncertain, indicating a vulnerable state.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 10:16:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Talking to my therapist tomorrow, but tonight is rough. Just needed to say it out loud.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant and immediate risk to the individual's safety.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 10:15:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating potential emotional distress and a need for support. The metaphor 'underwater' suggests a struggle to cope. Reaching out for help is a positive sign, but the lack of specific details warrants caution.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 10:14:39"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to quiet the noise, y'know? Been clean for a bit, but the urges are strong tonight. Reached out to a friend. Just gotta keep breathing.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges to relapse after a period of sobriety, and indicates significant emotional distress. While the individual has reached out for help and is focusing on breathing, the risk of relapse and potential associated consequences (which could include overdose or self-harm) is elevated.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 10:13:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scared me. Narcan worked, thank god. This stuff is everywhere. Please, learn the signs. It could save a life, or yours.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose incident, implying a risk of fatal outcome, although it was averted in this instance. The statement about the prevalence of the substance and the call to learn the signs suggests a broader risk to the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 10:12:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. I feel so stupid for letting it. I don't know what to do anymore. Anyone else been through this? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness, repeated negative experiences, and a lack of control. The phrase \"I don't know what to do anymore\" suggests a potential crisis. The text also asks if others have been through this, implying the author is looking for ways to cope, and is currently not succeeding on their own.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 10:11:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Froze. Wish I'd said something. Feeling sick about it now. Anyone else ever experience this? What do you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence and the feeling of helplessness suggest potential for escalation and psychological distress.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 10:10:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Trying to distract myself, but it's hard. Anyone else relate? Just looking for someone who understands.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and difficulty coping, suggesting a potential escalation of risk. While not explicitly mentioning self-harm or suicide, the presence of urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 10:09:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been isolating me from my friends, and last night... I just need someone to tell me I'm not crazy. Is this abuse?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes isolation from friends and alludes to a potentially abusive incident. The question 'Is this abuse?' strongly suggests the individual is experiencing behavior that they recognize as potentially harmful and are seeking validation. Isolation is a significant risk factor for escalating abuse and potential violence.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 09:19:23"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a fight on the bus today. Guy wouldn't stop harassing a woman, then it just exploded. Shaken up. Is there anywhere to report something like that anonymously?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A physical altercation occurred on a bus, indicating a potential risk of violence and injury to those involved and potentially bystanders. While the reporter was not directly involved in the fight they expressed feeling 'shaken up' indicating distress.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 09:18:21"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a fight on my street last night. Shook me up. Makes you wonder what's going on with people. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text doesn't indicate direct involvement, immediate threat, or specific intent to harm oneself or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 09:17:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so numb lately. The urge to feel *something*, anything, is overwhelming. Scared I might relapse. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of numbness, a strong urge for sensation, and fear of relapse, suggesting potential self-harm. While not explicitly stating suicidal intent, the desire to feel \"anything\" and the relapse concern warrant a medium severity assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 09:16:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, thankfully. Makes you realize how fragile life is. Learn the signs, carry Narcan if you can. It saves lives. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event, which is a serious medical emergency. While the person survived, the event itself indicates a significant risk of harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 09:15:16"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things are rough at home lately. Walking on eggshells all the time. Is this normal? Feeling trapped and don't know who to talk to.\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Took me years to realize it was abuse. The constant put-downs, the isolation... It's not okay. You deserve better.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Gaslighting is real, and it messes with your head. Don't let anyone make you doubt your own sanity.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While not explicitly stating intent to harm self or others, the text describes feelings of being trapped and experiencing potential abuse (gaslighting, put-downs, isolation). These are risk factors for mental health decline and potential escalation to more severe issues.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 09:14:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Day 3 clean. Reached out to my therapist. Hope it helps. This sucks.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports strong urges to self-harm (cutting) and feelings of being overwhelmed. While currently 3 days clean and reaching out to a therapist, the intensity of the urge indicates a significant risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 09:13:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved their life. Learn CPR, carry Narcan. You never know when you might need it. #overdose #narcan #cpr",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potential risk to others in the vicinity due to the presence of illicit substances and the potential for needing to intervene. While Narcan was successful in this instance, the event still represents a concerning public health issue.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 09:12:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just had another fight with my partner. Walking on eggshells constantly. Is this normal? Feeling so lost and alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates ongoing relationship conflict, feeling lost and alone, and the potential for emotional distress, suggesting a moderate risk to the individual's well-being. The phrase 'walking on eggshells' is a potential indicator of an unhealthy or abusive relationship dynamic.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 09:11:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to feel *something* is to hurt. I know it's not healthy, and I hate it. Anyone else feel this way? Trying to find healthier coping mechanisms.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to self-harm, even if acknowledged as unhealthy. The user is seeking healthier coping mechanisms, indicating awareness and a desire to change, but the presence of self-harm ideation elevates the risk beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 09:10:08"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Felt sick. Said something, now I'm shaken. Anyone else ever witness something like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes witnessing an act of violence (shoving), which indicates a potential safety risk, although the direct threat is low. The original poster also engaged verbally and is now feeling shaken, implying some level of personal risk and emotional distress.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 08:21:24"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown yesterday. Dude got seriously hurt. Makes you think, you know? Just want everyone to be safe out there. Keep your head up.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a violent incident resulting in serious injury, suggesting a potential risk of violence to others, even if not directly threatening.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 08:20:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, but it's still hard. Anyone else relate? Just trying to get through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm and feelings of being overwhelmed, indicating a potential risk. While the person has reached out for help, the struggle persists.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 08:19:22"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Made me realize how easily things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling shaken, indicating a potentially unsafe situation but without direct involvement or threat. It expresses unease, suggesting mild psychological impact.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 08:18:20"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Two guys, punching each other senseless. Shook me up bad. Anyone else witness it? Feel kinda sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent fight can be psychologically distressing and could potentially escalate into further violence affecting others. While not directly involved, the witness expresses feeling unwell, indicating a significant emotional impact.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 08:17:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, having a really rough night. The urge to cut is so strong. Trying to distract myself, but it's hard. Anyone else been there? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to engage in self-harm (cutting), indicating a significant risk of immediate self-inflicted harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 08:16:17"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough at home. Walking on eggshells constantly. Is this normal? Feeling so isolated and anxious.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates significant distress, anxiety, and a potentially volatile home environment described as 'walking on eggshells.' The feeling of isolation further elevates the concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 08:15:16"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so numb lately. Relapsed after a few months clean. Just trying to get through the day. Anyone know any good distractions that actually work?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates increased vulnerability and potential for self-harm. While there is no explicit suicidal ideation, the feeling of numbness and seeking distractions suggests coping difficulties and potential escalation of risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 08:14:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, walking on eggshells... feels like I'm losing myself. Anyone else been through this? How did you find the strength to leave? #abuse #domesticviolence #helpme",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse and a potential desire to leave the situation, suggesting an elevated risk of harm or escalation of the abuse. While not explicitly stating intent to harm self or others, the feelings of losing oneself and the hashtags point towards a potentially dangerous situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 08:13:13"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Some guy got shoved, then it escalated so fast. Makes you realize how quickly things can turn ugly. Shaken up. Anyone else witness that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes a witnessed fight, indicating a potential risk of violence but not directly involving the author or posing an immediate, severe threat to them. The author expresses being 'shaken up,' suggesting emotional distress, but there's no indication of physical harm to the author or intent to harm others.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 08:12:11"
  }
]