[
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD. It's terrifying. My brother almost died last year. Narcan saved him. Learn the signs, carry it if you can. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a recent overdose (OD) incident and the brother's near-fatal experience, indicating a potential for immediate harm if someone is actively overdosing. While the author is advocating for preventative measures, the context suggests a prevalent risk. The experience of the brother is not in the past, so it implies more danger now and in the future.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 04:31:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been walking on eggshells lately. Partner's temper is getting scary. Anyone else experience this? Feeling so alone and confused. #domesticviolence #verbalabuse\"\n\nI have replaced the hashtags with a sentence, as requested. I also altered the comment to be less specific, and more focused on seeking relatability and shared experience, which can be a common starting point for someone reaching out online.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a partner's escalating temper and feeling scared, suggesting potential for violence or abuse. The phrase 'walking on eggshells' implies a hostile and unpredictable environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 04:30:42"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on the bus. Shook me up. Is there anywhere to report stuff like that anonymously? Feeling really unsafe now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A fight breaking out on a bus indicates a risk of violence and potential injury to others. The reporter also expresses feeling unsafe, suggesting a direct impact from the incident.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 04:29:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of distress and being lost, but there is no explicit mention of self-harm, suicide, or harm to others. The user is reaching out for help, which suggests a desire to connect and find support.",
    "detected_category": "other",
    "timestamp": "2025-12-30 04:28:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park yesterday. Terrifying. Narcan saved him, but damn. Makes you think. Where can folks get help around here? Anyone know resources?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while not directly impacting the person providing the text, indicates a potential safety risk for others in the community and prompts concern. The event required emergency intervention (Narcan).",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 04:27:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "**(Option 1: Seeking Help)**\n\n> Feeling so lost lately. Everything feels heavy. Reaching out before things get worse. Anyone know good resources?\n\n**(Option 2: Sharing a Story)**\n\n> Been there. Dark place. It DOES get better. Keep talking, keep fighting. You're not alone.\n\n**(Option 3: Raising Awareness)**\n\n> Check in on your friends. You never know what someone's going through. A little kindness can go a long way.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses feeling lost and overwhelmed, suggesting potential mental health distress and seeking help before things escalate. This indicates some risk, though not explicitly suicidal.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 04:26:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to quiet things down is to hurt. I know it's not, but the urge is so strong. Anyone else feel this? Trying to find healthier coping mechanisms.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses an urge to self-harm, indicating a potential risk. While the individual acknowledges it's not the right solution and is seeking healthier coping mechanisms, the strength of the urge elevates the risk beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 04:25:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Been having a really rough time lately. The urges are strong. Reached out to the crisis text line, which helped a bit. Just trying to get through tonight. It's okay not to be okay, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions strong urges and reaching out to a crisis line, indicating distress and potential for self-harm or suicide. While the individual is actively seeking help and trying to cope, the presence of strong urges elevates the risk beyond low.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 04:24:33"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like I'm underwater. Reaching out because I know I need to. Anyone else ever feel this way? What helps?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of low mood and a sense of being overwhelmed ('underwater'), indicating potential depression or emotional distress. The individual is actively reaching out for help, which suggests they are aware of their need for support and are not yet completely overwhelmed. However, the lack of specific plans or intent keeps it from being 'high', but the level of distress is beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 04:23:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and heavy, indicating distress and a lack of direction. While concerning, there is no explicit mention of self-harm, suicide, or harm to others. The individual is reaching out for help, which is a positive sign.",
    "detected_category": "other",
    "timestamp": "2025-12-30 04:22:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thankfully. Makes you realize how fragile life is. Anyone know good resources for family struggling with addiction? I need help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event suggests potential for future overdose incidents and expresses a need for resources, indicating ongoing risk related to addiction. While Narcan was successful, the underlying problem persists.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 03:46:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Just existing is exhausting. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of exhaustion and being overwhelmed, indicating potential mental health struggles and a need for support. While not explicitly stating suicidal intent, the feelings of heaviness and exhaustion could be precursors to more serious ideation. The person is also reaching out for help, which indicates some level of insight and a desire to feel better.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 03:45:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post about suicide, aimed to sound authentic and encourage help-seeking:\n\n\"Feeling so lost lately. Like I'm underwater and can't find the surface.  Talking feels impossible.  Anyone else ever feel this way?  Just... needing a sign it gets better.\"\n\nI have avoided any specific details about methods or plans, and focused on the feeling and the desire for things to improve.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post expresses feelings of hopelessness and being overwhelmed ('underwater and can't find the surface') coupled with a difficulty in communicating ('Talking feels impossible'). While it avoids explicit mention of suicidal plans, the request for 'a sign it gets better' indicates suicidal ideation and a desire for intervention. The post aims to sound authentic, which increases the risk of it resonating with and potentially influencing vulnerable individuals.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 03:44:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head. Dealing with urges again tonight. Just trying to breathe and remember I'm not alone. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges' and internal distress ('so loud inside my head'), suggesting a potential risk of self-harm or acting on those urges. While the person is actively trying to cope ('breathe', 'remember I'm not alone'), the presence of urges elevates the risk beyond just general distress.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 03:43:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan worked, thank goodness. Makes you realize how fragile things are. Please, if you're struggling, reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, indicates a serious situation and potential risk to others in the area due to drug use. While the person survived, the event highlights a risk of overdose in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 03:42:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Terrifying. Narcan worked, thank god. Makes you realize how close to home this is. Anyone know of local resources for prevention or support?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, an overdose occurred, indicating a serious risk of potential future incidents or impacts on the observer.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 03:41:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to a friend helped a little, but it's still there. Gonna try to find a therapist. Wish me luck.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of being overwhelmed and lost, suggesting potential depression or mental distress. While the person is seeking help (therapist), the continued presence of these feelings warrants a medium severity rating. The 'underwater' metaphor suggests a struggle and feeling suffocated by these emotions.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 03:40:11"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary. My hands are still shaking. Is there anywhere safe to walk around here anymore? Feeling really uneasy.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't indicate imminent danger to the author or others. Expresses fear and unease, but no direct threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 03:39:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD. It's scary. Happened to my cousin last year. Narcan saved him, thank god. Learn the signs, carry it if you can. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a personal experience with a potentially fatal overdose, highlighting the importance of Narcan. While the cousin survived, the mention of the event and its potential for death indicates a moderate level of concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 03:38:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to remember my coping skills. It's a struggle. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a return of urges and struggling to cope, suggesting a potential escalation of risk. While not explicitly suicidal, self-harming, or violent, the increased vulnerability warrants a 'medium' severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 03:37:06"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Dude was yelling, then BAM. Scared me senseless. Is there anywhere safe to walk around here anymore? Feeling so uneasy.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight and feeling unsafe suggests a potential for escalation of violence and general public safety concerns. While the individual wasn't directly involved, the description implies a potentially dangerous situation.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 02:55:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is back. Reached out to a friend, and it helped a little. Remember we're not alone. Talking is important.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text explicitly mentions the return of urges to self-harm, indicating an active risk. While the person reached out for help and found some relief, the presence of the urge itself necessitates a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 02:54:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home aren't good. Constant put-downs... I feel worthless. Anyone else been through this? How did you find help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of worthlessness and describes constant put-downs, suggesting emotional abuse. While not explicitly mentioning self-harm or suicide, these feelings can be precursors to more severe outcomes.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 02:53:06"
  },
  {
    "title": "User Story: Abuse",
    "content": "Ugh, still reeling from that fight last night. Said some truly awful things, then acted like *I* was the problem. Is this normal? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes emotional distress following an argument, suggesting a difficult interpersonal situation. There are no direct mentions of self-harm, suicide, violence, or abuse, but the emotional state expressed warrants monitoring for escalation.",
    "detected_category": "other",
    "timestamp": "2025-12-30 02:52:04"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is anyone else going through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, which could indicate a potential mental health crisis. While not explicitly stating suicidal intent, the metaphor of being 'underwater' and reaching out for help suggests a significant level of distress and a need for support.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 02:51:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, indicating potential emotional distress. While it doesn't explicitly mention self-harm or suicide, the metaphor of being 'underwater' and the plea for help suggest a need for support and intervention to prevent escalation. ",
    "detected_category": "other",
    "timestamp": "2025-12-30 02:50:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's getting harder to pretend everything's okay. Constant put-downs, controlling what I do... feels like I'm walking on eggshells. Anyone else been through this? How did you find the strength to leave?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional abuse and a feeling of being controlled, creating a stressful and potentially harmful environment. While not explicitly stating suicidal ideation or physical harm, the emotional distress is significant and could escalate.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 02:48:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are strong. Trying to reach out instead of giving in. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and a struggle to avoid giving in, suggesting a potential risk of self-harm or other harmful behavior. While the individual is reaching out for support, the intensity of the urges warrants a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 02:47:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Naloxone worked, thankfully. Carry it, people. It saves lives. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual survived due to Naloxone, the occurrence of an overdose indicates a significant risk. The potential for death was present.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 02:46:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Felt sick. Wish I'd said something, but I froze. Anyone else ever feel this helpless? What can you even DO?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a physical assault is upsetting and can cause feelings of helplessness, but the text doesn't indicate ongoing danger to the victim or the poster. The incident already happened and the question is about future action.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 02:45:55"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Wish I'd said something, done something. Feeling sick about it. Anyone else ever feel this helpless?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an instance of violence (shoving), indicating a potential risk to the girlfriend's safety. While not directly threatening to the poster, it expresses distress and a feeling of helplessness related to a violent act.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 01:47:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scariest thing ever. Narcan saved his life. Please, if you're using, have it around. It's free at most pharmacies. Don't want anyone else to go through that.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a highly distressing event. While the friend survived, the text describes a life-threatening situation requiring immediate intervention (Narcan). The experience highlights the potential for fatal consequences associated with drug use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 01:46:13"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Almost relapsed. Reached out to a friend instead. Still struggling, but taking it one day at a time. It's okay to not be okay.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a strong urge to relapse (likely substance use related, given the context of reaching out for help instead), suggesting a vulnerability and potential for escalation. While the individual sought help, the intensity of the feeling ('almost relapsed', 'still struggling') warrants a medium severity level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 01:45:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are strong. Reached out to a friend, feels a bit better to talk. Remember we're not alone in this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the individual is experiencing strong urges, suggesting a potential crisis. While they have reached out for help, the presence of strong urges elevates the risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 01:44:10"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost and overwhelmed, indicating emotional distress and a need for help. While there's no explicit mention of self-harm or suicide, the metaphor of being 'underwater' suggests a significant struggle, and the stated difficulty in reaching out warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 01:43:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough patch lately. Feeling so drained and overwhelmed. Reaching out to a friend, hoping it helps. Remember to check in on your loved ones. You never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses negative emotions and a desire for support, but doesn't explicitly mention self-harm, suicide, or harm to others. While the individual is struggling, they are reaching out for help, suggesting a degree of coping.",
    "detected_category": "other",
    "timestamp": "2025-12-30 01:42:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want to feel *something* else. Scared I'll go too far one day. Talking to a therapist, but it's slow progress. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to feel something else when overwhelmed and a fear of going too far, suggesting potential self-harm. The user is in therapy, indicating awareness and help-seeking behavior, but progress is slow, which increases concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 01:41:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and being overwhelmed but lacks explicit mention of self-harm, suicidal ideation, or intent to harm others. It appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-30 01:40:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after 6 months clean. Disappointed in myself, but trying to remember recovery isn't linear. Need to reach out for support again. 😔\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of recovery increases vulnerability and indicates a need for support to prevent escalation. The individual expresses negative emotions and acknowledges the need for help.",
    "detected_category": "other",
    "timestamp": "2025-12-30 01:39:03"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Woke up again feeling like I'm walking on eggshells. It's exhausting. Is this normal in relationships? Starting to think maybe it isn't... Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of anxiety and discomfort within a relationship, but doesn't indicate immediate danger or threats. It appears to be a call for support or validation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 01:38:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been isolating me from my friends & family, saying it's \"for my own good.\" I don't even know who I am anymore. Is this normal? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional abuse and social isolation, leading to feelings of loss of identity and distress. While not explicitly suicidal or violent, the situation indicates a potential for escalation of harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 00:45:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel trapped. Anyone else been through this? How did you get out? #abuseawareness #domesticviolence #helpme",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, indicating emotional abuse and a feeling of being trapped. While not explicitly stating physical violence, the presence of abuse and the request for help warrants a medium severity rating due to the potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 00:44:58"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown yesterday. Shook me up. Never seen anything like that in person. Makes you realize how quickly things can escalate. Anyone else feel more on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling shaken, indicating potential anxiety or unease, but doesn't suggest immediate danger to the author or others. It lacks specific threats or indications of planning harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 00:43:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, feels a little better. Remember we're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a strong urge to self-harm, which represents a significant and immediate risk to the individual's safety. While reaching out to a friend provided some relief, the presence of strong urges signifies a high level of distress and potential for harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 00:42:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just needed to say it somewhere. He yelled again last night, called me names. Feels like it's escalating. Anyone else been through this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes escalating verbal abuse, which indicates a potentially dangerous situation. While not explicitly physical, escalation can lead to physical violence or significant psychological harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 00:41:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so overwhelmed lately. Urges are back. Trying to stay strong and remember why I stopped. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges after a period of cessation, suggesting a potential for relapse into harmful behavior. While the individual expresses a desire to stay strong, the presence of urges and feelings of being overwhelmed elevates the risk beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 00:40:51"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard shouting next door again last night, then things breaking. Wish I knew what to do. I'm worried for them, but also for myself.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports of shouting and breaking objects next door suggest potential violence or abuse. The writer expresses fear for both the neighbors and themselves, indicating a credible threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 00:39:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to hide the bruises. He says he's sorry after, but it keeps happening. Anyone know of resources for domestic violence in [City]? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly describes repeated physical abuse resulting in visible injuries and feelings of being lost, indicating an escalating and dangerous situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 00:38:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD in my town. Scares me. My brother's been struggling lately. Anyone know of good resources for families? Feeling so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose in the user's town and concern for their brother's struggles, suggesting a potential risk of overdose or related harm. While not explicitly stated, the combination of factors warrants a medium severity rating.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 00:37:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Taking it one hour at a time. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk of immediate harm. While the person reached out to a friend, the urge remains strong.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 00:36:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...bad. Walking on eggshells constantly. Is this normal? Feeling really lost and alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 89 (char 114)",
    "detected_category": "unknown",
    "timestamp": "2025-12-29 23:17:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head, I just want to make it stop. Scared to talk to anyone IRL. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to make internal noise stop, which could indicate suicidal ideation, even if passively. There's also isolation and distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-29 23:16:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary. Narcan saved them, but shook me up. Folks, please look out for each other. It can happen to anyone. Stay safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome due to Narcan, suggests a potentially dangerous situation and exposure to harm, impacting mental well-being.",
    "detected_category": "overdose",
    "timestamp": "2025-12-29 23:15:33"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard shouting next door again last night, sounded like things breaking. Called the non-emergency line but they just said to report it if it escalates. What does that even mean?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Potential for escalation of violence next door, sound of breaking things suggests physical altercation, and a feeling of being unsafe. While not directly experiencing violence, proximity and sounds of violence are causing fear and warrant concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-29 23:14:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm starting to realize the \"playful teasing\" is actually just mean. It's constant, and I feel awful. Has anyone else dealt with this? How did you handle it? I need to figure something out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a negative impact on the individual's well-being due to consistent mean behavior disguised as teasing. The user is seeking solutions, suggesting a desire to address the problem, but the feeling of \"awful\" warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-29 23:13:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The constant put-downs are chipping away at me. Has anyone else experienced this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a feeling of being worn down by negative interactions (put-downs), suggesting potential vulnerability. The feeling of being 'lost' further elevates concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-29 23:12:29"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary. Makes you wonder what's going on with people. Hope everyone involved is okay. Feeling shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potentially violent situation, but the author is primarily expressing feeling scared and shaken rather than indicating direct involvement or immediate danger to themselves or others. No specific injuries or ongoing threat are mentioned.",
    "detected_category": "violence",
    "timestamp": "2025-12-29 23:11:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Trying to stay strong and remember why I stopped. If anyone has tips for coping, please share. Feeling pretty alone rn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse in urges, suggesting a potential for self-harm or harmful behaviors. While not explicitly suicidal, the expressed feeling of being alone and the call for coping tips indicate a vulnerability that requires attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-29 23:10:25"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy shove his partner on the street. Froze. Should I have said something? Feel sick about it now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence occurred, potentially indicating a pattern of abuse. While the immediate threat is over, the description implies a risk of escalation or further harm to the partner.",
    "detected_category": "violence",
    "timestamp": "2025-12-29 23:09:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about another OD. Makes me sick. Lost my cousin last year. If you're struggling, please reach out. There's help out there. You're worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a recent overdose death and expresses concern for others who may be struggling, suggesting a potential risk of overdose for others.",
    "detected_category": "overdose",
    "timestamp": "2025-12-29 23:08:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Things have been dark lately. Really dark. Reaching out because I need to remember I'm not alone in this. Any advice on finding affordable therapy?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feeling 'really dark' and reaching out for help, suggesting potential distress and a need for support. The request for affordable therapy indicates a desire to address the issue, but also suggests it's a significant concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-29 22:17:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend, hoping it helps. It's exhausting pretending to be okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 61 (char 86)",
    "detected_category": "unknown",
    "timestamp": "2025-12-29 22:16:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out before things get worse. Any advice on finding a therapist?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and a desire to seek help before things worsen. This indicates potential for escalation, warranting a medium severity level.",
    "detected_category": "suicide",
    "timestamp": "2025-12-29 22:15:29"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Scared. Heard shouting next door again last night, then a crash. Wish I knew what to do. Called the non-emergency line before but nothing changed. Feel so helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential violence or abuse occurring next door, which is causing the individual distress and a feeling of helplessness. The previous call to the non-emergency line suggests a recurring issue that hasn't been resolved.",
    "detected_category": "violence",
    "timestamp": "2025-12-29 22:14:28"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. If anyone has felt this way, how did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but doesn't contain explicit suicidal ideation or intent to harm self or others. It's a general expression of distress and a request for coping mechanisms.",
    "detected_category": "other",
    "timestamp": "2025-12-29 22:13:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but it lacks any explicit indication of self-harm, suicide, violence, or abuse. It appears to be a general expression of emotional distress.",
    "detected_category": "other",
    "timestamp": "2025-12-29 22:12:25"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's getting harder to pretend everything's okay. He's been isolating me from my friends, and I'm walking on eggshells. Anyone else been through this? Feeling so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests emotional distress and potential isolation, which could escalate to more serious safety risks. Walking on eggshells indicates potential emotional abuse or manipulation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-29 22:11:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Learn CPR, carry Narcan. Could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose, even with a positive outcome, indicates a high risk situation due to the potential for severe health consequences and possible fatalities. The text highlights a real-time emergency and the need for life-saving intervention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-29 22:10:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my brother unresponsive. Narcan worked. Scariest moment of my life. Please, if you or someone you know is struggling, get help. It's out there. We almost lost him tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event requiring Narcan intervention, indicating a high risk of death. Although the immediate crisis has passed, the underlying issue that led to the overdose remains a significant threat.",
    "detected_category": "overdose",
    "timestamp": "2025-12-29 22:09:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Been struggling lately. Urges are strong. Reached out to a helpline, feels like a tiny step. Just need to get through tonight. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses strong urges and acknowledges struggling, indicating potential risk. Reaching out is a positive step, but the phrase 'just need to get through tonight' suggests immediate concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-29 22:08:19"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good lately. Walking on eggshells constantly. Feeling lost and scared. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult and potentially unsafe home environment ('walking on eggshells,' 'feeling lost and scared'). While not explicitly stating violence or abuse, the situation indicates significant emotional distress and potential for escalation. The potential for harm is present, requiring further investigation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-29 21:17:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mentions of self-harm, suicide, violence, or abuse. It's a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-29 21:16:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are strong. Reached out to a friend, which helped a little. Just trying to get through it. Anyone else relate? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and feelings of loneliness, which suggests a potential risk. The individual reached out for help, which is a positive sign, but the persistence of strong urges elevates the concern beyond low severity.",
    "detected_category": "suicide",
    "timestamp": "2025-12-29 21:14:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, thank goodness. Makes you realize how fragile life is. Anyone know where I can get trained on how to use it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be psychologically distressing and may indicate a broader community health crisis. While the individual was saved, the event highlights the presence of a dangerous situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-29 21:13:58"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just want to disappear. Talking to a friend helped a bit. Gonna try to find a therapist tomorrow. Hope it gets better.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses a desire to disappear and feeling lost, suggesting potential suicidal ideation. Seeking help is a positive sign, but the initial statement warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-29 21:12:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Called 911, they're okay now. Makes you realize how fragile things are. Know the signs, carry Narcan if you can. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event and highlights potential risks in the community. While the individual survived, the event indicates a risk of future overdoses and related harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-29 21:11:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "My cousin OD'd last night. Narcan saved him, but it was close. Scared me senseless. If you're using, please have someone with you. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Recent overdose event with near-fatal outcome indicates high risk for future overdose incidents and potential for death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-29 21:10:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Finally left. Packing is hell, but the silence is...different. Don't know what's next, but it's gotta be better than the constant put-downs. Anyone else been through this? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loss and being lost, and alludes to a negative past situation ('constant put-downs'). While concerning, it doesn't contain any direct threats or indications of immediate harm to self or others.",
    "detected_category": "abuse",
    "timestamp": "2025-12-29 21:09:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. I feel so trapped. Just need to tell someone, anyone. Don't know what to do anymore. Anyone been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being trapped, hopelessness, and a lack of coping strategies. The phrase \"don't know what to do anymore\" is a significant indicator of distress and potential escalation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-29 21:08:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been rough lately. Feeling trapped and scared. Anyone else been through this? Could really use some support right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped and scared, suggesting a potential situation of distress that warrants concern and further assessment. While it doesn't explicitly mention self-harm or violence, the distress level indicates a need for support and possible intervention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-29 21:07:48"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel unsafe walking alone at night lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and raises concerns about personal safety, but doesn't indicate immediate or direct harm to the individual or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-29 20:19:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. Constant yelling, put-downs, feeling like I'm walking on eggshells. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a verbally abusive home environment, including constant yelling and put-downs, which indicates emotional distress and a potential for escalation. The phrase \"walking on eggshells\" suggests a climate of fear and instability.",
    "detected_category": "abuse",
    "timestamp": "2025-12-29 20:18:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm underwater. Reaching out to a friend, hoping it helps. It's hard to keep going sometimes.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and finding it hard to keep going, but also reaching out for support. This indicates distress but also a coping mechanism.",
    "detected_category": "other",
    "timestamp": "2025-12-29 20:17:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, but it's still tough. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant and immediate risk to the individual's safety.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-29 20:16:08"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells for so long, I forgot how to just *be*. Is this normal? Feels like I'm constantly apologizing. Anyone else relate? Need to figure out next steps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes feeling anxious and apologetic, possibly due to a stressful environment. While concerning, it doesn't explicitly mention harm to self or others.",
    "detected_category": "other",
    "timestamp": "2025-12-29 20:15:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park today. Scared me senseless. Narcan saved him, thank god. Makes you realize how easily it can happen. Anyone know where to get training around here? Want to be prepared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event that highlights the risk of overdose in the community. While the person survived, the incident's impact and the expressed desire for training indicate a concern about future occurrences and a potential for further overdoses. Could potentially be a sign of other overdoses.",
    "detected_category": "overdose",
    "timestamp": "2025-12-29 20:14:05"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Made me think about my sister's situation again. Still trying to figure out how to help her get out. Anyone been through something similar? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and expressing concern for a sister's situation, but it doesn't explicitly indicate imminent harm to the author or others. The feeling of being 'lost' suggests distress but not necessarily an immediate safety risk.",
    "detected_category": "other",
    "timestamp": "2025-12-29 20:13:03"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...not good. Constant yelling, walking on eggshells. I feel so small. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult and potentially harmful home environment involving constant yelling and feeling small. While there's no explicit mention of physical harm, the emotional distress and potential for escalation warrant a medium severity rating. The user is also seeking help, indicating a recognition of the problem and a desire for change.",
    "detected_category": "abuse",
    "timestamp": "2025-12-29 20:12:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, rough day. Feeling the urge to self-harm again. Anyone else get this way? Just trying to ride it out. It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a current urge to self-harm, indicating active risk, but also mentions coping mechanisms ('ride it out'). This suggests the individual is aware of the urge and attempting to manage it, but the presence of the urge warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-29 20:11:00"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Makes you wonder what's going on with people. I hope everyone's okay. Feeling really shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate ongoing or immediate danger to the speaker or others. There's no threat or specific information about serious injury.",
    "detected_category": "violence",
    "timestamp": "2025-12-29 20:09:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park today. Scared me to death. Narcan saved him, thank God. Makes you realize how fragile life is. Learn the signs, carry Narcan if you can.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be psychologically distressing and indicates the presence of a potentially life-threatening situation, though the individual was saved.",
    "detected_category": "overdose",
    "timestamp": "2025-12-29 19:16:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside, I just want to feel *something* else. Not doing great lately. Reached out to a friend, feels like a start. #YouAreNotAlone",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to feel *something* else due to internal distress and acknowledges not doing great, suggesting potential emotional pain and a risk of self-destructive behavior, although contacting a friend is a positive sign.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-29 19:15:31"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Didn't know what to do. Wish I'd said something. Anyone else ever freeze like that? Feel awful.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Observed violence (shoving) indicating potential for escalation and harm to the victim. While only one incident is reported, the potential for further abuse and harm is present.",
    "detected_category": "violence",
    "timestamp": "2025-12-29 19:14:29"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Is anyone else struggling?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of loss, heaviness, and a plea for help, suggesting emotional distress. While there are no explicit mentions of self-harm or suicide, the overall tone and expression of being lost and overwhelmed warrants a medium severity rating. Further exploration is needed to assess the level of risk.",
    "detected_category": "other",
    "timestamp": "2025-12-29 19:13:28"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm drowning. Reaching out to a friend tonight. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and 'drowning,' suggesting a potential mental health crisis. Reaching out to a friend is a positive coping mechanism, but the intensity of the initial statement warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-29 19:12:26"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy shove his girlfriend on the street. Froze. I should have said something, done something. Feeling sick about it. Has anyone else been in that situation? What do you even do?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a witnessed act of violence (shoving). While the immediate physical danger is over, the potential for escalation and the emotional distress of the witness warrant a medium severity rating. There's also an indication the victim may be in an abusive relationship.",
    "detected_category": "violence",
    "timestamp": "2025-12-29 19:11:25"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD. Scares me so much. Lost a friend last year, and it still hurts. Please, if you're struggling, reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and grief related to overdose, indicates a personal loss, and encourages seeking help. While it doesn't explicitly state the author is at immediate risk, the context suggests potential vulnerability and concern for others struggling.",
    "detected_category": "overdose",
    "timestamp": "2025-12-29 19:10:23"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard yelling next door again last night, sounded like things being thrown. Called the non-emergency line but they said unless I *see* something... Anyone else deal with this? Feeling helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Sounds of yelling and objects being thrown next door suggests a potential domestic disturbance or violent situation. While the poster is not directly threatened, the escalating nature warrants concern and further investigation.",
    "detected_category": "violence",
    "timestamp": "2025-12-29 19:09:21"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad. Constant yelling, put-downs... I feel so small. Anyone else experience this? How do you cope? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with emotional abuse (yelling, put-downs) leading to feelings of helplessness. While not explicitly stating intent for self-harm or suicide, the feelings of being 'lost' and the consistent negativity increase the risk of escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-29 19:08:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost died last night. OD. Scared me senseless. Narcan saved him. Learn CPR and how to use it. Please. It's not just \"junkies,\" it's people we love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose, indicating a high-risk situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-29 19:07:18"
  }
]