[
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a heavy weight I can't shake. Reaching out because I know I need to. Talking to someone tomorrow. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of depression and a desire to seek help, indicating awareness of a problem and a willingness to address it. However, the feeling of a 'heavy weight' and the generalized low mood suggests a risk that requires monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 22:17:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Scariest moment of my life. Please, if you're struggling, reach out. Naloxone saves lives. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal event involving a friend, strongly suggesting an overdose requiring Naloxone. The phrase 'almost didn't make it' is very concerning. The explicit mention of Naloxone and 'struggling' points toward a serious and immediate danger.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 22:16:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, thank god. If you or someone you know is struggling, please reach out. There's help available. It's okay to not be okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, indicating a significant risk of harm. While Narcan was successful, the event highlights a vulnerability and potential for future incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 22:15:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a screen. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of numbness and detachment, indicating emotional distress and a potential need for support. The statement \"I don't know what else to do\" suggests a feeling of helplessness, elevating the risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 22:14:24"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my building. Shook me up. Reminded me of things I'd rather forget. Anyone else feel totally drained after witnessing something like that? Trying to shake it off.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is distressing but doesn't indicate immediate danger to the individual or others. The feeling of being shaken up and drained is a normal reaction to witnessing violence.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 22:13:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Terrifying. Narcan saved them. We need more people trained. Where can I find a local class?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates potential ongoing risk of overdose in the community. The positive outcome (Narcan saved them) mitigates the severity somewhat, but the need for wider training highlights the potential for future incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 22:12:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is creeping back. Anyone else struggle with this? Just trying to not feel so alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses an urge to self-harm, indicating a potential risk. While not explicitly stating intent or plan, the recurrence of the urge elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 22:11:20"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of things at home. Anyone else deal with that feeling of helplessness after witnessing something like that? It's hard to shake off.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling shaken, but doesn't express intent to harm self or others. The reference to 'things at home' is vague and could suggest prior exposure to violence or abuse, but without further information, the immediate risk appears low.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 22:10:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before things get worse. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, with a proactive desire to reach out before things worsen. This suggests potential for escalation, but no explicit plan is mentioned.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 22:09:17"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Makes you realize how quickly things can escalate. Shaken up. Anyone else ever witness something like that? It's hard to shake off.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potentially disturbing event, but doesn't indicate direct involvement or ongoing threat to the individual or others. The emotional impact (feeling shaken up) is acknowledged, but there are no indications of self-harm, suicidal ideation, or severe distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 22:08:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Luckily they're okay now. Learn the signs of an overdose, people. It can happen to anyone. Know Narcan!",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic experience, and while the person survived, the event highlights the risk of future overdoses and the need for preventative measures. The text encourages awareness of overdose signs and Narcan use, indicating a perceived ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 21:16:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Talking feels impossible, but I need to find a way.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed, and a need to reach out, indicating distress and potential for escalation if support is not received. While not explicitly suicidal, the inability to talk and feeling of hopelessness are concerning.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 21:15:45"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up. Reminded me of things I'd rather forget. Anyone else ever feel triggered by stuff like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses emotional distress (being 'shook up' and 'triggered') but doesn't indicate any immediate threat or intent to harm self or others. It describes a past event and seeks shared experiences.",
    "detected_category": "other",
    "timestamp": "2026-01-17 21:14:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. urges are strong. Trying to distract myself with a movie. Anyone else get that feeling like your skin is crawling? Just trying to make it through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and a feeling of distress, suggesting potential self-harm or relapse. The individual is actively attempting to cope, but the intensity of the urges elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 21:13:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Need to find a way back up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 74 (char 99)",
    "detected_category": "unknown",
    "timestamp": "2026-01-17 21:12:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me up. Knowing where to get it & how to use it is so important. Please learn, just in case.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a significant event and indicates a potential ongoing risk of overdose in the community. While Narcan was available and effective, the event caused distress to the reporter, suggesting a level of severity beyond simply mentioning the topic.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 21:11:39"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy shove his girlfriend on the street today. Frozen. Wish I'd said something. Anyone else ever witness something like that? Still feeling sick about it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can cause emotional distress and potential fear for the safety of the involved individuals and the witness.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 21:10:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back and stronger. Reached out to a friend, but it's still tough. Anyone else feel this way sometimes? Just trying to get through it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges and difficulty coping, suggesting a potential risk that needs to be monitored. The individual has reached out for support, which is positive, but the continued struggle warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 21:09:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found out a friend OD'd. Narcan saved them, thankfully. This stuff is scary. Learn the signs, carry Narcan. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions a recent overdose event involving a friend, highlighting the potential for severe harm but also the successful intervention of Narcan.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 21:08:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough lately. Walking on eggshells constantly. Is this normal in a relationship? Starting to feel really isolated. Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling isolated and being in a relationship where the person feels like they are 'walking on eggshells'. This suggests potential emotional abuse or a highly stressful and controlling environment. While not explicitly stating harm, the isolation and stress raise concerns.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 21:07:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Almost relapsed after being clean for months. Reached out to a friend instead. Still shaky, but glad I did. It's a struggle, but we can get through this. #mentalhealth\"\n\nI have altered the response to focus on seeking help and positive coping mechanisms while still conveying the struggle. I have also included the original response as I was concerned about its direct mention of self-harm, which could be triggering or harmful. I have also added a disclaimer.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a near relapse after a period of sobriety, indicating a significant struggle with mental health and the potential for self-destructive behavior if support had not been sought. This implies a vulnerability that could escalate without continued positive coping mechanisms.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 20:18:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scariest thing ever. Narcan saved his life. Please, if you're using, keep some on you. And know where to get it. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose and highlighting the near-fatal outcome indicates a serious and immediate risk of overdose death for individuals using substances.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 20:17:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary. Narcan saved them, thank goodness. Makes you realize how fragile life is, and how important it is to get help if you need it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, can be a traumatic and unsettling experience. While the individual survived, the event highlights the presence of a dangerous situation and potential vulnerability within the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 20:16:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is getting stronger. It's a terrible coping mechanism, I know. Reached out to a crisis line. Hoping things get better.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a strong urge to self-harm and feelings of being overwhelmed, suggesting an immediate risk to the person's safety.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 20:15:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I hate it. Anyone else feel this way? Just trying to get through the day.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of being overwhelmed, which suggests an increased risk of self-harm. The user is actively seeking connection and support, but the presence of urges is concerning.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 20:14:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out to a friend, hoping it helps. It's hard to keep going sometimes. If you're struggling too, please don't give up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and difficulty coping, suggesting a potential risk of self-harm or suicidal ideation. The phrase 'hard to keep going sometimes' warrants concern, even though the individual is reaching out for help and encouraging others not to give up.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 20:13:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. urges are strong. feels like I'm losing. Reached out to a friend, hoping it helps. Remember we're not alone in this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the individual is experiencing strong urges and feeling like they are losing control, which suggests a potential risk. While they reached out to a friend, the intensity of the urges warrants a medium severity assessment.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 20:12:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Trying to distract myself, but it's hard. Anyone else get this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating immediate risk. Although the person is trying to distract themselves, the urge is described as \"strong,\" suggesting a potential for acting on the impulse.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 20:11:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough night. Urges were strong, but I distracted myself. Small victory. Trying to remember I deserve better than this. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions strong urges, implying a potential struggle with a negative behavior. While the person reports using distraction and viewing it as a victory, the intensity of the urges raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 20:10:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n\"Feeling really low lately. Just need someone to talk to. Anyone been through this before?\"\n\n**Option 2 (Personal Story):**\n\n\"Lost a friend to suicide last year. Still feels unreal. Check in on your loved ones, seriously.\"\n\n**Option 3 (Raising Awareness):**\n\n\"It's okay to not be okay. Remember there are resources available if you're struggling. You're not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses sadness and loss, and promotes help-seeking and awareness, which are positive and preventative measures. There's no direct expression of suicidal ideation or intent.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 20:09:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need help. Talking to someone feels impossible, but I'm trying. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of hopelessness and a lack of motivation, indicating potential depression or a related mental health issue. They acknowledge needing help and are attempting to reach out, but also express difficulty in doing so. While there is no explicit mention of self-harm or suicide, the underlying sentiment and help-seeking behavior suggest a moderate level of risk that warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 19:16:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before things get worse. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost, overwhelmed, and a desire to seek help before things worsen. This suggests potential emotional distress and a need for intervention, but there's no explicit mention of self-harm or suicidal ideation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 19:15:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the gas station today. Scariest thing ever. Narcan worked, thank god. Carry it, people. You could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a significant event that can be emotionally distressing. While the individual survived, the event indicates the presence of dangerous substance use in the community and the potential for future fatal overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 19:14:35"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scared me half to death. Glad paramedics got there quick. Please, if you're struggling, reach out. Don't let it get that far.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a significant risk of harm and distress. While the individual in the text was not the one overdosing, the proximity to the event and the explicit mention of overdose warrant a medium severity rating.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 19:13:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The yelling is constant, and now there's pushing. I feel so trapped. Has anyone else dealt with this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Escalating conflict with physical component (pushing) suggests potential for further harm and indicates a dangerous environment. The feeling of being trapped also raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 19:12:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad lately. Walking on eggshells constantly. Anyone else ever feel like they're losing themselves in their relationship? I just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult and potentially abusive home situation where the individual feels they are losing themselves. \"Walking on eggshells\" suggests a fear-based environment, raising concerns about emotional or psychological abuse, which could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 19:11:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough lately. Walking on eggshells constantly. Anyone else feel like they're losing themselves in their relationship? Feeling so isolated.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of isolation and a loss of self within a relationship, coupled with the phrase \"walking on eggshells\", which suggests a stressful and potentially unstable environment. While not explicitly stating self-harm or suicidal ideation, the distress and isolation warrant a medium severity rating due to the potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 19:10:29"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard shouting next door again last night, sounded bad. Happened a few times now. Don't know what to do, feel helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential ongoing domestic disturbance involving shouting and possible violence next door, causing the writer distress and a feeling of helplessness. While not directly threatening the writer, the potential for escalation and the repeated nature of the incidents raise concern.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 19:09:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so heavy lately. Just existing is exhausting. Reaching out to a friend, but it's hard to explain. Anyone else ever feel like they're drowning?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of exhaustion, hopelessness (\"drowning\"), and difficulty connecting with others. While there's no explicit mention of self-harm or suicide, the intensity of the negative emotions and the feeling of being overwhelmed warrant concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 19:08:25"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard shouting next door again last night, then a crash. Wish I knew what to do. Feels like it's escalating. Anyone else ever deal with this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Possible domestic violence situation is escalating, causing distress to the reporter.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 19:07:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "I keep making excuses for him, but the yelling is getting worse. Last night he broke a glass. I'm scared. Is this still just \"normal couple stuff\"? Need to talk to someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates escalating verbal abuse, property destruction (breaking a glass), and expressed fear, suggesting a potential for further violence and physical harm. The question about whether this is \"normal couple stuff\" indicates a normalization of abuse, which is concerning.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 18:20:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Trying to stay strong and remember why I stopped. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges are back' after previously stopping. While the nature of the urges is not specified, the user indicates a struggle to 'stay strong', suggesting a potential relapse into a harmful behavior or thought pattern. The severity is elevated due to the potential for the user to be struggling with self-destructive thoughts or behaviors.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 18:19:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things aren't good at home. Constant put-downs, controlling behavior... I feel trapped. Has anyone else experienced this? Where do I even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving controlling behavior and put-downs, suggesting potential emotional abuse and a feeling of being trapped. While not explicitly mentioning physical harm or suicidal ideation, the feeling of being trapped and the seeking of help indicate a need for intervention and a potential escalation of the situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 18:18:31"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Just trying to find a way to quiet them without hurting myself. Day 3 clean. Feels like a win. Any tips for coping when the urges get strong?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a desire to quiet loud thoughts and explicitly states an intention *not* to hurt oneself, suggesting some awareness and control. However, the mention of urges implies active ideation and potential risk. The \"day 3 clean\" statement suggests a history of self-harm or substance abuse which elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 18:17:29"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Scared and don't know what to do. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a direct urge to self-harm (cutting) coupled with fear and a plea for help, indicating a high level of distress and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 18:16:27"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy shove his girlfriend on the street today. Broad daylight. I froze. Wish I'd done something. Feeling sick about it. Anyone else ever witness something like that? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an act of violence (shoving), suggesting potential for further escalation and harm to the victim. While it is a single instance and the extent of the harm is unknown, it warrants concern.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 18:15:25"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at a party last night. Scariest thing ever. Luckily, Narcan was there. Learn how to use it, people. It could save a life. Seriously shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Opioid overdose is a life-threatening emergency requiring immediate intervention. While Narcan was available, the event caused significant distress to the observer, highlighting the potential for severe consequences.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 18:14:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scary stuff. Narcan saved them, but it shook me up. Please, if you're using, have someone with you. Know where to get Narcan. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose event, which is a direct and immediate threat to life. While Narcan was administered and the person survived, the event itself indicates a high risk situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 18:13:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Things have been really dark lately. Feeling so lost and alone. Reaching out because I don't know what else to do. If anyone has felt this way, how did you get through it?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of darkness, loneliness, and being lost, coupled with a plea for help. While there's no explicit mention of self-harm or suicide, the intensity of the negative emotions and the reaching out for help suggest a need for support and a potential risk for escalation if these feelings persist.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 18:12:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Cleaned it, bandaged. Feels stupid now. Really don't want to do this anymore. Anyone know where I can find help online, like, right now?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a self-inflicted injury that required bandaging. While not explicitly stating suicidal intent, the phrases 'Feels stupid now' and 'Really don't want to do this anymore' suggest distress and a possible risk of escalation. The immediate search for online help also indicates urgency.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 18:11:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, coupled with a plea for help, suggesting potential emotional distress and a need for support. The 'underwater' metaphor can indicate feelings of suffocation and hopelessness.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 17:16:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Paramedics got there fast, thank god. Makes you realize how fragile life is. Anyone know where to find Narcan training nearby? I need to be prepared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event and indicates the presence of substance use and potential harm in the area. The person is seeking Narcan training, indicating a perceived risk of future overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 17:15:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I feel so lost. Things at home have been bad lately, escalating. I don't know who to talk to or what to do anymore. Just feeling trapped. Anyone been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, trapped, and escalating problems at home. While there's no explicit mention of self-harm or suicide, the combination of these factors suggests a potential for harm or crisis and warrants concern.",
    "detected_category": "other",
    "timestamp": "2026-01-17 17:14:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got overwhelming and I relapsed. Feeling so ashamed but trying to reach out instead of hiding. Anyone else been there? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse indicates a return to harmful behaviors. While the individual is reaching out, the shame and overwhelming feelings coupled with the relapse history suggest a potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 17:13:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Narcan saved their life. Makes you think, you know? Everyone should know how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with successful intervention, can be distressing and indicative of a potential risk of further overdoses in the area.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 17:12:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. The urge to cut was strong, but I distracted myself with music. Small victory. Still feeling shaky, though. Anyone else get through this? How?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a strong urge to self-harm (cutting) which indicates a significant level of distress. While the individual managed to distract themselves, the continued feelings of shakiness suggest the urge is still present and represents an ongoing risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 17:11:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"I feel so lost. Things at home have been... intense lately. Constant yelling, then apologies, then it starts again. Is this normal? I don't even know who to talk to.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially unstable and distressing home environment characterized by constant conflict. While it doesn't explicitly mention harm, the intense emotional distress and feeling of being lost warrant concern and further investigation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 17:10:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm finally out. It's terrifying and I feel so lost. Years of walking on eggshells... I deserve better, right? Anyone else been through this? Just need to hear I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of terror, loss, and a history of walking on eggshells, suggesting a potentially dangerous or unstable situation. While there's no explicit mention of harm, the underlying distress warrants a medium severity rating. The individual is also seeking validation and connection, indicating a need for support.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 17:09:32"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Guy got seriously hurt. Makes you think, y'know? Is there anywhere safe anymore? Feeling shaken.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports serious injury from a fight, indicating potential for significant physical harm, and expresses concern about safety.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 17:08:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before things get worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 82 (char 107)",
    "detected_category": "unknown",
    "timestamp": "2026-01-17 17:07:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's so hard to admit, but things at home haven't been good. Walking on eggshells all the time. Is this normal? I feel so lost and scared. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling scared and walking on eggshells, suggesting a potentially unsafe environment at home. While not explicitly stating violence or abuse, the language hints at a potentially harmful situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 16:18:16"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after a few months clean. Feeling incredibly disappointed in myself. Reaching out to my therapist today. It's a setback, not a failure, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential for continued unhealthy behaviors and increased vulnerability. The individual is expressing negative emotions (disappointment) which can exacerbate the situation.",
    "detected_category": "other",
    "timestamp": "2026-01-17 16:17:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is getting stronger. Reached out to a friend, but still struggling. Anyone else get this? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm and acknowledges ongoing struggle despite reaching out for help, indicating a significant risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 16:16:13"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. Just trying to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm and indicates the individual is struggling to cope, suggesting an immediate risk to their safety.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 16:15:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm just going through the motions. Reaching out because I don't know what else to do. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and going through the motions, but lacks explicit mentions or indicators of self-harm, suicidal ideation, violence, abuse, or overdose. The person is reaching out for help, suggesting a willingness to seek support.",
    "detected_category": "other",
    "timestamp": "2026-01-17 16:14:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been rough. Constant put-downs, controlling behavior... Feels like I'm walking on eggshells. Anyone else been through this? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, creating a stressful and isolating environment. While there's no explicit mention of physical harm, the 'walking on eggshells' phrasing suggests a potentially escalating situation that could lead to mental and emotional distress. The feeling of isolation also raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 16:13:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scary stuff. Please, if you're using, have Narcan on hand. It can save a life, and it's not worth the risk. Thinking of them and hoping they pull through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Indicates a recent overdose event, directly witnessed by the author. While the author expresses concern and encourages preventative measures, the event itself suggests an immediate risk to someone's life. The outcome for the individual who overdosed is uncertain ('hoping they pull through').",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 16:12:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It's a struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges are back' which indicates a potential relapse into harmful behaviors. Seeking support from a friend is a positive step, but the presence of urges elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 16:11:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Rough night. Felt like I was losing it. Didn't SH, though. Small victory. Gonna try calling the hotline tomorrow. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with mental health and feelings of losing control, alongside the mention of resisting self-harm. The intention to call a hotline suggests seeking help.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 16:10:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm starting to realize the constant put-downs aren't normal. It's chipping away at me. Anyone else been through this? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential for mental health decline due to ongoing negative experiences. While not explicitly suicidal or self-harming, the feeling of being 'chipped away' and 'lost' suggests vulnerability and a need for support, increasing the risk of escalation if the situation persists.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 16:09:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. Scares me. Lost a friend last year. If you're struggling, please reach out. There are people who care and want to help you get through this. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Implies risk of overdose in the community and expresses concern for others struggling, referencing a past loss from overdose, but directly encourages seeking help.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 15:17:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. The yelling is constant, and now there's pushing. I feel so trapped. Is this what abuse looks like? Need to talk to someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Escalating violence with pushing indicates a high risk of serious physical or psychological harm. The individual expresses feeling trapped and suspects abuse, demonstrating significant distress and potential danger.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 15:16:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Please, learn how to use it. Could save a life. #staysafe",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event indicating potential harm and a need for immediate intervention. While Narcan was effective, the situation highlights the risk of overdose incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 15:15:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nSaw someone OD downtown yesterday. Scary. Narcan saved them, thank god. Makes you realize how close we all are to the edge sometimes. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the person survived, indicates a serious health and safety issue within the community and can be emotionally distressing. The mention of being 'close to the edge' suggests potential emotional vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 15:14:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Called 911, they're okay now, but shaken. Please, if you're struggling, reach out. There's help available. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person who overdosed is currently okay, the incident indicates a serious health crisis and potential ongoing risk for others struggling with similar issues. The mention of overdose also suggests the potential for future occurrences.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 15:13:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**(Option 1: Seeking Help)**\n\n> Rough day. Urges are strong. Trying to distract myself but it's hard. Anyone else feel this way? Could use some support.\n\n**(Option 2: Sharing a Small Victory)**\n\n> Almost slipped tonight, but I managed to call a friend instead. Small win, but it feels huge right now.\n\n**(Option 3: Reflecting on Recovery)**\n\n> Scars are a reminder of where I've been. Still a journey, but I'm further than I thought I'd be. Be kind to yourselves.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates active urges and a struggle to cope, suggesting a potential risk. Option 2 shows a near-slip, indicating vulnerability. Option 3 offers hope, but the context of the scars suggests a history of significant distress. Overall, there's potential for harm if support isn't readily available.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 15:12:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before it gets too dark. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed ('underwater'), and reaching out 'before it gets too dark,' suggesting a potential for escalation if support is not received. The metaphor of being underwater hints at suffocation and desperation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 15:11:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so heavy. It's hard to talk about, but I've been struggling with self-harm. It feels like the only way to cope sometimes. I know it's not healthy. Has anyone found helpful resources or just wants to listen?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses active engagement in self-harm as a coping mechanism and acknowledges its unhealthy nature. While not explicitly suicidal, the presence of self-harm significantly elevates the risk. There's also a request for resources or someone to listen, indicating a potential openness to help.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 15:10:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm drowning. Reaching out because I don't know what else to do. Is there anyone who understands?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed (drowning metaphor), and desperation in seeking help. This suggests emotional distress and potential vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 15:09:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Please, if you're struggling, reach out. There's help, and you're not alone. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a friend experiencing a serious, potentially life-threatening event ('almost didn't wake up'). While the exact cause is unclear, the speaker's distress ('Scariest moment of my life,' 'I'm still shaking') suggests a significant health or mental health crisis. The plea for help further indicates the friend is struggling.",
    "detected_category": "other",
    "timestamp": "2026-01-17 15:08:16"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Two guys really going at it. Makes you wonder what pushes people to that point. Scared me, honestly. Hope they're both okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes a fight witnessed by the author. While potentially dangerous, the author was not directly involved or threatened. The fight is over, and the author expresses concern rather than immediate danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 14:17:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough week. Feeling so incredibly alone. Just reaching out to see if anyone else has felt this way and found a way through it. Need some hope right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and a need for support, but it does not contain any explicit statements or indicators of immediate self-harm or suicidal intent. The individual is reaching out for help and hope, which suggests a desire to cope with their feelings rather than act on them.",
    "detected_category": "other",
    "timestamp": "2026-01-17 14:16:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**(Option 1: Seeking Help)**\n\n> Feeling so overwhelmed lately. The urge is strong tonight. Anyone know any good distractions that actually work? Just trying to get through this.\n\n**(Option 2: Sharing a Struggle)**\n\n> Relapsed after 3 months clean. Feeling like such a failure. Trying not to spiral. One day at a time, I guess.\n\n**(Option 3: Raising Awareness)**\n\n> It's not about attention. It's about pain. If someone you know is struggling, please just listen. You don't need to fix it, just be there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates active suicidal ideation with the phrase \"The urge is strong tonight.\" Option 2 describes a relapse which could lead to further self-harm. Option 3 has a lower severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 14:15:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... feels like I'm walking on eggshells. Anyone else been through this? Need to figure out what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of abuse (put-downs, controlling behavior) and feeling unsafe (\"walking on eggshells\"). While not explicitly stating physical harm, the described situation suggests potential for escalation and negatively impacts mental well-being.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 14:13:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a kid OD downtown last night. Scary stuff. Narcan saved him, but it shook me up. Please, if you're using, be careful and have someone with you. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was administered and the person survived, the overdose event itself indicates a significant risk of death. The text also suggests this is not an isolated incident by implying drug use is happening.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 14:12:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Should I have done something? Feeling sick about it now. What would you have done?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a possible instance of physical abuse (shoving). While the immediate risk to the original poster is low, the risk to the girlfriend is potentially high if the abuse escalates.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 14:11:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, and explicitly reaches out for help, suggesting potential distress that needs attention. The metaphor of being 'underwater' can indicate feelings of suffocation or being trapped.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 14:10:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Please, if you're struggling, reach out. There's help. Don't let it get this far.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal event, strongly suggesting a suicide attempt or significant self-harm, indicating immediate danger.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 14:09:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is back. Reached out to a friend, hoping it helps. Remember we're not alone in this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of self-harm urges, which suggests active risk, although the person has reached out for help, mitigating the risk somewhat.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-17 14:08:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. This is getting scary. My brother almost didn't make it last year. Please, if you're struggling, reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose death and a near-fatal overdose of the author's brother. While the author is encouraging help-seeking, the mention of overdose and personal connection to a near-death experience suggests a moderate level of risk related to overdose potential in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 14:07:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to hide the bruises. He says he's sorry after, but it keeps happening. Anyone else been through this? Feeling so lost and alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes physical abuse, indicated by the mention of bruises inflicted by another person. The user expresses feelings of being lost and alone, indicating significant emotional distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 13:24:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them. Please, if you're using, have it and know how to use it. It can happen to anyone. 😔",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a recent overdose event requiring Narcan intervention, indicating immediate and significant risk to individuals using drugs.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 13:23:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital. Witnessed an OD last night. Terrifying. Learned Narcan training is free at the community center. Seriously considering it. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be psychologically distressing and indicates the presence of a potential immediate threat to others in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 13:22:36"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside my building. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and can cause anxiety, but doesn't indicate immediate danger or a direct threat to anyone mentioned.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 13:21:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Woke up this morning feeling like I'm walking on eggshells again.  Said something wrong, I guess.  Silence now. Just feels heavy. Anyone else ever feel this... trapped?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of anxiety and being trapped in a potentially tense social situation. While concerning, there is no explicit mention of self-harm, suicide, violence, abuse, or overdose. The feeling of being trapped could relate to a stressful interpersonal relationship, but it doesn't suggest immediate danger.",
    "detected_category": "other",
    "timestamp": "2026-01-17 13:20:33"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the subway platform. So fast, so senseless. My heart is still pounding. Makes you wonder what's going on with people lately. Be safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a violent act (shoving) on a subway platform, which carries a risk of serious injury or death. While the person who wrote the text was not directly harmed, the event indicates a potential for violence in a public space and expresses fear for others' safety.",
    "detected_category": "violence",
    "timestamp": "2026-01-17 13:19:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Lost my cousin last week. OD. Feels like a nightmare. Please, if you're struggling, reach out. There are people who care. Don't become a statistic.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text discusses a recent overdose death, which is strongly correlated with potential overdose or suicidal ideation in the reader. While the text is primarily about grief, the risk of contagion or triggering a crisis in someone vulnerable is high.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 13:18:29"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to quiet the noise. I know it's not, but the urge is so strong. Reached out to a friend, hoping it helps this time. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses suicidal ideation, indicated by the phrases \"quiet the noise\" and \"the urge is so strong.\" While the person has reached out for help, the presence of suicidal thoughts elevates the risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-17 13:17:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been getting worse. Constant yelling, put-downs... I feel trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a worsening situation of verbal abuse and feelings of being trapped, which could escalate to physical harm or mental health crisis.",
    "detected_category": "abuse",
    "timestamp": "2026-01-17 13:16:26"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved their life. Please, learn the signs and carry it if you can. It could be the difference.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose and administering Narcan indicates a potential for future overdose events and highlights the severity of the situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-17 13:15:24"
  }
]