[
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard shouting next door again last night. Sounded like things were thrown. Called the non-emergency line, but they just said to call if it escalates. What does 'escalates' even mean? Feeling helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While not explicitly stating violence towards the reporting person, the text describes a volatile situation next door involving shouting and objects being thrown. The caller feels scared and helpless, indicating potential for harm. The police response was insufficient, highlighting a concern that the situation may escalate.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 14:19:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... It's terrifying. Lost a friend last year, and I still feel it. If you're struggling, please reach out. There's help available. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a past overdose death and expresses fear about current overdoses, indicating potential risk exposure and emotional distress related to overdose.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 14:18:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so heavy lately, like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way? Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of distress and a desire for connection and advice, but lacks specific indicators of immediate harm or suicidal intent.",
    "detected_category": "other",
    "timestamp": "2025-12-16 14:17:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad. Really bad. Feeling trapped and scared all the time. Anyone know where to start getting help? I just want it to stop.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped, scared, and a desire for the situation to stop, suggesting potential distress and a need for help. While there isn't explicit mention of self-harm or suicide, the intensity of the emotions warrants concern and indicates a potential risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 14:16:28"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm underwater. Reaching out because I don't know what else to do. Talking feels impossible, but I need to try.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and difficulty communicating, suggesting potential emotional distress and a need for support. While not explicitly suicidal, the statement indicates a possible decline in mental well-being.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 14:15:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Just trying to get through each day. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges, suggesting a potential risk for self-harm or other harmful behaviors. While not explicitly suicidal, the individual is struggling and seeking coping mechanisms, indicating a need for support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 14:14:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"I'm so tired. He yelled again last night, said I was worthless. It's always my fault. Anyone else feel this way? Is this normal? I feel so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of worthlessness and loneliness, coupled with an indication of verbal abuse. While not explicitly suicidal or self-harming, the combination of factors suggests a potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 14:13:22"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight downtown. Shook me up bad. Reminded me of things I'd rather forget. Anyone else feel like violence sticks with you long after it's over?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and experiencing emotional distress, but does not indicate any immediate threat of harm to self or others. The lingering emotional impact is acknowledged.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 14:12:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so overwhelmed lately. Just started therapy, hoping it helps. It's hard to admit you're not okay.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feeling overwhelmed and seeking help through therapy. While it acknowledges difficulty, there's no explicit mention of self-harm, suicidal ideation, violence, or abuse.",
    "detected_category": "other",
    "timestamp": "2025-12-16 14:11:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about someone OD'ing. Scared me. A friend almost died last year. If you're struggling, please reach out. There are people who care and want to help you get better. It's possible.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions a recent overdose and a past near-fatal overdose, indicating potential risk for others struggling with similar issues.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 14:10:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm stuck in a dark hole. It's hard to see any light. Talking to a friend helped a little, but it keeps coming back. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and hopelessness, but it does not contain any explicit plans or intent to harm self or others. The individual is seeking support and coping mechanisms.",
    "detected_category": "other",
    "timestamp": "2025-12-16 13:30:16"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Finally left. Packing is hard, but staying was harder. Anyone else feel like they're starting from zero? Just... lost. #domesticviolence #abuse\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the person has left a potentially abusive situation, which suggests immediate physical danger may have decreased. However, the feelings of being \"lost\" and starting from \"zero\" combined with the hashtags #domesticviolence and #abuse, indicates significant emotional distress and potential vulnerability. The risk lies in potential for escalation if adequate support is not available.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 13:29:14"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside my building. Called the cops, but I feel sick. What else can I do? Witnessing that... it's messed me up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can cause significant emotional distress and potential psychological harm to the witness. While the direct threat is to the girlfriend, the witness is experiencing negative psychological effects.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 13:28:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. They're ok now, but it shook me. Narcan saves lives. Learn how to use it. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person experienced a drug overdose requiring intervention, indicating a potential for further overdoses in the area. While the individual is currently okay, the event highlights a serious risk and potential harm to others.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 13:27:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on where to start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost, indicating potential for mental health distress. The acknowledgment of needing to talk to someone, but finding it impossible, suggests a barrier to seeking help which raises concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 13:26:07"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like nothing matters. Reaching out because I know I need to. Talking to a friend tomorrow, baby steps. It's okay not to be okay, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of low mood and hopelessness, indicating a need for support. The explicit statement of reaching out and acknowledging the need for help suggests some protective factors are present, but the underlying distress warrants attention and monitoring.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 13:25:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thank god. Makes you think... everyone should carry it. Learn how to use it. Could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event, which is a serious medical emergency with potentially fatal consequences. While the individual survived due to Narcan, the event highlights the ongoing risk and potential for future harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 13:24:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Talking to a friend helped a bit, but it's still there. Anyone else ever feel this way? Just trying to not feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and loneliness, but does not contain any explicit mentions of self-harm, suicidal ideation, or harm to others. The individual mentions talking to a friend, suggesting they are seeking support.",
    "detected_category": "other",
    "timestamp": "2025-12-16 13:23:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get jumped near the subway. Heart's still racing. Called 911, but feeling so shaken. Anyone else witness anything like that around Elm & 5th? Need to process this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A violent assault (jumping) occurred. This indicates a significant and immediate threat to personal safety. While the original poster was not the victim, witnessing such an event and calling 911 supports the violence classification.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 13:21:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Narcan saves lives. Learn how to use it. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text implies a recent overdose event ('almost didn't wake up') requiring Narcan. While the friend survived, the potential for death indicates a significant risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 13:20:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"It's so hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel trapped. Anyone else been through this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential for abuse (put-downs, controlling behavior) and feelings of being trapped, which could escalate over time and impact the individual's well-being. While not explicitly stated, the situation described has the potential to lead to self-harm or other negative outcomes.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 12:24:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, suggesting a potential for emotional distress that requires attention. The phrase 'I don't know what else to do' indicates a lack of coping mechanisms.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 12:23:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Please, if you're using, carry it. Could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose implies potential for future overdoses in the area/social circle. The need for Narcan indicates a severe risk of overdose death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 12:22:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urges are getting strong again. Reached out to a friend, just need to get through tonight. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions strong urges, which could indicate a risk of self-harm or suicide. The person has reached out for help, suggesting they are aware of the danger, but the presence of strong urges elevates the risk beyond just feeling overwhelmed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 12:21:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Woke up again feeling like I'm walking on eggshells. It's exhausting. Anyone else feel trapped in their own home? I just want it to stop.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped, exhausted, and wanting something to stop, which suggests significant distress and potential for escalation. The phrase \"walking on eggshells\" implies a stressful and potentially volatile environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 12:20:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Please, if you're struggling, reach out. There are people who care. Naloxone saves lives. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests potential for secondary trauma and highlights the presence of a life-threatening situation, even if not directly impacting the reporter.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 12:19:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad. Constant yelling, put-downs... I feel so small. Anyone else been through this? How did you cope? I need some strength.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, a potentially harmful environment with verbal abuse, and a feeling of being small, suggesting a possible risk of escalation. While not explicitly mentioning self-harm or suicidal ideation, the negative emotions and plea for help warrant a medium severity rating.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 12:18:31"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to feel *something* is to hurt. I know it's not healthy, trying to find better coping mechanisms. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to hurt oneself as a means of feeling something, indicating a potential risk of self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 12:17:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Narcan saves lives, people. Please learn how to use it. You never know when you'll need it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose situation ('almost didn't wake up') requiring Narcan, indicating a severe and immediate health risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 12:16:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a crisis line, which helped a bit. Just trying to get through today. It's a struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the return of urges and a struggle to cope, suggesting an elevated risk compared to baseline. While the person sought help, the ongoing difficulty warrants monitoring.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 12:15:24"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... it's terrifying. Lost a friend last year. If you're struggling, please reach out. There's help available. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about overdoses and references the loss of a friend, indicating a personal connection to a serious issue. While not directly expressing suicidal intent, it highlights the risk of overdose and encourages seeking help, suggesting a potentially vulnerable state within the community or the individual themselves.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 11:18:28"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got shoved, head hit the pavement. Scary how fast things escalate. Makes you think, ya know? Hope he's okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Head trauma from hitting the pavement can result in serious injury, indicating a medium level of risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 11:17:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back and stronger. Reached out to a crisis line. Talking helps, even a little. If you're feeling it too, please don't go through it alone. There's support out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges, which could be self-harm or suicidal in nature. Reaching out for help is a positive sign, but the presence of strong urges still presents a significant risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 11:16:24"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Scared. My neighbor's been yelling a lot lately, tonight it escalated. Sounded like things were breaking. Don't know what to do. Should I call someone?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Escalating yelling with sounds of breaking things suggests a potential for violence or abuse, impacting the safety of the individual and potentially others nearby. Uncertainty about what to do indicates a lack of immediate resources or a fear of escalation.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 11:15:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just reached out to a helpline. Talking helped, even just a little. If you're struggling too, please don't give up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates feelings of being lost and struggling, but the individual reached out for help and encourages others not to give up. This suggests they are seeking support and have some level of hope. There are no explicit mentions or direct indicators of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2025-12-16 11:14:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Need to remember I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but explicitly seeks connection and reassurance, suggesting a desire to cope rather than end their life. No immediate threat is implied.",
    "detected_category": "other",
    "timestamp": "2025-12-16 11:13:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately, urges are back. Reached out to a friend, feels a little lighter. Remember you're not alone. Talking helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges, suggesting a potential for self-harm or harmful behavior. Reaching out to a friend is a positive coping mechanism, but the presence of urges necessitates a 'medium' severity level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 11:12:16"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his car mirror after a fender bender. Scared the crap out of me. Makes you wonder what's going on at home. Is there help for anger like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Observed outburst of anger, potential for escalation exists but no immediate threat is indicated.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 11:11:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor OD last night. Scariest thing ever. Narcan saved them, but it was too close. Please, if you're using, don't use alone. And carry Narcan. It really can save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing a near-fatal overdose indicates a significant risk of future overdoses within the immediate community and highlights the potential for fatal outcomes.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 11:10:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to a therapist next week, hoping it helps. Just need to breathe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but also indicates help-seeking behavior (talking to a therapist). While concerning, there is no direct mention of self-harm, suicide, or violence.",
    "detected_category": "other",
    "timestamp": "2025-12-16 11:09:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, thank god. Makes you realize how fragile life is, and how easily things can go wrong. Anyone else feel helpless sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potential risk of further overdoses in the area and highlights the severity of the drug crisis. While the individual survived, the incident underscores a clear and present danger.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 10:19:48"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Made me realize how close it can be. Anyone else feel on edge lately? Wish there was more we could do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses fear and anxiety related to witnessing a fight, but does not indicate immediate danger to the author or others. It expresses a wish for improvement rather than intent to harm.",
    "detected_category": "other",
    "timestamp": "2025-12-16 10:18:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, suggesting potential emotional distress. The individual acknowledges the need for help but struggles to seek it, indicating a possible barrier to accessing support. While there's no explicit mention of self-harm or suicide, the language used warrants attention.",
    "detected_category": "other",
    "timestamp": "2025-12-16 10:17:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home have been...not good. Walking on eggshells constantly. Anyone else feel this way? Is this normal? Feeling lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a potentially unhealthy home environment. \"Walking on eggshells\" suggests fear and anxiety, which could escalate into more serious mental health issues or even physical harm depending on the underlying situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 10:16:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... rough. Constant put-downs, walking on eggshells. Anyone else feel like they're losing themselves? Feeling really trapped.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of emotional abuse and feeling trapped, which can escalate to more serious mental health issues if not addressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 10:15:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to quiet things down is to hurt. I know it's not healthy, but it's hard to stop. Anyone else feel this way? Need to find better coping mechanisms.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a feeling of being compelled to hurt oneself as a coping mechanism, which indicates a risk of self-harm. While the individual acknowledges it's unhealthy and wants to stop, the struggle suggests the behavior is ongoing and potentially escalating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 10:14:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight. Hope it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed ('underwater'), which could indicate distress. Reaching out to a friend is a positive coping mechanism, but the underlying feelings warrant concern and suggest a potential risk for escalation if support is not effective.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 10:13:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Constant put-downs, controlling behavior... I feel trapped. Has anyone else experienced this? I need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, which indicates potential emotional and possibly physical abuse. The feeling of being 'trapped' suggests a significant negative impact on the individual's well-being. While there's no explicit mention of self-harm or suicide, the described situation elevates the risk level beyond 'low' due to the potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 10:12:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like I'm drowning. Reaching out to a friend tonight. Just need someone to listen.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and being overwhelmed ('drowning'), but also indicates an active coping mechanism by reaching out to a friend. This suggests distress that needs attention, but not necessarily immediate danger.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 10:11:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Some guy just snapped. Scary how fast things escalate. Makes you wonder what sets people off. Anyone else see it? Hope everyone's okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a fight involving an individual 'snapping,' suggesting potential for physical harm and unpredictable violent behavior. While not directly threatened, the reported event indicates a risk to public safety.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 10:10:33"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about someone OD'ing. Scared me. Happened to a friend last year, thankfully they pulled through. Narcan saves lives. Learn where to get it, just in case. It could save someone you know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a recent overdose and a past overdose of a friend, indicating potential risk of future overdose incidents within the poster's social circle. While the tone is not explicitly suicidal, the mention of overdose necessitates a medium risk assessment.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 09:21:11"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you wonder what people are going through to get that angry. Feeling shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which can be upsetting, but doesn't indicate direct personal involvement or immediate danger to the user or others. The 'feeling shaken' suggests distress, but not a severe level.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 09:20:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly low lately. Just reaching out to say it's okay not to be okay. Talking to someone really helps. 988 is a lifesaver.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being incredibly low, which suggests potential emotional distress. While it encourages seeking help, the explicit mention of feeling 'incredibly low' warrants a medium severity rating due to the possible risk of escalation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 09:19:07"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a fight break out at the park today. So scary how quickly things escalated. Reminded me of what my brother went through. Makes you wonder, when does it end?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a potentially dangerous situation. However, it primarily expresses fear and concern, with no direct indication of immediate harm to the speaker or others. The reference to the brother is vague and doesn't suggest imminent danger. There is no explicit self-harm, suicide, abuse or overdose content.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 09:18:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing so many stories lately. Lost a friend last month. Learn the signs of OD, carry Narcan if you can. It could save a life, maybe even someone you know. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references overdose (OD) and a recent loss of a friend, indicating potential exposure to or direct impact from a dangerous situation. While it promotes preventative measures (Narcan), the underlying context suggests a heightened risk environment.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 09:17:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of being overwhelmed, suggesting a potential risk of self-harm or relapse. While the individual has reached out for support, the presence of urges necessitates a moderate level of concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 09:16:01"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out downtown. Shook me up. Is it just me, or is everyone on edge lately? Wish people could just chill.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Reports a fight witnessed, causing distress, but doesn't indicate imminent danger or direct involvement of the author. Suggests a general feeling of unease rather than a specific threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 09:15:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Finally left. Packing is hell, but breathing feels easier already. Scared but done. Any advice for starting over?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates a stressful situation (packing, feeling scared) but also a sense of relief and a desire to start over. There is no explicit mention of harm to self or others.",
    "detected_category": "other",
    "timestamp": "2025-12-16 09:13:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Called 911, they're gonna be okay. Please, if you're struggling, reach out. Don't want to see that happen again. There's help available.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event indicating potential risk to others engaging in similar behaviors. While the person survived, the text highlights the prevalence of drug use and the potential for future overdoses.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 09:12:57"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get punched outside the bar. Shook me up. Is there anywhere to volunteer to help de-escalate situations like that? Feel helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a violent act can be upsetting, but the individual is not directly involved or threatened. The user is looking for ways to help others, suggesting a prosocial orientation rather than a risk to themselves or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 09:11:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to a friend helped a little, but it's still hard. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but there are no explicit mentions of self-harm, suicidal ideation, violence, abuse, or overdose. The individual reached out to a friend which indicates a willingness to seek help.",
    "detected_category": "other",
    "timestamp": "2025-12-16 08:22:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but it doesn't contain any explicit mentions or indications of self-harm, suicide, violence, abuse, or overdose. It's a general expression of distress.",
    "detected_category": "other",
    "timestamp": "2025-12-16 08:21:18"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight break out downtown today. So scary. Makes you wonder what's going on with people. I just walked away fast.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessed a fight, but no indication of personal involvement or ongoing threat. Just expressing fear and concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 08:20:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Reaching out because I don't know what else to do. Is there anyone else who understands this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of loneliness and isolation but lacks specific indicators of immediate harm or suicidal intent. Seeking connection and understanding.",
    "detected_category": "other",
    "timestamp": "2025-12-16 08:19:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed yesterday, urges were strong. White-knuckled through it. Grateful for distractions, but scared it'll happen again. Anyone else relate? Just feeling so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and feelings of being overwhelmed, suggesting potential for self-harm or suicidal ideation. While the person managed to cope ('white-knuckled through it'), the fear of recurrence and feeling alone elevate the risk beyond low. The specific nature of the urges is unclear, so it doesn't reach 'high' severity, but warrants concern and potential intervention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 08:18:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Just talking to someone helped a little. If you're struggling, please reach out. You're not alone. 988 is there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of heaviness and suggests struggling, which could indicate a potential mental health crisis. The mention of 988 suggests the person is aware of resources for people in distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 08:17:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad lately. Constant yelling, put-downs... I feel so small. Is this normal? Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (yelling, put-downs) and feelings of worthlessness. While there's no explicit mention of self-harm, suicide, or violence, the emotional distress indicates a potential risk for escalation. The user seeking validation suggests a need for support and raises concerns.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 08:16:09"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> Things at home are getting bad again. I feel so trapped. Does anyone know resources for emotional abuse? I need to get out.\n\n**Option 2 (Raising Awareness):**\n\n> I used to think \"abuse\" meant physical violence. It's so much more than that. Gaslighting & manipulation are real & damaging.\n\n**Option 3 (Sharing a personal story):**\n\n> It took me years to realize the constant belittling wasn't normal. Now I'm trying to rebuild my self-worth. It's hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user in Option 1 expresses a direct need to escape an emotionally abusive situation, indicating potential for escalation and immediate risk. While not explicitly stating intent to harm themselves or others, the feeling of being trapped increases vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 08:15:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. They're okay now, thankfully, but it shook me. Makes you realize how close it is. Is there anywhere to learn how to help if it happens again?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potential ongoing risk of overdose in the area, affecting the original person again or other park visitors. While the individual is currently okay, the event's impact and proximity suggest a need for preparedness and awareness, increasing risk for others in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 08:14:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, but it shook me. Please, if you're struggling, reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A witnessed overdose indicates a serious event with potential for long-term psychological impact on the witness and raises concerns about the availability of substances and the well-being of the person who overdosed.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 08:13:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like I'm drowning. Reached out to a friend, which helped a little. Remember it's okay to not be okay. Talking is so important.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed ('drowning') and low mood, suggesting potential mental health distress. While the person reached out for help, indicating a degree of coping, the severity is more than low due to the intensity of the expressed emotions.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 07:20:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIP posts lately. Lost a friend to OD last night. Please, if you're struggling, reach out. There are people who care & want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about overdoses and encourages seeking help, indicating a risk is present, potentially affecting the author or their social circle. The recent loss of a friend to overdose elevates the urgency.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 07:19:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. It hits different when you know them, y'know? Folks, please be careful. If you're struggling, reach out. There's help available. We can't lose more people.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text refers to a recent overdose death, implying potential risk for others struggling with similar issues. While not explicitly suicidal, the grief and call for help suggest vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 07:18:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n>  Relapsed last night. Feeling so ashamed and alone. Reaching out before things get worse. Anyone know good resources for online support?\n\n**Option 2 (Personal Story):**\n\n>  3 years clean from self-harm today. Didn't think I'd make it. It DOES get better. Keep fighting.\n\n**Option 3 (Raising Awareness):**\n\n>  Seeing more & more talk about sh. It's not attention-seeking, it's a sign of pain. Be kind, listen, and know resources exist.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates a relapse and potential for escalation. Although the user is seeking help, the risk of immediate harm exists.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 07:17:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Reached out to a friend, just needed to say it out loud. It helps. If you're struggling too, you're not alone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions the return of urges, which suggests a potential for self-harm or other harmful behaviors. While the person reached out for help, the presence of urges elevates the risk beyond a general expression of feeling down.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 07:16:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in our town. Feels so close to home. Anyone else lost someone? It's scary and I don't know what to do to help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and concern related to a recent overdose, indicating a heightened awareness of risk in the community. While the individual doesn't express intent for self-harm or harm to others, the proximity of the overdose and feelings of helplessness suggest potential for increased vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 07:15:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD hit too close to home. Lost a friend last year. Please, if you're struggling, reach out. There are people who care & want to help you get through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and acknowledges the prevalence of overdoses, referencing a personal loss. While it encourages seeking help, the mention of a friend's death due to overdose suggests a potential vulnerability to similar ideation or behavior in others struggling.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 07:14:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a crisis line, it helped a little. Just taking it one day at a time. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm and feelings of being overwhelmed. While the person has reached out for help, the severity remains high due to the active suicidal ideation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 07:13:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it was too close. Please, if you're using, have someone with you & have Narcan. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose, indicating a high risk of death. Narcan was required, highlighting the severity of the situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 07:12:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so numb lately, like I'm watching my life from behind a glass wall. Reaching out to a friend today. Just gotta keep going.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses emotional numbness and detachment, which can be a precursor to more serious mental health issues. Reaching out to a friend is a positive step, but the underlying feelings warrant concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 07:11:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it feels like the only way to quiet them is... not good. I'm trying to find better ways to cope. Anyone else feel this? How do you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses thoughts of harmful coping mechanisms to silence overwhelming thoughts, suggesting potential self-harm or suicidal ideation. The phrase \"not good\" is a concerning euphemism.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 06:23:02"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of things I'd rather forget. Anyone else ever feel triggered by stuff like that? Feeling really anxious now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes feeling anxious and triggered by witnessing a fight, indicating emotional distress but no immediate threat to self or others.",
    "detected_category": "other",
    "timestamp": "2025-12-16 06:22:00"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Guy got knocked out cold. Shook me up. Is there anywhere to volunteer, maybe help de-escalate situations like that? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A violent event resulting in serious injury occurred. While the reporter is not directly involved or threatened, the event suggests a risk of violence in the area.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 06:20:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scariest thing ever. Narcan saved them, but it was way too close. Learn the signs, carry Narcan. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the person survived, suggests a potential risk of repeated exposure to similar events and highlights the prevalence of drug use, implying a potential for future overdose incidents. The 'way too close' suggests a high level of distress from the observer, which can have a negative impact.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 06:19:57"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is back. Trying to stay strong & reaching out for help. It's a daily struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions the urge to self-harm, indicating a significant risk to the individual's safety. While they are reaching out for help, the presence of the urge itself necessitates a high severity assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 06:18:55"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He says he loves me, but then screams and breaks things. Is this normal? I feel so lost and alone. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional and physical abuse, suggesting a risk of escalation and harm. The user expresses feeling lost and alone, increasing vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 06:17:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head I just want to feel *something* else. It's not a solution, I know. Trying to find healthier coping mechanisms. Anyone else relate? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses a desire to feel 'something' else in response to overwhelming thoughts, which could indicate potential for self-destructive behavior. The mention of 'healthier coping mechanisms' suggests awareness that current methods might be unhealthy. Feeling 'lost' adds to the concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 06:16:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of my brother. Anyone else feel like violence is just… everywhere lately? How do you cope? I'm feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feeling shaken and lost after witnessing a fight, and a general feeling that violence is prevalent. While concerning, it does not indicate an immediate or specific threat of violence from or towards the author.",
    "detected_category": "other",
    "timestamp": "2025-12-16 06:15:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but shaken up. Learn CPR and how to use it, people. It can happen anywhere.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates a potential for further overdoses in the area, though immediate danger is averted.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 06:14:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Reached out to a friend, feels a little better. Remember you're not alone. <3",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential for self-harm or a mental health crisis. While the person reached out to a friend, the presence of urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 06:13:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Not sure what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, implying emotional distress and a lack of direction. The metaphor 'underwater' suggests suffocation and helplessness. Reaching out indicates a need for support.",
    "detected_category": "other",
    "timestamp": "2025-12-16 05:19:46"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside the deli. Froze. Didn't know what to do. Still shaking. Anyone else ever witness something like that? Feeling sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an act of violence (physical assault) that poses an immediate threat to the girlfriend's safety and well-being. It also expresses the witness's distress, indicating the potential for psychological impact.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 05:18:44"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you realize how quickly things can escalate. Shaken up. Anyone else witness it? Hope everyone's okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight downtown indicates a potential risk of violence exposure, and the poster expresses being shaken up, suggesting a level of distress and possible psychological impact. While the poster is not directly involved in the fight the event is recent and localized.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 05:17:42"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel so small. Has anyone else dealt with this? Where do I even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, indicating potential emotional abuse. While not explicitly stating physical harm, the feeling of being 'small' suggests a significant negative impact on the individual's well-being and could escalate if left unaddressed. The person is also asking for help, indicating a need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 05:16:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at a party last night. Terrifying. Narcan saved them, but it was way too close. Learn CPR & recognize the signs, please. Could save a life. Seriously shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "An overdose occurred, requiring Narcan intervention. While the person survived, the phrase 'way too close' indicates a high risk of death. The user is also 'seriously shaken up,' suggesting a significant emotional impact from witnessing a potentially fatal event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 05:15:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw another news story about an OD. Makes me sick. Lost my cousin last year. If you're struggling, please reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a recent overdose news story and personal loss due to overdose, implying awareness and potential vulnerability. While it encourages seeking help, the mention of ODs and personal loss suggests potential risk, albeit not explicitly stated.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 05:14:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. He yells, then apologizes, says it's my fault. Feels like I'm walking on eggshells. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of verbal abuse and feeling unsafe, which can escalate to more serious harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 05:13:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before it gets worse. Anyone else been there?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost, with an implication that things could worsen, suggesting potential for self-harm or suicidal ideation. The phrase 'reaching out before it gets worse' indicates some awareness and a desire to prevent further decline.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 05:12:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... rough. Constant put-downs, walking on eggshells. Anyone else been through this? Feeling so alone. 😔",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and a feeling of isolation, which could escalate to more severe mental health concerns.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 05:11:31"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Froze. Wish I'd said something, anything. Feeling sick about it now. Anyone else ever experience that? How do you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, even if not directly involved, can indicate a risk of escalation or further violence. The person who posted also express distress.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 05:10:29"
  }
]