[
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post addressing suicidal feelings, while adhering to the guidelines:\n\n\"Been feeling so low lately, like nothing matters. It's hard to talk about, but I'm reaching out. Has anyone else felt this way? Talking helps, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 102 (char 127)",
    "detected_category": "unknown",
    "timestamp": "2026-01-19 17:20:27"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a fight break out on the bus. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight on a bus is unsettling and may cause anxiety, but it doesn't directly indicate a high risk of severe harm to the individual or others. It's a reaction to a potentially dangerous situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 17:19:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed ('heavy'), and a sense of desperation by reaching out for help. While not explicitly suicidal, the language indicates significant distress and a need for support, increasing the risk of escalation if unaddressed.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 17:18:23"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude was sucker punched and is out cold. Shook me up bad. Is there anywhere to report this anonymously? Feel helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person has been incapacitated due to violence, indicating a potential for further harm or escalation. The level of incapacitation (unconsciousness) raises the severity beyond a simple altercation.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 17:17:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Terrifying. They're okay now, thankfully, but it really shook me up. Naloxone saves lives. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A drug overdose occurred, requiring intervention. While the person survived, the event indicates a potential for future, possibly fatal, overdoses in the area.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 17:16:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a kid OD at the park today. Scared me senseless. Narcan saved him, thank god. Learn CPR, folks. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event indicates a significant risk in the community, though it was successfully addressed. The potential for future incidents and the emotional impact on witnesses warrant a medium severity rating.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 17:15:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. The urge was strong, but I distracted myself. Small victory. Still hate feeling like this. Anyone else relate? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge, implying a potential for self-harm or suicidal ideation. While the person mentions distracting themselves, the persistence of the feeling and the open question about coping mechanisms suggests ongoing vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 17:14:16"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad lately. Constant yelling, and now...other stuff. Feels like I'm walking on eggshells. Is this normal? I don't know what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a hostile and potentially abusive home environment (yelling, 'other stuff', walking on eggshells). While there's no direct mention of physical harm, the vagueness and escalation suggest a potential for it.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 17:13:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to quiet things down, but the relief is so short. Trying to find better ways to cope. Anyone else feel this way? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a feeling of being overwhelmed and a desire to 'quiet things down', which, while vague, can be indicative of suicidal ideation or self-harm urges. The acknowledgement of short-term relief suggests a potentially unhealthy coping mechanism is being considered or used. The plea for help and better coping strategies indicates a level of distress and a desire to change, but the initial statement raises concerns.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 17:12:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. Little things escalating. I feel so trapped. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped and an escalation of issues, suggesting increasing distress and a potential risk of harm to self or others. The user is reaching out, indicating a need for support.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 17:11:10"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a guy get shoved into the subway tracks. Luckily someone pulled him up quick. Shaken up. Makes you realize how fragile things are out here. Stay safe, everyone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A person was intentionally shoved onto subway tracks, a situation with a high likelihood of serious injury or death. While the person was rescued, the act itself indicates a severe risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 16:20:56"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud is just stuck over me. Reaching out because I don't really know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of depression and hopelessness, indicating a potential risk that warrants attention. The statement 'I don't really know what else to do' suggests a lack of coping mechanisms and increased vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 16:19:54"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Reached out to a friend, but still feels like too much. Remember it's okay to not be okay, right? Need to find a better coping mechanism.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges and feelings of being overwhelmed, suggesting a potential risk of self-harm. While the individual has reached out for help and acknowledges that it's okay not to be okay, the feeling of 'too much' warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 16:18:53"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Makes you realize how easily things can escalate. Anyone else feel like anger is just simmering everywhere lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text primarily expresses feeling shaken and observing a general sense of tension, not an immediate threat of harm to self or others. There is no direct mention of violence intended by the author, just observation of violence committed by others.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 16:17:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is anyone else going through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, coupled with a sense of helplessness and reaching out for support. While not explicitly suicidal, the metaphor of being underwater suggests a struggle and potential for escalation if support is not received.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 16:16:49"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately? Wish there was more de-escalation training available.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and evokes feelings of anxiety and a desire for de-escalation training, but there's no immediate threat indicated.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 16:15:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, stronger than ever. Trying to resist, but it's exhausting. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feeling overwhelmed and reports the return of urges which they are struggling to resist. This suggests a potential risk of acting on those urges.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 16:14:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... Scares me. Lost a friend last year. If you're struggling, please reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about overdose and mentions the loss of a friend, indicating potential vulnerability to similar experiences. While the message is ultimately supportive and encouraging help-seeking, the underlying issue of overdose and grief raises the severity to medium.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 16:13:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, potentially indicative of depression or suicidal ideation, although there is no explicit mention of self-harm or suicide plans. The feeling of being 'underwater' can be interpreted as suffocating or struggling to cope.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 16:12:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough night. Urges were strong, but I distracted myself. One day at a time, right? Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the person experienced strong urges, which could potentially lead to self-harm or relapse. The phrase 'one day at a time' suggests an ongoing struggle.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 16:11:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Just reaching out, has anyone else felt this way? Don't know what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and lack of purpose, which are risk factors for suicidal ideation. The individual is also reaching out for help, indicating a potential crisis.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 15:21:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, isolating me from friends... feels like I'm walking on eggshells. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse and isolation, suggesting a potentially harmful situation. While there's no explicit mention of physical harm, the described environment can significantly impact mental health and could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 15:19:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Need to find a way back up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, with a metaphorical description that could suggest depression or a struggle with mental health. The desire to 'find a way back up' indicates a potential for hope but also acknowledges current distress.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 15:18:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... It's scary. Lost a friend last year. Narcan is vital, please learn how to use it. Could save a life. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose death, a personal loss due to overdose, and advocates for Narcan use, indicating an ongoing risk of overdose events in the community and a potential for further loss of life. While not directly expressing intent, it highlights the prevalent danger of overdose.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 15:17:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Glad they're okay now, but it shook me up. Anyone know where I can find naloxone training nearby? Feel so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be traumatic and lead to vicarious traumatization. The individual is also expressing feelings of helplessness and seeking naloxone training, indicating a desire to intervene in future overdose situations, which carries inherent risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 15:16:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's so hard to admit this, but things at home have been...not good lately. Walking on eggshells constantly. Is this normal? Feeling so lost and scared.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates significant distress, fear, and a negative home environment (walking on eggshells). While it doesn't explicitly mention self-harm, suicide, or violence, the level of anxiety and the potential for escalation warrant a medium severity rating. The individual feels 'lost and scared' which could lead to negative coping mechanisms.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 15:15:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells for so long, I forgot how to just... be. Anyone else feel like they're losing themselves in their relationship? Starting to think this isn't normal. Need to talk to someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of losing oneself and a sense of something being not normal in the relationship, suggesting potential emotional distress and a need for external support. While not explicitly mentioning harm, the underlying distress warrants attention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 15:14:49"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a man hit his dog in the park today. Just smacked him hard. I yelled, but I feel so shaken. Is there anything you can actually DO in that situation? I froze.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing animal abuse can be psychologically distressing and indicates a potential for escalation of violence. While the direct threat is to the animal, the man's behavior demonstrates a capacity for violence and impulsivity which could extend to humans.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 15:13:47"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant yelling, put-downs... I feel so small. Anyone else gone through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with verbal abuse (yelling, put-downs) and feelings of worthlessness. While not explicitly suicidal or self-harming, the emotional distress indicates a potential escalation risk. The user is also reaching out for support, suggesting they are aware of the negative impact on their well-being.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 15:12:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD at the park. Terrifying. Narcan saved them. Seriously, please learn CPR and how to use it. You could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, requiring intervention to save the person's life, indicating a significant risk of death. While the person survived, the potential for a fatal outcome exists with future overdoses if intervention isn't available.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 15:11:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIPs lately. Lost another friend to overdose last night. Please, if you're struggling, reach out. There are people who care. Don't be afraid to ask for help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions overdose, a recent death of a friend, and a call for help indicating potential suicidal ideation or substance abuse issues in the broader social circle.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 14:23:02"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things aren't good at home. Walking on eggshells constantly. Anyone else feel like they're losing themselves? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a stressful and potentially abusive home environment, leading to feelings of losing oneself. While not explicitly mentioning harm, the 'walking on eggshells' suggests potential emotional or verbal abuse, and the feeling of losing oneself raises concerns about mental well-being.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 14:22:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home aren't good. Constant put-downs, walking on eggshells... Feels like I'm losing myself. Anyone else been through this? How did you find help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and a loss of self, suggesting a potentially harmful environment. While not explicitly stating intent to harm themselves or others, the distress level and the seeking of help indicate a need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 14:20:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Called 911, they're okay now. Learn the signs, people. Naloxone saves lives. Please look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, indicating a potentially life-threatening situation. Although the person is now okay, the event highlights the risk and need for preventative action.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 14:19:57"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just realized yelling & put-downs every day IS abuse. Thought it was just \"how he is.\" Feeling so lost and confused. Anyone else experience this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse, leading to feelings of being lost and confused. While not explicitly stating physical harm, emotional abuse can escalate and significantly impact mental health, potentially leading to other harmful behaviors.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 14:18:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so isolated. Has anyone else gone through this? Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and isolation, suggestive of abuse. While not explicitly stated, this can significantly impact mental health and potentially escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 14:17:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad lately. Walking on eggshells constantly. Anyone else ever feel like they're losing themselves trying to keep the peace? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling alone, constantly walking on eggshells, and losing oneself to keep the peace. This suggests emotional distress and a potentially unhealthy or volatile home environment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 14:16:52"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Seeing someone actually get hurt like that... makes you realize how fragile things are. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence, which can be emotionally distressing, but it does not indicate direct involvement, intent to harm self or others, or active planning. The poster is expressing a reaction to the event and seeking validation from others.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 14:15:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, rough day. Feeling the urge to relapse after 6 months clean. Reached out to my therapist, waiting to hear back. Just gotta keep breathing. Anyone else been there?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a strong urge to relapse after a period of sobriety, suggesting a potential for harm. While the individual has reached out for help, the risk remains elevated until support is received.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 14:14:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after Narcan. Scared doesn't even cover it. Thought I was being careful. Please, anyone struggling, reach out. It's not worth it. There's help out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose requiring Narcan intervention, indicating a serious risk of future overdose and potential death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 14:13:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Cutting again after 6 months clean. Messed up, I know. Reached out to my therapist, waiting to hear back. Just needed to tell someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Relapse of self-harm after a period of being clean indicates increased distress and potential for escalation. The individual is actively engaging in self-injurious behavior, making the situation urgent. While they have contacted their therapist, the delay in response increases the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 13:32:39"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming. Not looking for attention, just...anyone else feel like hurting themselves when it all gets too much? Trying to find healthier ways to cope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and the desire to hurt oneself, but also indicates an attempt to find healthier coping mechanisms. The presence of self-harm ideation elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 13:31:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need help. Any advice on finding a good therapist?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a need for help, which suggests potential for escalation. While there's no explicit mention of self-harm or suicide, the 'dark cloud won't lift' metaphor and seeking a therapist indicates a significant level of distress that warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 13:30:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel trapped. Has anyone else experienced this? Need to feel less alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, indicating a potential for escalating emotional or physical abuse. The feeling of being trapped suggests a significant impact on the individual's well-being and increases risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 13:29:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scary stuff. Narcan saved his life. Learn the signs of an OD, it could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a high risk event.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 13:28:32"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting on the street, got way too heated. Really shook me up. Anyone know resources for bystander intervention? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes a heated argument, it doesn't explicitly state physical violence occurred, but the level of distress and the need for bystander intervention resources suggests a risk of escalation or potential harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 13:27:30"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the subway. Shook me up. Reminded me of my brother... still dealing with the aftermath. Anyone know resources for trauma support?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text doesn't directly indicate immediate danger, it reports an incident of violence (shoving) and the narrator expresses distress, linking it to past trauma. The request for trauma support suggests a potential for longer-term psychological harm or escalation if not addressed. The shoving incident itself, while not directly targeting the narrator, indicates a potential risk of violence in the environment.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 13:26:29"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Heart is pounding. Wish I'd said something, anything. Feeling sick about it now. Anyone else witness stuff like this? How do you react?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, even if not directly involved, can have significant emotional and psychological impact. The poster expresses distress (pounding heart, feeling sick), indicating a level of severity beyond simply observing an unpleasant event. While not an immediate physical threat to the poster, the second-hand exposure to violence and the resulting emotional distress warrants a 'medium' severity rating.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 13:25:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Thankfully they were okay. Makes you think, you know? Learn CPR, carry Narcan. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the individual survived, indicates a risk of similar incidents and potential harm to others or oneself if unprepared. Encouragement to learn CPR and carry Narcan suggests awareness of ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 13:24:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is back and stronger than ever. Reached out to a crisis line. Hope things get better soon. Taking it one hour at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm and indicates a significant escalation of this urge. While the person has reached out for help, the presence of strong self-harm urges constitutes a high risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 13:23:23"
  },
  {
    "title": "User Story: Violence",
    "content": "Heard shouting next door again last night. Called the cops before, but nothing changes. I'm scared for her. Anyone know what else I can do? Feels helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential ongoing abuse or violence next door, causing the writer fear for another person's safety. While not explicitly stated, the repeated nature of the disturbance and the feeling of helplessness suggest a serious situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 12:26:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news report about another overdose. Scares me, thinking about my brother. We need more resources out there. Where can people find help, quick?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expression of fear for brother's well-being related to overdoses suggests potential risk. The need for quick access to resources implies urgency and a potential vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 12:25:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD in the park today. Scary stuff. Narcan saved them, but it really shook me up. How can we get more people trained on how to use it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was used successfully, the overdose event indicates a risk of future overdoses in the area. It also shows a potential need for increased intervention and prevention measures.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 12:24:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Terrifying. Narcan saved their life. Carry it, learn how to use it. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, which is a life-threatening event requiring immediate intervention. While Narcan was used successfully, the potential for future incidents and the vulnerability highlighted by the phrase 'it can happen to anyone' warrant a medium severity rating.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 12:23:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post that addresses the topic of suicide in a way that aims to be authentic and encourage help-seeking:\n\n\"Things have been really dark lately. Feeling so lost and overwhelmed. Reaching out because I don't know what else to do.  Anyone know where to find support in [City/Region]?  Just need to talk.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post expresses feelings of being lost, overwhelmed, and a desire to talk. The mention of \"things have been really dark lately\" and not knowing what else to do suggests a potential for self-harm or suicidal ideation, although it is primarily help-seeking. The severity is not high because the individual is actively reaching out for support. The inclusion of a specific location suggests the person might be willing to engage with local resources.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 12:22:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is back. It's scary. Reached out to a friend, hoping it helps. Just trying to get through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions the return of the urge to hurt oneself, indicating active suicidal ideation or self-harm ideation, which constitutes a high-risk situation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 12:21:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things aren't good at home. Walking on eggshells all the time. Anyone else feel like they're losing themselves? Could really use some support right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a difficult and potentially abusive home environment ('walking on eggshells'). While not explicitly stated, the feeling of 'losing themselves' and need for 'support' could indicate a growing mental health concern, increasing the risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 12:20:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor being taken away in an ambulance last night. OD. Scared me. Please, if you're struggling, reach out. There's help out there. Don't let it get this far.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event requiring emergency medical attention. While the individual posting is not directly at risk, witnessing such an event can be distressing and highlights the potential for future overdose incidents. The plea for help suggests awareness of a broader issue.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 12:18:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Said something, but wish I'd done more. Anyone else ever freeze in a situation like that? Feeling guilty.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed a violent act (shoving) indicating potential for escalation and harm. While not directly involved, the incident involves interpersonal violence and possible abuse.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 12:17:57"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to quiet the noise is to hurt. I know it's not right, but it's hard to stop. Talking to someone feels impossible. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a desire to self-harm and difficulty stopping, indicating a significant risk. The feeling of isolation and inability to seek help further elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 12:16:55"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong, even though I know it's not the answer. Anyone else struggle with this? Just trying to not feel so alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating active suicidal ideation. While the individual acknowledges it's not the answer, the presence of the urge itself elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 11:19:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend, hoping it helps. It's hard to keep swimming.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and 'underwater,' with a struggle to 'keep swimming' which can be interpreted as a metaphor for coping with difficult emotions. Indicates seeking help from a friend, suggesting awareness of the need for support, but also acknowledging the difficulty of the situation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 11:18:38"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out on the bus today. It was so fast and scary. Shaking still. Is there anywhere to report stuff like that, even if no one seemed seriously hurt?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a safety concern. However, the text indicates that no one seemed seriously hurt, which lowers the severity. The author is shaken but seeking reporting options, not expressing immediate danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 11:17:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, rough day. Feeling the urge to self-harm creeping up. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses an urge to self-harm and acknowledges the difficulty in fighting it. While the individual has reached out for help, the presence of the urge indicates a moderate level of risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 11:16:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"I'm so tired of walking on eggshells. Every little thing sets him off. Is this...normal? Feeling so trapped lately.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a potentially volatile and trapping situation. While not explicitly mentioning violence or harm, the phrases \"walking on eggshells\" and \"sets him off\" indicate potential emotional or verbal abuse and control, increasing the risk of escalation. The feeling of being trapped also raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 11:15:33"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out at the bar last night. Punches thrown, bottles smashed. It was terrifying. Shook me up more than I thought it would. Is it normal to feel this anxious after witnessing something like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence is upsetting and can cause anxiety, but the text doesn't indicate imminent danger or direct threat to the individual or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 11:14:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough. Walking on eggshells constantly. Anyone else feel like they're losing themselves? Need to find some strength.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and stressful home environment ('walking on eggshells'), suggesting potential emotional distress and loss of self. While not explicitly stating harm, the situation described raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 11:13:29"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but lacks specific plans or intent to harm self or others. Seeking advice suggests a desire for help.",
    "detected_category": "other",
    "timestamp": "2026-01-19 11:12:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about another OD. Scared me. Lost my cousin last year. If you're struggling, please reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and acknowledges a loss due to overdose, and encourages seeking help. While not explicitly suicidal, it indicates potential vulnerability and exposure to a high-risk situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 11:11:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately, like I'm drowning. Reaching out because I don't know what else to do. Any advice or just someone to listen would be appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, using the metaphor of drowning. While it's a cry for help and indicates distress, it doesn't explicitly mention self-harm or suicidal ideation, but the intensity warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 11:10:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, which could indicate a risk of self-harm or suicidal ideation. The individual is reaching out for help, suggesting they are struggling but haven't yet acted on any specific plans.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 10:21:51"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, thank god. Makes you realize how easily it can happen. Learn CPR and carry Narcan, people. You could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a recent overdose event, indicating a potential ongoing risk in the described environment. While Narcan was available and effective, the accessibility of drugs leading to overdose remains a concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 10:20:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells for so long, I forgot what my own voice sounds like. Is this...normal? Starting to think I need help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a significant loss of self and potential distress, suggesting a need for help. While not explicitly mentioning harm, the feeling of being silenced and the questioning of normalcy raise concerns about mental well-being and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 10:19:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it's like the only way to quiet them is to feel something else, even if it hurts. Trying to find better coping mechanisms. Anyone else relate? How do you deal?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential for self-harm as a coping mechanism, suggesting distress and a need for alternative strategies. While not explicitly suicidal, the mention of seeking physical pain to quiet internal noise raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 10:18:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got really bad last night and I relapsed. Feeling so ashamed. I need to find a better way to cope. Where do I even start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse and feelings of shame indicate distress and a potential risk of future negative behaviors. The text mentions a need to cope, which is a positive aspect but the overall sentiment suggests vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 10:17:44"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Frozen. Should I have said something? Feel sick about it now. Anyone else experience this? What do you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an act of violence (shoving), which could potentially lead to physical injury and indicates a possible abusive relationship. While the immediate risk to the poster isn't apparent, the observed violence is concerning.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 10:16:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, thank god. We gotta talk more about this, people are dying. Where can I learn how to use it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was used successfully, someone overdosing indicates a potential ongoing public health risk and the mention of people dying highlights the seriousness of the situation. The person asking where to learn how to use Narcan indicates concern and a potential desire to intervene in future overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 10:15:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant put-downs... I feel so small. Anyone else experience this? Just looking for someone who understands.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes ongoing emotional abuse (put-downs) which can significantly impact mental health and potentially escalate over time. The user is seeking validation and understanding, suggesting they are struggling to cope. While there's no explicit mention of self-harm or suicide, the sustained emotional distress raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 10:14:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, and a plea for help suggesting potential emotional distress. While not explicitly suicidal, the metaphor of being 'underwater' implies suffocation and desperation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-19 10:13:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Okay, here's a short, realistic post:\n\n\"Felt so overwhelmed today. Urges were really strong. Managed to distract myself for now, but it's exhausting. Anyone else relate? Just feeling really alone with this.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post expresses strong urges and feelings of being overwhelmed and alone. While the individual managed to distract themselves, the intensity of the urges and the expressed isolation suggest a potential risk of escalation. The nature of the 'urges' is unspecified, increasing uncertainty.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 10:12:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Didn't know what to do. Wish I'd said something. Anyone else ever freeze like that? Feels awful.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence suggests potential for escalation or further harm. While not directly involved, the description implies a potential for a more dangerous situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 09:26:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud I can't shake. Reaching out because I know I need to. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of persistent sadness and acknowledges a need for help, suggesting potential for escalation if unaddressed.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 09:25:00"
  },
  {
    "title": "User Story: Violence",
    "content": "Heard shouting next door again last night. Makes me jump every time. Called the non-emergency line before, but nothing changed. Feeling helpless. Anyone else deal with this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text doesn't explicitly state immediate danger, the repeated shouting, feeling helpless, and being easily startled suggests a potential for escalation. The ongoing nature of the situation, coupled with the impact on the individual's well-being, warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 09:23:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Just broke a 6-month clean streak. Feeling so ashamed and lost. Reaching out before things get worse again. Any advice on coping strategies that actually work?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after 6 months suggests vulnerability. Shame and feeling lost indicate potential for escalation. Reaching out is positive, but the risk of self-harm or other negative coping mechanisms exists.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 09:22:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm starting to think the yelling isn't normal. It's constant, and now he's isolating me from my friends. Has anyone else experienced this? I feel so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional and social abuse (isolation) which, while not directly life-threatening, can escalate to more dangerous situations or significantly impact mental health.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 09:21:55"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing unease. While unsettling, it doesn't indicate immediate danger to the individual or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 09:20:53"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. My heart is still racing. Said something, but feel like I should have done more? Anyone else ever freeze up like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence (shoving) indicates a risk of escalation or further harm to the victim. While not directly involved, the poster's distress suggests potential for vicarious trauma or a desire to intervene in future situations.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 09:19:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been walking on eggshells lately. Every little thing sets him off. Is this normal in relationships? Starting to feel really trapped.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a potential for escalation. \"Walking on eggshells\" and \"every little thing sets him off\" indicates possible emotional abuse and control. Feeling \"trapped\" is also a concerning sign.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 09:18:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Cutting again after 6 months clean. Messed up. Need to find my way back to coping strategies that actually work. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Relapse into self-harm after a period of abstinence indicates a significant escalation in distress and coping difficulties, raising immediate concerns for safety.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 09:17:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It helps. If you're struggling too, you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which suggests an escalation of distress. While the person has reached out for help, the presence of urges necessitates a medium severity rating. The specific nature of the urges is not defined, but their reappearance warrants attention.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 09:16:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Didn't want to, but I relapsed. Day 1 again. Reaching out for support this time. It's so hard.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse can indicate a worsening of underlying issues and increased vulnerability. Reaching out is a positive sign, but the statement conveys distress and a struggle with a difficult situation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 08:23:33"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the bus stop. Makes me sick. Reminded me of things at home. Anyone else deal with this? Feeling so unsafe lately.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a feeling of unsafety and distress triggered by witnessing violence, potentially indicating vulnerability and a heightened emotional state.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 08:22:31"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I hate this. Reached out to a friend, hoping it helps. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feeling overwhelmed, suggesting a potential risk of self-harm or relapse into harmful behaviors. Reaching out to a friend is a positive step, but the severity remains moderate due to the presence of urges and the expressed need to 'get through tonight'.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 08:21:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home have been rough. Constant put-downs are wearing me down. Anyone else ever feel this way? I'm not sure what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a feeling of being worn down by constant put-downs, suggesting a potential for escalation. The individual is also seeking help and validation, implying they are struggling to cope. While there is no explicit mention of self-harm, suicide, or violence, the ongoing abuse and resulting distress elevates the risk level beyond low.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 08:20:28"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting on the street, yelling. He shoved her. My hands are still shaking. Called 911, hope she's okay. Makes you realize how close it can be.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence (shoving) occurred, indicating a risk of injury. While the immediate threat may have subsided with the 911 call, the situation involved assault and potential harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-19 08:19:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but lacks explicit statements of harm or intent. It's a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2026-01-19 08:18:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Cutting again after 6 months clean. Feels like such a failure. Reached out to my therapist, hoping to get an emergency appointment. Just need to get through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Relapse of self-harm after a period of abstinence indicates a significant escalation of distress and potential for further self-harm. The individual is actively seeking help, which is a positive sign, but the intensity of the feelings and the relapse elevate the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-19 08:17:23"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad. Constant yelling, put-downs... I feel so small. Anyone else go through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a negative home environment with emotional abuse. While there is no explicit mention of self-harm or suicide, the feelings of worthlessness ('feel so small') and the general distress ('things have been bad') warrant a medium severity rating as it could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-19 08:16:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so numb lately, like I'm watching my life from behind glass. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of numbness and detachment, but doesn't explicitly mention self-harm, suicide, or violence. It is a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2026-01-19 08:15:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Called 911, they’re gonna be okay. Reminded me we gotta look out for each other. Naloxone saves lives. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, indicating a serious health risk, but the person received help and is expected to recover.",
    "detected_category": "overdose",
    "timestamp": "2026-01-19 08:14:18"
  }
]