[
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things are bad at home. I feel so trapped. Is there anyone who's been through this? I just need to know I'm not alone.\"\n\n**Option 2 (Sharing a Story):**\n\n> \"It took me years to realize it WAS abuse. Yelling, controlling my money...it's not normal. Leaving was the hardest, but best, thing I've ever done.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Gaslighting is real. Don't let anyone make you doubt your own sanity. Trust your gut, always.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses feelings of being trapped in a bad home situation, which could potentially escalate. Options 2 and 3 describe or allude to abusive situations.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 01:46:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... It's scary. Lost a friend last year. Narcan saves lives. Learn how to use it. Please. 💔",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose, the loss of a friend to overdose, and a plea to learn how to use Narcan. This suggests an ongoing overdose risk and potential exposure to dangerous situations. While the message advocates for harm reduction, the underlying context implies a significant risk in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 01:45:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"He's been isolating me from my friends & family lately. Makes me feel so small and worthless. Is this normal in relationships? Feeling lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Isolation from support systems and feelings of worthlessness are significant risk factors for mental health decline and potential escalation to self-harm or suicidal ideation. While not explicitly stated, the situation warrants concern and further investigation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 01:44:48"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of stuff from my childhood. Anyone else get triggered by stuff like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes feeling shaken up and triggered by witnessing a fight, but does not express any immediate intent to harm self or others. It expresses a desire for coping mechanisms.",
    "detected_category": "other",
    "timestamp": "2025-12-16 01:43:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The constant put-downs are chipping away at me. Anyone else ever feel like they're walking on eggshells all the time? Is this normal in a relationship?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potentially a verbally abusive relationship. The individual feels like they are 'walking on eggshells' and being worn down by 'constant put-downs,' suggesting an unhealthy and potentially escalating situation. While not explicitly suicidal or self-harming, the sustained emotional abuse elevates the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 01:42:44"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight outside my kid's school. Shook me up. Makes you wonder what's going on in people's lives to get to that point. Anyone else feeling on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and raises general safety concerns, but doesn't indicate an immediate or targeted threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 01:41:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan worked, thank god. Keep it on you, people. You never know when you'll need it. Learn how to use it. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A person overdosed and required Narcan, indicating a life-threatening situation. While the person survived, the event highlights the high risk of overdose in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 01:40:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Just reached out to a helpline. It was scary, but I'm glad I did. There's still hope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being overwhelmed and 'drowning,' indicating significant emotional distress and potential for self-harm. Reaching out to a helpline suggests they recognize the seriousness of their situation and are seeking help, but the initial state of distress warrants medium severity.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 01:39:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad lately. Constant put-downs, walking on eggshells... I feel so alone. Is this normal? Anyone else been through this? I don't know what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation with potential for escalating harm due to emotional abuse and isolation. While there's no explicit mention of physical violence or self-harm, the described environment of 'constant put-downs' and 'walking on eggshells' suggests a toxic and potentially dangerous situation that could lead to negative mental health outcomes. The individual's feelings of loneliness and uncertainty ('I don't know what to do') warrant concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 01:38:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He was screaming again last night, over nothing. I just feel so small. Is this normal? Anyone else ever feel this way? I don't know what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional distress and potential abuse, suggesting a need for intervention and support. The phrase 'I feel so small' combined with 'He was screaming again last night' indicates a power imbalance and potential for ongoing harm, though immediate danger is not explicitly stated.",
    "detected_category": "abuse",
    "timestamp": "2025-12-16 01:37:35"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor OD last night. Narcan saved him, but it was terrifying. Learn the signs & carry it if you can. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the neighbor survived due to Narcan, a drug overdose is a serious medical emergency with potentially fatal consequences. The event was also described as \"terrifying\", indicating significant distress.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 00:46:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Narcan saved them. Scary stuff. Please, learn the signs of an overdose. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a high risk of death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 00:45:22"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing on the street, got heated fast. He shoved her, I froze. Wish I'd done something. Still shaking. Anyone else ever feel this helpless?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the reporting person wasn't directly harmed, the text describes an act of violence (shoving) which has the potential to escalate. It also expresses distress and a sense of helplessness, indicating potential psychological impact on the observer.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 00:44:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. Urges were strong, but I distracted myself. One hour at a time, right? Anyone else relate? Just feeling really alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges and feelings of being overwhelmed and alone, suggesting potential self-harm risk although it is mitigated by the user employing distraction techniques.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 00:43:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. It's hard to reach out, but I know I need to. Talking to someone feels like the first step.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The statement expresses feelings of being overwhelmed and drowning, indicating significant distress and potential for self-harm. The individual acknowledges needing help but finds it difficult to reach out, suggesting a barrier to support and increasing risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 00:42:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are strong. Reached out to a friend, feels a tiny bit lighter. Remember you're not alone. <3",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges and a rough time, suggesting potential self-harm or suicidal ideation. Reaching out to a friend is a positive coping mechanism, but the presence of strong urges necessitates a medium severity level.",
    "detected_category": "suicide",
    "timestamp": "2025-12-16 00:41:15"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing in the street, things escalated fast. Scared me. Is there anywhere to report that kinda thing anonymously, even if I'm not sure if it was \"serious\" enough? Felt wrong to just walk by.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a heated argument is unsettling, but without clear evidence of physical violence or immediate threat, the risk severity is low. The reporter is primarily expressing fear and concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-16 00:40:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor being carried out on a stretcher last night. OD. Scared me. Addiction is a monster. If you're struggling, please reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a neighbor's overdose, indicating potential risk to the neighbor and raising concern for the original poster's mental state given the statement of being scared. While not directly stating risk to the poster, it does imply a close proximity to a dangerous situation and a possible emotional impact.",
    "detected_category": "overdose",
    "timestamp": "2025-12-16 00:39:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Again. The urges were too strong. Feeling so ashamed and alone. I need to find better coping mechanisms. Anyone else been there? How do you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses urges and feelings of shame and isolation, suggesting a potential struggle with negative behaviors or thoughts. While not explicitly mentioning self-harm or suicide, the intensity of the urges and the lack of coping mechanisms warrant a 'medium' severity rating due to the potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 00:38:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly low lately. Like I'm constantly underwater. Reaching out because I don't know what else to do. Is anyone else going through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed, which are risk factors for mental health decline and potential self-harm. The user is reaching out for help, suggesting they are struggling to cope independently.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-16 00:37:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It helps. If you're struggling too, you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions returning urges, which suggests a potential for self-harm. While the person reached out for help, the presence of urges warrants a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 23:18:19"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's getting harder to hide the bruises. Said I deserved it for being 'disrespectful'. I feel so alone. Anyone know resources to get help discreetly?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes physical abuse (bruises, statement about deserving it) which is a significant safety risk. The user also expresses feeling alone, increasing vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 23:17:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm stuck in a hole. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and hopelessness, but does not contain any explicit statements of suicidal ideation, self-harm intent, or intent to harm others. The individual is reaching out for help, which suggests a desire to improve their situation.",
    "detected_category": "other",
    "timestamp": "2025-12-15 23:16:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Need to find a way back up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, potentially indicating distress and a need for help. The metaphor of being \"underwater\" and needing to find a way \"back up\" can suggest a struggle with difficult emotions and a desire to escape a negative situation. While not explicitly suicidal, it warrants attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 23:15:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, thankfully. Makes you realize how fragile things are. If you're struggling, please reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, the text describes a recent overdose incident, indicating a serious potential risk to self (even if to another person). The phrase 'scariest thing ever' indicates this was a frightening and impactful event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 23:14:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary. Narcan saved them, but shook me up. Anyone else been through this? Where do you find support? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be traumatizing and indicates potential indirect harm to the reporter's mental well-being. While the person survived, the experience has clearly caused distress. Additionally, it indicates potential ongoing risk of overdose in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 23:13:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scared me senseless. Narcan worked, thank god. Makes you realize how close we all are to the edge. Anyone know resources for dealing with the aftermath of something like that? Still shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be a traumatic experience, leading to potential psychological distress and anxiety in the witness. While the immediate danger is mitigated by the Narcan, the long-term effects of the trauma and potential for vicarious traumatization necessitate a medium severity rating.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 23:12:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about someone ODing. Scared me. Happened to my brother last year, thankfully he's okay now. Narcan saves lives. Learn where to get it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person who OD'd is not the author, the post references a recent overdose event and the author's personal connection to a past overdose with their brother. This suggests a potential ongoing risk in the community, and the emotional impact is significant.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 23:11:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, indicating a potential for emotional or psychological abuse. The feeling of being trapped is also concerning. While not explicitly stated, there is a risk that this situation could escalate or lead to mental health deterioration.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 23:10:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Scratched last night. Again. Feeling so ashamed and lost. Reaching out before it gets worse. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates self-harm (scratching), feelings of shame, being lost, and a desire to prevent escalation. While there's no explicit suicidal intent, the self-harm and feelings of being overwhelmed suggest a need for intervention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 23:09:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. Really fighting the urge to relapse. Just need to get through tonight. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with relapse, suggesting a potential risk to the individual's well-being. The phrase \"fighting the urge\" and \"need to get through tonight\" suggest active risk. Although not explicitly stated, relapse could lead to self-harm or other dangerous behaviors.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 22:17:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Just reaching out. If anyone's been through dark times, how did you find a little light? Need some hope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and a desire for help, but does not contain explicit suicidal ideation, self-harm plans, or threats.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 22:16:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, just trying to get through tonight. It's a struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm. Reaching out to a friend indicates an attempt to manage the crisis, but the presence of the urge signifies a serious risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 22:15:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you wonder what's going on in people's lives to get to that point. Hope everyone involved is okay. Feeling shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is disturbing, but the text doesn't indicate direct personal harm or intent to harm others.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 22:14:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing unease. While concerning, it doesn't indicate immediate danger to the speaker or others, nor does it describe participation in the fight.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 22:13:52"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train. People just watched. Makes you sick. Anyone know what to do if you witness something like that? I froze. Wish I hadn't.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical assault occurred, indicating a risk of injury and potential escalation. While it's a single incident, the act of pushing someone creates a medium level of concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 22:12:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good lately. Walking on eggshells constantly. Is this normal? Feeling really lost and scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a distressing and potentially harmful home environment characterized by fear and anxiety. While there's no explicit mention of physical harm, the feeling of being 'scared' and 'walking on eggshells' suggests potential for emotional or psychological abuse.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 22:11:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and overwhelmed (\"underwater\"), indicating potential distress. The request for advice suggests a desire for help, but the general sense of hopelessness warrants concern. While not explicitly suicidal, the level of distress implies a need for support.",
    "detected_category": "other",
    "timestamp": "2025-12-15 22:10:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scared me senseless. Narcan saved them, thank God. Please, if you're struggling, reach out. There's help out there. Don't become another statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes an overdose event requiring Narcan intervention, indicating a severe and life-threatening situation. While the person survived, the potential for fatality is extremely high with overdoses.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 22:09:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough at home. Constant put-downs, isolating me from friends. Feels like I'm walking on eggshells. Anyone else experience this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse (put-downs, isolation) which creates a stressful and potentially harmful environment. The phrase 'walking on eggshells' indicates a high level of anxiety and fear. While not explicitly stating intent for self-harm or violence, the situation warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 22:08:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Terrifying. Narcan worked, thank god. Makes you realize how close it is to everyone. Learn CPR, carry Narcan. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a potentially fatal overdose event. Although intervention was successful, the risk of recurrence and the prevalence of overdose highlight a significant safety concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 21:18:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, thank god. Carry it, people. You never know when you might need it. Learn how to use it. It's worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a life-threatening overdose event, highlighting the immediate danger and the necessity of emergency intervention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 21:17:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about someone OD'ing. Scared me. My brother went through that last year. Thankfully he's okay now, but it was close. Please, be safe and look out for each other. Naloxone saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a recent overdose event impacting the poster's social circle, indicating a potential risk of further overdose incidents within that group.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 21:16:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about overdose deaths spiking again. Feels so close to home. Lost a friend last year. Please, if you're struggling, reach out. There are people who care and want to help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and acknowledges the impact of overdose deaths, suggesting potential vulnerability and a need for support, indicating a risk level beyond just awareness.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 21:15:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Guy got knocked out cold. Shook me up. Makes you realize how quickly things can escalate. Be careful out there, everyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was knocked unconscious in a fight, indicating a moderate level of physical violence and potential for serious injury.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 21:13:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I'm fighting them, but it's exhausting. Reached out to a friend. Just need to make it through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which are being fought with exhaustion. The person is reaching out for help, suggesting an awareness of the risk, but the presence of urges elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 21:12:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Relapsed after a few months clean. Feeling really ashamed and alone. Reaching out for support. Anyone else been there?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse and feelings of shame and isolation are significant risk factors for increased vulnerability and potential self-harm. The act of reaching out is positive, but the underlying issues require attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 21:11:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, thankfully. Makes you realize how fragile life is. If you're struggling, please reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event and indicates potential substance abuse issues in the surrounding environment. While the individual is currently okay, the event itself carries a risk of future occurrences and potential harm to others or themselves. It also highlights the presence of a support network which decreases severity.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 21:10:54"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nUgh, rough day. Feeling the urge to relapse is so strong. Just trying to breathe and remember why I stopped. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expressing a strong urge to relapse indicates a potential risk of returning to harmful behaviors. While not actively self-harming or suicidal in the moment, the intense urge signals vulnerability and warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 21:09:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them. Makes you realize how close we all are to the edge. Anyone else carrying it? Should be mandatory training.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was effective, the overdose event indicates a significant risk of a life-threatening situation occurring in the area. The text highlights the potential for harm and the need for preventative measures.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 21:08:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan worked, thank god. Makes you realize how fragile life is. Learn the signs, carry naloxone if you can. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, indicates a significant risk of future overdose events in the area and highlights the presence of potentially fatal drug use. While the individual survived, the situation underscores the potential for severe harm or death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 20:19:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend, hoping it helps. It's so hard to keep going sometimes.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and struggling to keep going, which could indicate suicidal ideation, although not explicitly stated. Seeking support is a positive sign, but the underlying distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 20:18:13"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I hate this. Reached out to a friend, just need to make it through tonight. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions the return of unspecified 'urges' and feeling overwhelmed, suggesting a potential risk of harm. The individual has reached out for support, indicating awareness and a desire to cope, which mitigates the immediate risk to some degree. However, the nature of the urges is unknown and requires further assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 20:17:11"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and helplessness, but there is no explicit mention of self-harm, suicide, or harm to others. The individual is reaching out for support.",
    "detected_category": "other",
    "timestamp": "2025-12-15 20:16:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Really struggling tonight. The urges are so strong. Anyone know good distractions that actually work? Feeling so lost.\n\n**Option 2 (Sharing Experience):**\n\n> Been clean for 3 weeks. Longest streak in ages. Still hard, but proving to myself I can do this. One day at a time.\n\n**Option 3 (Raising Awareness):**\n\n> Scars aren't always visible. Be kind, you never know what someone is going through. Check in on your friends.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses strong urges and feelings of being lost, indicating potential self-harm risk. While not explicitly stating suicidal intent, the intensity of the struggle warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 20:15:07"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight downtown last night. So scary how quickly things escalated. Is there anywhere to learn self-defense around here? Feeling really shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence and expresses fear but doesn't indicate the individual is in immediate danger, planning violence, or at risk of self-harm. The person is shaken and seeking self-defense training, indicating a desire for increased safety and preparedness rather than an imminent threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 20:14:05"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his car mirror after getting cut off. Scared me. Is that normal? Makes me wonder what happens at home, you know?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the incident describes an act of violence, it's directed at property and not a person. The observer expresses fear, indicating potential for escalation, but the immediate risk of severe harm is low. The concern about 'what happens at home' suggests a possible concern about abuse, but it's speculation.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 20:13:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm drowning. Reaching out because I don't know what else to do. If you've been there, any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, drowning, and not knowing what to do. While it doesn't explicitly mention self-harm or suicide, the intensity of the distress suggests a need for support and could potentially escalate if unaddressed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 20:12:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... rough. Walking on eggshells constantly. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a potentially unsafe home environment and emotional distress. 'Walking on eggshells' indicates potential conflict or abuse, although the specifics are unclear.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 20:10:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Reaching out because I don't know what else to do. If anyone has felt this way and found something that helped, please share.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of loneliness and a desire for help, but does not indicate immediate harm or intent.",
    "detected_category": "other",
    "timestamp": "2025-12-15 20:09:58"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just realized yelling constantly *is* emotional abuse. Feels stupid admitting it, but it's been years. Anyone else dealt with this? How did you even start to heal?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the writer acknowledges perpetrating emotional abuse (yelling constantly). While the focus is on their healing, the admission suggests a potential for ongoing abusive behavior and the need for intervention to prevent further harm to others. The severity isn't high as it's retrospective and the writer is seemingly remorseful and seeking help, but it's more than low due to the potential for future incidents if the root cause is not addressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 19:18:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are strong. Trying to distract myself, but it's hard. Anyone else feel this way? Just feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges and feelings of isolation, which are risk factors for self-harm or suicide. While there's no explicit plan, the struggle indicates a need for support.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 19:17:16"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the park. Shaken up. My hands are still trembling. Is there anywhere safe to walk around here anymore? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, causing emotional distress (shaking, feeling lost). While distressing, it doesn't indicate imminent danger to the person themselves.",
    "detected_category": "other",
    "timestamp": "2025-12-15 19:16:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Reached out to a friend, feels good to not be alone with it this time. If you're hurting too, please talk to someone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential for self-harm or suicidal ideation. While the person has reached out for support, the presence of urges necessitates a medium severity level.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 19:15:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "I keep making excuses for him. Saying it's just stress. But the yelling is getting worse, and now...the pushing. Is this really happening to me? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes escalating physical abuse (pushing) which is a significant safety risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 19:14:11"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Guy got knocked out cold. Shaken up, honestly. Anyone know good resources for dealing with witnessing violence? Feel sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be psychologically damaging, indicating a potential need for mental health support. While the poster is not directly threatened, the event was impactful and is causing distress.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 19:13:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Scary stuff. Please, if you're using, have someone with you, and Narcan. It saves lives. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event, indicating a high risk of serious harm or death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 19:12:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good lately. Walking on eggshells constantly. Is this normal? Feeling really lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a difficult home environment with potential for abuse or violence, indicated by 'walking on eggshells.' The feeling of being 'lost' raises concern for emotional distress.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 19:11:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Felt so overwhelmed today. Urges were strong, but I reached out to a friend instead. It helped, a little. Still shaky, but I'm here. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and shakiness, suggesting distress and potential for self-harm, even though the person reached out for help. The phrase \"still shaky\" implies the urge hasn't completely dissipated.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 19:10:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been... not good lately. Walking on eggshells constantly. Is this normal? Feeling so lost and alone. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a potentially abusive or volatile domestic situation with the phrase \"walking on eggshells.\" The user expresses feeling lost and alone, indicating emotional distress. While there is no explicit mention of violence, self-harm, or suicide, the description suggests a concerning situation that warrants further investigation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 19:09:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Terrifying. Narcan saved them, but it shook me up. We gotta do better protecting each other. Where can I learn more about helping in these situations?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was administered successfully, a person overdosing represents a significant health risk with potentially fatal consequences. The text also conveys the witness's distress, indicating the impact of the event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 18:22:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is strong. It's scary. Reached out to a friend, hoping it helps. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm and acknowledges fear, indicating a significant and immediate risk. While the person has reached out for help, the intensity of the urge elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 18:21:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Narcan saved them, but it shook me up bad. Is there anywhere to learn how to help if it happens again?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and suggests a potential risk of future overdose incidents in the area. While the individual survived, the situation highlights a public health concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 18:20:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on Elm St. Shook me up. Called it in, hope she's okay. Makes you realize how common this is. Anyone else witness something similar? Feeling sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent act (shoving) suggests potential for escalation and immediate harm to the victim. While the text doesn't describe severe injuries, the act itself is a risk indicator.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 18:18:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Makes you think. My little brother's been acting out lately, getting angry so fast. Anyone dealt with a kid with anger issues? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses concern about a younger brother's anger issues and seeks advice, but does not directly indicate imminent danger to self or others. The observation of a fight downtown is a trigger for reflection, but not a direct threat.",
    "detected_category": "other",
    "timestamp": "2025-12-15 18:17:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Reaching out because I don't know what else to do. Is anyone else going through this? Need to know I'm not the only one.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and a need for connection, but does not contain explicit mentions of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2025-12-15 18:16:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been so angry lately, and I just feel like I'm walking on eggshells. Is this normal? I don't know what to do anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests potential emotional abuse and fear of escalating anger, indicating a risk of harm. The user is feeling helpless and walking on eggshells, signaling a potentially unsafe environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 18:15:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my brother unresponsive. Narcan saved him. Terrified. Learn the signs, people. Please. It can happen to anyone. Where can I get more Narcan for free?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Brother found unresponsive and required Narcan, indicating a life-threatening opioid overdose. While the immediate crisis is averted, the risk of future overdose remains high.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 18:14:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw two guys fighting outside my work today. Scared the crap out of me. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a violent situation, but the author expresses fear rather than intent to harm themselves or others. The general anxiety expressed is not directly indicative of imminent danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 18:13:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Narcan saved them, but it shook me up bad. We need more access & less stigma. Check on your friends, please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event. While Narcan was successful, the event highlights the risk of overdose in the community and the potential for fatal outcomes.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 18:12:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm drowning. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost, using the metaphor of drowning, indicating significant emotional distress and a plea for help. While not explicitly suicidal, the level of distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 17:21:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like a dark cloud won't lift. Reaching out because I know I need to. Talking to a therapist next week. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses low mood and a desire to seek help by talking to a therapist. The individual acknowledges their need for support and has scheduled an appointment.",
    "detected_category": "other",
    "timestamp": "2025-12-15 17:20:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so overwhelmed lately. The urges are back and stronger. Trying to stay strong but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a return of strong urges and a feeling of being overwhelmed, suggesting a potential risk of acting on those urges. The user is seeking support, indicating they are struggling.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 17:19:10"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy get shoved on the train platform today. Scared me half to death. Everyone just walked past. Is that normal now? Feeling really shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent act, even if not directly involved, can be traumatizing. The text indicates emotional distress ('scared me half to death,' 'feeling really shaken') and raises concerns about the normalization of violence ('Is that normal now?'). While the event itself is a single instance and the individual is not the direct victim, the emotional impact and questioning of social norms elevate the risk beyond low.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 17:18:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to a friend helped a little. Trying to take it one day at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, which could be indicative of depression or suicidal ideation. While talking to a friend helped, the overall sentiment suggests potential vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 17:17:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scared. Found my brother unresponsive. Narcan worked, thank God. Please, if you're struggling, reach out. Don't want anyone to go through this. There's help available.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Brother experienced a potentially fatal overdose requiring Narcan. While the immediate crisis is resolved, the underlying issue of substance abuse and potential relapse risk remain a significant threat.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 17:16:05"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a fight outside my building last night. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be upsetting, but the text doesn't indicate imminent danger or direct involvement. The user expresses being shaken up and on edge, suggesting emotional distress but not a direct threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 17:15:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Sometimes it feels like I'm drowning. Just need to remember to breathe and reach out. Talking to a friend later, hoping it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The statement expresses feelings of being overwhelmed and 'drowning,' suggesting significant emotional distress. While the individual mentions coping mechanisms (breathing, reaching out, talking to a friend), the initial expression warrants attention and monitoring. The use of 'drowning' can be a metaphor for suicidal ideation or overwhelming emotional distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-15 17:14:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... rough. Walking on eggshells constantly. Is this normal? Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home environment, characterized by 'walking on eggshells,' which suggests potential emotional or psychological distress and a possible abusive situation. While not explicitly stating harm, the phrasing indicates a potentially unhealthy and unsafe dynamic.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 17:12:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so incredibly alone lately. Like I'm underwater. Just needed to say it out loud. If anyone's been there, how did you get through it?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and isolation, but does not contain explicit suicidal ideation, self-harm plans, or threats of violence. The person is reaching out for support, which suggests they are not entirely overwhelmed.",
    "detected_category": "other",
    "timestamp": "2025-12-15 17:11:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after a close call. Mixing things is so dangerous. Please be careful, everyone. It's not worth it. Scared straight, for real.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a recent hospitalization due to mixing unspecified substances, implying a significant negative health outcome. The phrase \"scared straight\" suggests a serious, potentially life-threatening, event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 16:21:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Been feeling so low lately.  Urges are back.  Anyone know good coping strategies or where to find help that actually understands?  Feeling lost.\n\n**Option 2 (Sharing Experience):**\n\n> 6 months clean from SH. Some days are still really hard, but I'm trying.  It IS possible to stop.\n\n**Option 3 (Raising Awareness):**\n\n> Just a reminder to check in on your loved ones. You never know what someone's going through.  Be kind.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 mentions urges, indicating current risk. Option 2 suggests a history of self-harm. Option 3 raises awareness of the need to check on others, implying that there may be some cause for concern for someone else's well-being.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 16:20:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a crisis line, hoping it helps this time. It's exhausting.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm and feelings of being overwhelmed, indicating a significant risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 16:19:18"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired of walking on eggshells. Every little thing sets him off. Is this normal in relationships? Feeling trapped.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a potentially volatile relationship dynamic, suggesting possible emotional or psychological abuse. The feeling of being 'trapped' raises concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-15 16:18:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Lost my cousin last week. OD. So messed up. Please, if you're struggling, reach out. Don't let it get this far. There are people who care.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a recent death due to overdose, indicating a significant risk of imitative behavior or heightened distress in the network of the deceased.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 16:17:15"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want to feel *something* else. Not proud of it, but it's real. Trying to find healthier ways to cope. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses a desire to feel something different when overwhelmed, but doesn't explicitly mention self-harm, suicide, violence, abuse, or overdose. It also indicates an attempt to find healthier coping mechanisms.",
    "detected_category": "other",
    "timestamp": "2025-12-15 16:16:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor being carried out on a stretcher last night. OD. Scary. Please, if you're struggling, reach out. There's help. Don't let this be you.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a neighbor's overdose, implying a potentially fatal situation and highlighting the risk of similar outcomes for others struggling. The mention of outreach suggests a proactive response, but the underlying risk remains significant.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 16:15:12"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on Elm St. Called the cops, hope she's okay. Makes me sick to my stomach. Anyone know of resources for domestic violence victims in this town?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence (shoving) has occurred, indicating a potential for escalation and further harm. While the immediate risk to life isn't explicitly stated, the act suggests an ongoing or potential pattern of abuse.",
    "detected_category": "violence",
    "timestamp": "2025-12-15 16:14:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found out a friend OD'd. Feels so unreal. Please, if you're struggling, reach out. There are people who care and want to help. Don't be afraid to ask.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose death of a friend, which can be a trigger for others struggling with similar issues. While the text encourages reaching out for help, the mention of overdose suggests a vulnerability and heightened risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-15 16:13:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head. Scratched again last night. Feels like a release, but I hate it after. Anyone else get this? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates self-harm (scratching) as a coping mechanism, which while not explicitly suicidal, suggests distress and a potential escalation of harmful behaviors.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-15 16:12:06"
  }
]