[
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm underwater. Just reaching out, hoping someone understands. It's hard to keep going sometimes.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and struggling to keep going, suggesting potential suicidal ideation, although without specific plans.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 22:17:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Talking to someone tomorrow. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and acknowledges the need for help, indicating a potential risk. The user is taking steps to address the issue by talking to someone, which mitigates the immediate risk, but the underlying feelings require monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 22:16:24"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. My hands are still shaking. Should I have done something? I froze. Feeling so guilty.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed an act of violence (shoving) which indicates potential for escalation and harm to the girlfriend. While the immediate risk might be contained, the potential for future violence and the emotional distress of the witness elevate the concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 22:15:22"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on the way home. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel extra anxious lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused anxiety but doesn't indicate direct involvement or imminent danger to the author or others. It reflects a general feeling of unease.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 22:14:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm underwater. Reaching out before it gets worse. Any tips for finding a therapist? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost, combined with a proactive step of reaching out for help. The statement 'before it gets worse' indicates a potential for escalation if not addressed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 22:13:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Day 3 clean. Just need to keep reminding myself it's a temporary fix. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant and immediate risk. While the individual is currently abstaining ('Day 3 clean'), the intense urge suggests a high likelihood of relapse.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 22:12:18"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight break out downtown last night. So scary how quickly things escalated. Shaken up. Anyone else witness that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The user witnessed a fight, which caused them distress, but there's no indication of direct harm to the user or intent to cause harm to others.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 22:11:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Relapsed last night. Feeling so ashamed and lost. Reached out to the crisis line, just needed to tell someone. It's a long road, but I'm still here.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse coupled with feelings of shame, loss, and reaching out to a crisis line indicates distress and potential for escalation. While the individual states they are 'still here,' the relapse increases vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 22:10:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, thankfully. Made me realize how fragile life is. Learn the signs, carry Narcan. You could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event that can be psychologically distressing and indicates the presence of significant risk within a community. While the person survived, the event itself carries potential for secondary trauma and highlights the ongoing danger of substance abuse.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 22:09:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at a party last night. Scariest thing ever. Narcan saved them, but damn. Please, if you're using, have someone with you and carry Narcan. It's not worth the risk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event requiring Narcan intervention, indicating a significant and immediate risk of serious harm or death associated with drug use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 22:08:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad. Getting screamed at for every little thing. Walking on eggshells. Anyone else experience this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive situation involving verbal abuse and a feeling of isolation. While not explicitly stating intent to harm self or others, the emotional distress and feeling of being alone raises concern for potential escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 21:17:13"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on my street. Shaken up. Called the cops, but still... Makes you wonder what's going on with people lately. Anyone else feel on edge?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual reporting is shaken and expresses unease, the fight itself indicates a potential for violence in the area, and the feeling of being \"on edge\" suggests a heightened state of anxiety and potential vulnerability.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 21:16:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Reached out to a friend, just need someone to listen. It helps. Please, if you're struggling too, don't be alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges, implying potential self-harm or suicidal ideation. The individual reached out for help, which is a positive sign, but the presence of strong urges elevates the risk beyond low. The encouragement to others not to be alone suggests awareness of the danger.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 21:15:10"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend, hoping it helps. It's exhausting pretending I'm okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost, overwhelmed ('underwater'), and exhausted from pretending to be okay. This indicates emotional distress and potential vulnerability, requiring further assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 21:14:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Reached out to a friend, feels a tiny bit lighter. Remember we're not alone in this. 💜 If you're struggling too, please reach out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential relapse or escalation of a previous issue. While the person has reached out for help, the presence of urges elevates the risk beyond low. The specific nature of the urges is not clear, warranting caution.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 21:13:07"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so numb lately. Everything's just... heavy. Reaching out because I don't know what else to do. Talking feels impossible, but I need to try.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses numbness, emotional heaviness, and a feeling of being overwhelmed, suggesting potential risk for self-harm or suicidal ideation. The individual is reaching out, indicating some awareness of needing help, but also states talking feels impossible, which is concerning.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 21:12:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them. We need more people trained. Learn the signs, it could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person overdosed, indicating a serious health risk, but the situation was resolved with Narcan. While the individual was saved, the potential for fatal outcomes exists and highlights a broader community issue.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 21:11:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were strong, but I distracted myself with a movie. Small win, I guess. Anyone else get that feeling of needing to feel *something*? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates urges, but also successful distraction and seeking coping mechanisms. While concerning, the person is actively managing the situation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 21:10:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, I just want to feel *something* else. Day 1 clean. Scared, but trying. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to feel \"something\" else due to overwhelming thoughts, coupled with the mention of being \"clean\" and scared. This suggests potential self-harm tendencies or a struggle with addiction/withdrawal, indicating elevated risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 21:09:01"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Just realized yelling every day & calling me names isn't normal. Feeling lost. Anyone else been through this? How do you even start to fix things?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional abuse and distress which can escalate to mental health issues. While not explicitly mentioning harm, the repeated verbal abuse and the user's feeling of being 'lost' suggests a need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 21:08:00"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 74 (char 99)",
    "detected_category": "unknown",
    "timestamp": "2025-12-25 20:18:55"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a guy shove his girlfriend on Elm St. Shook me up. Didn't know what to do, just froze. Anyone else ever witness something like that? Still feel sick about it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent act can be psychologically distressing and indicates a potential safety risk for the victim. While the witness wasn't directly harmed, the event is concerning.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 20:17:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about another OD in my town. It's scary how easily things can go wrong. If you're struggling, please reach out. There are people who care & want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post describes an overdose in the community, indicating a risk of further overdose events. It also mentions struggling individuals, suggesting potential vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 20:16:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Talking feels impossible.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed (\"lost lately,\" \"underwater,\" \"don't know what else to do\"). While not explicitly mentioning self-harm or suicide, the intensity of the negative emotions and the feeling of being unable to communicate could indicate a potential for escalation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 20:15:50"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a guy shove his girlfriend on Elm St. Shook me up. Didn't know what to do. Anyone else ever witness something like that? Feeling helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be emotionally distressing and creates a potential risk of escalation if the abuser becomes aware of witnesses.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 20:14:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just reaching out... anyone else ever feel like they're drowning? Really need to hear I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and 'drowning,' suggesting significant emotional distress and a potential risk of self-harm or suicidal ideation. The request for reassurance ('need to hear I'm not alone') indicates a cry for help.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 20:13:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to someone feels impossible, but I know I need to. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, and indicates a need for help, suggesting potential for escalation if support is not found.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 20:12:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a significant level of distress and a feeling of being overwhelmed. The user is actively seeking help, suggesting they haven't yet reached a point of hopelessness, but the phrasing suggests potential for escalation if support isn't received.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 20:11:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just feeling so lost. The constant put-downs are getting worse. Is this normal in relationships? Starting to think maybe it's not just 'teasing' anymore. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of increasing emotional abuse, leading to feelings of being lost. While no immediate threat is stated, the escalation and questioning of normalcy suggest increasing distress and potential for harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 20:10:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "i'm struggling. things got really bad last night and i hurt myself again. i hate this. trying to find the strength to call the helpline. wish me luck.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly states self-harm occurred ('hurt myself again') and expresses intense distress and a sense of hopelessness, indicating a high risk of further self-harm or suicidal ideation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 20:09:42"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. Last night was bad. I feel so lost and ashamed. Does anyone know resources for emotional abuse? I need help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and feelings of shame and being lost, suggesting a need for help. While not explicitly stating intent for self-harm or suicide, the severity of emotional distress warrants a medium risk level as abuse can escalate to more serious outcomes.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 19:16:22"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a guy shove his girlfriend on the street today. Just walked right past. Feel sick about it. What should I have done?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault indicates a potential for escalation and further violence. While the reporter is not directly in danger, the event itself poses a risk to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 19:15:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about the ODs lately is scary. My brother almost died last year. Narcan saved him. Please, learn how to use it. It could save someone you love. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a near-fatal overdose experience of the author's brother, highlighting the real possibility of severe harm or death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 19:14:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of self-harm urges and feeling overwhelmed, which represents a potential risk even with reaching out for help. The exhaustion mentioned suggests ongoing distress.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 19:13:18"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming. I messed up again, and the urges are strong. Trying to stay safe and remember I deserve better. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feeling overwhelmed, mentions 'urges,' and a past mistake, indicating potential self-harm risk. While the person is trying to stay safe, the presence of strong urges elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 19:12:17"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and a sense of desperation. While it doesn't explicitly mention self-harm or suicide, the metaphor of being 'underwater' and reaching out for help indicates a potential crisis and warrants further investigation.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 19:11:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thank god. Reminded me how fragile life is. Learn the signs, folks. It could save someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose event occurred, requiring intervention. While the person survived, the event highlights the potential for fatal outcomes.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 19:10:14"
  },
  {
    "title": "User Story: Abuse",
    "content": ">Been feeling trapped lately. Constant put-downs disguised as \"jokes.\" Starting to believe them. Anyone else experience this? How do you cope? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped, repeated put-downs, and feeling lost, which can indicate emotional distress and potential for escalation if not addressed. The individual is starting to internalize negative messages which is concerning.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 19:09:12"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Saw a guy get jumped on my street last night. Shaken up. Makes you realize how quickly things can turn. Anyone else feel unsafe lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a violent assault occurring in the user's vicinity, indicating a potential threat to their safety and well-being. The user also expresses feeling unsafe.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 19:08:11"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend on the street. Froze. Someone else intervened, thankfully. Still shaking. What do you even DO in that situation? Feeling so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing violence indicates a high risk event. While the original victim may now be safer due to intervention, the text describes a violent assault which inherently poses a high risk of serious harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 19:07:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. The urges are back. Trying to stay strong and remember why I stopped. If anyone has tips for dealing with this, please share.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges' returning, implying a previous struggle with something potentially harmful. While the person is trying to stay strong, the presence of these urges suggests a risk of relapse or acting on them. The specific nature of the urges is unknown, necessitating a cautious approach.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 18:21:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately. The urge to cut is strong. Trying to resist, but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses active thoughts of self-harm (cutting) and difficulty resisting these urges, indicating a potential risk of self-inflicted harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 18:20:05"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Like I'm underwater. Reaching out because I don't know what else to do. If anyone has felt this way, how did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of intense loneliness and hopelessness, suggesting a potential for self-harm, though it does not explicitly mention suicidal ideation. The phrase \"underwater\" can be interpreted metaphorically as feeling overwhelmed and suffocated by emotions.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 18:19:04"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just wanted to say if you're struggling too, you're not alone. Reaching out feels impossible, but maybe it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and suggests reaching out for help, indicating distress but no explicit plan or intent for self-harm or suicide.",
    "detected_category": "other",
    "timestamp": "2025-12-25 18:18:02"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so small. Has anyone else experienced this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of emotional abuse (put-downs, controlling behavior) which can escalate and negatively impact mental health. While not explicitly stating intent to harm oneself or others, the feeling of being 'small' and the seeking of help indicates distress and potential for further harm if the situation continues.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 18:17:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary how fast things escalated. Shaking now. Anyone else feel like things are getting more volatile lately? I don't feel safe anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight and expressing feelings of fear and unsafety suggest a moderate level of risk due to potential for further exposure to violence or psychological distress.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 18:15:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary stuff. Narcan saved them, thank goodness. Makes you realize how close to home this is. Anyone know where to get training? Want to be prepared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a risk of potential future overdoses in the area, and the user's concern indicates distress and a desire to be prepared for similar events. While not directly indicating imminent harm to the user or others, it highlights a significant safety concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 18:14:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Please, if you're using, have someone with you. Narcan saves lives. Learn how to use it. I'm so shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose incident, indicating a high risk of death or serious harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 18:13:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train. Everyone just stared. Makes you wonder what you'd actually do in that situation. Feeling pretty shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical assault occurred, potentially leading to injury. While the immediate threat is over, the observer is shaken, suggesting the event had a significant impact and could lead to future anxiety or fear.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 18:12:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Please, if you're struggling, reach out. There's help out there. Don't let it get this far.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal event implying a potential suicide attempt or serious self-harm. The urgency in the language ('almost didn't wake up', 'Don't let it get this far') suggests a very high level of risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 18:11:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Woke up feeling like I'm walking on eggshells again. It's exhausting. Anyone else feel this way in their relationship? Sometimes I don't even know what I did wrong...\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of anxiety and uncertainty in a relationship, but doesn't explicitly mention any imminent danger or harm.",
    "detected_category": "other",
    "timestamp": "2025-12-25 17:17:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nUgh, bad day. The urge to cut is so strong. Trying to distract myself but it's hard. Anyone else feel this way sometimes? Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses a strong urge to self-harm (cutting) and feelings of loneliness, indicating a potential risk of self-harming behavior.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 17:16:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been bad lately. Constant put-downs, controlling behavior... I feel trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation with constant put-downs and controlling behavior, suggesting abuse and a feeling of being trapped. While there's no explicit mention of immediate physical harm, the controlling behavior and feeling trapped could escalate into a more dangerous situation. The user is reaching out for help, indicating a need for support.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 17:15:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel trapped. Has anyone else experienced this? How did you find help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, indicating a potentially abusive situation. The feeling of being trapped suggests emotional distress and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 17:14:25"
  },
  {
    "title": "User Story: Abuse",
    "content": "I feel so lost. Things at home have been...rough. He yells, then apologizes, then does it again. It's exhausting. Is this normal? I don't know what to do anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive situation involving repeated yelling and apologies, suggesting a cycle of verbal abuse. The user expresses feeling lost and exhausted, indicating emotional distress and a lack of coping mechanisms. While there's no explicit mention of physical violence or self-harm, the escalating nature of the described behavior and the user's distress warrant concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 17:13:24"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shaken up. Is there anywhere to volunteer, like, help people de-escalate stuff? Feels wrong to just stand by next time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed a violent assault resulting in unconsciousness. While the witness wasn't directly involved or threatened, the level of violence is concerning and suggests a potential for more serious harm in similar future events.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 17:12:23"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Shaking still. Is there anywhere to report stuff like that anonymously?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight can be traumatizing and cause distress, suggesting a potential risk to mental well-being even though the person was not directly involved. The shaking indicates a significant emotional reaction.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 17:11:21"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been rough. Constant put-downs, controlling behavior... I feel trapped. Has anyone else gone through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, indicating a potential abusive situation. While it doesn't explicitly mention physical violence or immediate danger, feeling 'trapped' suggests psychological distress and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 17:10:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mentions of self-harm, suicide, or harm to others. It is a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-25 17:09:18"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Said something, he yelled back. Wish I'd done more. Anyone else ever freeze like that? Feeling guilty.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a man physically assault his girlfriend constitutes a moderate risk. While the initial report is of a single shove, it indicates potential violence and possible escalation. The mention of yelling also suggests an unstable situation. The safety of the girlfriend is potentially compromised.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 17:08:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. Narcan saved them. Learn the signs, carry it if you can. It could save a life. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates a potential risk of further overdoses in the community or among the person's social network. The text highlights the seriousness of the situation and the potential for fatal outcomes if intervention (Narcan) wasn't available.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 16:19:20"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Called 911, they're okay now, but please, learn the signs of an overdose. It can happen to anyone. Be safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, an overdose occurred and required emergency intervention. The event highlights a significant health and safety risk in the described environment.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 16:18:18"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling, but doesn't indicate direct involvement or ongoing threat. While it mentions feeling on edge, it doesn't suggest imminent danger to self or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 16:17:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, which helped a little. Just trying to get through tonight. It's a struggle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feeling overwhelmed, suggesting an increased risk of self-harm or suicide. Reaching out to a friend is a positive coping mechanism, but the struggle persists, indicating the risk is not fully mitigated.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 16:16:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scariest thing ever. Narcan saved them. Please, if you're struggling, reach out. There are people who care. This stuff is too real.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose indicates a high risk environment and the potential for further overdose incidents, even though the person survived.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 16:15:14"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get shoved on the train platform today. Heart's still racing. Is it just me, or is everyone on edge lately? Makes you scared to even go out.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a violent act (being shoved) that resulted in emotional distress. While the individual was not necessarily seriously injured, the witnessed event caused fear and anxiety, suggesting a potential for further escalation or psychological impact.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 16:14:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, but it really shook me up. Knowing where to get it is so important. Be safe out there, friends.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports an overdose incident, indicating a potential risk to the individual and a broader safety concern related to drug use in the area.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 16:13:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Learn CPR & recognize the signs. It could save a life. I'm still shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event requiring Narcan. Overdoses are life-threatening and represent a high level of immediate danger.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 16:12:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is getting strong again. Reached out to a friend, which helped a little. Just trying to get through the day. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk. While the person reached out to a friend, the intensity of the urge suggests immediate concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 16:11:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so numb lately. Relapsed last night after a month clean. Just need to find the strength to keep going. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety is a setback and indicates distress. The statement 'feeling so numb' suggests emotional distress. While not explicitly suicidal, the relapse and feelings of numbness warrant concern and further inquiry.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 16:10:07"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Dude was yelling, then just *bam*. Scared the crap out of me. Is there anywhere I can report this anonymously?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A physical altercation occurred, suggesting a risk of injury to those involved. While the reporter seems to be safe, the event itself indicates a potential for further violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 15:17:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Narcan saved them, thank god. Carry it. Learn how to use it. It can save a life. Please be careful out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Overdose is a serious, life-threatening event, though Narcan was available and effective in this instance. It highlights the potential for severe health consequences.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 15:16:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Like I'm underwater. Reaching out to a friend tonight. Hope it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of loneliness and being overwhelmed ('underwater'). While they are reaching out for help, the language suggests significant emotional distress. The question 'It's okay to not be okay, right?' indicates a need for reassurance and highlights vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 15:15:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, and it helped a little. Just taking it one day at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 15:14:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Narcan saved them, but it shook me up. Learn how to use it, you could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event, indicating the presence of significant safety risks within the community related to drug use. While the individual survived due to Narcan, the potential for fatality and the emotional impact on the witness are concerning.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 15:13:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it feels like the only way to turn down the volume is to hurt. Trying to find healthier ways to cope. Anyone else relate? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to self-harm as a coping mechanism, indicating a potential for harm. While the individual is seeking healthier coping strategies, the active thought of self-harm elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 15:12:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and lost, indicating significant distress. The phrase 'like I'm underwater' suggests feelings of suffocation and helplessness. Reaching out for advice indicates a desire for help, but also suggests the individual may be struggling to cope. While not explicitly suicidal, the intensity of the distress warrants a medium severity rating.",
    "detected_category": "other",
    "timestamp": "2025-12-25 15:11:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing so many gone lately. Narcan saves lives, please learn how to use it. Lost a friend last week and wish I'd known more. Don't want anyone else to go through this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses grief and loss related to overdose deaths, indicating a heightened risk for potential overdose or exposure to overdose situations. While not explicitly stating intent, the strong emotional distress and call for Narcan use suggest a vulnerable environment.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 15:10:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scary stuff. Narcan saved him, but it shook me up. If you're struggling, please reach out. There's help out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event that indicates a potential risk to the individual who overdosed, though immediate harm was averted by Narcan. It also highlights a broader community risk of drug use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 15:09:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIP posts lately. OD is scary real. Found my brother barely breathing last month. Narcan saved him, but damn. Learn the signs, please. Could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses overdose (OD), a life-threatening event, and the use of Narcan to reverse it, indicating a serious safety risk is present. While it mentions a specific instance where Narcan was successful, the overall tone is concerning due to the high number of overdose-related deaths and near-death experiences.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 15:08:36"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Scared. Heard shouting next door again last night, then a crash. Called the non-emergency line but they said it's just a 'domestic'. Feels like someone should do *something*.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports of shouting, crashing noises, and a feeling that someone should intervene suggest potential domestic violence. While the non-emergency line dismissed it as 'domestic', the escalating nature (shouting, then crashing) indicates a possible risk of harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 14:17:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so overwhelmed lately. Like I'm underwater. Reaching out because I don't know what else to do. Has anyone else felt this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being overwhelmed and seeking help. While concerning, there is no explicit mention of self-harm, suicide, or harm to others.",
    "detected_category": "other",
    "timestamp": "2025-12-25 14:16:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but it does not contain explicit mentions of self-harm, suicide, violence, or abuse. It's a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-25 14:15:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Narcan worked, thank god. Learn how to use it, people. Could save a life. Seriously shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event with the potential for psychological impact on the witness. While the immediate danger was averted by Narcan, the event indicates the presence of a life-threatening situation and could trigger secondary issues.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 14:14:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Scared me half to death. Reminded me of my brother... Anyone else feel like things are getting more volatile lately? Feeling really anxious now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the individual expresses anxiety and fear, there's no direct threat or mention of violence against themselves or others. The observation of a fight is the trigger for their anxiety.",
    "detected_category": "other",
    "timestamp": "2025-12-25 14:13:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Narcan saved him. Please, learn the signs of overdose. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A friend experienced a life-threatening overdose requiring Narcan intervention, indicating a significant and immediate safety risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 14:12:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. If you've been there, what helped?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a desire for help, suggesting a potential risk of self-harm or suicidal ideation. The user's willingness to reach out is a positive sign, but the presence of a 'dark cloud' and feelings of being 'low' warrant attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 14:11:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the ambulance on my block again. Another OD. This is getting too close to home. Is there anyone out there who knows how to help someone? I'm scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and concern about overdoses happening nearby, suggesting potential exposure to the risk of overdose for themselves or loved ones, along with a desire to learn how to help. While there's no direct threat to the author, the proximity of the overdoses elevates the risk from low to medium.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 14:10:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Like I'm underwater. Reaching out before I sink further. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of isolation and being overwhelmed ('underwater', 'sink further') which are potential indicators of a mental health crisis. The explicit act of 'reaching out' suggests a need for help but the intent remains ambiguous.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 14:09:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Felt so overwhelmed last night, almost relapsed. Reached out to a friend instead, and just talking helped. Still struggling today, but taking it one hour at a time. It's exhausting.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a near relapse, suggesting a potential escalation of a harmful behavior. While the individual reached out for help, the continued struggle and exhaustion indicate ongoing vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 14:08:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but there is no direct mention of self-harm, suicide, violence, or abuse. It's a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-25 13:26:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were strong, but I distracted myself with a movie. Small victory. Anyone else find specific things that help in those moments?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text mentions urges (potentially self-harm or substance related) but the person successfully distracted themselves. While a positive step, the presence of strong urges indicates a potential risk that needs monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 13:25:36"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of things I'd rather forget. Anyone else ever feel like violence just lingers, even when you're not involved? Need to process.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and experiencing emotional distress as a result. While unsettling, there's no indication of immediate danger to the author or others. The author is expressing a need to process the event, suggesting self-awareness and a desire to cope healthily.",
    "detected_category": "violence",
    "timestamp": "2025-12-25 13:24:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. OD is real. Scariest night of my life. Learn the signs, carry Narcan. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose incident experienced by the author's friend, indicating a high risk event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 13:23:32"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. They're okay now, thank god. Makes you realize how fragile life is. Learn CPR, carry Narcan. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived the overdose, the event represents a significant health risk and potential for fatality. The suggestion to learn CPR and carry Narcan indicates an awareness of the ongoing potential for future similar incidents.",
    "detected_category": "overdose",
    "timestamp": "2025-12-25 13:22:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"He's been getting angry over nothing lately, then says I'm too sensitive. It's exhausting. Anyone else deal with this? Feels like I'm walking on eggshells.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional abuse and a feeling of being unsafe ('walking on eggshells'). While no explicit threats are mentioned, the pattern of anger and dismissiveness raises concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 13:21:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... rough. Walking on eggshells constantly. Anyone else ever feel like they're losing themselves in their own relationship? Feeling trapped. Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling trapped, which can escalate to more serious risks. The mention of \"walking on eggshells\" suggests a potentially abusive or volatile environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 13:20:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"It's hard to admit, but things at home have been rough. Constant put-downs, walking on eggshells... Feels like I'm losing myself. Anyone else been through this? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional distress and a potentially abusive environment, suggesting a risk of escalating mental health issues and potential for harm, although immediate danger isn't explicitly stated.",
    "detected_category": "abuse",
    "timestamp": "2025-12-25 13:19:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to resist, but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and difficulty resisting them, suggesting a potential for escalation. While not explicitly stating intent, the presence of urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-25 13:18:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend today, hope it helps. It's exhausting pretending to be okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost, overwhelmed ('underwater'), and exhausted from pretending to be okay. This suggests potential emotional distress and a possible risk of self-harm or suicidal ideation, although there is no explicit mention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-25 13:17:24"
  }
]