[
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells lately. Partner's temper is scary. Anyone else feel like they're constantly doing something wrong, even when they're not? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates fear and potential emotional or verbal abuse due to the partner's temper. The phrase \"walking on eggshells\" and feeling like they are \"constantly doing something wrong\" suggest a controlling and potentially volatile environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 21:16:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scared me senseless. Narcan saved them. Carry it if you can, please. You never know. #overdose #narcan",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was administered and the person survived, the fact that someone overdosed indicates a significant risk to individuals in that environment. The event caused significant emotional distress to the reporter.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 21:15:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD today. Scary stuff. Narcan saved him, thank god. Makes you realize how fragile life is. If you're struggling, please reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose can be traumatizing and indicates the presence of a dangerous situation with potential for fatalities. Although the person was saved, the incident highlights the risk of overdose in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 21:14:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, thankfully. Naloxone saves lives. Please learn how to use it. You never know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a significant event. While the person survived, the event indicates the presence of substance use and potential risk of future overdoses within the individual's environment or community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 21:13:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend in the street. Froze. Called the cops after. Shaking. What else could I have done? Feeling so useless right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence and potential for escalation. While the text doesn't indicate direct threat to the reporter, the violence observed is a significant concern and the emotional distress experienced suggests potential psychological impact.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 21:12:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy and I don't know where to turn. Talking to someone feels impossible, but I know I need help. Any advice on finding the strength to reach out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and a need for help. While there's no explicit mention of self-harm or suicide, the statement \"everything feels heavy and I don't know where to turn\" suggests a potential for escalation if left unaddressed. The desire for help indicates some awareness and a willingness to seek support, but the difficulty in reaching out elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 21:11:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on Elm St. Didn't know what to do, froze up. Feeling sick about it. Anyone else ever witness something like that? How did you react? Wish I'd said something.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing domestic violence is reported, suggesting potential for escalation or repeated incidents. The witness's distress also indicates a significant impact.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 21:10:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Been feeling so overwhelmed lately. Urges are back. Trying to resist, but it's hard. Anyone else relate? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with overwhelming feelings and the return of urges, suggesting potential risk of self-harm. While the individual is actively resisting, the difficulty implies the situation could escalate.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 21:09:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. If you've been there, what helped?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a need for help, suggesting a potential risk for self-harm or suicidal ideation. The person is reaching out, which is a positive sign, but the depth of their distress warrants a 'medium' severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 21:08:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Please, if you're using, even occasionally, carry Narcan. It saves lives. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose, indicating a high-risk situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 21:07:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I keep making excuses for him, but the yelling is getting worse. Last night he cornered me. Is this normal? I feel so trapped.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates escalating verbal abuse (yelling getting worse) and a physically intimidating situation (cornered me). Feeling trapped is a significant indicator of danger and potential for further abuse or violence.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 20:18:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"I'm so tired. He yelled again last night, and I feel like it's always my fault. Does anyone know where I can get help? I need to talk to someone.\"\n\n**Option 2 (Sharing a Feeling):**\n\n> \"It's hard to explain, but sometimes I feel like I'm walking on eggshells. It's exhausting trying to predict what will set him off.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"People think abuse is always physical. But words can hurt just as much. Remember that emotional abuse is real, and it matters.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and a need for help, suggesting a situation that could escalate if unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 20:17:25"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight outside my kid's school. Shook me up. Makes you wonder what's going on with people these days. Feeling pretty anxious about sending her back tomorrow.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses anxiety and concern after witnessing a fight, but doesn't indicate immediate danger to the child or the sender. It's a reaction to an external event.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 20:16:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a crisis line, and just talking helped a little. Gonna try to take it one hour at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Strong urge to self-harm reported, indicating immediate risk. While the person contacted a crisis line, the risk remains high and requires immediate attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 20:15:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Is anyone else feeling this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain explicit mentions of self-harm, suicide, or harm to others. It's a general expression of distress and a request for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-26 20:14:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"He's been isolating me from my friends lately. Says they're 'bad influences.' It's subtle, but I feel so alone. Is this... normal? Feeling trapped.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Isolation from friends is a common tactic in controlling relationships and can escalate to abuse. The feeling of being 'trapped' is a significant warning sign.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 20:13:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating potential distress and need for support. The phrase 'I don't know what else to do' suggests a level of desperation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 20:12:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Narcan saved them, but it really shook me up. Reminded me how fragile life is. Anyone know resources for people struggling?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even when the person survived, indicates a potential risk of future overdoses in the area and can cause significant emotional distress to the witness. While the immediate situation was resolved, the mention of seeking resources suggests concern for others at risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 20:11:16"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential abuse (put-downs, controlling behavior) leading to isolation. While not explicitly stating intent for self-harm or harm to others, the feeling of isolation and asking for help suggest a need for intervention and a potential escalation of the situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 20:10:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough lately. Walking on eggshells constantly. Is this normal? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a potentially volatile or abusive home environment (\"walking on eggshells\"). While it doesn't explicitly mention violence or self-harm, the feeling of isolation and the description of the home situation suggest a need for further investigation and potential intervention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 20:09:13"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Makes me sick. Reminded me of what my brother went through last year. Is there anywhere to volunteer to help victims of assault? Feeling so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and expressing a desire to help victims of assault, but it doesn't indicate imminent danger to the author or others. While upsetting, it doesn't present a direct threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 19:16:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Reached out to a crisis line. Talking helps, even if it's just a little. If you're feeling it too, please reach out. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the return of urges and seeking help from a crisis line, suggesting distress and potential risk. While the person is actively seeking support, the presence of urges warrants a medium severity assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 19:15:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so heavy lately, like I'm underwater. Just reaching out... anyone else ever feel this way? Not sure what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and reaching out for help, suggesting emotional distress and potential for self-harm if support isn't received.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 19:14:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me up. We need more resources & less stigma so people get help BEFORE it gets that bad. Please look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose was averted, it indicates a significant safety risk in the environment and potential for future, possibly fatal, incidents.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 19:13:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scared me senseless. Called 911, they’re okay now, but damn. Learn CPR, people. You might save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the immediate threat is resolved, the text describes an overdose event, indicating a potential ongoing risk to others in the community. The call to action to learn CPR suggests the event highlighted the potential for fatality. Although the person survived, the overdose represents a significant health risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 19:12:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw another memorial post. Feels like every week. Please, if you're struggling, reach out. There are people who care and want to help you stay here. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a recurring pattern of suicide or accidental death (potentially overdose) in the author's community, which indicates a heightened risk environment. The direct encouragement to seek help implies awareness of individuals struggling with potentially life-threatening issues.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 19:11:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nJust got out of the hospital after Narcan saved my life. Scared straight. This stuff is no joke. Anyone else been there? Feeling so alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Recent overdose requiring Narcan indicates a high risk of future overdose and potential fatality. The user also expresses feelings of isolation which further exacerbate the risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 19:10:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Trying to stay clean, taking it one hour at a time. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating a potential risk. While the individual is actively trying to cope, the presence of the urge elevates the severity beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 19:08:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Trying to stay strong and remember why I stopped. It's a daily battle. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges and a struggle to maintain sobriety. While not explicitly suicidal or self-harming, the relapse increases the risk of engaging in harmful behaviors.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 19:07:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved their life. Please, learn how to use it. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potential for future overdoses in the community, and the proximity of the event increases the likelihood of exposure for others. While Narcan was effective in this instance, it highlights the risk of opioid use and related dangers.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 19:06:56"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating distress and a need for support. While not explicitly suicidal, the metaphor of being underwater and unable to surface suggests a potential risk of hopelessness and a struggle to cope.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 18:21:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. The urge to cut is so strong. Trying to stay strong and find other ways to cope. If anyone has tips, please share.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating active suicidal ideation. While the person is trying to cope, the intensity of the urge elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 18:20:05"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw my neighbor get shoved yesterday. Shook me up. Didn't know what to do. Is that assault? Feeling helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessed an assault, feeling shaken and helpless, but no indication of direct threat to self or others beyond the initial shoving incident. Severity is low because the narrator is reporting an event that happened to someone else. It could escalate if the neighbor experiences further violence or the narrator becomes a target.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 18:19:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Felt so overwhelmed today. Urges were strong, but I distracted myself by calling a friend. Small victory. Still feels like a long road. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates the person is experiencing urges but successfully distracted themselves. While there is distress, there is also coping and a reaching out for connection, mitigating immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 18:18:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Relapsed after a few months clean. It's like the only way I know how to feel *something* other than numb. Reaching out for help again. It's so hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a potential escalation of harmful behaviors. The individual expresses a need to feel *something* which could lead to further dangerous actions. While explicitly reaching out for help is positive, the relapse and feeling of overwhelm raise concerns.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 18:16:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on Elm St. Shook me up. Called the non-emergency line, but I'm still rattled. Anyone else witness it? Hope she's okay. Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence involving possible abuse, though severity is not immediately clear. Physical harm was inflicted.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 18:15:58"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel trapped. Has anyone else dealt with this? Where do I even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of emotional abuse and controlling behavior, indicating a potential risk of escalation to physical violence or severe emotional distress. The feeling of being 'trapped' is a significant concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 18:14:56"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out before it gets worse. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating potential distress and a proactive step to seek help before things escalate.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 18:13:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another overdose. Makes me think of my brother. Scariest time of my life. If you're struggling, please reach out. There's help out there. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a past overdose event and expresses concern about others struggling, suggesting a potential risk of overdose for others. While not explicitly suicidal, the mention of a 'scariest time' related to the brother's overdose suggests emotional distress and vicarious trauma.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 18:12:53"
  },
  {
    "title": "User Story: Abuse",
    "content": "I keep making excuses for him, but the yelling is getting worse. It's not just words anymore. Has anyone else dealt with this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The escalation from verbal abuse to potentially physical abuse, coupled with the feeling of isolation, indicates a growing risk of harm. The phrase \"It's not just words anymore\" suggests a concerning shift in the abuser's behavior.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 18:11:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just want to know if anyone else feels like they're drowning sometimes. It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and exhausted, using the metaphor of 'drowning.' While it doesn't explicitly mention self-harm or suicide, the intense negative emotion and feeling of being overwhelmed suggest a potential risk that warrants further attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 17:17:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scary night. Found my brother unresponsive. Narcan saved him. Please, if you're using, have someone with you and carry Narcan. It works. Where can I get more for free?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Brother found unresponsive and required Narcan, indicating a life-threatening overdose situation. Repeated overdose is likely without intervention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 17:16:11"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just a heavy cloud. Reaching out to a friend, hoping it lifts soon. It's okay not to be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but there are no explicit indications of self-harm, suicide, or violence. The individual is reaching out for support, suggesting a willingness to cope.",
    "detected_category": "other",
    "timestamp": "2025-12-26 17:15:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Felt so overwhelmed today. Urges were strong. Managed to distract myself, but it's exhausting. Anyone else relate? How do you cope?\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Clean for 3 weeks. Small victory, but it feels huge. Still struggling, but trying to focus on the progress.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"It's not about attention. It's about pain. Please be kind to those who are struggling. You never know what someone's going through.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses strong urges, indicating a potential risk. Options 2 and 3 are less severe, but collectively, the presence of urges suggests a concerning situation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 17:14:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. It's terrifying. Lost a friend last year. If you're struggling, please reach out. There's help available. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a recent overdose death and past loss of a friend, indicating a local problem with drug use and the potential for others to be at risk. While the text encourages seeking help, the mention of a recent overdose and personal loss elevates the risk level.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 17:13:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but it was too close. Learn the signs, people. It could be someone you love. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a potentially fatal overdose event requiring emergency intervention (Narcan). While the person survived, the event's intensity and risk to life are significant.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 17:12:04"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy get punched outside my building. Shook me up. Called the cops, but feeling really anxious now. Anyone else witness this? Need to talk.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While a violent act occurred, the text describes witnessing the event and experiencing anxiety, not direct threat or participation. The author contacted the police, indicating appropriate action.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 17:11:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nScared. Found my brother unresponsive last night. Narcan saved him, but it was so close. Please, learn the signs of OD. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Brother experienced a near-fatal overdose requiring Narcan, indicating a significant and immediate health risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 17:10:00"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on the bus. Shaken up. Is it just me, or is everyone on edge lately? Makes you wonder...\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be upsetting, but the text doesn't indicate direct involvement or ongoing threat. The person expresses being shaken up but does not indicate they are in immediate danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 17:08:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside my kid's school. So scary. Makes you wonder what's going on in people's lives. Wish there was more support available.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight near a school indicates a potential risk of violence escalating or involving others, including children.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 17:07:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so lost lately. Like I'm just going through the motions. Reaching out because I don't know what else to do. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and going through the motions, indicating distress but lacks any explicit mention or direct implication of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2025-12-26 16:18:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "I feel so lost. Things at home have been bad lately. He yells all the time, and last night... I just don't know what to do anymore. Is this normal?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential domestic abuse (yelling), suggesting a need for support and further assessment. The user expresses feeling 'lost' and questioning the normality of their situation, hinting at a potential crisis.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 16:17:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Like I'm underwater. Reaching out to a friend, hoping it helps. It's so hard to keep going sometimes.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 60 (char 85)",
    "detected_category": "unknown",
    "timestamp": "2025-12-26 16:16:48"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train. My heart is still racing. Is there anything I could have done? Feeling so helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person posting wasn't directly harmed, they witnessed a violent act (shoving) on a train. This indicates a potential risk of violence to others in the environment and caused distress to the witness.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 16:15:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just realized this isn't normal. He yells, then cries & says he's sorry. It's a cycle. Anyone else experience this? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a concerning cycle of yelling, crying, and apologizing, which could indicate a pattern of abuse or emotional instability. The user also expresses feeling lost, suggesting a lack of support and potential vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 16:14:45"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight downtown. Shook me up. Reminded me of things at home growing up. Anyone else feel like that sometimes? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling, and expresses feeling shaken. It elicits shared feelings and coping mechanisms. The potential for imminent harm seems low.",
    "detected_category": "other",
    "timestamp": "2025-12-26 16:13:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, controlling behavior... I feel so isolated. Anyone else gone through this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress due to controlling behavior and put-downs, potentially indicating abuse and feelings of isolation. While not explicitly stating intent to harm self or others, the feeling of being 'lost' and the description of the situation warrant concern and a need for further assessment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 16:12:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Scared me. Narcan worked, thank god. Makes you realize how fragile life is. Anyone else feel like this is happening too often? Need to find a better way.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event that can have psychological impact. While Narcan was effective, the event points to a serious public health issue and potential for future overdose incidents.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 16:11:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Please, if you're using, even occasionally, carry Narcan. It could save a life. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event, indicating a very high risk of death. The mention of Narcan strongly suggests opioid overdose.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 16:10:38"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a fight break out at the bus stop. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text indicates a personal reaction (feeling shaken) rather than imminent danger to the author or others. No specific threats are mentioned.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 16:09:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I feel so alone. He says he loves me, but then he yells & calls me names. It's getting worse. Is this normal? I don't know what to do anymore.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional and verbal abuse, which is escalating and causing distress. While there's no explicit mention of physical harm or immediate danger, the user's feelings of isolation and despair warrant concern and further assessment for potential risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 15:17:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but shook me up bad. Learn CPR, carry Narcan. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose was successfully reversed, the event highlights the presence of a serious risk (overdose) and the potential for future occurrences affecting the reporter or others. The call to action to learn CPR and carry Narcan suggests an ongoing concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 15:16:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight, hope it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed ('underwater'), and implicitly acknowledges struggling ('It's okay to not be okay, right?'). While it shows an attempt to cope by reaching out to a friend, the intensity of the distress warrants a 'medium' severity rating, requiring further assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 15:15:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm underwater. Reaching out before I sink further. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and sinking, suggesting a potential risk of worsening mental health. The act of reaching out is positive, but the depth of the negative feelings warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 15:14:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to a friend helped a little, but it's still hard. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but also mentions seeking support from a friend. While concerning, there's no explicit mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2025-12-26 15:13:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly low lately. Just reaching out to say if you're struggling, you're not alone. Talking helps, even if it feels impossible. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses low mood and encourages seeking help, but there's no explicit mention of self-harm or suicidal ideation. It's a general message of support.",
    "detected_category": "other",
    "timestamp": "2025-12-26 15:12:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are getting stronger. Anyone else relate? Just trying to get through it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates increasing urges, suggesting a potential escalation of a negative situation. While the exact nature of the urges is unclear, the statement 'trying to get through it' implies a struggle and a possible risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 15:11:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Cleaned the cuts, but feeling so ashamed. Reached out to a crisis line. Hoping they can help me get through tonight. Just needed to tell someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates self-harm (cuts) and a high level of emotional distress, requiring immediate support and intervention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 15:10:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thank god. Makes you realize how fragile things are. Anyone know where I can learn more about overdose prevention?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a moderate risk level due to potential vicarious trauma and increased awareness of the issue, leading to questions about prevention. The fact that Narcan was used indicates a life-threatening situation occurred. The individual is now seeking information on overdose prevention, which suggests a potential increased awareness and concern for themselves or others.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 15:09:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Shook me up. Said something but I froze. Anyone else ever feel helpless in those situations? Wish I'd done more.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence (pushing) in public, indicating potential for escalation. The observer's distress suggests a non-trivial impact.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 15:08:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\nIt's so hard to admit, but things at home have been bad lately. Walking on eggshells constantly. Anyone else feel like they're losing themselves? Need to find some support.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially unsafe home environment where the individual feels they are 'walking on eggshells.' This suggests potential emotional or psychological abuse. The feeling of 'losing themselves' also points to a decline in mental well-being and a need for support.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 14:18:03"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. My heart's still racing. Wish I'd said something, but I froze. Anyone else ever feel that helpless? What can you even DO?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an instance of violence (shoving). While it's a single instance and the partner's condition is unknown, physical violence always carries a risk of injury.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 14:17:02"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD downtown. Scary stuff. Narcan saved their life, but it makes you think. Please, if you're struggling, reach out. There's help available. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan reversed the overdose, the event indicates a significant risk of future overdose or other harm related to substance abuse. The user expresses concern and encourages seeking help.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 14:16:00"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight outside my kid's school. Makes me sick. Is everyone okay? How do we stop this from happening again? Feeling so helpless right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight, especially near a school, indicates potential for physical harm to individuals, including children. While the text doesn't specify injuries, the strong emotional response ('makes me sick', 'feeling so helpless') suggests a distressing event with potential for escalation or future incidents.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 14:14:58"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Seriously shaken up. Dude got clocked hard. Makes you think, you know? How do you even process something like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing violence is unsettling and can cause anxiety, but the text doesn't indicate imminent danger to the speaker or others. The speaker expresses reflection, not necessarily a plan or desire to engage in violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 14:13:57"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been isolating me from friends & family, and the yelling...it's constant. Is this normal in a relationship? Feeling lost and scared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Isolation, constant yelling, and fear are significant indicators of escalating abuse. The victim is expressing being 'lost and scared,' signaling significant distress and potential danger.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 14:12:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and drowning, indicating significant emotional distress and a potential risk of escalation if not addressed. The phrase 'don't know what else to do' suggests a lack of coping mechanisms.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 14:11:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "Ugh, another fight. Walking on eggshells constantly. Is this normal in a relationship? Feeling so drained. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses emotional distress and fatigue due to relationship conflict, but it lacks any explicit or direct indicators of immediate danger or harm to self or others.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 14:10:52"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a fight downtown last night. Scary how quickly things escalated. Made me realize how important it is to de-escalate situations, not add fuel to the fire. Anyone else ever witness something like that? Still shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate immediate danger or direct involvement. The user expresses being shaken up, but no intention of harm to self or others is implied.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 14:09:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary how quickly things escalated. Shaking still. Anyone else witness that? Feeling really unsafe now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent event can be psychologically distressing and lead to feelings of unsafety and anxiety, suggesting a potential for negative mental health impacts. While there's no immediate physical danger to the individual based on the text, the reported shaking and feeling unsafe indicate a significant emotional response.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 14:08:49"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes a witnessed act of violence (assault), there's no indication of direct threat to the speaker or imminent danger. The speaker expresses being 'shook up' and 'on edge,' suggesting psychological impact, but not necessarily immediate physical risk. The escalation to unconsciousness suggests the potential for severe physical harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 13:26:56"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but doesn't contain explicit statements of self-harm or suicidal intent. The user is reaching out for help, suggesting a desire to connect rather than harm themselves.",
    "detected_category": "other",
    "timestamp": "2025-12-26 13:25:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just feeling so lost. Things at home have been...rough lately. Walking on eggshells all the time. Anyone else ever feel like they're losing themselves?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and general distress, but lacks specific mentions of self-harm, suicide, violence, abuse, or overdose. The user is describing feeling emotionally strained and disconnected from themself, which indicates a potential risk but does not suggest imminent danger.",
    "detected_category": "other",
    "timestamp": "2025-12-26 13:24:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately.  Little urges are back, and I'm trying so hard to resist.  Anyone else relate?  Just feeling really alone right now.  Need to remember my coping skills.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions the return of 'little urges' which the person is trying to resist, suggesting potential self-harm or relapse. Feeling overwhelmed and alone increases the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 13:23:51"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing on the street. Escalated so fast. He shoved her, I froze. Wish I'd done something. Anyone else ever feel that helpless?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence (shoving) occurred, indicating potential for further escalation and harm to the victim. The observer also expresses distress, suggesting a potentially impactful event.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 13:22:49"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to distract myself, but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, implying previous struggles and a potential escalation of risk. While the individual is trying to distract themselves, the statement \"it's hard\" suggests the coping mechanisms are failing.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 13:21:48"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the park. Shook me up bad. My hands are still trembling. Is there somewhere safe to talk about this? Feeling really lost right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight can be traumatizing and cause significant distress. The trembling hands and feeling 'lost' suggest a need for support and processing the event.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 13:20:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw another ambulance downtown. Makes you think, you know? Lost a friend last year to an OD. Narcan saves lives. Carry it, learn how to use it. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a past overdose death and encourages carrying Narcan, indicating an ongoing risk of overdose events. While not explicitly stating an immediate threat, the implicit concern and call to action elevate the severity.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 13:19:45"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel anxious after witnessing something like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be distressing and cause anxiety, but the text doesn't suggest ongoing threat or intent to harm self or others.",
    "detected_category": "other",
    "timestamp": "2025-12-26 13:18:43"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. This keeps happening, feel like I'm losing it. Is there anywhere to go when you feel unsafe walking home?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear and a feeling of unsafety in a public place, and expresses a sense of losing control due to repeated violent events. The user is also seeking a safe place, indicating a need for immediate assistance.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 13:17:42"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, suggesting potential for violence, but doesn't indicate direct involvement or personal threat to the author or others. There is a general feeling of unease expressed, but no specific imminent danger is mentioned.",
    "detected_category": "violence",
    "timestamp": "2025-12-26 12:23:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just reaching out... anyone else ever feel like they're just going through the motions? It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and exhausted, which are indicative of low mood and potential distress, but does not contain any explicit threats or plans for self-harm.",
    "detected_category": "other",
    "timestamp": "2025-12-26 12:22:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Trying to resist but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges, suggesting a potential for self-harm. While the individual is attempting to resist, the struggle implies a risk that needs attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 12:21:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just realized the constant put-downs aren't normal. Feeling so lost and confused. Is this abuse? Anyone else experience this? Need to figure out what to do next.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential abuse, which can escalate to more serious harm if not addressed. The individual is seeking help and acknowledging something is wrong, but the uncertainty and confusion increase the risk level.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 12:20:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, and it helped a little. Remember you're not alone. Talking really does make a difference. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a high level of immediate risk. While the person reached out for help, the presence of the urge itself warrants high severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-26 12:19:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about overdose deaths is scary. My friend almost died last year. It can happen to anyone. Please be careful & look out for each other. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions overdose deaths and a friend's near-fatal overdose, indicating a real and potentially life-threatening risk. The call for caution and recognizing signs also suggests awareness of potential danger.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 12:18:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so numb lately. Urges are back, stronger than before. Reached out to the crisis line. Just gotta keep breathing.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a return of strong self-harm urges and feelings of numbness. While the person reached out for help, the presence of strong urges signifies a high risk of acting on them.",
    "detected_category": "suicide",
    "timestamp": "2025-12-26 12:17:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in my town. This hits hard. Lost a friend last year. Please, if you're struggling, reach out. There's help available. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a recent overdose death and expresses concern, indicating a potential risk of overdose within the community, even though it doesn't directly indicate imminent harm to the author. The mention of losing a friend suggests a personal connection to the issue, increasing the potential impact.",
    "detected_category": "overdose",
    "timestamp": "2025-12-26 12:16:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "I keep making excuses for him. Said he was stressed, tired. But the yelling's getting worse, and now... I don't know what to do anymore. Is this normal? Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates escalating verbal abuse (yelling getting worse) and the speaker's uncertainty and distress. While there's no explicit mention of physical violence, the escalating nature and the speaker's feeling of helplessness suggest a potentially dangerous situation. Further investigation would be needed to assess the risk of violence.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 12:15:42"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just need to vent. Said it was \"just a joke\" again after yelling. Makes me feel so small. Anyone else deal with this? How do you cope? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and a feeling of being lost, which suggests potential for escalation or negative coping mechanisms.",
    "detected_category": "abuse",
    "timestamp": "2025-12-26 12:14:40"
  }
]