[
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain explicit mentions of self-harm, suicide, violence, abuse, or overdose. It reads more as a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-30 12:24:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "i messed up. again. feels like i'm back at square one. reaching out before things get worse. anyone know resources that actually help? feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of hopelessness, being back at 'square one,' and a fear of things getting worse. They are actively seeking help, which indicates awareness, but the underlying distress suggests a moderate risk level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 12:23:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. He's been getting worse lately, yelling over nothing, then acting like it didn't happen. Is this normal? Starting to feel like I'm losing my mind. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 57 (char 82)",
    "detected_category": "unknown",
    "timestamp": "2025-12-30 12:22:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and overwhelmed, indicating a potential mental health crisis. While not explicitly suicidal, the statement \"I don't know what else to do\" suggests a lack of coping mechanisms and warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 12:21:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his car mirror after a fender bender. Made me jump. Reminded me too much of my dad. Anyone else get triggered by stuff like that? Feeling anxious now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing an act of anger (punching a car mirror), which triggered anxiety in the author. While the author expresses feeling anxious, there is no indication of immediate danger to themselves or others. The trigger is based on a past experience with their father, suggesting a possible history of abuse but no current threat is specified.",
    "detected_category": "other",
    "timestamp": "2025-12-30 12:20:39"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are strong. Anyone else feel like they're just barely holding on sometimes? Trying to find healthier ways to cope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions strong urges and feeling barely able to hold on, suggesting a struggle with mental health. While it expresses a desire for healthier coping mechanisms, the intensity of the urges raises concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 12:19:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD. Makes me sick. Lost my cousin last year. Please, if you're struggling, reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose death and expresses concern for others struggling. While not directly indicating imminent risk, it acknowledges a relevant and potentially dangerous situation and encourages help-seeking behavior. The mention of a personal loss related to overdose increases the emotional weight.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 12:18:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just talked back to him & now I'm locked in the bathroom. Again. Feeling so trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a pattern of being locked in a bathroom after an argument, suggesting a potential pattern of coercive control and restriction of freedom. While there's no explicit mention of violence, self-harm, or suicidal ideation, the feeling of being 'trapped' warrants concern and further assessment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 12:17:34"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Never seen anything like that in person. Anyone else feel on edge lately? Makes you wonder...",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing anxiety. While unsettling, it doesn't indicate immediate danger or a specific threat to the individual or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 12:16:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. If you've been there, how did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain explicit mentions of self-harm, suicide, violence, abuse, or overdose. The user is reaching out for help and support, suggesting a willingness to find solutions.",
    "detected_category": "other",
    "timestamp": "2025-12-30 12:15:31"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw my neighbor get shoved yesterday. Shook me up. Called the cops, but feeling helpless. Is there anything else I can do to help him?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence occurred, though seemingly a single incident. The reporting party expresses concern and helplessness, indicating a potential for escalation or further harm to the neighbor.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 11:18:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "My brother almost didn't wake up yesterday. Scariest moment of my life. Please, if you're struggling, reach out. There are people who care. Don't let it get this far.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text implies a near-fatal event, strongly suggesting a suicide attempt or very serious self-harm incident ('almost didn't wake up', 'Don't let it get this far').",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 11:17:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling really low lately. Like, bone-deep tired. Reaching out because I don't know what else to do. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of low mood and tiredness, and a desire for connection. While concerning, it does not explicitly mention self-harm, suicide, or violence.",
    "detected_category": "other",
    "timestamp": "2025-12-30 11:16:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside, it feels like the only way to quiet them is to hurt. Trying to find healthier ways to cope. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses thoughts of self-harm as a coping mechanism, indicating a potential risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 11:15:09"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Some dude sucker punched another guy. Scary how fast things escalate. Makes you think. Anyone else witness that near 5th & Main?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "A single instance of violence was observed, but there is no indication of ongoing threat or widespread danger. It seems like a spontaneous event.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 11:14:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD. Scared. Lost a friend last year. If you're struggling, please reach out. There's help. You matter.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses fear related to overdoses and acknowledges personal loss due to overdose. While it encourages seeking help, the expression of fear and connection to a past loss elevates the risk beyond simply mentioning the topic.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 11:13:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just needed to say it out loud. It helps. If you're struggling too, you're not alone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a relapse or worsening of a prior struggle. While the individual reached out for help, the presence of urges implies a potential risk that needs monitoring. The lack of specifics makes it difficult to assess the exact level of risk, but the return of urges elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 11:12:05"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but it lacks specific details about self-harm, suicidal ideation, or harm to others. The user is reaching out for support, suggesting a desire to connect rather than act on negative feelings.",
    "detected_category": "other",
    "timestamp": "2025-12-30 11:11:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain explicit mentions of self-harm, suicide, or harm to others. It is a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-30 11:10:02"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. Constant put-downs, controlling my every move... I feel so trapped. Has anyone else experienced this? How did you find a way out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling trapped and controlled, indicating a potential abusive situation. While not explicitly stating intent for self-harm or suicide, the feeling of being trapped and the mention of constant put-downs are serious warning signs. Seeking advice on how to 'find a way out' suggests a desire to escape a negative situation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 11:09:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just had another 'talk' with him. My head is spinning. Said I was being dramatic, again. Is it really all in my head? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and questioning of one's own perception, potentially due to manipulation or gaslighting. The user feels 'lost' which can be a precursor to more severe mental health issues.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 10:18:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train platform. Scared the crap out of me. He seemed okay but damn, people are on edge lately. Makes you wonder what's going on in their lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was physically assaulted (shoved) which could have resulted in serious injury depending on the circumstances (e.g., proximity to the tracks, pre-existing conditions of the victim). While the victim seemed okay, the potential for harm is significant.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 10:17:56"
  },
  {
    "title": "User Story: Abuse",
    "content": "I feel so trapped. He's been isolating me from my friends & family. It started small, but now it's constant criticism & control. I don't know what to do anymore. Is this abuse?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a pattern of isolation, control, and criticism, which are all indicators of emotional and potentially escalating abuse. The feeling of being trapped and not knowing what to do increases the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 10:16:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD… It's scary. Lost a friend last year. Please, if you're struggling, reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about overdoses and acknowledges the loss of a friend. While it encourages seeking help, the mention of overdose and loss related to it indicates a potential risk to the author or someone they know. The text does not explicitly state they are at risk, but their proximity to the issue warrants a medium severity.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 10:15:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like I'm underwater. Reaching out because I know I need to. Anyone else ever feel this way? What helps?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a need to reach out for help. While not explicitly suicidal, the 'underwater' metaphor suggests significant emotional distress. The act of reaching out is a positive sign, but the depth of the stated feelings warrants a 'medium' severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 10:14:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out to a friend tonight. Just gotta keep going. There's gotta be some light somewhere.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and that nothing matters, which are risk factors for suicide. Reaching out to a friend is a protective factor, but the underlying feelings warrant concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 10:13:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm constantly underwater. Reaching out because I don't know what else to do. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a lack of coping mechanisms, indicated by 'feeling so low' and 'don't know what else to do.' While not explicitly suicidal, the expression of hopelessness and seeking help suggests a potential risk that requires attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 10:12:49"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Wish I'd said something, but I froze. Anyone else ever feel that helpless? Feeling sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, while not directly involving the reporter, indicates potential risk of escalation or further harm to the victim. The reporter expresses distress and helplessness, suggesting a significant impact.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 10:11:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but it shook me. Please, if you're struggling, reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a potentially traumatic event and highlights the presence of substance use issues in the community. While the person survived, the experience underscores the risk of future overdoses and the potential for psychological distress in witnesses.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 10:10:45"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside my building. Called the cops, but I feel sick. Witnessing that... I can't shake it. Anyone else ever feel this helpless?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can cause significant emotional distress and potential secondary trauma, although there's no direct threat to the reporter.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 10:09:44"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Scared. Found my brother unresponsive. Narcan worked, thank god. But this has to stop. Anyone know resources for families dealing with addiction? I can't lose him.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Brother experienced a potentially fatal overdose requiring Narcan intervention, indicating a serious and immediate threat to his life.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 09:21:06"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up bad. Just felt so helpless. Anyone else ever feel like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling shaken and helpless. While unpleasant, it doesn't indicate imminent danger to the poster or others. It expresses a feeling of unease and a desire for shared experience.",
    "detected_category": "other",
    "timestamp": "2025-12-30 09:20:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "My neighbor just OD'd. Narcan saved him, thankfully. It's terrifying how close we came to losing him. Please, learn the signs and carry Narcan. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A neighbor overdosed and required Narcan, indicating a life-threatening situation and potential for future overdoses in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 09:19:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, almost relapsed. Reached out to a friend instead. Still shaky, but glad I did. It's a day-by-day thing, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a near relapse, suggesting a struggle with a potentially harmful behavior. While the individual reached out for help, the 'shaky' feeling indicates continued vulnerability.",
    "detected_category": "other",
    "timestamp": "2025-12-30 09:18:02"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. My heart is racing. Called the non-emergency line, but feeling so shaken. Anyone else witness something like that before? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, while the poster was not directly harmed, can be emotionally distressing and suggests a potential escalation of violence that could involve others. The reported incident involved physical aggression.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 09:17:00"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the subway. Everyone just stared. Makes you wonder what's wrong with people, y'know? Wish I'd said something. Feeling shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a violent act is upsetting but the text does not indicate ongoing threat or serious physical harm to the narrator. It primarily conveys emotional distress.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 09:15:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Trying to stay strong, but it's hard. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating a current struggle. While the person is trying to cope, the strength of the urge elevates the risk beyond just ideation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 09:14:57"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a man shove his partner on the street today. Just walked away like nothing happened. I froze. Wish I'd said something. Feeling sick about it. Anyone else ever witness something like that? What do you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can have psychological impact. The poster's distress (\"Feeling sick about it\") indicates a non-trivial effect. While the original act was isolated and didn't directly involve the poster, the second-hand exposure raises concerns about potential emotional distress and the normalization of violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 09:13:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after a few weeks clean. Disappointed in myself but trying to remember recovery isn't linear. Back to therapy tomorrow. One day at a time.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a setback in recovery, and the mention of feeling overwhelmed suggests potential vulnerability. While the individual expresses disappointment and is seeking help (therapy), the relapse itself warrants a medium severity rating due to the risk of further relapses or escalation of substance use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 09:12:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Talking to someone feels impossible, but I'm trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of depression and acknowledges a need for help, but hesitates to reach out. This suggests a potential risk that could escalate if unaddressed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 09:11:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Walking on eggshells all the time. Anyone else experience this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 89 (char 114)",
    "detected_category": "unknown",
    "timestamp": "2025-12-30 08:21:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like I'm underwater. Just reaching out to say it's okay to not be okay. Talking helps, even if it's just a little.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and discouragement, but lacks specific details about self-harm, suicidal ideation, violence, or abuse. It encourages seeking help, which indicates a potential protective factor.",
    "detected_category": "other",
    "timestamp": "2025-12-30 08:20:49"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside the deli. Dude got decked. Shook me up. Is it just me, or is everyone on edge lately? Makes you wonder what sets people off.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While a violent incident occurred, it appears to be isolated and doesn't indicate ongoing or escalating risk to the original poster or a wider group. It's a single observation, not a report of active threat or vulnerability.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 08:19:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scariest thing ever. Narcan saved them. Please, learn how to use it. It's not enough just to have it. Know how. #overdoseprevention #naloxone",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose victim was saved, the event highlights the presence of a significant risk of overdose in the community. The call to action to learn how to use Narcan underscores the potential for future overdose events.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 08:18:46"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. The urges are strong. Trying to stay strong too, but it's hard. Reached out to a friend, hoping it helps. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges and difficulty coping, suggesting a potential crisis. Reaching out for help is a positive sign, but the severity is elevated due to the intensity of the urges and the expressed struggle to stay strong.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 08:17:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed (\"lost,\" \"underwater\") and indicates a need for help. While not explicitly stating suicidal intent, the intensity of the emotions and the plea for advice suggest a significant level of distress that warrants concern.",
    "detected_category": "other",
    "timestamp": "2025-12-30 08:16:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home have been... not good. Walking on eggshells constantly. Is this normal? Feeling lost and scared.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a potentially unsafe home environment with emotional distress (walking on eggshells, scared, lost). While not explicitly mentioning violence or abuse, the language implies a challenging and possibly harmful situation. Further exploration is needed to assess the full extent of the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 08:15:42"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight outside my kid's school today. Shaken up. Makes you wonder what's going on with people. Anyone else feel like things are just…tense lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text lacks specific threats or indications of imminent danger to the writer or others. It expresses general unease.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 08:14:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, but it's still hard. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, which indicates a significant and immediate risk to the individual's safety. While the person reached out to a friend, the intensity of the urge necessitates a high severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 08:13:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD. It hits different now. Lost a friend last month. Please, if you're struggling, reach out. Don't let it be too late. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief over a friend's overdose and encourages seeking help, indicating a potential risk of overdose or suicidal ideation in the reader or their social circle.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 08:12:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "**(Option 1: Seeking Help)**\n\n> Feeling so lost lately. Everything feels heavy. Reaching out for support... anyone know good resources?\n\n**(Option 2: Sharing a Personal Story)**\n\n> Been there. The darkness can feel overwhelming. Talking helped me. Please don't suffer in silence.\n\n**(Option 3: Raising Awareness)**\n\n> Check in on your friends. You never know what someone's going through. A simple \"how are you?\" can make a difference.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but does not contain explicit mentions of self-harm, suicide, or violence. It encourages seeking help and supporting others, indicating a general need for emotional support rather than an imminent threat.",
    "detected_category": "other",
    "timestamp": "2025-12-30 07:20:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Terrifying. Narcan worked, thank god. Learn how to use it, please. Could save a life. Seriously shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose was non-fatal due to Narcan, the situation indicates a high-risk activity and potential ongoing danger in the environment.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 07:19:03"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of things back home. Anyone else get triggered by stuff like that? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling triggered, but doesn't express intent to harm self or others. The individual is reaching out for coping strategies, suggesting a desire for help.",
    "detected_category": "other",
    "timestamp": "2025-12-30 07:18:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scariest thing ever. Thankfully, Narcan worked. Please, if you're using, carry it. And know how to use it. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a high-risk situation, and the text implies ongoing substance use within the friend group.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 07:16:59"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, thankfully. Makes you realize how fragile life is. Please, if you're struggling, reach out. There's help available.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a serious situation with potential for fatality, although the individual survived. The event highlights the immediate risk associated with drug use and the vulnerability of life.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 07:15:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD today. Terrifying. Narcan worked, thank god. Please, if you're struggling, reach out. There are people who care and want to help you stay alive. It's not worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and highlights the risk of overdose in the community. Narcan was effective, but the event itself indicates potential for future overdose incidents and highlights the dangers of substance use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 07:14:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Narcan saved them, but it shook me up bad. Please, if you're struggling, reach out. There's help available. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and highlights the risk of overdose in the community, though the individual survived. Encourages seeking help.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 07:13:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another OD in our town. This hits hard. Lost my brother last year, and it still feels like yesterday. Please, if you're struggling, reach out. There's help out there. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a recent overdose death and expresses grief related to a past overdose death. It also encourages seeking help, suggesting awareness of ongoing struggles. While not explicitly stating intent for self-harm or harm to others, the mention of overdose and loss raises concern and warrants a medium severity rating.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 07:12:53"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got clocked hard. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text doesn't indicate ongoing immediate threat or serious injury to the speaker. While concerning, it primarily expresses emotional distress.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 07:11:51"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so numb lately. Urges are back. Just trying to get through tonight. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions feeling numb and having urges, suggesting a potential risk of acting on harmful impulses. The user is actively seeking coping mechanisms which indicates some awareness and a desire to manage the situation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 07:10:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just want to remind everyone to check in on your friends, even the ones who seem okay. You never know what someone's going through. Reach out if you need to. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, and a reminder to check on friends suggests the author might be struggling with something significant. While not explicitly stating suicidal ideation, the vulnerability expressed warrants moderate concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 06:22:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Old coping mechanisms surfaced. Day 1 of trying something different. Anyone else relate? Just feeling incredibly alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feeling overwhelmed and a return to old coping mechanisms, which could be harmful. The feeling of being incredibly alone is also a risk factor for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 06:21:30"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Dude was getting pummeled. Called 911, but feel helpless. Anyone else witness it? Hope he's okay. Makes you think.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A violent physical altercation occurred, with one individual being seriously assaulted. While the event is in the past and emergency services were contacted, the potential for lasting harm to the victim is present.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 06:20:29"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy get shoved on the train platform. Shook me up. It was so casual, like it happens all the time. Is that normal now? I feel sick.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text doesn't describe a severe injury, the act of being shoved onto a train platform carries a significant risk of serious injury or death (e.g., falling onto the tracks). The observer's distress suggests a real, potential danger was witnessed.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 06:19:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Not sleeping again. The constant put-downs are getting worse, not better. Feeling trapped. Anyone else been through this? How did you find the strength to leave?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped and increased put-downs, suggesting potential emotional distress and a possible abusive situation. While not explicitly mentioning self-harm or suicide, the feelings of helplessness and seeking advice on leaving suggest a need for support and a risk of escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 06:18:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Relapsed after 6 months clean. Feeling so ashamed and alone. Reached out to my therapist, but waiting is hard. Just needed to tell someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety is a significant risk factor. While the individual has reached out for help, the waiting period can be a vulnerable time. Feelings of shame and loneliness can exacerbate the situation. Further assessment needed to determine immediate safety.",
    "detected_category": "other",
    "timestamp": "2025-12-30 06:17:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant yelling, walking on eggshells. Feeling trapped. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a potentially abusive home environment with feelings of being trapped, which could escalate to harm. While not explicitly stated, the situation presents a risk for emotional distress and potential harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 06:16:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed, and seeking help, indicating potential emotional distress and a need for support. While not explicitly suicidal, the statement suggests a vulnerability that warrants attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 06:15:21"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Trying to distract myself but it's hard. Anyone else relate? Just feeling really alone rn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, which suggests a previous history of self-harm or suicidal ideation. While the individual is trying to distract themselves, the statement of feeling 'really alone' is a significant risk factor.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 06:14:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to. Talking to someone feels impossible, but maybe typing this is a start. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and low mood, but lacks specific details about suicidal ideation, self-harm plans, or imminent danger. The individual acknowledges needing help and is reaching out, indicating a desire to improve their situation.",
    "detected_category": "other",
    "timestamp": "2025-12-30 06:13:18"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his car mirror after getting cut off. Scared me. Makes you wonder what's going on behind closed doors, you know? Anyone else feel like anger is just everywhere lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing an act of anger (punching a car mirror) is unsettling, but doesn't directly indicate imminent danger to anyone. While the person expresses concern about broader anger issues, the specific incident doesn't suggest high risk.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 05:21:07"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to someone feels impossible, but I know I need to. Any advice on where to start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and isolation, which are risk factors for mental health decline and potential self-harm. The individual acknowledges a need for help but struggles to reach out, indicating a barrier to support.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 05:20:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor being carried out by paramedics. OD. Makes you think. Check on your friends, people. It can happen to anyone. Please get help if you need it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a neighbor's overdose requiring emergency medical intervention, suggesting potential risk to others in the community and highlighting the serious consequences of substance abuse.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 05:19:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I'm starting to think the constant put-downs aren't normal. It's chipping away at me. Has anyone else experienced this? Feeling lost and unsure of myself.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 54 (char 79)",
    "detected_category": "unknown",
    "timestamp": "2025-12-30 05:18:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Cleaned the cuts, but I'm so tired of this cycle. Anyone know resources that actually helped them? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 45 (char 70)",
    "detected_category": "unknown",
    "timestamp": "2025-12-30 05:17:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing too many RIPs lately. Lost another friend to OD. This sh*t is real. Please, if you're struggling, reach out. Don't become a memory. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses grief over multiple overdose deaths, including a recent friend, and directly mentions the possibility of someone becoming a memory, implying potential suicidal ideation or a high risk of overdose.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 05:16:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Reached out to a friend, feels a little better. Just trying to take it one hour at a time. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of urges, suggesting a potential mental health crisis. The individual is actively seeking support, which is a positive sign, but the presence of urges necessitates a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 05:14:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Some guy got shoved into traffic. Shaken up. Makes you realize how quickly things can escalate. Anyone else feel like things are getting more volatile lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was shoved into traffic, indicating potential for serious injury or fatality, although the victim is only described as 'shaken up.' The escalation of violence from an argument to physical harm raises concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 05:13:57"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Finally left. Years of walking on eggshells, the put-downs... I'm scared but also free. Anyone know resources for starting over?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Indicates a history of abuse and fear, suggesting potential vulnerability and psychological distress. The act of leaving is positive but the fear indicates ongoing risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 05:12:55"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you wonder what people are going through to get that angry. Anyone else feeling on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text reports witnessing a fight, indicating potential violence in the area, but doesn't express direct intent or threat. The feeling of being 'on edge' is vague and doesn't suggest imminent danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 05:11:54"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD. It's terrifying. My brother almost died last year. Narcan saved him. Learn the signs, carry it if you can. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a recent overdose (OD) incident and the brother's near-fatal experience, indicating a potential for immediate harm if someone is actively overdosing. While the author is advocating for preventative measures, the context suggests a prevalent risk. The experience of the brother is not in the past, so it implies more danger now and in the future.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 04:31:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been walking on eggshells lately. Partner's temper is getting scary. Anyone else experience this? Feeling so alone and confused. #domesticviolence #verbalabuse\"\n\nI have replaced the hashtags with a sentence, as requested. I also altered the comment to be less specific, and more focused on seeking relatability and shared experience, which can be a common starting point for someone reaching out online.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a partner's escalating temper and feeling scared, suggesting potential for violence or abuse. The phrase 'walking on eggshells' implies a hostile and unpredictable environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-30 04:30:42"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on the bus. Shook me up. Is there anywhere to report stuff like that anonymously? Feeling really unsafe now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A fight breaking out on a bus indicates a risk of violence and potential injury to others. The reporter also expresses feeling unsafe, suggesting a direct impact from the incident.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 04:29:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of distress and being lost, but there is no explicit mention of self-harm, suicide, or harm to others. The user is reaching out for help, which suggests a desire to connect and find support.",
    "detected_category": "other",
    "timestamp": "2025-12-30 04:28:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park yesterday. Terrifying. Narcan saved him, but damn. Makes you think. Where can folks get help around here? Anyone know resources?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while not directly impacting the person providing the text, indicates a potential safety risk for others in the community and prompts concern. The event required emergency intervention (Narcan).",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 04:27:38"
  },
  {
    "title": "User Story: Suicide",
    "content": "**(Option 1: Seeking Help)**\n\n> Feeling so lost lately. Everything feels heavy. Reaching out before things get worse. Anyone know good resources?\n\n**(Option 2: Sharing a Story)**\n\n> Been there. Dark place. It DOES get better. Keep talking, keep fighting. You're not alone.\n\n**(Option 3: Raising Awareness)**\n\n> Check in on your friends. You never know what someone's going through. A little kindness can go a long way.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses feeling lost and overwhelmed, suggesting potential mental health distress and seeking help before things escalate. This indicates some risk, though not explicitly suicidal.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 04:26:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to quiet things down is to hurt. I know it's not, but the urge is so strong. Anyone else feel this? Trying to find healthier coping mechanisms.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses an urge to self-harm, indicating a potential risk. While the individual acknowledges it's not the right solution and is seeking healthier coping mechanisms, the strength of the urge elevates the risk beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 04:25:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Been having a really rough time lately. The urges are strong. Reached out to the crisis text line, which helped a bit. Just trying to get through tonight. It's okay not to be okay, right?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions strong urges and reaching out to a crisis line, indicating distress and potential for self-harm or suicide. While the individual is actively seeking help and trying to cope, the presence of strong urges elevates the risk beyond low.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 04:24:33"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so low lately, like I'm underwater. Reaching out because I know I need to. Anyone else ever feel this way? What helps?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of low mood and a sense of being overwhelmed ('underwater'), indicating potential depression or emotional distress. The individual is actively reaching out for help, which suggests they are aware of their need for support and are not yet completely overwhelmed. However, the lack of specific plans or intent keeps it from being 'high', but the level of distress is beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 04:23:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and heavy, indicating distress and a lack of direction. While concerning, there is no explicit mention of self-harm, suicide, or harm to others. The individual is reaching out for help, which is a positive sign.",
    "detected_category": "other",
    "timestamp": "2025-12-30 04:22:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thankfully. Makes you realize how fragile life is. Anyone know good resources for family struggling with addiction? I need help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event suggests potential for future overdose incidents and expresses a need for resources, indicating ongoing risk related to addiction. While Narcan was successful, the underlying problem persists.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 03:46:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Just existing is exhausting. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of exhaustion and being overwhelmed, indicating potential mental health struggles and a need for support. While not explicitly stating suicidal intent, the feelings of heaviness and exhaustion could be precursors to more serious ideation. The person is also reaching out for help, which indicates some level of insight and a desire to feel better.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 03:45:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post about suicide, aimed to sound authentic and encourage help-seeking:\n\n\"Feeling so lost lately. Like I'm underwater and can't find the surface.  Talking feels impossible.  Anyone else ever feel this way?  Just... needing a sign it gets better.\"\n\nI have avoided any specific details about methods or plans, and focused on the feeling and the desire for things to improve.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post expresses feelings of hopelessness and being overwhelmed ('underwater and can't find the surface') coupled with a difficulty in communicating ('Talking feels impossible'). While it avoids explicit mention of suicidal plans, the request for 'a sign it gets better' indicates suicidal ideation and a desire for intervention. The post aims to sound authentic, which increases the risk of it resonating with and potentially influencing vulnerable individuals.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 03:44:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head. Dealing with urges again tonight. Just trying to breathe and remember I'm not alone. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges' and internal distress ('so loud inside my head'), suggesting a potential risk of self-harm or acting on those urges. While the person is actively trying to cope ('breathe', 'remember I'm not alone'), the presence of urges elevates the risk beyond just general distress.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 03:43:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan worked, thank goodness. Makes you realize how fragile things are. Please, if you're struggling, reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, even with a positive outcome, indicates a serious situation and potential risk to others in the area due to drug use. While the person survived, the event highlights a risk of overdose in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 03:42:14"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Terrifying. Narcan worked, thank god. Makes you realize how close to home this is. Anyone know of local resources for prevention or support?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, an overdose occurred, indicating a serious risk of potential future incidents or impacts on the observer.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 03:41:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to a friend helped a little, but it's still there. Gonna try to find a therapist. Wish me luck.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of being overwhelmed and lost, suggesting potential depression or mental distress. While the person is seeking help (therapist), the continued presence of these feelings warrants a medium severity rating. The 'underwater' metaphor suggests a struggle and feeling suffocated by these emotions.",
    "detected_category": "suicide",
    "timestamp": "2025-12-30 03:40:11"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary. My hands are still shaking. Is there anywhere safe to walk around here anymore? Feeling really uneasy.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't indicate imminent danger to the author or others. Expresses fear and unease, but no direct threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-30 03:39:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD. It's scary. Happened to my cousin last year. Narcan saved him, thank god. Learn the signs, carry it if you can. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a personal experience with a potentially fatal overdose, highlighting the importance of Narcan. While the cousin survived, the mention of the event and its potential for death indicates a moderate level of concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-30 03:38:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to remember my coping skills. It's a struggle. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a return of urges and struggling to cope, suggesting a potential escalation of risk. While not explicitly suicidal, self-harming, or violent, the increased vulnerability warrants a 'medium' severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-30 03:37:06"
  }
]