[
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to feel *something* is to hurt. I know it's not healthy, but it's hard to stop. Reaching out feels impossible, but I know I need to. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a desire to hurt oneself and difficulty stopping. It directly states awareness of the unhealthiness but implies a lack of control, suggesting a significant risk of self-harm.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 02:51:34"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to a friend helped a little. Remember to reach out if you're struggling too. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, which can be indicative of a mental health struggle. The mention of feeling \"underwater and can't find the surface\" suggests a significant level of distress. While the person reached out to a friend, indicating some coping mechanisms, the intensity of the initial feelings warrants a medium severity assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 02:50:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. Walking on eggshells constantly. Is this normal? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially unsafe home environment with phrases like 'walking on eggshells,' suggesting fear and anxiety. While it doesn't explicitly mention violence or abuse, the overall tone and description raise concern for emotional or psychological distress and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 02:49:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Trying to distract myself but it's hard. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating a potential escalation. While the individual is attempting to cope, the intensity of the urge raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 02:48:28"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing news about another OD hit way too close to home. Lost my cousin last year. Please, if you're struggling, reach out. There's help out there. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and acknowledges the risk of overdose. While not explicitly suicidal, it suggests a heightened awareness and concern about self-destructive behaviors, indicating vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 02:47:27"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Should I have said something? Feeling sick about it now. Wish I knew what to do in those situations.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can lead to emotional distress and potentially escalate into physical danger if intervention is attempted without proper knowledge or safety measures. While the original text writer was not physically harmed, this event could lead to potential harm to the girlfriend as well as psychological distress to the witness.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 02:46:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head, I just want to feel *something* else, you know? Not proud of it, but it happens. Trying to find healthier ways to cope. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a desire to feel something else to cope with overwhelming thoughts, implying a potential for self-destructive behavior. While not explicitly stating self-harm, the desire to \"feel *something* else\" when overwhelmed suggests a vulnerability to potentially harmful coping mechanisms.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 02:45:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so low lately. Just having a really hard time seeing the point. Reaching out to a friend now. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of hopelessness and questioning the point of living, suggesting potential suicidal ideation. While the individual is reaching out to a friend, the presence of these feelings warrants a medium severity assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-08 02:44:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me up. Please, if you're using, have someone with you and carry Narcan. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates potential for future overdoses and highlights the immediate danger associated with drug use. While Narcan was used successfully, the event's impact on the individual and the call to action suggest ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 02:43:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and being overwhelmed, indicating emotional distress and a need for help. While not explicitly suicidal, the feelings described are risk factors for suicidal ideation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 02:42:18"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my friend OD last night. Scariest thing ever. He's okay now, thankfully. Makes you realize how fragile life is. Learn the signs, carry Narcan if you can.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates a potential risk of future overdose for the friend, as well as potential trauma for the person who witnessed it. The friend is now okay, which decreases the immediate severity, but risk remains.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 01:46:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his car mirror after getting cut off. Scared me. Is that normal road rage? Feeling shaky.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing road rage is unsettling, but the described incident (punching a car mirror) doesn't directly indicate imminent danger to the reporting person or others. The reporter is feeling shaken, which suggests emotional distress, but not necessarily a high-risk situation.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 01:45:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling so lost and empty. Reaching out because I don't know what else to do. Any advice or just someone to listen?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and empty, indicating distress. However, there is no explicit mention of self-harm, suicide, or harm to others.",
    "detected_category": "other",
    "timestamp": "2025-12-08 01:44:55"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm starting to feel like I'm walking on eggshells all the time. He gets so angry over nothing. Is this normal in a relationship? I'm scared to talk to anyone I know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of controlling behavior and fear, potentially indicating emotional abuse. The writer is scared, which suggests a potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 01:43:54"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant yelling, walking on eggshells... I feel so isolated. Anyone else been through this? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a volatile home environment with potential for escalation. While it doesn't explicitly mention harm, the constant yelling and walking on eggshells suggest emotional distress and potential for verbal or emotional abuse. The feeling of isolation further exacerbates the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 01:42:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. The constant put-downs are chipping away at me. Anyone else feel like they're walking on eggshells all the time? Is this normal? I'm starting to think it's not.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling emotionally worn down by constant put-downs and a tense environment. While not explicitly suicidal or self-harming, the feeling of being 'chipped away' and 'walking on eggshells' suggests a significant level of emotional distress and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 01:41:51"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Terrifying. Called 911, they're okay now. Learn Narcan, people. It could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the immediate danger has passed as the person is now okay, the event signifies a risk of future overdose, and the text promotes awareness of a life-saving intervention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 01:40:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Called 911, they're getting help. Learn the signs of an OD, it could save a life. Naloxone is key.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Observed overdose is a serious incident requiring immediate medical attention. While help was called, the event indicates potential for severe harm or death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 01:39:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need help. Talking to someone feels impossible, but I'm trying.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a need for help, indicating potential self-harm risk. While not explicitly stating suicidal intent, the user acknowledges their low mood and difficulty seeking help, suggesting vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 01:38:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, potentially indicating a need for support. The phrase 'underwater and can't find the surface' suggests a struggle, and reaching out indicates a level of distress.",
    "detected_category": "other",
    "timestamp": "2025-12-08 01:37:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Feeling so lost. Constant put-downs disguised as 'jokes' are really getting to me. Is this normal in relationships? Starting to think it's not...\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and questioning of the relationship's health due to persistent belittling. While not explicitly stating intent to harm self or others, the feeling of being \"lost\" and the negative impact of the 'jokes' suggest a potential for escalating emotional harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 00:45:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about someone ODing. Hits too close to home. Lost a friend last year. Please, if you're struggling, reach out. There are people who care. Don't be another memory.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about a recent overdose and references a past loss due to similar circumstances. While not directly expressing suicidal ideation, it highlights the risk of overdose within the individual's social circle and implies emotional distress, raising the potential for risky behavior.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 00:44:45"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got seriously hurt. Makes you think, y'know? Scared me. Is there anywhere safe anymore?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a violent altercation with serious injury, implying a threat to public safety and causing personal distress.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 00:43:43"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out at the bus stop. So shaken. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and can cause anxiety, but the text doesn't indicate direct involvement or immediate danger to the individual. It expresses emotional distress and shared concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-08 00:42:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just found my friend unresponsive. Narcan worked, but it was terrifying. Please, if you're struggling, reach out. Don't want anyone else to go through this. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Friend was found unresponsive and required Narcan, indicating a life-threatening overdose event.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 00:41:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and helpless, which could indicate underlying distress and a potential risk of self-harm or suicidal ideation. The individual is actively seeking help, suggesting a willingness to engage, but the depth of their distress warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 00:40:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scared me senseless. Narcan worked, thank god, but it shook me up. This shit is real, ppl. If you're struggling, please reach out. You're worth it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event that can indicate a broader public health crisis and individual distress, but there is no direct threat present.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 00:39:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just left. Again. He promised it wouldn't happen this time. My head is spinning. Does anyone know a good, safe place I can go, even just for tonight? I feel so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential for abuse and a feeling of being unsafe. The person is actively seeking a safe place, suggesting an immediate need and a potential for escalation if a safe place isn't found.",
    "detected_category": "abuse",
    "timestamp": "2025-12-08 00:38:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a crisis line, hoping it helps. It's exhausting fighting this every day.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly states a strong urge to self-harm and feeling overwhelmed, indicating a significant and immediate risk to the individual's safety.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-08 00:37:34"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but it shook me. Please, if you're using, have someone with you & know the signs. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a witnessed overdose requiring Narcan, indicating a life-threatening situation and potential for future incidents.",
    "detected_category": "overdose",
    "timestamp": "2025-12-08 00:36:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after 6 months clean. Feeling so much guilt and shame now. Reaching out for support again. It's a daily battle.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety, coupled with feelings of guilt and shame, indicates a potential for increased risk-taking and mental health crisis. While not explicitly stating intent to self-harm or suicide, the struggle described warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 23:16:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud inside my head. Found some resources online, gonna try to reach out. Baby steps, right? It's exhausting fighting this alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates internal distress and a feeling of being overwhelmed, suggesting a potential mental health crisis. The individual is seeking help, which is positive, but the exhaustion mentioned implies a prolonged struggle.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 23:15:56"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to feel *something* is to hurt. I know it's not healthy, but the urge is so strong. Reached out to a crisis line. Hoping it helps. Just needed to say it somewhere.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Expresses a strong urge to self-harm and admits it's not healthy, indicating a high risk of acting on those urges despite seeking help.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 23:14:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but it really shook me up. Reminded me how fragile things are. Anyone know good resources for helping people struggling?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, indicating a significant health risk, though it was successfully addressed with Narcan. The event caused distress to the observer, highlighting the potential for vicarious trauma.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 23:13:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so low lately, urges are back. Trying to resist, but it's hard. Reached out to a friend, hoping it helps. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with urges, suggesting a potential risk of self-harm. The individual is actively trying to resist and has reached out for help, which is a positive sign, but the return of urges elevates the risk beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 23:12:52"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Been walking on eggshells lately. Is it normal to feel like you're constantly doing something wrong, even when you're not? Starting to feel really trapped. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped and constantly wrong, which could indicate emotional distress and potential for escalation. While not explicitly stating harm, the 'walking on eggshells' metaphor suggests a stressful and potentially harmful environment or relationship.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 23:11:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Reaching out because I don't know what else to do. Any advice or just someone to talk to would be appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and hopeless ('drowning') and a plea for help. While there's no explicit mention of suicide or self-harm, the intensity of the distress and the explicit request for intervention indicate a need for support and a potential risk that warrants further assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 23:10:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Just wanted to say if you're struggling too, you're not alone. Reaching out feels impossible, but there are people who want to help. Thinking of trying a hotline.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses struggles and indicates suicidal ideation by mentioning a hotline as a potential resource. While no explicit plan or intent is stated, the mention of a hotline suggests the individual is contemplating seeking help for a potentially serious mental health crisis.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 23:09:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Relapsed after 6 months clean. Feeling so ashamed and lost. Reaching out to my therapist tomorrow, but tonight is rough. Just need to know I'm not alone in this.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety is a high-risk situation. While the individual is reaching out for help, the immediate risk of harmful behavior is elevated due to feelings of shame and loss.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 23:08:45"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on the train. So scary. Shaking. Is there anywhere I can report this besides the police? Feel helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence can be traumatizing and cause anxiety/fear. While the immediate threat is over, the emotional impact suggests a need for support and reporting options beyond immediate police involvement.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 23:07:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor being carried out by paramedics today. OD. Scared. Please, if you're struggling, reach out. There are people who care. I'm here to listen too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a neighbor's overdose suggests a risk of potential copycat behavior or increased vulnerability to substance abuse due to proximity and emotional impact. While the text doesn't indicate imminent harm to the author, the overdose event has created a sense of fear and vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 22:17:09"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been... rough. Constant yelling, and now things are getting physical. I feel so lost and scared. Anyone know of resources to help? I need to figure out how to be safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates escalating domestic violence, including physical altercations, causing the individual to express fear and a need for safety. This suggests an immediate threat of harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 22:16:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like a dark cloud won't lift. Reaching out because I know I need to. Talking to a friend tonight, hoping it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and low mood, but also shows active coping mechanisms like reaching out to a friend. There's no explicit mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2025-12-07 22:15:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Talking feels impossible, but I need to try.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, suggesting potential distress. The individual is reaching out for help, indicating they recognize the need for support, but also that they are struggling. While not explicitly suicidal, the language warrants concern.",
    "detected_category": "other",
    "timestamp": "2025-12-07 22:14:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, but it could have been so different. Narcan saves lives. Learn how to use it. Please.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual survived, a drug overdose occurred, indicating a significant risk. The potential for fatality exists in overdose situations.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 22:13:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to talk to someone. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a desire for help, suggesting a potential risk of self-harm or suicidal ideation. While not explicitly stated, the 'dark cloud' metaphor and feeling 'low' warrant concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 22:12:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thankfully. Please, learn the signs & carry it if you can. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose, even with successful intervention, indicates a severe, life-threatening situation and highlights the potential for fatal outcomes if not addressed promptly.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 22:11:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, and just talking helped a little. Gonna try to find a therapist this week. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk. While the individual reached out for help and intends to seek therapy, the immediate risk remains high due to the intensity of the urge.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 22:09:59"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. My neighbor's been yelling & throwing things again. Called the cops last time, but it just made things worse. Anyone know of resources for domestic disturbances that actually help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential for escalating violence and the neighbor's actions have worsened after police involvement, suggesting a need for immediate help and safety planning.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 22:08:57"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so overwhelmed lately. The urge to cut is strong. Reached out to a friend, which helped a bit. Taking it one hour at a time. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating active suicidal ideation. While the person reached out to a friend for help, the presence of the urge itself elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 22:07:55"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about overdose deaths lately... it's scary. My brother struggled for years. If you're fighting addiction, please know you're not alone. There are resources out there. Reach out. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references overdose deaths and addiction, indicating a potential for life-threatening health risks.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 21:16:30"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out at the bus stop. Shaken. Is this normal now? Feel so unsafe walking home lately. Anyone else experiencing more aggression in public?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual was not directly harmed, the observation of a fight and expressed feeling of unsafety suggest a potentially escalating risk. Witnessing violence can be traumatizing and lead to heightened anxiety about future safety.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 21:15:29"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Just reaching out to see if anyone else has felt this way and found a way through. Need some hope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loss and a need for hope, but doesn't indicate immediate danger or specific plans for self-harm or harm to others. It's a general expression of emotional distress.",
    "detected_category": "other",
    "timestamp": "2025-12-07 21:14:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just reached out to a helpline. Talking helped, even a little. If you're struggling, please don't give up. There's support out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The individual expresses feelings of being lost and reaching out for help, indicating distress but also active coping mechanisms. There's no explicit mention of self-harm, suicide, or violence.",
    "detected_category": "other",
    "timestamp": "2025-12-07 21:13:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so heavy lately, like I'm underwater. Reaching out because I don't know what else to do. Has anyone else felt this way? Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a sense of helplessness, potentially indicating a decline in mental well-being and a need for support. While there is no explicit mention of self-harm or suicide, the language suggests a significant emotional burden that warrants attention. Reaching out for help is a positive sign, but the depth of distress is concerning.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 21:12:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just left. Again. Said it was my fault, like always. Head's spinning. Anyone know resources for emotional abuse? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and potential ongoing abuse, causing a state of disorientation ('Head's spinning'). The user is actively seeking resources, suggesting they recognize the problem and want help. While not explicitly suicidal or self-harming, the situation could escalate if left unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 21:11:23"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Reached out to a friend, feels a little better. Remember there are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions of 'urges' returning suggests a potential relapse or escalation of a pre-existing issue. Reaching out to a friend is a positive coping mechanism, but the presence of urges indicates ongoing risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 21:10:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain specific threats or plans for self-harm or harm to others. It is a general expression of distress.",
    "detected_category": "other",
    "timestamp": "2025-12-07 21:09:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. He's been yelling more, and last night... I just don't know what to do anymore. Anyone been through this? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests potential emotional and possibly physical abuse due to increased yelling and an unspecified event last night. The person expresses feelings of isolation and distress, which increases vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 21:08:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately & ngl, urges have been bad. Trying to reach out instead. Anyone else feel this way? Any tips that help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the individual is experiencing strong urges, suggesting a potential risk of self-harm or suicide. While the individual is reaching out for help, the presence of 'bad urges' elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 21:07:17"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a fight outside my building. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text doesn't indicate imminent danger or direct involvement. It primarily expresses feeling shaken and on edge.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 20:17:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 74 (char 99)",
    "detected_category": "unknown",
    "timestamp": "2025-12-07 20:16:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been feeling so isolated lately. Constant put-downs and control... Is this normal in a relationship? Starting to think it's not just \"tough love.\" Anyone else been through this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional isolation, control, and put-downs, which are indicators of potential emotional abuse. The user is questioning the relationship and feeling lost, suggesting distress and vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 20:15:50"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about overdose deaths is scary. Lost a friend last year. If you're struggling, please reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about overdose deaths and mentions the loss of a friend, indicating potential exposure to a high-risk environment and emotional distress. While not explicitly stating intent, it highlights vulnerability related to substance use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 20:14:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary stuff. Narcan saved them, but it really shook me up. Makes you realize how fragile life is. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates potential for further overdose incidents in the area, highlighting public health and safety concerns.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 20:13:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and overwhelmed ('underwater'), indicating potential emotional distress. Reaching out is a positive sign, but the underlying feelings warrant concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 20:12:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Rough night. The urges were so strong. Clean for a while now, but tonight was a close call. Just needed to tell someone. Gonna try and reach out to my therapist tomorrow.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes strong urges, implying potential self-harm or relapse into harmful behaviors. While the individual expresses intent to seek help, the immediacy of the urges elevates the risk beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 20:11:44"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not explicitly mention self-harm, suicide, or harm to others. The individual is reaching out for support, which suggests a desire to improve their situation.",
    "detected_category": "other",
    "timestamp": "2025-12-07 20:10:42"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like a dark cloud won't lift. Reaching out because I know I need to talk to someone. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a low mood and a desire to seek help, suggesting potential for escalation if unaddressed. Expressing a need to talk implies internal distress.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 20:09:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mentions of self-harm, suicide, or violence. It's a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-07 20:08:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head. Just trying to get through tonight without making things worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The statement expresses internal distress and a struggle to avoid worsening the situation, suggesting a potential for self-harm or suicidal ideation, although it lacks explicit plans.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 19:16:02"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street. He shoved her, hard. Called the cops, but I'm still shaking. Makes you realize how easily things can escalate. Anyone else feel helpless witnessing stuff like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, especially physical assault, can be psychologically distressing and indicates a potential risk of harm to the victim, even if reported to the authorities.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 19:15:00"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Scary how fast things escalated. Makes you think, you know? Stay safe out there, everyone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text mentions a fight escalating quickly, implying a potential for violence, but lacks specific details about injuries or ongoing threats. It's more of a general warning.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 19:13:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary. My hands are still shaking. Is there anything we can do to help de-escalate situations like that? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is frightening and may cause anxiety, but the text doesn't indicate direct involvement or ongoing threat to the individual or others. The focus is on feeling scared and helpless, not actively participating in or escalating the violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 19:12:57"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so numb lately. Urges are back. Reached out to a friend, just needed to say it out loud. It helps, a little. If you're struggling too, you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the return of urges, which is a warning sign for potential self-harm or suicide. Reaching out is a positive coping mechanism, but the persistence of urges elevates the risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 19:11:56"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. They're okay now, thank god. Makes you realize how fragile things are. If you're struggling, please reach out to someone. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event, indicating a significant risk. While the person survived, the potential for fatality elevates the severity. The text also includes a supportive message suggesting the person writing it is aware of the risk and offering help.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 19:10:54"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get shoved on the train today. People just watched. Makes you wonder what's happening to us. Anyone else feel like things are getting more aggressive?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical assault (shoving) occurred, indicating potential for harm. While not explicitly stated, inaction by bystanders suggests a normalization of violence or fear, raising concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 19:09:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Talking feels impossible, but I know I need help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed, and a need for help, suggesting potential for escalation if unaddressed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 19:08:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant yelling, put-downs... I feel so small. Is this normal? Anyone else go through this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional distress and a potentially abusive environment characterized by yelling and put-downs, leading to feelings of inadequacy. While it doesn't explicitly mention physical harm or suicidal ideation, the description of a hostile home environment raises concerns about the individual's well-being and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 19:07:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, walking on eggshells...Is this normal? Feeling lost & alone. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a potentially abusive environment (put-downs, walking on eggshells). While there isn't an explicit mention of physical violence or self-harm, the feelings of isolation and being lost can be precursors to more severe issues.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 19:06:48"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Reaching out because I don't know what else to do. If you've been there, how did you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and a desire for help, but there is no explicit mention of self-harm, suicide, violence, abuse, or overdose. It appears to be a general cry for support.",
    "detected_category": "other",
    "timestamp": "2025-12-07 18:20:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about another OD in my town. Makes me sick. Lost a friend last year. If you're struggling, PLEASE reach out. There are people who care. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions a recent overdose and a past loss of a friend due to overdose, indicating an ongoing overdose problem in the community. While the author is encouraging people to seek help, the repeated mention of overdose and its negative consequences points to a significant and current risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 18:19:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just reaching out to see if anyone else knows what it's like. Trying to find a reason to keep going.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of loss, being lost, and a struggle to find a reason to continue. While not explicitly suicidal, the statement 'trying to find a reason to keep going' suggests a degree of hopelessness and a potential risk of self-harm or suicidal ideation if these feelings persist or worsen.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 18:18:00"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy and I'm not sure how to cope. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feeling lost, overwhelmed, and unable to cope, indicating potential for escalating distress. While there's no explicit mention of self-harm or suicidal ideation, the level of distress warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 18:16:58"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm underwater. Reaching out because I don't know what else to do. Any advice or just someone to talk to would be appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a desire for help, indicating emotional distress. While not explicitly suicidal, the phrase \"I don't know what else to do\" suggests a lack of coping mechanisms and a potential risk of escalation if support is not provided.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 18:15:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out for help feels impossible, but I know I need to. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, and a difficulty in reaching out for help, suggesting potential distress. While not explicitly mentioning self-harm or suicide, the feeling of being 'underwater' can be interpreted as a metaphor for depression or a feeling of being overwhelmed, warranting concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 18:14:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and hopelessness, and the individual is reaching out for help, suggesting they may be struggling to cope. While there's no explicit mention of self-harm or suicide, the overall sentiment warrants a medium severity rating due to the potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 18:13:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "Ugh, another wave of feeling totally worthless. Been here before, but it's hitting hard. Reaching out instead of isolating. Anyone else feel like they're just... existing?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of worthlessness and a desire to connect rather than isolate. While concerning, there's no explicit mention of self-harm, suicide, or other dangerous behaviors.",
    "detected_category": "other",
    "timestamp": "2025-12-07 18:12:52"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Reached out to a friend, just need someone to listen. It helps. If you're struggling too, please don't go it alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges, which could imply self-harm or suicidal ideation. The person has reached out for help, which is a positive sign, but the presence of strong urges elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-07 18:11:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. Little things, but they escalate. I feel so stupid for letting him back in. Anyone know resources for emotional abuse? I need to get out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a pattern of escalating emotional abuse and a desire to leave the situation. While not explicitly stating immediate physical danger, the escalation and feeling trapped raise concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 18:10:48"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things aren't good at home. Walking on eggshells constantly. Anyone else ever feel like they're losing themselves? Need to find a way out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates distress, feeling trapped, and a desire to escape an unhealthy home environment. The phrase \"losing themselves\" and \"find a way out\" suggest potential for negative coping mechanisms and the risk requires further assessment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 17:16:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Just left. Again. My 'safe space' became anything but. Tired of the cycle. Anyone know resources for emotional abuse? Feeling lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a pattern of distress ('Again', 'Tired of the cycle') related to emotional abuse and a feeling of being 'lost,' suggesting potential vulnerability. While not explicitly suicidal or imminently dangerous, the situation warrants concern and resource provision.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 17:15:09"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough. Constant put-downs, isolating me from friends... I feel trapped. Anyone else been through this? How did you find help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, indicating potential risk for mental health decline and increased vulnerability. The feeling of being \"trapped\" suggests a lack of autonomy and potential escalation of harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-07 17:14:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Narcan saved them, but I'm still shaken. Learned my lesson about carrying it. Get trained, it's so important.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates the presence of a significant health risk (overdose) in the environment. Although Narcan was available, the event caused significant distress to the witness.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 17:13:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm drowning. Reaching out because I don't know what else to do. Any advice or just someone to listen?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and a lack of coping mechanisms, suggesting potential for escalation if support is not received. The phrase 'like I'm drowning' indicates significant distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 17:12:05"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved their life. Please, if you're using, have it with you. It's not worth the risk. #addiction #overdose",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event requiring Narcan intervention, indicating a life-threatening situation and potential for future occurrences. While the person survived, the event's inherent risk and the explicit warning suggest a high level of immediate and ongoing danger.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 17:11:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved their life, but I'm still shaken. Please, if you're struggling, reach out. There's help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates potential risk to others around the person who overdosed, even if indirectly. The person who overdosed is no longer in immediate danger, but the event highlights the presence of substance use and potential for future overdoses in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-07 17:10:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a heavy cloud is always over me. Reaching out because I know I need help. Any advice on finding a good therapist?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of depression and a recognized need for help, suggesting a potential risk that could escalate without intervention. The active seeking of a therapist indicates a desire to improve the situation, but the low mood warrants monitoring.",
    "detected_category": "suicide",
    "timestamp": "2025-12-07 17:09:00"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. It's heavy.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but lacks specific indicators of intent to harm self or others. It appears to be a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-07 17:07:58"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting on the street. Really heated, almost got physical. Makes you wonder what goes on behind closed doors. Hurts to see that kinda stuff. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a heated argument, while potentially escalating, does not directly indicate immediate danger or severe harm to individuals involved. It expresses concern and discomfort rather than a concrete threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-07 17:06:57"
  }
]