[
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but lacks specific details about self-harm, suicidal ideation, or harm to others. While concerning, it primarily indicates a need for support and connection rather than imminent danger.",
    "detected_category": "other",
    "timestamp": "2026-01-14 00:48:22"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Just wanted to say if you're struggling, you're not alone. Talking helps, even if it feels impossible. Reach out to someone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being overwhelmed and encourages seeking help, but does not indicate immediate danger.",
    "detected_category": "other",
    "timestamp": "2026-01-14 00:47:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Finally left. Scared & exhausted. Years of being told I was worthless... hard to believe I deserve better, but I'm trying. Any advice for starting over? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being scared, exhausted, and worthless, stemming from past abuse. While there's no explicit mention of self-harm or suicidal intent, the vulnerability and feelings of being lost could escalate if left unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 00:46:18"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out at the corner store. Shook me up bad. Makes you realize how fast things can escalate. Anyone else feel like violence is getting worse lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but there's no indication of ongoing or immediate danger to the reporter or others. It expresses concern and observation rather than direct involvement or threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 00:45:17"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 70 (char 95)",
    "detected_category": "unknown",
    "timestamp": "2026-01-14 00:44:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "I feel so lost. Things at home are getting worse. I’m scared, but I don’t know who to talk to. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost, scared, and mentions worsening conditions at home. While there's no explicit mention of self-harm or suicidal ideation, the combination of these factors indicates a potential risk that requires further assessment and support.",
    "detected_category": "other",
    "timestamp": "2026-01-14 00:43:13"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Seeing someone get hurt like that... makes you realize how quickly things can escalate. Anyone else feel on edge after witnessing something like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence, but there is no indication of immediate danger or threat to the safety of the individual expressing the sentiment or others. It expresses a feeling of being shaken up and on edge, indicating a negative emotional reaction but not necessarily a high-risk situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-14 00:42:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Relapsed after 6 months clean. Feeling so ashamed and lost. Reached out to my therapist but just needed to say it somewhere. Anyone else been there?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety can be a trigger for negative emotions and potentially lead to further risky behaviors. While not explicitly stating intent, the feelings of shame and being lost warrant concern and suggest increased vulnerability.",
    "detected_category": "other",
    "timestamp": "2026-01-14 00:41:09"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things aren't good at home. Constant yelling, controlling behavior... I feel trapped. Has anyone else been through this? How did you find help? I need to figure something out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of emotional distress and potential abuse (controlling behavior, feeling trapped), indicating a risk of harm to the individual's well-being. While not explicitly stating physical harm, the situation warrants concern and potential escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-14 00:40:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a screen. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of numbness and detachment, coupled with a plea for help, suggesting potential emotional distress and a need for support. While not explicitly suicidal, the feelings described can be precursors to more severe mental health crises.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-14 00:39:06"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Reminded me of my brother... Still dealing with the aftermath of that stuff years later. Anyone else carry that weight? Wish it would just go away.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and experiencing lingering emotional distress, but does not indicate immediate danger to self or others. The individual expresses a desire for the distress to go away, but doesn't suggest suicidal ideation or intent to harm.",
    "detected_category": "other",
    "timestamp": "2026-01-13 23:18:06"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Luckily, they're okay now. Makes you realize how fragile life is. Learn the signs of overdose, please. It could save someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event indicating potential risk of overdose in the community. While the person survived, it highlights the presence of dangerous substances and the possibility of future, potentially fatal, overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 23:17:04"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post about suicide, focusing on seeking help:\n\n\"Been feeling so low lately, like nothing matters. Reached out to the crisis line, and just talking helped a little. Still struggling, but taking it one day at a time. If you're feeling this way, please reach out too. You're not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post explicitly mentions suicidal ideation and reaching out to a crisis line. While it promotes seeking help, the expression of feeling 'so low, like nothing matters' indicates a significant level of distress and potential risk. The 'still struggling' suggests the immediate risk has not been fully mitigated.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 23:16:02"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Shook me up. Wish I'd said something. Anyone else ever freeze in situations like that? Feeling guilty.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessed a physical altercation (shoving), which is a potential indicator of violence. However, the text doesn't indicate ongoing danger to the person who was shoved or the poster. It expresses concern and guilt rather than imminent harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 23:15:00"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news report about an OD in my town. Scared me. Reminded me of my own struggles. If you're fighting addiction, please reach out. There's help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses concern and support related to addiction, triggered by a news report of an overdose. While it acknowledges personal struggles, it primarily focuses on encouraging others to seek help, without indicating imminent risk to the author or others.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 23:13:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't explicitly mention self-harm, suicidal ideation, violence, abuse, or overdose. While concerning, it seems to be a general expression of distress and a call for support.",
    "detected_category": "other",
    "timestamp": "2026-01-13 23:12:57"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a guy get jumped downtown last night. Shook me up bad. Anyone else witness it? Just trying to process what I saw and make sure he's okay. Feel so helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a violent assault. While the victim's condition is unknown, the description implies potential for serious injury. The witness is also expressing distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 23:11:55"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Walking on eggshells constantly. I'm scared. Anyone know resources for domestic abuse in [City Name]? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a fear of violence and a potential domestic abuse situation. The phrase \"walking on eggshells constantly\" suggests ongoing emotional and possibly physical abuse.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 23:10:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw my neighbor being taken away in an ambulance. Narcan probably saved him. Scared me so bad. Learned my lesson, keeping some on hand now. Hope he's okay. Please, look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a recent overdose event requiring emergency medical intervention and the use of Narcan, pointing to a significant, potentially life-threatening situation. While the immediate danger has passed for the neighbor, the proximity and impact of the event suggest a medium level of risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 23:09:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan worked, thankfully. Made me realize how easily it can happen. Stay safe out there, everyone. Know the signs.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person overdosed, indicating a significant risk to life. While Narcan was successful, the event highlights the potential for fatal outcomes.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 23:08:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just walked out. Years of \"jokes\" that weren't funny, control disguised as love... I'm finally done. Scared but free. Any advice for starting over? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a history of abuse and emotional distress. While there's no explicit mention of self-harm or suicidal intent, the feelings of being \"scared\" and \"lost\" after leaving a controlling relationship are concerning and warrant attention. The risk of escalation to self-harm or other negative coping mechanisms is present.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 22:18:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so lost lately. Everything's just... heavy. Anyone know of good resources for when you feel like you're drowning?\n\n**Option 2 (Sharing a Story):**\n\n> Been there. The dark place. It DOES get better, even when you can't see it. Pls reach out if you're struggling. You're not alone.\n\n**Option 3 (Raising Awareness):**\n\n> Check in on your friends, even the ones who seem okay. You never know what someone's hiding. Just a simple \"how are you?\" can make a difference.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and \"drowning,\" indicating significant distress and potential suicidal ideation, though not explicitly stated. The mention of \"the dark place\" further suggests a possible history of depression or suicidal thoughts.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 22:17:10"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so overwhelmed lately. Like I'm stuck in a dark hole. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feeling overwhelmed and trapped, indicating potential for escalation if support is not received.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 22:16:08"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scary night. Found my brother unresponsive. Narcan saved him, but it was too close. Please, if you're using, have someone with you. And get Narcan. It works.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event requiring Narcan intervention. The brother was found unresponsive, indicating a life-threatening situation. While Narcan was effective, the phrase \"it was too close\" highlights the high risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 22:15:06"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"He says he's sorry, it won't happen again. But it keeps happening. I feel so stupid for believing him each time. Is this... normal? I don't know what to do anymore.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a pattern of repeated apologies followed by continued harmful behavior, suggesting a potential abusive dynamic. The phrase \"I don't know what to do anymore\" implies a growing sense of helplessness and potential for escalation. While not explicitly stated, the repetitive nature hints at emotional or psychological abuse, which can escalate to physical abuse or other serious consequences.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 22:14:05"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Feeling so lost. Said some really awful things to my partner last night. I hate that I can be that person. Is there any way to learn to control anger better? Scared I'll lose them.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses regret and fear of losing their partner due to anger, suggesting potential for future emotional harm or relationship damage. While not explicitly violent, the mention of 'awful things' and fear of losing their partner indicates potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 22:13:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Old coping mechanisms keep popping into my head. Trying to stay strong and reach out instead. Anyone else relate? How do you get through it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions feeling overwhelmed and the re-emergence of old coping mechanisms, which could be potentially harmful. While the person is trying to reach out and stay strong, the mention of 'old coping mechanisms' suggests a risk that needs monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 22:12:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being overwhelmed and a sense of helplessness. The statement 'Reaching out because I don't know what else to do' indicates a potential crisis and a need for support. While there's no explicit mention of self-harm or suicide, the feelings described can be precursors to more serious thoughts or actions.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 22:10:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. Walking on eggshells constantly. Feeling trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling trapped and walking on eggshells, suggesting a potentially unsafe environment at home. While it doesn't explicitly mention violence or abuse, the emotional distress and sense of confinement warrant concern and further investigation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 22:09:58"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been walking on eggshells lately. Partner's been getting angry over nothing, then says I'm too sensitive. Is this normal? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and a feeling of being controlled, which can escalate to more severe forms of abuse or mental health issues. While not explicitly stating violence, the \"angry over nothing\" and \"walking on eggshells\" phrasing suggest a hostile and unpredictable environment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 22:08:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight outside the grocery store. Shook me up. Reminded me of my brother, years ago. Wish there was a way to help people before things escalate like that. Anyone else feel helpless sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a safety concern. However, it's a past event, and the author expresses feelings of helplessness rather than intent to harm themselves or others. There is no active threat. ",
    "detected_category": "violence",
    "timestamp": "2026-01-13 21:18:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown. Scary. Narcan saved them. Carry it, learn how to use it. Could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event indicates a risk of similar incidents occurring. While the person survived, the situation highlights the potential for fatal outcomes and the prevalence of drug use in the area.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 21:17:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, isolating me from friends... Feels like I'm walking on eggshells. Anyone else gone through this? Where do I even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, indicating a potentially harmful situation. While there's no explicit mention of physical violence or self-harm, the feeling of 'walking on eggshells' and being isolated raises concerns for the individual's mental and emotional well-being. This could escalate if not addressed.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 21:16:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD in the bathroom stall today. Scared me senseless. Thank god for the Narcan they had. We gotta do better, people. Know the signs, carry it. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates a potential, ongoing risk of further overdoses in the described environment. While Narcan was available, it highlights a serious safety concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 21:15:07"
  },
  {
    "title": "User Story: Suicide",
    "content": "I'm having a really hard time lately. Feeling so lost and empty. Just reaching out to see if anyone else has felt this way and what helped.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and empty, which can be indicators of depression or other mental health challenges. While not explicitly mentioning self-harm or suicide, the depth of negative emotion warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 21:14:05"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight downtown. Shook me up. Reminded me of stuff at home growing up. Anyone else get triggered by stuff like that? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses being shaken up and triggered, suggesting emotional distress, but doesn't indicate immediate danger to self or others. It's a request for coping mechanisms, not a plan or explicit ideation.",
    "detected_category": "other",
    "timestamp": "2026-01-13 21:13:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things aren't good at home. Constant put-downs, controlling behavior... I feel trapped. Anyone else been through this? How did you find the strength to leave?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and controlling behavior, which can escalate to physical violence. The feeling of being 'trapped' suggests significant distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 21:12:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "I'm having a really tough time lately. Feeling so lost and overwhelmed. Reaching out because I don't know what else to do. Any advice or support would be appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but there is no direct mention or implication of self-harm, suicide, violence, abuse, or overdose. It indicates a desire for support and advice, suggesting a willingness to seek help rather than act on harmful thoughts.",
    "detected_category": "other",
    "timestamp": "2026-01-13 21:11:01"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Shook me up bad. Is there anywhere safe to walk at night anymore? Feeling really vulnerable.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses fear and vulnerability after witnessing a fight, but doesn't indicate imminent danger to the individual or others, or intent to harm self or others. It is a concern about general safety rather than a specific threat.",
    "detected_category": "other",
    "timestamp": "2026-01-13 21:09:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed ('heavy'), and a lack of coping mechanisms ('don't know what else to do'). While not explicitly mentioning harm, the distress and hopelessness warrant concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 21:08:58"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The constant put-downs are chipping away at me. Anyone else feel like they're walking on eggshells all the time? I need to find a way out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being worn down and a desire to escape an unspecified negative situation. While there's no explicit mention of self-harm or suicide, the underlying distress and sense of being trapped raise concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 20:19:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Scariest thing ever. Narcan worked, thank god. Seriously, carry it. You never know when you'll need it. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the overdose was averted, the event indicates a risk of future overdoses in the area and the potential for encountering someone in a life-threatening situation. The writer stresses the importance of carrying Narcan, implying a recognized level of risk. While the individual survived, overdose situations are inherently dangerous and often result in fatality.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 20:18:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt the urge again tonight. Just trying to breathe through it. Anyone else get that tight chest feeling beforehand? Makes it so hard to think straight.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses an urge and physical symptoms (tight chest) which could indicate a buildup to a harmful action. While the specific nature of the urge is unclear, the mention of difficulty thinking straight and seeking connection suggests potential escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 20:17:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things aren't good at home. Constant put-downs and walking on eggshells. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home situation with constant put-downs, suggesting emotional abuse and a feeling of isolation. While it doesn't explicitly mention harm, the ongoing nature of the situation and the feeling of being alone raise concerns for potential mental health decline.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 20:16:25"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them. Please, learn how to use it. It could save a life, maybe even someone you know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event and suggests the presence of opioid use, indicating a potential risk of future overdoses in the community or social circle.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 20:15:24"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good lately. Walking on eggshells all the time. Feeling so isolated. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling isolated and walking on eggshells, which suggests a potentially unstable or tense home environment. While it doesn't explicitly mention harm, the underlying stress and isolation could escalate. The feeling of needing to know they are not alone indicates a need for support.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 20:14:22"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So messed up. Makes you wonder what's going on in people's lives to get to that point. Feeling shaken. Anyone else witness it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling, but the text doesn't indicate direct involvement or immediate danger to the author or others. The author expresses feeling shaken but doesn't suggest harm or intent to harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 20:13:20"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shaken up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing the author to feel shaken and on edge. While unsettling, it doesn't indicate imminent harm or a direct threat involving the author or others.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 20:12:19"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get too much. Old coping mechanisms resurface, even when you think you're doing better. Reached out to my therapist, feeling shaky but glad I did. It's okay to not be okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual reached out for help and acknowledges their feelings, the mention of 'old coping mechanisms' resurfacing suggests a potential for negative actions, though not explicitly stated. The 'shaky' feeling also indicates distress.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 20:11:17"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I feel so lost. Things at home have been getting worse lately, yelling turned into something else. Not sure where to turn or who to talk to. Feeling trapped. Is there anyone who understands?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a deteriorating home environment, potential abuse (yelling turned into something else), feelings of being trapped, and a lack of support. This combination suggests emotional distress and a possible safety risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 20:10:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, potentially indicating a mental health crisis. While there is no explicit mention of self-harm or suicide, the metaphor of being 'underwater' and reaching out suggests significant distress and a need for support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 19:18:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... feels like I'm walking on eggshells. Anyone else been through this? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of ongoing emotional abuse and control, which can escalate to physical violence or lead to mental health issues. The feeling of being 'lost' suggests potential for further deterioration of mental state.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 19:17:49"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Scared the hell out of me. Makes you realize how quickly things can escalate. Anyone else feel like anger is just simmering everywhere lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is a concerning event but doesn't indicate immediate or direct threat to the individual or others. While it expresses fear and observes potential for escalation, it lacks specific details suggesting imminent danger or targeting.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 19:16:48"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown yesterday. Just kids, but so brutal. Makes you wonder what's going on at home. Anyone else feeling like things are getting more volatile lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight, while concerning, doesn't indicate immediate or significant danger to the author or others. It suggests a perceived increase in general volatility rather than a specific, high-risk threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 19:15:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scariest thing ever. They're okay now, thankfully. But if you're struggling, please reach out. There are people who care. ❤️ Don't let it get to that point.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a recent overdose event. While the person survived, the event highlights a significant risk of harm. The message also includes a general call for help, indicating ongoing struggles within the person's social circle or the author's awareness of such struggles.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 19:14:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming I just want to feel *something* else. Scared I'll go too far one day. Anyone else relate? Talking helps, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses a desire to feel something else when overwhelmed and fear of going \"too far.\" Indicates potential self-harm or suicidal ideation, although vague. Seeking help through talking is a positive sign.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 19:13:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. urges are strong. Trying to distract myself but it's so hard. Anyone else get this way? What helps? #selfharmrecovery #mentalhealth",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text explicitly mentions strong urges related to self-harm, indicating a potential risk. While the person is attempting to distract themselves and seeking help, the intensity of the urges elevates the risk level.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 19:12:41"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up bad. Seeing that kind of anger... I keep replaying it in my head. Anyone else ever feel like that after witnessing violence? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence and experiencing emotional distress, but doesn't indicate immediate danger to self or others. The person is seeking coping mechanisms, suggesting an attempt to process the event healthily.",
    "detected_category": "other",
    "timestamp": "2026-01-13 19:11:39"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing in the street, things got heated fast. It's scary how quickly words turn to fists. Anyone know resources for de-escalation techniques? Feeling shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a verbal argument escalating to potential physical violence is concerning, but the text reports no direct harm to the author or others, and the author is seeking de-escalation resources, indicating a desire to prevent further escalation.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 19:10:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scared. Found my brother unresponsive yesterday. Narcan saved him, but it was too close. Learn the signs, carry naloxone. Please. It's not worth losing someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose, indicating a significant risk of future overdose events and potential fatality.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 19:09:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling, but doesn't indicate direct involvement, immediate danger, or intent to harm self or others. It primarily expresses anxiety and awareness of potential for escalation.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 18:23:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been really bad lately. Constant yelling, and now...other stuff. I feel so trapped. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Mentions of \"other stuff\" after \"constant yelling\" suggests potential escalation of conflict or abuse, and the feeling of being \"trapped\" indicates a lack of safety and potential for harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 18:22:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scariest thing ever. They're okay now, thank god. Makes you realize how fragile life is. Please, be careful out there. Know your limits and look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the person survived, the text describes an overdose event which carries inherent risk of death or serious harm. The text also implicitly encourages harm reduction which suggests there is a significant risk of future similar events.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 18:21:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been getting worse. I feel so isolated. Anyone else been through this? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of isolation and admits to worsening circumstances at home, indicating potential emotional distress and a need for support. While not explicitly stating suicidal ideation or self-harm, the deteriorating home situation and isolation raise concern.",
    "detected_category": "other",
    "timestamp": "2026-01-13 18:20:09"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. So scary. My hands are still shaking. Is there anywhere safe to walk around here anymore? Feeling really uneasy.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing emotional distress (shaking hands, feeling uneasy). There is no direct threat to the individual or others, but it indicates a feeling of unsafety.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 18:19:07"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Reached out to a friend, which helped a bit. Taking it one hour at a time. It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a strong urge to self-harm (cutting), indicating active ideation, but also mentions reaching out for help, which is a protective factor. The user is struggling but actively coping.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 18:18:05"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw two guys fighting outside the bar last night. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge after witnessing something like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but does not indicate imminent danger to the person reporting. The text describes feeling shaken and on edge, suggesting psychological distress but not a direct threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 18:17:03"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to hide the bruises. Said I was clumsy again. Anyone else feel like they're walking on eggshells constantly? I need to talk to someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates potential physical abuse (bruises, explanation of clumsiness) and emotional distress (walking on eggshells, need to talk). These are significant indicators of immediate danger.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 18:16:02"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Didn't know what to do. Called non-emergency, they're sending someone. Hope she's okay. Makes you realize how common this is.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an act of violence (shoving) indicates a potential for physical harm, though the extent of injury is unknown. The involvement of law enforcement suggests the situation is being taken seriously.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 18:15:00"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy shove his girlfriend on the street. Froze. Wish I'd said something. Feeling sick about it. Anyone else ever witness something like that? What did you do?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can cause distress and potential for future inaction. The incident itself is a violent act.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 18:13:58"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just reaching out to say it's hard, and if you're struggling too, you're not alone. Thinking of calling the hotline. 988 is the number, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being 'low' and acknowledges struggling. They are considering calling a suicide hotline, which indicates suicidal ideation. While not explicitly stating suicidal intent, the consideration of a hotline suggests a level of risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 17:21:29"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic post focusing on seeking help and sounding authentic, while staying within the constraints and avoiding triggering content:\n\n\"Things have been really dark lately. Feeling so lost and overwhelmed. Reached out to a helpline today. It was hard, but it helped a little. Taking it one day at a time.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses negative feelings like being lost and overwhelmed, and acknowledges a difficult time. However, it also indicates help-seeking behavior (reaching out to a helpline) and a coping strategy (taking it one day at a time). While concerning, the language lacks immediacy or specific plans for self-harm, suicide or violence.",
    "detected_category": "other",
    "timestamp": "2026-01-13 17:20:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm drowning. Reaching out because I don't know what else to do. If you've been there, how did you find your way back?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 74 (char 99)",
    "detected_category": "unknown",
    "timestamp": "2026-01-13 17:19:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Feeling so overwhelmed lately. Things got dark again last night. Reached out to the crisis line. Talking helped a little. Just trying to get through today.\n\n**Option 2 (Sharing Experience):**\n\n> Been clean for 6 months. It's a daily struggle, but seeing the scars fade reminds me how far I've come. You're stronger than you think.\n\n**Option 3 (Raising Awareness):**\n\n> It's not attention-seeking. It's a sign of deep pain. Please be kind to those struggling. You never know what someone's going through.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates recent suicidal ideation ('Things got dark again last night') and seeking help via a crisis line, suggesting current distress. While help was sought, the continued struggle ('Just trying to get through today') warrants a medium severity rating. Other options are positive and do not indicate imminent risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 17:18:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and overwhelmed ('like I'm underwater'), indicating a potential mental health crisis. The statement 'I don't know what else to do' suggests a lack of coping mechanisms and a need for immediate support.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 17:17:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly lost lately. Like I'm drowning and no one can see me. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, using the metaphor of drowning. While it doesn't explicitly mention self-harm or suicide, the intensity of the distress and the plea for help suggest a potential risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 17:16:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so overwhelmed lately. Like I'm drowning and can't see a way out. Talking to someone feels impossible, but I know I need to. Any advice on finding help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and hopeless, and mentions a need to seek help. While not explicitly suicidal, the feeling of being unable to see a way out indicates significant distress and a potential risk for escalation. The individual recognizes the need for help, which suggests some level of self-awareness and a desire to improve their situation, but the difficulty in reaching out raises concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 17:15:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Scary. Narcan saved them. Please, if you're using, carry it. And tell someone. It could be you next time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Reports a friend overdosing and needing Narcan, indicating a high risk of overdose and potential death. The message also emphasizes the potential for recurrence, implying an ongoing risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 17:14:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get too much. Scratched again last night. Feeling ashamed but also...relieved? Need to find healthier ways to cope. Anyone else relate? How do you deal?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates self-harm (scratching), which suggests a risk of escalation and potential for more serious injury. The user acknowledges the need for healthier coping mechanisms, implying awareness of the problem, but the act itself places it in the medium severity range.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 17:13:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? How did you find the strength to leave? I need help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and isolation, suggesting potential emotional and/or psychological abuse. The user is seeking help, indicating a need for intervention. The possibility of escalation to physical violence cannot be ruled out.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 17:12:11"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm drowning. Reaching out because I don't know what else to do. Anyone else feel this way? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed ('drowning'), indicating distress and a lack of coping mechanisms. The individual is actively seeking help, suggesting a potential risk of escalation if support is not received. While there is no explicit mention of suicide or self-harm, the depth of despair warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 16:22:28"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy and pointless. Talking to a friend helped a little, but the darkness keeps creeping back. Reaching out for more support. Hope things get brighter.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and darkness, suggesting potential for self-harm thoughts or actions. Seeking support is a positive sign, but the persistence of negative feelings warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 16:21:26"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I froze. Wish I'd said something, done something. Feeling sick about it. Anyone else ever feel this helpless?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault suggests potential for escalating violence and harm to the victim. While the reporter wasn't directly harmed, the event indicates an unsafe environment.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 16:20:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Cutting again after 6 months clean. I hate this. Anyone know any good coping strategies that actually work? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Relapse into self-harm after a period of abstinence significantly increases the risk of severe injury or suicide attempt. The individual also expresses feelings of being overwhelmed, hating their situation, and feeling lost, indicating a high level of distress and vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 16:19:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "My cousin OD'd last night. Narcan saved him, thank God. It was terrifying. Please, if you're using, even occasionally, carry Narcan. It could save a life. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event, indicating a high risk of further overdose incidents for the individual involved and potentially for others in their social circle. Narcan was required to reverse the overdose, highlighting the severity of the situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 16:18:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs and control. Feeling trapped. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates ongoing emotional abuse and feelings of being trapped, which can escalate to more serious safety concerns. While not explicitly stating suicidal ideation or intent to harm, the distress level warrants a 'medium' severity.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 16:17:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly low lately. Just reaching out because I don't know what else to do. Is anyone else struggling? Any advice would be appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of low mood and helplessness, suggesting potential for self-harm, though no explicit intent is stated.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 16:16:16"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Feeling trapped and scared. Anyone else been through this? How did you find help? Need to figure out my next step.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being trapped and scared, suggesting a potential crisis. While not explicitly mentioning harm, the underlying distress warrants concern and further investigation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 16:15:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good lately. Constant put-downs, isolating me from friends... feels like I'm walking on eggshells. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and social isolation, which can escalate to more severe mental health issues. While not explicitly stating suicidal ideation or intent to harm others, the feeling of being alone and walking on eggshells suggests a potential risk.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 16:14:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...rough. Constant yelling, walking on eggshells. I feel so small. Anyone else been through this? How did you cope? I need some advice.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with constant yelling and feeling small, suggesting emotional abuse and distress. While it doesn't explicitly mention physical harm, the feeling of walking on eggshells and emotional distress indicates a need for intervention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 16:13:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things aren't good at home. Always walking on eggshells. Anyone else ever feel like they're losing themselves trying to keep the peace?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a stressful and potentially unhealthy home environment. While it doesn't explicitly mention harm, the feeling of 'walking on eggshells' and 'losing themselves' suggests emotional distress and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 15:21:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Punches thrown, yelling... I froze. Reminded me too much of my childhood home. Anyone else get triggered by public violence? How do you cope? Feeling shaky.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and experiencing a personal emotional reaction (triggering) but does not indicate imminent danger or intent to harm self or others. The individual expresses a desire to cope with the emotional distress.",
    "detected_category": "other",
    "timestamp": "2026-01-13 15:20:33"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Just need a friendly ear. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit suicidal or self-harm ideation. It seeks connection and shared experience.",
    "detected_category": "other",
    "timestamp": "2026-01-13 15:19:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Walking on eggshells constantly. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a stressful and potentially abusive home environment ('walking on eggshells'). While not explicitly stating violence or harm, the feeling of constant tension and isolation raises concern for potential escalation and psychological distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 15:18:29"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... Feeling trapped. Anyone else been through this? Where do I even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and a feeling of being trapped, indicating a potentially escalating situation with mental health consequences. While not explicitly suicidal or violent, the feeling of entrapment and seeking help suggests distress requiring intervention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 15:17:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are back and stronger than ever. Trying to stay strong, but it's exhausting. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions strong urges, suggesting a potential risk of acting on them, even though the individual is trying to resist. The specific nature of the urges is not defined, but the intensity expressed warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 15:16:26"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel anxious after witnessing something like that? Need to process...",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses anxiety and the need to process a witnessed fight, but there's no indication of direct threat to the individual or others, or intent to harm.",
    "detected_category": "other",
    "timestamp": "2026-01-13 15:15:24"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, with a direct plea for help, suggesting potential emotional distress and a need for support. The metaphor of being 'underwater' can indicate feeling suffocated or trapped.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 15:14:22"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Feeling isolated and scared. Anyone else been through this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of isolation, fear, and hardship at home, potentially indicating a crisis or harmful situation. The desire to know if others have experienced similar situations suggests a need for support and could indicate a risk of escalation if unmet.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 15:13:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a crisis line, it helped a bit. Just taking it one hour at a time. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm and feeling overwhelmed, indicating a significant risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 15:12:18"
  }
]