[
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Narcan saved them, but it really shook me up. Please, if you or someone you know is struggling, get help. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the individual survived, indicates a significant substance use issue and potential for future, possibly fatal, events. The observer also expresses distress.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 13:30:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank God. Please, learn how to use it. It can save a life. I'm still shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was successful, a person overdosing indicates a significant health risk and potential for future, possibly fatal, overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 13:29:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't contain explicit mentions of self-harm, suicide, violence, abuse, or overdose. It appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2026-01-13 13:28:39"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are back and stronger. Reached out to a friend, but still feeling so alone. Any advice on coping skills that actually work? Feeling desperate.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of strong urges and feelings of desperation and loneliness, suggesting an increased risk of acting on those urges. Reaching out to a friend is a positive sign, but the continued feelings of isolation and the plea for coping skills indicate the individual is struggling significantly and requires support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 13:27:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home have been rough lately. Constant yelling, put-downs... Feels like I'm walking on eggshells. Anyone else been through this? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile home environment with verbal abuse and a feeling of constant stress, suggesting emotional distress. While there's no explicit mention of physical harm or intent to harm, the situation warrants attention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 13:26:35"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Scariest thing ever. They're okay now, thankfully. Please, if you're struggling, reach out. There are people who care. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potential for future overdoses within the individual's environment or the individual themselves. While the person is currently okay, the situation highlights a significant risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 13:25:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been feeling trapped lately. Small things keep escalating. Walking on eggshells constantly. Anyone else experience this? Starting to think it's not normal.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being trapped and walking on eggshells, suggesting a potentially unhealthy or abusive environment. The escalation of small things and questioning the normalcy of the situation indicate growing distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 13:24:32"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got decked, out cold. Shook me up. Anyone else ever witness something like that? Feeling kinda sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the original poster (OP) was not directly harmed, they witnessed a violent assault resulting in unconsciousness. This could indicate a serious threat of violence in the area and the OP is demonstrably affected by what they saw.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 13:23:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Just talking feels impossible. Reaching out for resources feels like the only thing I can manage right now. Hope things get lighter.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of heaviness and difficulty communicating, but also a desire for things to improve and an ability to seek resources. This indicates distress and potential for escalation, but also a willingness to help themselves.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 13:22:28"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Constant put-downs, walking on eggshells... I feel so small. Anyone else been through this? How did you cope? I'm starting to feel lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and feelings of helplessness. While there's no explicit mention of self-harm or suicidal ideation, the feeling of being 'lost' and the description of a toxic home environment indicates potential for escalation if the situation continues.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 13:21:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to quiet things down, y'know? Not proud of it. Reaching out for help feels huge, but I know I need to. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a desire to \"quiet things down\" which, while vague, suggests potential self-harm. The individual acknowledges needing help and expresses difficulty reaching out, implying the issue is significant.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 12:25:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so small. Anyone else been through this? Where do I even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and feelings of being controlled, indicating a potentially unsafe home environment and diminished self-worth. While not explicitly stating intent to harm self or others, the individual is seeking help, suggesting a recognition of the problem and a desire for change which is a positive sign but abuse can escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 12:24:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Trying to resist, but it's exhausting. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating a significant risk of self-inflicted injury. While the individual is trying to resist, the intensity of the urge and the feeling of exhaustion suggest a high level of distress and a potential for imminent harm.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 12:23:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately, like I'm underwater. Just reaching out. Has anyone else felt this way? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and isolated, but doesn't contain specific ideation or plans for self-harm or suicide. It's primarily a cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2026-01-13 12:22:37"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a screen. Reaching out because I don't know what else to do. Is anyone else feeling this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of numbness, detachment, and a sense of helplessness, indicating a potential mental health crisis. The user is reaching out for help which suggests they are aware of the problem and seeking support, but the underlying issue could escalate without intervention.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 12:21:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Been walking on eggshells lately. Partner's temper is getting scary. Anyone else deal with this? Feeling so alone and unsure what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a partner's escalating temper, which could indicate a potential for abuse or violence. The mention of \"walking on eggshells\" and feeling \"scary\" suggests a threatening environment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 12:20:34"
  },
  {
    "title": "User Story: Violence",
    "content": "My neighbor's been screaming at his wife for hours. I can hear it through the walls. Called the cops anonymously. Hope they actually do something this time. Feeling sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Domestic disturbance with potential for escalation and potential harm to the wife. While the reporter called the police, the situation is ongoing and there is concern for the victim's immediate safety.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 12:19:32"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy, and I'm not sure how much longer I can keep carrying it. Reaching out because I don't know what else to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and being overwhelmed, suggesting a potential risk for self-harm or suicidal ideation. The individual is explicitly reaching out for help, indicating some awareness and a desire to find a solution, but the statement 'not sure how much longer I can keep carrying it' raises concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 12:18:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a news story about another OD in our town. Scared, remembering when my brother almost didn't make it. Naloxone saves lives. Learn how to use it. Please. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions an overdose death and a near-fatal overdose of the author's brother, suggesting a real and present danger related to overdose. While the message promotes awareness and prevention, the underlying issue represents a significant health risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 12:17:28"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so incredibly lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of loneliness and being lost, but lacks explicit suicidal ideation, self-harm plans, or other imminent danger indicators.",
    "detected_category": "other",
    "timestamp": "2026-01-13 12:16:26"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, walking on eggshells... I feel so small. Anyone else been through this? How do you even start to get out?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation of emotional abuse (\"constant put-downs, walking on eggshells\") which can significantly impact mental health. The phrase \"I feel so small\" indicates a potential for low self-esteem and vulnerability. While not explicitly mentioning self-harm or suicide, the context suggests a need for support and intervention before the situation escalates.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 11:18:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the party last night. Scariest thing ever. Narcan saved their life. Please, everyone, learn how to use it. You could save someone you know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a life-threatening overdose event requiring Narcan intervention, indicating a high risk of morbidity or mortality.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 11:17:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm just going through the motions. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and going through the motions, but lacks explicit mentions of self-harm, suicide, violence, abuse, or overdose. While concerning, the risk severity is low as it's a general expression of distress.",
    "detected_category": "other",
    "timestamp": "2026-01-13 11:16:34"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Reached out to a friend, just need someone to listen. It's so exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges and feelings of being overwhelmed, suggesting a potential risk of self-harm or relapse. Reaching out to a friend is a positive coping mechanism, but the intensity of the urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 11:15:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, having a really rough night. The urge to cut is so strong. Trying to stay strong and remember why I stopped. Anyone else relate? Just need to know I'm not alone rn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting). While the person is trying to resist and seeking support, the intensity of the urge elevates the risk to medium. They have a history of self-harm and are currently struggling.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 11:14:31"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The constant put-downs are chipping away at me. Anyone else experience this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being worn down by consistent negativity and isolation, which could escalate to more serious mental health concerns.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 11:13:29"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Rough night. Urges were strong, but I distracted myself with a movie. Small victory, I guess. Trying to take it one day at a time. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text mentions strong urges and a struggle, but also indicates successful coping mechanisms (distraction with a movie) and a focus on taking things one day at a time. This suggests a current struggle, but not an immediate crisis.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 11:12:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\n\"Lost a friend last week. OD. Hurts so bad. Please, if you're struggling, reach out. Don't let it be too late. There's help.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes the recent death of a friend due to overdose, indicating potential distress and vulnerability in the author and potentially others reading the message. While not explicitly suicidal or self-harming, the close proximity to a fatal overdose significantly elevates the risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 11:11:25"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Reached out to a friend, feels a little better. Just putting it out there. It's okay to not be okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges (potentially related to self-harm, substance use, or other risky behaviors) and feelings of struggle. While the person reached out to a friend, indicating some coping mechanism, the presence of urges elevates the risk beyond 'low'. It does not reach 'high' as there is no explicit plan or immediate intent mentioned.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 11:10:23"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately, like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not explicitly mention suicidal thoughts, self-harm, or harm to others. It's a general cry for help.",
    "detected_category": "other",
    "timestamp": "2026-01-13 11:09:21"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Narcan saved them. Carry it, learn how to use it. You never know. It could save a life. Seriously shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, indicating a potential for serious harm or death, even though intervention was successful. The text suggests a risk for the individual who overdosed and highlights the broader risk of overdose in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 10:19:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed but lacks explicit statements of self-harm or suicidal intent. It is a general expression of distress and a request for connection.",
    "detected_category": "other",
    "timestamp": "2026-01-13 10:18:25"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight break out on my street last night. Shaken up. Never seen anything like it. Anyone else feel like things are getting more volatile lately? Makes me scared to walk alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses fear and unease due to witnessing a fight. While concerning, it doesn't indicate immediate danger to the individual or others, nor does it suggest planning or intent for harm.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 10:17:24"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so incredibly low lately. Like a heavy fog I can't shake. Reaching out because I know I need to. Any advice on finding a good therapist?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of low mood and a desire to seek professional help, indicating the individual is aware of their distress and attempting to address it. The phrasing 'heavy fog I can't shake' suggests a persistent and significant level of distress. While not explicitly mentioning self-harm or suicidal ideation, the level of distress warrants a 'medium' severity rating as it indicates a potential for escalation if unaddressed.",
    "detected_category": "other",
    "timestamp": "2026-01-13 10:16:22"
  },
  {
    "title": "User Story: Abuse",
    "content": "I keep making excuses for him, but the yelling is escalating. Last night he broke a plate. I'm scared this is more than just stress. Anyone been through something similar? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The escalation of yelling and the act of breaking a plate indicates a potential for violence. The user expresses fear, suggesting they perceive a real threat to their safety. While not explicitly violent towards the user yet, the potential for escalation is concerning.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 10:15:20"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a heavy fog I can't shake. Reaching out because I know I need to. Any advice on finding a therapist?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of low mood and difficulty coping ('heavy fog I can't shake'). They acknowledge needing help and are seeking a therapist, indicating awareness and a desire for support. While there's no explicit mention of self-harm or suicidal ideation, the depressed mood and plea for help suggest a need for intervention to prevent escalation.",
    "detected_category": "other",
    "timestamp": "2026-01-13 10:14:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post focusing on seeking help:\n\n\"Things have been really dark lately. Feeling so overwhelmed. Reached out to the crisis line, and just talking helped a little. Gonna take it one day at a time. 988 is there if you need it too.\"\n\nI have intentionally focused on seeking help and offering a resource.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of overwhelm and darkness, suggesting potential mental health struggles. The user has reached out to a crisis line, which indicates active help-seeking behavior. However, the mention of \"things have been really dark lately\" is a cause for concern and warrants a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 10:13:16"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw two guys fighting outside the bar. One was really hurt. Shook me up. Is there anywhere to report something like that anonymously? Feeling sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence has occurred, resulting in injury to at least one individual. While the reporting person is not directly involved or threatened, the incident is severe enough to cause significant distress and a desire to report it, indicating a potential ongoing risk to public safety.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 10:12:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Shook me up bad. Narcan worked, thank god. Learn the signs, folks. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and indicates potential risk of future overdoses in the area. While Narcan was effective, it highlights the presence of a serious health risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 10:11:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt that familiar urge again last night. So tired of this cycle. Reached out to a friend instead, which helped a bit. Still feeling raw. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a recurring urge, likely negative, and feelings of being raw, suggesting potential self-harm or suicidal ideation. Reaching out to a friend is a positive coping mechanism, but the presence of the urge and negative feelings elevate the risk beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 10:10:09"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside the bakery. Froze. Didn't know what to do. Feeling sick about it now. Anyone else ever witness something like that? What did you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can be psychologically distressing and may indicate a risk of escalation or further harm to the victim.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 09:22:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is back. Trying to resist, but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a resurgence of self-harm urges, indicating a potential risk of self-inflicted injury. While the individual is trying to resist, the statement 'it's hard' suggests the struggle is significant and the risk is not negligible.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 09:21:08"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Things are rough at home lately. Feels like I'm walking on eggshells. Anyone know resources for emotional abuse?\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Just realizing some things from my past weren't normal. Gaslighting is real, and it messes you up.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Silence helps abusers. Speak up, even if it's just to one person. You're not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses emotional abuse and its effects, indicating potential harm and the need for resources. While not explicitly mentioning immediate danger, the reference to walking on eggshells and gaslighting suggests an ongoing problematic situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 09:20:06"
  },
  {
    "title": "User Story: Violence",
    "content": "Heard yelling next door again last night. Sounded like things were thrown. Makes my stomach churn. Wish I knew what to do. Scared for them.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes sounds of yelling and objects being thrown next door, implying a potential risk of violence or abuse. While the observer is scared and doesn't know what to do, the situation suggests a need for concern and possible intervention.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 09:19:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> \"Feeling so lost lately. Everything feels heavy. Reaching out because I don't know where else to turn. Any advice?\"\n\n**Option 2 (Sharing Experience):**\n\n> \"Been there. The darkness can lift. Talking helps. If you're struggling, please reach out to someone. You're not alone.\"\n\n**Option 3 (Raising Awareness):**\n\n> \"Lost a friend this week. Please check in on the people you love. You never know what someone's going through. Be kind.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses feelings of being lost and overwhelmed, suggesting emotional distress. Option 3 mentions the loss of a friend, which could be due to suicide, increasing the concern. While not explicitly stating suicidal intent, the overall tone and themes warrant a medium severity level.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 09:18:01"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scared me senseless. Narcan worked, thank god. Makes you realize how fragile life is, and how easily things can change. Anyone know where I can get some training on using Narcan, just in case?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a stressful event with potential psychological impact. The text indicates concern and a desire to be prepared for future incidents. While the immediate crisis was averted, the experience highlights the risk of future overdoses in the area and the potential need for intervention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 09:16:59"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home haven't been good lately. Constant put-downs, controlling behavior... I feel so lost and alone. Anyone else been through this? I need to figure out my next steps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, which suggests emotional abuse. The individual expresses feeling lost and alone, indicating potential for escalation of emotional distress.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 09:15:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Heard shouting next door again last night. Sounded like things were getting thrown. I'm worried, but I don't know what to do. Anyone else been through this? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Potential for violence next door, which could escalate and impact the individual. While not directly threatened, the sounds of throwing objects and shouting suggest a volatile situation.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 09:14:54"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly low lately. Like a heavy cloud I can't shake. Reaching out to a friend, hoping it helps. Talking feels impossible, but maybe it's a start.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of low mood and difficulty communicating, suggesting potential depression. The mention of reaching out is a positive sign, but the inability to shake the 'heavy cloud' indicates some risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 09:13:53"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Like there's no air left. Reaching out because I don't know what else to do. Is anyone else struggling?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and being overwhelmed ('no air left'). Reaching out for help indicates some awareness and desire for connection, but the intensity of the feeling warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 09:12:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"It's so hard to admit, but things at home haven't been good lately. Constant yelling, put-downs... I feel trapped. Anyone else been through this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a negative home environment with yelling and put-downs, indicating emotional distress and potential for escalating conflict. The feeling of being 'trapped' suggests a lack of control and potential for negative coping mechanisms.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 08:22:19"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Called 911, they're okay now. Please, if you're struggling, reach out. There's help available. Don't be afraid.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event, indicating immediate danger to the individual involved, and the potential for similar events in the future.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 08:21:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just... heavy. Reaching out because I don't know what else to do. Is anyone else feeling this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and loss, but lacks specific details about suicidal ideation, self-harm plans, or intent. It appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2026-01-13 08:20:16"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Things have been really dark lately. Feeling so lost and empty. Reaching out to a friend, hoping it helps. Just need a little light right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of darkness, being lost and empty, which could indicate depression or suicidal ideation. Reaching out to a friend is a positive step, but the depth of the negative feelings warrants a medium severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 08:19:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? Feeling lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional and psychological abuse (put-downs, controlling behavior, isolation) which can escalate and lead to significant mental health issues. The feeling of being \"lost\" indicates distress and a need for support.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 08:18:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Thankfully, they're okay now. Reminded me how easily things can go wrong. If you're struggling, please reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event and highlights the risk of serious harm or death, even if the individual recovered. The text also includes a general expression of vulnerability and encourages seeking help.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 08:17:11"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just need to vent. Things got physical again last night. I feel so lost and alone. Anyone else been through this? How did you find the strength to leave?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly states 'Things got physical again last night,' suggesting ongoing abuse. The user expresses feeling 'lost and alone' and seeks advice on leaving, indicating a potential for escalation and immediate danger.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 08:16:09"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Narcan saved him. Please, if you're using, carry it. It's free & could save a life. Reach out if you need help finding it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose averted by Narcan, indicating a significant and immediate risk to life.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 08:15:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get too much. Just want to feel *something* different, y'know? Reached out to a friend, gonna try to get through this. It's not a solution, I know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feeling overwhelmed and a desire for a different emotional state, indicating distress. Acknowledges reaching out, which is positive, but also states that it's 'not a solution,' suggesting a lack of hope for long-term relief. While there isn't explicit mention of self-harm or suicide, the level of distress and lack of perceived solutions warrant a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 08:14:06"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home aren't good. Always walking on eggshells. Is this normal? Feeling so alone. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially unsafe home environment and feelings of isolation. Walking on eggshells suggests fear and possible abuse. While not explicitly stated, the situation warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 08:13:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\n\"Felt so overwhelmed last night. The urge to self-harm was really strong. Managed to distract myself, but it's scary how easily I slip back. Anyone else relate? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a strong urge to self-harm, indicating a potential risk. While the person managed to distract themselves, the ease with which they slip back suggests ongoing vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 07:21:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, and a lack of coping mechanisms, indicating potential for escalation. The metaphor of being underwater and unable to find the surface suggests a sense of desperation and hopelessness.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 07:20:45"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out downtown. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate direct harm to the poster or a specific, imminent threat. The poster expresses feeling shaken and on edge, suggesting distress, but not necessarily a high level of risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 07:19:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Not sure what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and lost, with a vague request for help. While not explicitly suicidal, the language suggests distress and potential for escalation.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 07:18:42"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on the way home. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel anxious after witnessing something like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which caused anxiety. While disturbing, it doesn't indicate immediate danger to the author or others, nor does it involve direct participation in violence or indications of self-harm, suicide, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2026-01-13 07:17:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. It's hard to talk about, but I'm reaching out. Anyone else feel this way? Any tips for coping?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of low mood and lack of motivation, but does not contain specific threats or plans. The individual is reaching out for support, indicating a willingness to seek help.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 07:16:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a heavy cloud is just stuck over me. Reaching out because I know I need to talk to someone. Any advice on finding a good therapist?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates low mood and a desire to seek help, suggesting potential depression. While not explicitly suicidal, the low mood and reaching out for help warrant a 'medium' severity as a preventative measure. Seeking therapy is a positive step, but the underlying issue needs assessment.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 07:15:37"
  },
  {
    "title": "User Story: Abuse",
    "content": "I keep making excuses for him, but the yelling's getting worse. Last night he threw a glass. Is this still just a \"rough patch\"? I'm starting to feel scared. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes escalating verbal abuse and an incident of throwing an object, indicating potential for physical harm. The writer also expresses fear.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 07:14:35"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a guy get shoved on the train platform. Heart's still racing. So messed up how quickly things can escalate. Anyone else ever witness something like that? Feeling really shaken.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent act can cause significant emotional distress. While not directly experiencing harm, the poster's shaken state and mention of rapid escalation suggest potential for anxiety or fear, warranting concern and possible need for support.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 07:13:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Relapsed after 6 months. Feeling so ashamed and alone. Reached out to my therapist, waiting for a call back. Just need to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse and feelings of shame and isolation increase vulnerability. While the individual has reached out for help, the immediate risk remains elevated until support is received. The mention of 'getting through tonight' suggests immediate distress.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 07:12:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Narcan saved their life, but it shook me up. Knowing it's out there... makes you think. Be safe, y'all. Look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event, indicating the presence of a life-threatening situation and potential for emotional distress in the observer. While the individual survived due to Narcan, the event highlights the accessibility and potential severity of drug use in the community.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 06:23:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Terrifying. Narcan saved them, but it shook me up. Learn the signs, carry it if you can. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing a friend's overdose, while ultimately resulting in a rescue, indicates a life-threatening situation with significant emotional impact.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 06:22:15"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on the train. So shaken up. Is it normal to feel this anxious afterwards? Feels like my heart's still racing.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and experiencing anxiety. While distressing, it doesn't indicate imminent danger to the individual themselves, but rather an emotional reaction to a stressful event. There's no mention of physical injury or threat to their immediate safety.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 06:21:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing so many RIP posts lately. OD is scary real. Lost a friend last week. Please, if you're struggling, reach out. Don't let it be you.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions 'RIP posts lately,' 'OD is scary real,' and 'Lost a friend last week,' strongly suggesting a recent overdose-related death. The phrase 'Don't let it be you' indicates a high risk of suicide or self-harm among individuals struggling with similar issues.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 06:20:12"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. I yelled, he ran. Shaking. Is there anything else I should have done? Feel sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a physical assault suggests a potential for escalating violence. While the immediate threat is gone (the perpetrator fled), the victim remains potentially vulnerable to future harm. The reporter's distress also indicates the event was significant and potentially traumatic.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 06:19:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my friend OD last night. Scariest thing ever. Narcan saved him. Please, learn the signs and carry it if you can. It really does save lives. I'm still shaking.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event of a friend, indicating a high risk for the friend (potential for repeated overdose) and potentially the original poster due to the emotional distress and proximity to the event. The need for Narcan also signals high immediate danger.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 06:18:08"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Any advice or just someone to listen?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating potential emotional distress and a need for support. While not explicitly suicidal, the feeling of 'everything feels heavy' and not knowing what to do are concerning and warrant a moderate level of concern.",
    "detected_category": "other",
    "timestamp": "2026-01-13 06:17:07"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so incredibly lost lately. Like I'm underwater. Reaching out to a friend, but it's hard. Anyone else feel this way sometimes?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but doesn't explicitly mention self-harm, suicide, violence, abuse, or overdose. Reaching out to a friend is a positive sign.",
    "detected_category": "other",
    "timestamp": "2026-01-13 06:16:05"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just a heavy fog I can't shake. Reaching out because I know I need to. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and a heavy fog, coupled with a recognition of needing help. While not explicitly suicidal, the language suggests significant distress and a potential risk if left unaddressed.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 06:15:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been really bad lately. Walking on eggshells constantly. Feels like I can't do anything right. Anyone else been through this? Feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a stressful and potentially abusive home environment. While it doesn't explicitly mention violence or self-harm, the phrase \"walking on eggshells\" suggests a fear of triggering a negative reaction from someone else, implying potential emotional or psychological abuse. The feeling of loneliness and inability to do anything right further raises concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 06:14:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad brain day. Feeling the urge to relapse. Remembered I'm not alone and reaching out instead. Anyone else been there? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses a strong urge to relapse, indicating vulnerability and potential risk of harm to self. Reaching out is a protective factor, but the urge itself raises concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 05:22:22"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I hate it. Trying to stay strong and remember why I stopped. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses having urges, which suggests a potential for self-harm or relapse. While they are trying to stay strong, the presence of urges elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 05:21:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, I just need to feel *something* else. Trying to find healthier ways to cope. Anyone else relate? Any tips?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses a need to \"feel *something* else\" due to overwhelming thoughts and is explicitly trying to find healthier coping mechanisms. The phrase \"feel *something* else\" in conjunction with internal distress can sometimes be a precursor to self-harm, even if not explicitly stated or intended. The proactive attempt to find healthy alternatives mitigates immediate danger, but the underlying distress warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 05:20:19"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately, like I'm drowning. Reaching out because I don't know what else to do. Any advice or support is appreciated.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 74 (char 99)",
    "detected_category": "unknown",
    "timestamp": "2026-01-13 05:19:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing more ppl OD lately. Lost a friend last month. Please, if you're struggling, reach out. There are resources, you don't have to do this alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text directly mentions overdoses and the loss of a friend, indicating an immediate risk of overdose and potential suicidal ideation due to grief and shared struggle.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 05:18:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so incredibly lost lately. Like I'm drowning. Reaching out because I don't know what else to do. Anyone else ever feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed (drowning metaphor), and a sense of desperation. While it doesn't explicitly mention self-harm or suicidal ideation, the intensity of the negative emotions suggests a potential risk.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 05:17:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. Walking on eggshells constantly. Is this normal in a relationship? Feels like I can't do anything right. Anyone else experience this? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a potentially unhealthy relationship dynamic, suggesting a need for support. While not explicitly suicidal or self-harming, the feeling of walking on eggshells and being unable to do anything right can lead to increased vulnerability.",
    "detected_category": "abuse",
    "timestamp": "2026-01-13 05:16:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so heavy lately. Like there's no air left. Reaching out before things get worse. Anyone know resources that actually help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of heaviness and lack of air, suggesting distress and a desire for help before things escalate. The phrase 'reaching out before things get worse' indicates awareness of a potential negative trajectory.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 05:15:11"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD yesterday. Scary stuff. Narcan saved them. Carry it, learn how to use it. You could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose, which is a serious medical emergency with potential for death. While the person survived, the event highlights a significant risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 05:14:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so numb lately. Like I'm watching my life from behind a screen. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of numbness, detachment, and helplessness, and is actively seeking help. While there is no explicit mention of self-harm or suicidal ideation, the feelings described are indicative of a potential mental health crisis and warrant concern.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 05:13:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Taking it one hour at a time. Anyone else been there? How did you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating active risk. While the person has reached out for help, the urge is still present, requiring monitoring and support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 04:32:49"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Okay, here's a short, realistic post focusing on seeking help:\n\n\"Felt so overwhelmed today. Almost relapsed. Reached out to a friend instead. Still shaky, but glad I didn't go through with it. Talking helps. #recoveryispossible\"\n\nI have added the hashtag #recoveryispossible to show positivity and hope.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feeling overwhelmed and a near relapse, indicating a significant vulnerability. While the individual sought help and avoided relapse, the risk of future incidents remains.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 04:31:48"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD today. Scary stuff. Narcan saved him, but it shook me up. If you're using, please be careful. Reach out if you need help. It's out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event. While the individual survived due to Narcan, the event highlights the presence of a life-threatening situation and the risk of future overdoses. The advice to be careful and seek help indicates awareness of ongoing danger.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 04:30:46"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest moment of my life. Narcan saved him. Learn the signs of an overdose. It's real.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Friend experienced a near-fatal overdose requiring Narcan, indicating a significant risk of death.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 04:29:44"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Didn't know what to do. Wish I'd said something. Anyone else ever freeze like that? Feeling awful about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence (shoving) indicates a potential risk to the girlfriend. While the immediate danger might have passed, the risk of further abuse or escalation exists. The witness is also experiencing distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 04:28:43"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Relapsed after 6 months clean. Just trying to get through today. Anyone else know this feeling? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety coupled with feelings of overwhelm and loneliness suggests increased vulnerability and potential for harm. While not explicitly suicidal, the relapse indicates a breakdown in coping mechanisms and elevated risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-13 04:27:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. Urges are strong. Reached out to a crisis line, feels like a tiny step. Anyone else relate? Just feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses strong urges and feelings of isolation, indicating a potential risk for self-harm. Reaching out to a crisis line is a positive step, but the ongoing struggle suggests the individual requires further support and monitoring.",
    "detected_category": "suicide",
    "timestamp": "2026-01-13 04:26:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing loudly on the street. Escalated so fast. He shoved her, hard. I froze. Wish I'd done something. Feeling sick about it. What do you even do in that situation?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Physical violence (shoving) was observed, indicating a risk of serious harm to the victim.",
    "detected_category": "violence",
    "timestamp": "2026-01-13 04:25:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the ambulance lights last night scared me. Friend OD'd. They're okay now, thank God. This stuff is too real. Please, be careful out there and know your limits.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A friend overdosed, indicating potential for repeated or increased risk of overdose among the social circle.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 04:24:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD in front of the store yesterday. Scariest thing ever. They’re okay now thanks to Narcan, but it shook me up bad. Made me realize how close we all are to losing someone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual survived due to Narcan, witnessing an overdose indicates a risk of future overdoses in the area and potential psychological distress for the witness. The statement 'how close we all are to losing someone' suggests a heightened awareness of vulnerability and potential for future incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-13 04:23:35"
  }
]