[
  {
    "title": "User Story: Abuse",
    "content": "\"Woke up with that familiar knot in my stomach. Just remembering last night. Is it really abuse if he says he loves me after? Feeling so lost. Anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests potential emotional and/or physical abuse, with the individual questioning the nature of the relationship and expressing feelings of distress and being lost. The phrase \"familiar knot in my stomach\" hints at repeated instances and negative emotional impact.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 15:17:02"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm constantly underwater. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 75 (char 100)",
    "detected_category": "unknown",
    "timestamp": "2025-12-20 15:16:00"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit suicidal ideation, self-harm, or threats of violence. It's a general expression of distress and a call for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-20 15:14:58"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed, but lacks explicit suicidal ideation, self-harm plans, or threats. The user is reaching out for support.",
    "detected_category": "other",
    "timestamp": "2025-12-20 15:13:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm drowning and no one sees it. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and being overwhelmed, suggesting potential for self-harm or suicidal ideation. The phrase \"drowning and no one sees it\" indicates a level of distress requiring attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 15:12:56"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Feeling so incredibly lost lately. Just reaching out to see if anyone else has felt this way and found a path forward. It's hard to see any light right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of lostness and hopelessness, but does not contain explicit suicidal ideation, self-harm behaviors, or threats of violence. It primarily seeks connection and support.",
    "detected_category": "other",
    "timestamp": "2025-12-20 15:11:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary how quickly things escalated. Makes you think, you know? Anyone else feel like things are getting more tense lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text mentions a fight and expresses feelings of tension, but doesn't contain any specific threats or indications of imminent danger. It's more observational and expresses a general feeling of unease.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 15:10:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a post about overdose awareness. Scared me. Lost a friend last year. Narcan is so important, learn how to use it. You could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses overdose and mentions a personal loss due to overdose, which indicates a potential emotional impact and the presence of a significant health risk in the community.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 15:09:51"
  },
  {
    "title": "User Story: Suicide",
    "content": "**Option 1 (Seeking Help):**\n\n> Been feeling so low lately. Just existing is exhausting. Talking to someone feels impossible, but I know I need help. Where do I even start?\n\n**Option 2 (Sharing Experience):**\n\n> I remember that dark place. It DOES get better. Hold on. Reach out. You're not alone in this fight.\n\n**Option 3 (Raising Awareness):**\n\n> Check in on your friends, even the seemingly happy ones. You never know what someone's going through. A little kindness can go a long way.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 expresses feelings of exhaustion and acknowledges a need for help, suggesting potential for escalation if support isn't received. Options 2 and 3 are supportive and preventative, but the initial statement raises concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 15:08:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "Been feeling so isolated lately. Constant put-downs, controlling behavior... Is this normal in a relationship? Starting to think it's not. Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes feelings of isolation and experiences of put-downs and controlling behavior, suggesting potential emotional abuse. While it doesn't explicitly mention self-harm or suicidal ideation, the feeling of being 'lost' and questioning the normality of the relationship raises concerns.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 15:07:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the gas station. Narcan saved them, but it was scary. Makes you think... Know where to get it & how to use it. It could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose, a life-threatening event requiring immediate intervention. While Narcan was successful, the situation itself indicates a significant risk of harm.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 14:17:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so heavy. Relapsed after 6 months clean. Feeling ashamed, but reaching out. Anyone know good coping strategies that aren't just \"take a bath\"? Need real help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates a struggle with addiction, and feelings of shame can contribute to further risky behavior. The individual is reaching out for help, which is a positive sign, but the expressed need for \"real help\" suggests current coping mechanisms are insufficient.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 14:16:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things aren't good at home. Walking on eggshells all the time. Is this normal? I feel so lost and alone. Any advice?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a difficult and potentially harmful situation at home, including feeling lost and alone, and walking on eggshells which can indicate emotional distress and potentially abuse.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 14:14:58"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... It hits different when it's someone you know. Please, if you're struggling, reach out. There's help available, even if it doesn't feel like it. I'm here to listen too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references an overdose death of someone known to the author, suggesting potential grief and vulnerability, and implicitly acknowledges the possibility of others struggling with similar thoughts or actions. While the author offers support, the context indicates a heightened risk environment.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 14:13:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... it's terrifying. Lost a friend last year. If you're struggling, please reach out. There are people who care. Don't become another statistic. 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses concern about overdoses and mentions the loss of a friend, suggesting potential vulnerability in the audience and prompting outreach for help. While not explicitly suicidal, the topic and related loss elevate the risk compared to general sadness.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 14:12:55"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on my way home. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel extra on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate direct involvement or immediate danger to the author or others. It expresses feeling shaken and on edge, suggesting anxiety but not necessarily a severe risk.",
    "detected_category": "other",
    "timestamp": "2025-12-20 14:11:53"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary how quickly things escalated. My hands are still shaking. Is there anywhere to volunteer to help de-escalate situations like that? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The individual witnessed a fight and expresses feeling shaken and helpless, but is not directly involved or threatened. The focus is on their reaction and desire to help, not imminent danger.",
    "detected_category": "other",
    "timestamp": "2025-12-20 14:10:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are strong. Reached out to a friend, feels a little better. Remember it's okay to ask for help. 988 is there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates active suicidal ideation ('urges are strong') but also protective factors (reaching out to a friend, awareness of 988). The presence of urges elevates the risk beyond low, but the active help-seeking prevents it from being immediately high.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 14:09:49"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it feels like the only way to quiet them is to hurt. Trying to find better coping mechanisms. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses thoughts of self-harm as a coping mechanism, indicating a potential risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 14:08:47"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but lacks explicit mention of self-harm, suicide, or harm to others. It seems like a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-20 14:07:46"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been...not good. Walking on eggshells constantly. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a difficult home situation involving walking on eggshells, suggesting potential abuse or a highly stressful environment. The user expressing feeling alone elevates the concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 13:23:22"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen feeling so low lately. Urges are back. Trying to stay strong but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges and feelings of being low, suggesting a potential risk of self-harm or suicidal ideation. While not explicitly stated, the struggle to stay strong warrants a medium severity level.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 13:22:21"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just reaching out to see if anyone else understands. It's hard to keep going sometimes. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and difficulty coping, suggesting potential suicidal ideation. While there is no explicit mention of self-harm or suicide plans, the phrase 'hard to keep going sometimes' raises concern and warrants further assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 13:21:19"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else ever feel that way after witnessing something like that?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate imminent danger to the author or others. It primarily expresses emotional distress after the event, not intent to harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 13:20:18"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly alone lately. Reaching out because I don't know what else to do. Anyone else ever feel like they're just...drowning?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of intense loneliness and a sense of being overwhelmed (\"drowning\"). While it doesn't explicitly mention self-harm or suicide, the feeling of being overwhelmed and the plea for help suggest a potential risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 13:19:16"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Reached out to a friend, feels a little better to not be alone with it. If you're going through it too, please reach out. You're not alone either.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a relapse or worsening of a mental health condition. Reaching out is a positive step, but the presence of urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 13:18:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\"I keep making excuses for him, but the yelling is getting worse. Last night he cornered me... I don't know what to do. Is this normal? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes escalating yelling, being cornered, and feeling lost, which indicates a potentially dangerous situation of emotional and possibly physical abuse. The escalation suggests a high risk of further harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 13:17:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Scared. Found my brother unresponsive. Narcan worked, thank god. Still waiting for the ambulance. Addiction is a monster. Learn the signs, carry Narcan. It saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Brother was found unresponsive and required Narcan, indicating a potentially life-threatening overdose situation. The immediate danger has passed with Narcan administration, but the situation necessitates further medical attention and highlights an ongoing risk due to addiction.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 13:16:11"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, suggesting potential emotional distress and a need for help. While not explicitly suicidal, the metaphor of being \"underwater\" indicates a struggle and warrants concern.",
    "detected_category": "other",
    "timestamp": "2025-12-20 13:15:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after almost losing a friend to an OD. Scariest night of my life. Please, if you're using, have someone with you, and know the signs. Naloxone saves lives. Learn how to use it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose event, indicating a significant risk of severe harm or death related to drug use.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 13:14:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, and I hate it. Trying to stay strong and remember why I stopped. Anyone else get this? Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a return of urges, indicating a potential for self-harm or relapse, coupled with feelings of loneliness and being overwhelmed. While there's no explicit plan, the combination warrants a 'medium' severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 12:22:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. The constant put-downs are chipping away at me. Is this normal in a relationship? Feeling lost and don't know where to turn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional distress, feeling lost, and experiencing potentially abusive behavior (put-downs). While there is no explicit mention of self-harm or suicidal ideation, the feeling of being 'chipped away' indicates significant negative impact and a potential escalation risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 12:21:14"
  },
  {
    "title": "User Story: Suicide",
    "content": "Sometimes it feels like I'm underwater, just trying to breathe. Reaching out because I don't know what else to do. Has anyone else felt this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and struggling, with a sense of helplessness. While not explicitly stating suicidal intent, the feeling of being underwater and reaching out can be interpreted as a cry for help and potential distress that could escalate if not addressed.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 12:20:12"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough lately. Constant put-downs, isolating me from friends... feels like I'm walking on eggshells. Is this normal in a relationship? Starting to feel really lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, which can escalate and significantly impact mental well-being. The feeling of being 'lost' suggests distress.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 12:19:11"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his dog on Elm St. Shaken. Reported it, but feel like I should've done more? Anyone else witness it? Wish I'd yelled something. Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence (dog being punched) indicates a potential for escalation or further harm to the animal. While not directly involving the reporter, it's a concerning act of violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 12:18:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately, urges are back. Reached out to a friend, just talking helped a bit. Remember you're not alone, even when it feels like it. <3",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential for self-harm or relapse into harmful behaviors. While the individual reached out for help, the presence of urges necessitates a 'medium' severity rating as the risk is not immediately imminent but requires attention and support.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 12:17:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so heavy, y'know? Just trying to find healthier ways to cope. Anyone else feel like they're just barely holding on?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being overwhelmed and struggling to cope, but it doesn't explicitly mention self-harm, suicide, or harm to others. The mention of \"healthier ways to cope\" suggests an intention to find positive solutions, lowering the immediate risk.",
    "detected_category": "other",
    "timestamp": "2025-12-20 12:16:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of being lost and overwhelmed, potentially indicating depression or a mental health crisis. The statement 'don't know what else to do' suggests a lack of coping mechanisms and a need for support. While not explicitly mentioning self-harm or suicide, the intensity of the feelings warrants concern and further assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 12:15:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after Narcan saved my life. Scared. This stuff is everywhere. Getting help tomorrow. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Recent life-threatening overdose requiring Narcan intervention indicates a high risk of recurrence. Expressed fear and feeling of isolation compound the risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 12:14:03"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough week. Urges are back, stronger than before. Reached out to a friend, just needed to vent. It helps, even a little. Taking it one day at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges, suggesting a potential for escalation. While the person reached out for help, the persistence of strong urges necessitates monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 12:13:01"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Just wanted to say if you're struggling, you're not alone. Talking to someone helps, even if it's just a little. Reach out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and encourages seeking help. While it mentions struggling, it doesn't contain explicit suicidal ideation or plans.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 11:16:11"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out at the bus stop. Shaken up. Makes you realize how quickly things can escalate. Anyone else ever witness something like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but the individual only expresses feeling shaken up, indicating no direct harm or imminent threat to themselves or others. The event is a past occurrence.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 11:15:10"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out on the street. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't indicate immediate danger to the individual or others. The person expresses feeling 'on edge' which indicates stress but not necessarily an imminent threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 11:14:08"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were strong. Didn't act on them, though. Small victory. Anyone else relate? Just feeling really alone right now.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions strong urges, implying a struggle with potentially harmful thoughts or behaviors. While the individual states they didn't act on them, the presence of strong urges and feelings of isolation warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 11:13:07"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of distress and being overwhelmed, but does not contain specific plans or threats of harm.",
    "detected_category": "other",
    "timestamp": "2025-12-20 11:12:05"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his partner on the street. Shook me up. Said something, but feel like I should've done more. Anyone else ever freeze in a situation like that? Feeling helpless.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessed violence indicates potential for escalation or further harm. While no immediate threat is mentioned to the witness, the event itself points to a risk of physical harm to the shovee.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 11:11:04"
  },
  {
    "title": "User Story: Suicide",
    "content": "Ugh, things have been so dark lately. Feeling really lost and overwhelmed. Talking to someone feels impossible, but I know I need to. Any advice on where to start?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of darkness, being lost, and overwhelmed, coupled with the acknowledgement of needing help but feeling unable to reach out. This suggests a potential for escalation if support is not received.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 11:10:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain explicit mentions of self-harm, suicide, violence, abuse, or overdose. It appears to be a general cry for help and connection.",
    "detected_category": "other",
    "timestamp": "2025-12-20 11:09:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got decked. Makes you think, y'know? Is this just how things are now? Feeling kinda shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling, causing anxiety, but doesn't indicate imminent danger or a high probability of severe harm to the person who wrote the text.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 11:08:00"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just...heavy. Reaching out to a friend, hoping it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and heavy, suggesting emotional distress, but lacks specific details about self-harm, suicide, or harm to others. Seeking support from a friend indicates a coping mechanism.",
    "detected_category": "other",
    "timestamp": "2025-12-20 11:06:58"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight break out downtown. Shaken up. Makes you realize how quickly things can escalate. Anyone else feel this way sometimes?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing the person to feel shaken. While unsettling, it does not directly indicate immediate danger to themselves or others. The user is expressing a general feeling of unease about the potential for sudden escalation, but it is not targeted, imminent, or directly threatening.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 10:17:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, hoping it helps. This sucks.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential for self-harm or relapse into harmful behaviors. Reaching out to a friend is a positive coping mechanism, but the overwhelming feeling and the return of urges still indicate a significant risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 10:16:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to someone feels impossible. Anyone else ever feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, overwhelmed, and isolated, which can be precursors to more serious mental health issues. The reluctance to talk to someone is concerning.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 10:15:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Relapsed after 6 months clean. Feeling so ashamed and alone. Reaching out to my therapist tomorrow, but tonight is rough. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety is a significant risk factor for overdose. The feelings of shame and loneliness also exacerbate mental health vulnerabilities. While not explicitly suicidal, the combination of factors indicates a heightened risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 10:14:43"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw my neighbor OD last night. Scariest thing ever. Narcan saved them. Learn CPR and carry Narcan, people. It could save a life. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a significant event indicating a high risk of potential harm to the individual who overdosed and potential emotional distress for the witness. The need for Narcan and CPR highlights the seriousness of the situation. While the neighbor survived, future overdoses are possible.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 10:13:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank god. Makes you realize how fragile life is, and how many people are struggling. If you need help, please reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event requiring Narcan intervention, indicating a significant risk of death. While the individual was saved, the incident highlights the potential for fatal outcomes and the prevalence of substance abuse issues.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 10:12:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "I keep making excuses for him. He apologized again, said it won't happen. But it did. Again. Anyone else feel like they're going crazy? Is this...normal? I don't know what to do.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potential pattern of harmful behavior from another person, coupled with the author's increasing distress and feelings of being overwhelmed ('going crazy', 'I don't know what to do'). While not explicitly stating physical harm, the repetition and the author's confusion and distress suggest a situation with escalating risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 10:11:38"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy get punched outside the bar. Shook me up bad. Is this normal now? Feels like everyone's on edge lately.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Observed violence (a punch). While a single punch is not necessarily life-threatening, it indicates a breakdown in social order and potential for escalation or further harm. The observer also expresses distress and a feeling that the environment is becoming more volatile.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 10:10:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home have been rough. Constant yelling, put-downs... I feel so small. Anyone else been through this? Just need to know I'm not alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a verbally abusive home environment with feelings of diminished self-worth. While there is no explicit mention of self-harm or suicide, the emotional distress and sense of isolation suggest a potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 10:09:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just realized yelling isn't normal. Been happening for years, always thought I was overreacting. Now I'm not so sure. Anyone else experience this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Experiences of yelling in the environment, potentially indicating abuse, is concerning. The user also expresses feeling lost, signaling a need for support.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 10:08:33"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nSaw a guy OD downtown today. Scary stuff. Narcan saved him, but shook me up. Learn the signs, people. It could save a life, or your own.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event indicates a serious health crisis and potential for future incidents. The prompt includes a warning about being able to save others, implying potential for repeat overdoses in the area.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 09:17:39"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown today. Shook me up. Guy just snapped. Makes you realize how fragile things are, y'know? Anyone else feel on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, causing emotional distress. While unsettling, it doesn't indicate imminent danger to the author or others. The author mentions feeling 'on edge' but does not express violent intent or suicidal ideation.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 09:16:38"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it feels like the only way to quiet them is to turn the volume up outside. Not proud, but trying to find better coping mechanisms. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses a struggle with overwhelming thoughts and a maladaptive coping mechanism (increasing external noise). While concerning, it doesn't directly express intent to harm self or others. The user is also seeking healthier coping mechanisms.",
    "detected_category": "other",
    "timestamp": "2025-12-20 09:15:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Clean for a week, then relapsed tonight. Feeling so ashamed. Reaching out for support. Anyone else been there?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety is a significant risk factor for overdose, especially given the feeling of shame which may increase the likelihood of further substance use. The individual is reaching out for support, which is positive, but the relapse itself warrants concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 09:14:35"
  },
  {
    "title": "User Story: Violence",
    "content": "Saw a fight downtown last night. Dude got clocked, just out of nowhere. Shook me up bad. Anyone else witness it? I keep replaying it in my head. Feel sick.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence can cause emotional distress and potential anxiety/trauma, indicating a moderate risk to the individual's mental wellbeing. The description of feeling 'shook up bad,' 'replaying it in head,' and 'feel sick' suggests significant impact.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 09:13:33"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy, and I don't know where to turn. Just reaching out.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and overwhelmed but lacks specific details about self-harm, suicide, or harm to others. Indicates a desire to connect, suggesting a willingness to seek help.",
    "detected_category": "other",
    "timestamp": "2025-12-20 09:12:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but lacks specific details about intent or plans for self-harm. It seems more like a general expression of distress and a desire for connection.",
    "detected_category": "other",
    "timestamp": "2025-12-20 09:11:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved them, but shaken up. Learn how to use it, seriously. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A potentially fatal overdose occurred, highlighting the risk of serious harm, although the individual survived due to Narcan.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 09:10:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them, but shook me up bad. Folks, please look out for each other. Know the signs. It can happen anywhere.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the individual survived, indicates a serious health crisis and potential for future incidents. The emotional distress described suggests a significant impact.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 09:09:27"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Talking feels impossible, but maybe someone understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, with a sense of hopelessness. The phrase 'underwater' can be interpreted metaphorically as feeling suffocated by emotions. The individual is reaching out for help, indicating some level of distress and a need for connection. While there's no explicit mention of self-harm or suicide, the depth of despair warrants a 'medium' severity rating.",
    "detected_category": "other",
    "timestamp": "2025-12-20 09:08:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of hopelessness and being overwhelmed, indicating a potential mental health crisis. While there's no explicit mention of self-harm or suicide, the metaphorical language of being 'underwater' and the acknowledgement of needing help suggests a significant level of distress that requires attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 08:20:07"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, but it really shook me up. Makes you realize how fragile life is, and how much we need to support each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "An overdose occurred, which is a life-threatening medical emergency. While Narcan was administered and the person survived, the potential for fatality was present.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 08:19:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Like I'm underwater. Reaching out because I don't know what else to do. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being overwhelmed and a plea for help, suggesting potential emotional distress and a need for support. While not explicitly suicidal, the feeling of being 'underwater' can be interpreted as a metaphor for depression or feeling trapped, which elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 08:18:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Just had another screaming match with my partner. Feeling so drained and worthless. Is this normal in a relationship? Starting to think maybe it's not...\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text doesn't explicitly mention harm, the feelings of worthlessness and being drained, combined with questioning the relationship's normality after frequent screaming matches, suggests emotional distress that could escalate. The potential for emotional abuse is present.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 08:17:03"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home aren't good. Constant put-downs & controlling behavior. I feel so isolated. Has anyone else been through this? I need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a situation involving controlling behavior and emotional isolation, suggesting potential for escalation to abuse or mental health crisis.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 08:16:01"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out downtown. Shook me up bad. Reminded me of things I'd rather forget. Anyone else ever feel completely derailed after witnessing something like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight which caused emotional distress, but there's no indication of direct threat to self or others.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 08:15:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I feel so lost. My partner yelled at me for hours last night over something small. It's happening more and more. Is this normal? I don't know what to do anymore.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a pattern of verbal abuse, which can escalate and significantly impact mental health. While not explicitly stating intent to harm self or others, the increasing frequency and intensity of the partner's behavior raises concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-20 08:13:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were strong. Didn't give in this time, but it was close. Talking to my therapist tomorrow. Just putting it out there.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual reports experiencing strong urges, implying a struggle with potentially harmful behavior. While they state they resisted, the closeness of the event and the need for therapy suggest a significant level of distress and risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 08:12:57"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The user expresses feelings of being lost and overwhelmed, indicating potential emotional distress. The phrase 'underwater' can be interpreted metaphorically as feeling suffocated or struggling to cope. Reaching out suggests a need for help, but there's no explicit mention of self-harm or suicidal ideation, making it higher than low, but not as severe as high.",
    "detected_category": "other",
    "timestamp": "2025-12-20 08:11:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post focusing on seeking help:\n\n\"Feeling really low lately. Everything feels overwhelming. Reached out to the crisis line, just needed to talk. It helped a little. Gonna take it one day at a time.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The post expresses feelings of being overwhelmed and low, indicating potential mental health distress. While the person has reached out for help, the continued struggle warrants a 'medium' severity rating to encourage further monitoring and support. The phrase \"it helped a little\" can imply the situation is still unstable and they are not fully relieved.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 08:10:54"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Just saw a fight break out on the bus. Shook me up bad. Makes you realize how easily things can escalate. Anyone else ever feel like that?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight on a bus, while upsetting, doesn't directly indicate a high risk of severe harm to the individual or others. The person expresses being shaken up, indicating a negative emotional impact, but not necessarily imminent danger.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 07:17:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them. Learn how to use it, could save a life. Seriously. #OverdoseAwareness #NarcanTraining",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a significant health risk in the area and potential for further incidents. While Narcan was used successfully, the event highlights the presence of a life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 07:16:15"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so incredibly low lately. Like there's no way out. Reaching out because I know I need to. If anyone has felt this way and found help, please share.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and a desire for help, indicating potential suicidal ideation. While there's no explicit plan, the depth of the negative emotions warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 07:15:13"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight break out on my street last night. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel more on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling and may cause anxiety, but there's no direct indication of immediate danger to the individual or others. It expresses concern and unease rather than a direct threat or ongoing harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 07:14:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary. Narcan worked, thank god. Makes you think. We gotta do better to help people get clean. Where do folks even go for help around here?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event requiring Narcan, indicating a significant health risk. While the immediate crisis was averted, the underlying issue remains, presenting a continued risk of future overdoses for the individual and potentially others.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 07:13:10"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thankfully. Makes you realize how close we all are. Be safe out there, friends. Look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event, which is a direct and potentially fatal health crisis. While the person was saved, the event highlights a significant risk present in the environment.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 07:12:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Anyone else ever feel this way? Just trying to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Expresses a strong urge to self-harm (cutting) and indicates current distress, suggesting imminent risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 07:11:08"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a guy get shoved on the train. Everyone just stared. Makes you wonder when someone will actually help instead of filming. Feeling sick about it.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was physically assaulted, indicating potential for further escalation or injury. While the immediate risk might be low for the person reporting, the event itself represents a violent act and potential harm to the victim.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 07:10:06"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. It's exhausting.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and exhausted, which are indicative of distress but lack specific details suggesting immediate danger. There are no explicit mentions of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2025-12-20 07:09:05"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Talking to someone feels impossible right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed, and unable to cope, indicating potential emotional distress and isolation. The individual is reaching out for help, suggesting some awareness of their need for support, but the statement that 'talking to someone feels impossible right now' raises concern as it indicates a barrier to accessing immediate assistance.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 07:08:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, feels a little better. Remember you're not alone. There are resources if you need them.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating an immediate risk. While the person reached out to a friend and feels a little better, the severity of the initial urge necessitates a high-risk classification.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 06:21:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, stronger than before. Trying to resist, but it's exhausting. Anyone else feel this way? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges and a struggle to resist them, suggesting a potential risk of acting on those urges. The specific nature of the urges is unknown, but the individual is clearly experiencing distress and seeking support, which implies a concerning level of vulnerability.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 06:20:24"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a really rough time lately. The urge to hurt myself is strong. Trying to stay strong, but it's exhausting. Anyone else feel this way? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk to the individual's safety.",
    "detected_category": "suicide",
    "timestamp": "2025-12-20 06:19:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Terrifying. Narcan saved them, but it shook me up. We need more awareness and access to help. Is there anywhere local that offers training?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the person survived due to Narcan, indicates a serious safety risk in the community. It highlights the presence of potentially fatal drug use and the need for immediate intervention in similar situations. The event caused distress to the witness, suggesting a potential for vicarious trauma.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 06:18:21"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight outside my kid's school. So scary. Makes you wonder what's going on with people. Feeling really shaken up. Anyone else seen an increase in aggression lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a fight outside a school is a concerning event that can be psychologically distressing. While the text doesn't directly indicate imminent danger to the author or others, the mention of a fight and heightened aggression suggests a potential risk of escalating violence in the community.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 06:17:20"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Punches thrown, yelling... I froze. It brought back bad memories from childhood. Feeling anxious now. Anyone else get triggered by public violence? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence, which triggered anxiety and past memories. While distressing, it doesn't indicate immediate danger to self or others. The person is seeking coping mechanisms rather than expressing intent to harm.",
    "detected_category": "other",
    "timestamp": "2025-12-20 06:16:18"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the text describes witnessing violence and feeling unsettled, it doesn't indicate imminent danger to the author or others, but it does suggest a concerning event with potential for further escalation. The description of someone being 'knocked out cold' implies a significant physical assault.",
    "detected_category": "violence",
    "timestamp": "2025-12-20 06:15:17"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Things got too much last night, and I relapsed. Feeling so ashamed and lost. Reaching out for help again. Day 1 starts now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse and feelings of shame and being lost, which suggests vulnerability and increased risk. While not explicitly suicidal, the vulnerability elevates the severity.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-20 06:14:15"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... Scares me. Lost a friend last year. If you're struggling, please reach out. There's help available. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a recent overdose and personal loss, indicating potential vulnerability and raising concern for the individual's emotional state.",
    "detected_category": "overdose",
    "timestamp": "2025-12-20 06:13:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like I'm underwater. Just reaching out to say if you're struggling too, you're not alone. Thinking of calling the hotline. 988 is the number, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 58 (char 83)",
    "detected_category": "unknown",
    "timestamp": "2025-12-20 06:12:12"
  }
]