[
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed today. Urges were strong. Didn't act on them, though. Small victory. Reaching out for support feels hard, but necessary. Anyone else relate?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports strong urges and feeling overwhelmed, indicating a potential for escalation even though the person states they didn't act on the urges today. Seeking support but finding it hard suggests a barrier to accessing help.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 23:17:35"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... feels like I'm walking on eggshells. Anyone else been through this? How did you find the strength to leave? #abuseawareness #domesticviolence",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and constant put-downs, indicating emotional abuse. While there's no explicit mention of physical violence, the feeling of 'walking on eggshells' suggests a volatile and potentially unsafe environment.",
    "detected_category": "abuse",
    "timestamp": "2025-12-22 23:16:33"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is getting stronger. I reached out to a crisis line, and it helped. If you're struggling too, please know you're not alone. There's help available.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk. While the person reached out for help, the presence of suicidal ideation warrants a high severity assessment.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 23:15:31"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like a dark cloud won't lift. Reaching out because I know I need to talk to someone. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and a desire to talk, but there's no explicit mention of self-harm, suicide, or harm to others. It indicates a low mood and a need for support.",
    "detected_category": "other",
    "timestamp": "2025-12-22 23:14:29"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to a friend helped a little. Still feels like a long way to go.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, overwhelmed, and struggling to cope, although talking to a friend provided some relief. The phrase \"underwater and can't find the surface\" suggests a potentially dangerous level of distress.",
    "detected_category": "suicide",
    "timestamp": "2025-12-22 23:13:28"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Trying to stay strong and remember why I stopped. Anyone else relate? Just feeling really alone right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions the return of urges, suggesting a potential risk of relapse or escalation. Feeling overwhelmed and alone further increases the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 23:12:26"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. It's suffocating.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, suffocated, and reaching out for help. While there's no explicit mention of self-harm or suicide, the strong negative emotions and feeling of being overwhelmed suggest a potential risk that warrants attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-22 23:11:25"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to a friend helped a little, but it's still there. Anyone else ever feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of sadness and being lost, but doesn't contain specific suicidal ideation, self-harm, violence, abuse, or overdose indicators. While the person is clearly struggling, they are also reaching out and engaging with a friend, suggesting a coping mechanism.",
    "detected_category": "other",
    "timestamp": "2025-12-22 23:10:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just got out of the hospital after ODing. Scared. Never thought it would happen to me. If you're struggling, please reach out. Don't end up like I almost did.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The individual recently overdosed and expresses fear, indicating a high risk of recurrence or further harm. The message also suggests a level of despair that warrants immediate attention.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 23:09:22"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Talking to someone feels impossible, but I know I need to. Any advice on finding help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, with a desire to seek help, suggesting potential emotional distress and a possible need for intervention. The metaphor 'underwater' implies struggling to cope.",
    "detected_category": "suicide",
    "timestamp": "2025-12-22 23:08:20"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so isolated. Is this abuse? Where do I even start getting help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and isolation, which can escalate to more severe mental health issues if not addressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-22 22:17:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, just gotta keep distracting myself. It's a daily battle.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating immediate risk. While the person has reached out for help and is attempting distraction, the intensity of the urge necessitates a high severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 22:16:49"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park yesterday. Terrifying. Narcan saved them, but it was so close. Learn how to use it, people. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was successful, the event indicates a life-threatening situation requiring immediate intervention. The potential for future, possibly fatal, overdoses exists.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 22:15:47"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. OD is real. Please, if you're struggling, reach out. Don't let fear stop you from asking for help. It's okay to not be okay.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose, indicating a severe and immediate risk to life.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 22:14:45"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank God. Makes you realize how fragile life is. Please, if you're struggling, reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the individual was saved, a potentially fatal overdose occurred, indicating a significant risk in the environment and to individuals struggling with addiction. The event highlights the potential for severe health consequences and the fragility of life.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 22:13:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Trying to distract myself, but it's hard. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating an elevated risk. While the person is attempting distraction, the intensity of the urge warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 22:12:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a bit. Remember we're not alone. 💜",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a high risk of potential harm. While the person reached out for help, the strength of the urge necessitates a high severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 22:11:40"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 168 (char 190)",
    "detected_category": "unknown",
    "timestamp": "2025-12-22 22:10:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scary stuff. Narcan saved them, but it shook me up. Please, if you're using, have someone with you and carry Narcan. It really does save lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose incident, which is a life-threatening event requiring immediate intervention. While Narcan was successful, the situation highlights a significant risk of death.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 22:09:37"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Days clean and then I relapsed. Feeling so ashamed and lost. Anyone else been there? Just need to know I'm not alone rn.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse and feelings of shame and loss, suggesting potential vulnerability and risk of further harmful behavior or thoughts. While not explicitly suicidal, the feelings described warrant attention.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 22:08:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan saved him, thank god. Learn the signs, people. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential risk to the individual who overdosed and highlights the presence of dangerous substances in the area. While Narcan was administered, the situation could have been fatal, indicating a significant risk.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 21:17:05"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been...not good lately. Walking on eggshells all the time. Anyone else been through this? Feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a difficult and potentially abusive or violent home environment. \"Walking on eggshells\" suggests fear and intimidation, raising concern for the user's safety and well-being, although specific details of harm are not stated.",
    "detected_category": "abuse",
    "timestamp": "2025-12-22 21:16:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD today. Terrifying. Narcan saved them, but shook me up bad. Please, if you're struggling, reach out. There's help out there. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a significantly distressing event, indicating a risk for secondary trauma in the observer. While the person survived due to Narcan, the event highlights the presence of a high-risk behavior (drug use) in the environment and the potential for future, possibly fatal, overdoses. The message also implies the observer is experiencing emotional distress ('shook me up bad').",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 21:15:01"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Just wanted to say, if you're struggling with self-harm, you're not alone. It's okay to ask for help. I'm trying to get better too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions struggling with self-harm, indicating potential risk. While the author is encouraging help-seeking, the admission of struggling elevates the severity beyond just general distress.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 21:13:59"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back, stronger than before. Trying to resist, but it's exhausting. Anyone else relate? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges and feeling overwhelmed. While not explicitly stating suicidal intent, the return of urges raises concern and warrants attention. The user is seeking validation and support, suggesting they are struggling to cope independently.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 21:12:58"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is strong. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly states a strong urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 21:11:56"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a really rough week. Feeling so drained and alone. Just reaching out... anyone else ever feel like they're just going through the motions?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of loneliness and exhaustion, but there is no explicit mention of self-harm, suicidal ideation, violence, abuse, or overdose. The person is reaching out, suggesting a desire for connection rather than immediate danger.",
    "detected_category": "other",
    "timestamp": "2025-12-22 21:10:54"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after 6 months. Disappointed in myself, but trying to remember recovery isn't linear. Reach out if you're struggling too, we can get through this.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety suggests a struggle with addiction and potential for escalation. While the text expresses a desire for support and recovery, relapse events can increase the risk of harm. The relapse itself doesn't describe or suggest immediate harm, but the vulnerability is present and could worsen depending on circumstance.",
    "detected_category": "other",
    "timestamp": "2025-12-22 21:09:53"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, but it shook me up. Knowing it can happen anywhere... Makes you think. Be safe out there, everyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a potential risk to the observer's mental health due to the traumatic nature of the event. While the person survived, the exposure to a life-threatening situation and the realization that it can happen anywhere raises concern.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 21:08:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just need to vent. He screamed again last night. Said I was worthless. I feel so small. Is this normal in relationships? I don't know what to do anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes verbal abuse and feelings of worthlessness, indicating emotional distress. While there's no explicit mention of self-harm or suicidal ideation, the expression of feeling 'so small' and not knowing 'what to do anymore' suggests a vulnerability that requires attention. Escalation is possible if the abuse continues.",
    "detected_category": "abuse",
    "timestamp": "2025-12-22 21:07:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Constant put-downs, isolating me from friends... I feel so lost. Anyone else been through this? How did you find help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional abuse and isolation, indicating a potential risk to the individual's mental and emotional well-being. While there is no explicit mention of self-harm or suicidal ideation, the feeling of being 'lost' and the description of 'constant put-downs' suggest a degree of distress that warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-22 20:18:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan saved their life. Please, learn how to use it. You could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was used successfully, the text describes an overdose event, indicating a significant health risk and potential for fatal outcome. Encouragement to learn how to use Narcan implies that such events could occur again.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 20:17:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nMy friend almost didn't wake up last night. Narcan saved him. Scary stuff. Please, learn the signs of an overdose. It could save someone you love.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a significant and immediate threat to life.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 20:16:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scariest thing ever. Narcan saved them, thank god. Learn how to use it, please. You could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While Narcan was used and the person survived, an overdose is a potentially life-threatening event. The text highlights the immediate danger and need for preventative action.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 20:15:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them. We gotta do better, learn the signs, and carry Narcan. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests a potential ongoing risk of further overdoses in the area, though the immediate situation was resolved. The call to action for Narcan use highlights the possibility of future incidents.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 20:14:36"
  },
  {
    "title": "User Story: Suicide",
    "content": "\"Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. It's suffocating.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost, suffocated, and a general sense of distress. While not explicitly mentioning self-harm or suicide, the feeling of being 'underwater' and 'suffocating' suggests a potentially serious emotional state that requires attention.",
    "detected_category": "suicide",
    "timestamp": "2025-12-22 20:13:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I feel so lost. Things at home have been... rough lately. Constant yelling, put-downs. I'm starting to believe it's all my fault. Has anyone else dealt with this? Feeling really alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes emotional distress, feelings of worthlessness, and a sense of isolation stemming from a difficult home environment involving yelling and put-downs. While there's no explicit mention of self-harm or suicidal ideation, the level of distress and feelings of being alone warrant a 'medium' severity assessment due to potential escalation. The belief that it's all their fault increases the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-22 20:12:32"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been...bad. Constant yelling, walking on eggshells. I feel so small. Anyone else been through this? Feeling lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a potentially unsafe home environment with emotional distress and feelings of being small, which could escalate if not addressed. Constant yelling and walking on eggshells point to a situation requiring attention.",
    "detected_category": "abuse",
    "timestamp": "2025-12-22 20:11:30"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Trying to resist, but it's hard. Anyone else relate? Any tips for coping?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating an immediate risk. While the individual is trying to resist, the strength of the urge elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 20:10:29"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy punch his girlfriend outside the grocery store. Froze. Didn't know what to do. I feel sick. Has anyone else ever witnessed something like that? What *can* you even do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing violence, specifically domestic violence (punching a girlfriend), indicates a risk of escalation and potential for further harm. While the reporter wasn't directly targeted, they may be in danger if they attempt to intervene. The event itself constitutes a violent act.",
    "detected_category": "violence",
    "timestamp": "2025-12-22 20:09:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "```\nIt's hard to admit, but things at home aren't good. Constant put-downs, controlling behavior... feels like I'm walking on eggshells. Anyone else been through this? How did you find the strength to leave? #abuseawareness #domesticviolence\n```",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a situation indicative of domestic abuse, involving put-downs and controlling behavior. This suggests a high risk of emotional and potentially physical harm.",
    "detected_category": "abuse",
    "timestamp": "2025-12-22 19:16:59"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like I'm watching my life from behind a glass wall. Reaching out because I don't know what else to do. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of depression and isolation but does not explicitly mention self-harm, suicide, or harm to others. The individual is reaching out for advice, indicating a desire for help.",
    "detected_category": "other",
    "timestamp": "2025-12-22 19:15:57"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight downtown. So scary how quickly things escalated. Makes you wonder what sets people off, y'know? Feeling really shaken up.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be upsetting, but the text doesn't indicate imminent danger to the speaker or others. The feeling of being 'shaken up' suggests emotional distress rather than a direct threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-22 19:14:55"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling? Could use a lifeline.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, using the metaphor of being underwater. The phrase \"need a lifeline\" suggests a desire for help and support, implying potential distress and vulnerability. While there's no explicit mention of self-harm or suicide, the level of distress warrants concern.",
    "detected_category": "suicide",
    "timestamp": "2025-12-22 19:13:54"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. My neighbor's been yelling & throwing things for hours. Called the non-emergency line, but they haven't come. Anyone know what else I can do? Worried for the kids.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Neighbor's violent behavior (yelling and throwing things) escalating. Concern for children indicates potential for harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-22 19:12:52"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need to. Talking to someone tomorrow. Hope it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses feelings of hopelessness and indicates a desire for help, suggesting some level of risk. They have scheduled to talk to someone but the impact of that is not known.",
    "detected_category": "suicide",
    "timestamp": "2025-12-22 19:11:50"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's so hard to admit, but things at home haven't been good. Constant yelling, put-downs... I feel so small. Anyone else been through this? How did you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a negative home environment with emotional abuse (yelling, put-downs) and expresses feelings of inadequacy. While there's no explicit mention of self-harm or suicide, the described situation is indicative of potential mental health distress and could escalate if unaddressed.",
    "detected_category": "abuse",
    "timestamp": "2025-12-22 19:10:49"
  },
  {
    "title": "User Story: Abuse",
    "content": "Ugh, another fight. Walking on eggshells constantly. Is this normal? Feeling so isolated. Anyone else go through this? Need to talk.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Feeling isolated and constantly walking on eggshells, combined with a need to talk, suggests potential emotional distress and a plea for support. While not explicitly stating harm, the situation implies a concerning level of stress and potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2025-12-22 19:09:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shook me up. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't directly indicate imminent harm or a specific threat to the author or others. The feeling of being 'on edge' suggests anxiety but not necessarily intent to harm.",
    "detected_category": "violence",
    "timestamp": "2025-12-22 19:08:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is getting stronger. Anyone else feel this way? Just trying to not feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 19:07:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just left. Finally. Scared, but free-er than I've felt in years. Anyone know resources for emergency housing? I'm in [City, State].\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses fear and a need for emergency housing, suggesting potential immediate vulnerability and risk of exploitation or harm while lacking stable shelter. The lack of safety and need for immediate housing elevates the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-22 18:21:50"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to feel *something* is to hurt myself. I know it's not healthy, but it's hard to stop. Anyone else feel this way? Where do you even start to get help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes active thoughts and urges of self-harm, indicating a significant risk. The individual is also expressing a sense of being overwhelmed and unsure of how to seek help, which further increases the immediate concern.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 18:20:49"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out before it gets worse. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 74 (char 99)",
    "detected_category": "unknown",
    "timestamp": "2025-12-22 18:19:47"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got decked. Scary how fast things escalate. Makes you think, ya know? Anyone else feel like things are getting more volatile lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "While the text describes a violent event (a fight), it's a second-hand account and there's no indication the speaker is involved or in immediate danger. The tone is more reflective than panicked.",
    "detected_category": "violence",
    "timestamp": "2025-12-22 18:18:46"
  },
  {
    "title": "User Story: Violence",
    "content": "I saw a guy get shoved on the train platform today. Scared me half to death. Reminded me of when my brother... ugh. Just gotta breathe. Is there anywhere to report stuff like that, even if you don't know the people involved?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was physically assaulted (shoved) on a train platform. While the outcome isn't explicitly stated, the act itself indicates potential for serious injury. The reporter is also expressing significant distress.",
    "detected_category": "violence",
    "timestamp": "2025-12-22 18:17:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a bit. Remember we're not alone. Talking is key. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports strong urge to self-harm, indicating active risk. Mitigation reported through reaching out to a friend, reducing the severity slightly.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 18:16:42"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a little. Anyone else relate? How do you cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating a potential risk. Reaching out to a friend is a positive coping mechanism, but the persistence of the urge elevates the severity beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 18:15:41"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need to. Talking to someone tomorrow. It's a start.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of hopelessness and indicates a need for help, suggesting a potential risk of self-harm or suicide. While the person is seeking help, the active expression of low mood warrants a medium severity assessment.",
    "detected_category": "suicide",
    "timestamp": "2025-12-22 18:14:39"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the gas station today. Scary stuff. Narcan saved them, thank goodness. Makes you think... Know where to get it, just in case. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event indicates a potential for severe harm and death, even though the individual was saved. The text also acknowledges the possibility of future overdose events.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 18:13:38"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard shouting next door again last night, then a crash. Wish I knew what to do. Called the non-emergency line before but they said they couldn't do anything without proof. Feeling helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential violence or abuse occurring next door, evidenced by shouting and crashing sounds. The reporter expresses fear and helplessness, suggesting a potentially escalating situation. While there is no direct threat to the reporter, the proximity and recurring nature of the incidents warrant concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-22 18:12:36"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night, relapsed after 6 months clean. Disappointed but trying to be kind to myself. Reaching out to my therapist today. It's a setback, not a failure. #selfharmrecovery\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety indicates vulnerability and potential for further self-harm. The mention of #selfharmrecovery also suggests a history of self-harm, making relapse a serious concern. While the individual is reaching out for help, the immediate risk is present.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 17:17:45"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Woke up this morning feeling like I'm walking on eggshells again. Is this normal in a relationship? Starting to feel so lost and small. Wish I knew who to talk to.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional distress and feelings of being in a vulnerable or unstable situation ('walking on eggshells,' 'lost,' 'small'). The feeling of isolation ('Wish I knew who to talk to') further elevates the concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-22 17:16:42"
  },
  {
    "title": "User Story: Abuse",
    "content": "Ugh, another fight. Walking on eggshells constantly. Is this normal? Feel so drained. Thinking of talking to someone... anyone been there?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates emotional distress and a difficult relationship dynamic, but there is no explicit mention of self-harm, suicide, violence, or abuse. The user is expressing a desire for help, suggesting they are seeking solutions rather than acting on harmful thoughts. The risk is low as the user is more likely to seek external support than engage in dangerous behaviors.",
    "detected_category": "other",
    "timestamp": "2025-12-22 17:15:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things aren't good at home. Walking on eggshells constantly. Is this normal? Feeling so alone. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests a difficult and potentially unsafe home environment with emotional distress and isolation. While it doesn't explicitly mention physical harm, the phrase \"walking on eggshells\" implies potential volatility and fear. The feeling of being alone increases the risk.",
    "detected_category": "abuse",
    "timestamp": "2025-12-22 17:14:38"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Terrifying. Called 911, they're ok now. Makes you realize how close we all are to the edge. Where can I learn more about helping people in that situation?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The individual witnessed an overdose and sought help. While disturbing, the immediate danger has passed and the person is now seeking information to help others, not expressing harm to themself or others.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 17:13:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, walking on eggshells... Is this normal? Feeling so lost and alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress and a potentially abusive home environment, suggesting a risk to the individual's mental well-being. While not explicitly mentioning self-harm or suicide, the feelings of being lost and alone, coupled with descriptions of put-downs and walking on eggshells, warrant concern.",
    "detected_category": "abuse",
    "timestamp": "2025-12-22 17:12:34"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, indicating potential violence in the area, but doesn't suggest imminent danger to the poster or others, or any specific targeting. It expresses unease, but not specific threats or actions.",
    "detected_category": "violence",
    "timestamp": "2025-12-22 17:11:33"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Makes you realize how fragile life is. If you're struggling, please reach out. There are people who care.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose, which is a life-threatening event. While the text doesn't indicate immediate danger to the author or others, the mention of overdose suggests potential for similar incidents.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 17:10:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a friend OD last night. Terrifying. Narcan saved them, but shaken. Please, if you're using, keep it with you & someone who knows how. It's not worth the risk. Where can I get trained on using it, just in case?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Witnessing an overdose is a traumatic event indicating a high risk of future overdose for the individual who overdosed and potential psychological distress for the person who witnessed it. The mention of Narcan being used suggests a life-threatening situation.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 17:09:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't make it last night. Seeing him like that... terrifying. Please, if you're struggling, reach out. There's help out there. I'm still shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a close call with a friend, implying a serious situation that caused significant distress. While the specific nature of the incident is not clear, the mention of struggling and reaching out suggests a potential crisis. The phrase 'almost didn't make it' is concerning. However, without more details, the exact severity cannot be determined, but is higher than low.",
    "detected_category": "suicide",
    "timestamp": "2025-12-22 17:08:27"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up yesterday. Scariest moment of my life. Please, everyone, look out for each other and know the signs. Narcan saves lives.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal event involving a friend, strongly suggesting a severe health crisis requiring immediate intervention (implied overdose and Narcan use).",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 16:19:43"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train. Everyone just stared. Makes you wonder what's going on with people, you know? Scared to even intervene.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A person was physically assaulted (shoved). While the immediate physical harm may be low, the potential for escalation and the social environment's response suggest a medium level of concern.",
    "detected_category": "violence",
    "timestamp": "2025-12-22 16:18:41"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Almost relapsed after being clean for months. Reached out to a friend instead. Still struggling, but taking it one day at a time. It's okay to not be okay.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a near relapse after a period of sobriety, suggesting a vulnerability and potential for future relapse. The individual reached out for help, which is positive, but the underlying struggle persists.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 16:17:39"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so loud in my head, it feels like the only way to turn the volume down is to hurt myself. I know it's not healthy, but it's hard to stop. Reaching out for help. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions self-harm as a coping mechanism for overwhelming thoughts. While the individual expresses awareness that it's unhealthy and states they are reaching out for help, the active mention of self-harm elevates the risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 16:16:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a memorial for a friend lost to overdose. Hurts so much. Addiction is a disease, not a choice. If you're struggling, please reach out. There's help available. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and loss related to a friend's overdose, indicating potential distress in the author. While not explicitly stating suicidal intent, the topic of overdose and addiction suggests vulnerability.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 16:15:35"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another overdose. Makes me sick. Lost my cousin last year. If you're struggling, please reach out. There's help out there. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses grief and acknowledges the overdose death of a family member, suggesting a possible emotional vulnerability related to overdose risk. While the user encourages seeking help, the personal connection to loss elevates the risk compared to general statements.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 16:14:33"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw another ambulance on my block. Makes me sick. Lost my cousin last year. Please, if you're struggling, reach out. There's help out there. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses distress and indirectly references potential suicide ideation by mentioning loss, struggle, and becoming a statistic. While not explicit, the combination of these factors warrants a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2025-12-22 16:13:31"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm (cutting), indicating active ideation and a struggle to resist. While the individual reached out for help, the presence of the urge elevates the risk beyond 'low'.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 16:12:29"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, rough day. The urge to relapse is hitting hard. Just trying to breathe and remember why I stopped. Anyone else feel this way sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a strong urge to relapse, which, depending on the substance or behavior the person is trying to abstain from, could have serious consequences for their health and well-being. While not explicitly suicidal or self-harming, relapse can lead to significant harm.",
    "detected_category": "other",
    "timestamp": "2025-12-22 16:11:27"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is getting stronger. Reached out to a crisis line, and it helped a little. Remember you're not alone. There's help available.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a significant and immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 16:10:26"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were strong, but I distracted myself. One day at a time, right? Anyone else relate? Feeling kinda alone rn.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'strong urges,' which could imply self-harm or suicidal ideation, though the specific nature is unclear. The individual is also feeling alone, which can exacerbate mental health issues.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 15:18:44"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Just feeling so lost. He says he loves me, but then he screams and breaks things. Is that normal? I don't know what to do anymore.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional and physical abuse (screaming, breaking things) within a relationship, indicating a risk of escalating violence or harm to the individual.",
    "detected_category": "abuse",
    "timestamp": "2025-12-22 15:17:42"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Scared me half to death. Makes you wonder what's going on with people. Anyone else feeling on edge lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate imminent danger to the author or others. It expresses feelings of fear and unease but lacks specific threats or indicators of planned violence.",
    "detected_category": "violence",
    "timestamp": "2025-12-22 15:16:40"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw the news about another overdose. It hits different when it's someone you knew. Please, if you're struggling, reach out. There are people who care. Don't become a statistic.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a recent overdose death and encourages people struggling with substance abuse to seek help, suggesting a potential risk of overdose for others.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 15:15:38"
  },
  {
    "title": "User Story: Abuse",
    "content": "I'm so tired. Things at home are getting worse, not better. I feel so isolated and I don't know what to do anymore. Is there anyone else who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness, isolation, and worsening home situation, indicating potential for escalation. The question implies a need for support.",
    "detected_category": "suicide",
    "timestamp": "2025-12-22 15:14:36"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. So scary. Reminded me of things I've been trying to forget. Feeling really shaken up. Anyone else deal with flashbacks after witnessing violence?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing violence and experiencing emotional distress (flashbacks). While upsetting, it doesn't indicate immediate danger to self or others. The user is reaching out for shared experiences, not necessarily expressing suicidal/homicidal ideation or current abuse.",
    "detected_category": "violence",
    "timestamp": "2025-12-22 15:13:35"
  },
  {
    "title": "User Story: Suicide",
    "content": "Okay, here's a short, realistic social media post about suicide, aiming for authenticity and help-seeking, within the character limit:\n\n\"Feeling really low lately.  Like, seeing no way out.  Scared to admit it, but I need to talk to someone.  Anyone know resources that actually help?  Just feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The post expresses feelings of hopelessness, suicidal ideation ('seeing no way out'), and a direct plea for help. While it's framed as help-seeking, the presence of suicidal ideation indicates a high level of risk.",
    "detected_category": "suicide",
    "timestamp": "2025-12-22 15:12:33"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"I keep making excuses for him, but the yelling is getting worse, and now he's grabbing me. I feel so lost. Is this...is this abuse? I don't know what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes escalating verbal abuse and physical aggression (grabbing), indicating a high risk of harm and potential for further violence.",
    "detected_category": "abuse",
    "timestamp": "2025-12-22 15:11:31"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming, I just want the noise to stop. Found a helpline that actually listened. It's not a cure, but it's a start. 988 is there if you need it too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feeling overwhelmed and a desire for the noise to stop, which indicates distress and potential risk. The mention of finding a helpline is a positive sign, suggesting help-seeking behavior, but the underlying issues remain.",
    "detected_category": "suicide",
    "timestamp": "2025-12-22 15:10:29"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Learn how to use it, please. It can save a life. Seriously shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A drug overdose occurred, requiring intervention (Narcan). While the person survived, overdose events are inherently risky and potentially fatal.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 15:09:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just feeling so lost lately. Things at home are... complicated. Walking on eggshells constantly. Anyone else been there? It's exhausting. Is there help out there?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost, exhaustion, and a difficult home situation possibly involving emotional manipulation (\"walking on eggshells\"). The user is also reaching out for help, which indicates they are struggling to cope. While there's no explicit mention of self-harm or suicide, the overall tone and request for assistance suggest a level of distress that warrants attention.",
    "detected_category": "other",
    "timestamp": "2025-12-22 14:19:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"I keep making excuses for the yelling, the insults. But it's getting worse. Feels like I'm walking on eggshells all the time. Is this...normal? How do you know when it's actually abuse?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a pattern of escalating verbal abuse (yelling, insults) causing significant emotional distress (walking on eggshells). While not explicitly physical, the situation suggests a potential for further escalation and negative psychological impact.",
    "detected_category": "abuse",
    "timestamp": "2025-12-22 14:17:56"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Some guy just snapped. Makes you realize how quickly things can escalate. Feeling really shaken up right now. Anyone else witness it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight is unsettling but doesn't directly indicate immediate danger or significant harm to the text author. While the event was violent, the author is reporting feeling shaken, not reporting being injured or directly threatened. The 'snapped' description suggests a singular event, not an ongoing threat.",
    "detected_category": "violence",
    "timestamp": "2025-12-22 14:16:54"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting in the street, got really heated. Reminded me of things at home growing up. Anyone else feel jumpy after witnessing stuff like that? Wish I knew how to help.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight and feeling emotionally affected. While upsetting, it doesn't indicate immediate danger to the author or others. The reference to home life and feeling 'jumpy' suggest a possible history of trauma, but there is no explicit mention of violence planned by the author, or active violence towards the fighting couple, or others.",
    "detected_category": "other",
    "timestamp": "2025-12-22 14:15:52"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Please, if you're using, carry Narcan and know how to use it. It can save a life. Learn more: [link to resource]. Stay safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose event indicates a potential for harm, though it does not directly threaten the person reporting. The mention of Narcan suggests the issue is ongoing and potentially prevalent.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 14:14:49"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw my neighbor yelling at his kid again. Sounded like hitting too. Makes me sick. Should I call someone? Don't want to cause trouble, but...\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Possible child abuse occurring, including physical hitting, though details are vague. Potential for ongoing harm to the child.",
    "detected_category": "abuse",
    "timestamp": "2025-12-22 14:13:47"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately, urges are back. Reached out to a friend, just talking helps. Remember you're not alone. There are resources if you need them. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential for self-harm or a mental health crisis. While the person reached out for help, the presence of urges necessitates a 'medium' severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 14:12:46"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend, hoping it helps. It's hard to keep going sometimes.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being overwhelmed and a struggle to keep going, suggesting potential for self-harm, though actively reaching out for help mitigates the immediate risk.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 14:11:44"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like the only way to feel *something* is to hurt. I know it's not right, but the urge is so strong. Anyone else feel this? Trying to find better coping mechanisms.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses an urge to self-harm, indicating a potential risk. While the individual acknowledges it's not right and is seeking coping mechanisms, the presence of the urge elevates the risk beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2025-12-22 14:10:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a story about another OD. Makes me sick. Lost my cousin last year. Please, if you're struggling, reach out. There are people who care and want to help. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses grief and encourages seeking help, indicating a past overdose tragedy but no immediate threat. While it touches on a sensitive topic, it primarily promotes support and connection.",
    "detected_category": "overdose",
    "timestamp": "2025-12-22 14:09:40"
  }
]