[
  {
    "title": "User Story: Self-Harm",
    "content": "---\n\nBeen having a really rough time lately. Urges are back and stronger. Reached out to a crisis line, feeling a little better just talking. Remember you're not alone. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a resurgence of strong urges, suggesting a potential for self-harm or suicidal ideation. While the person reached out for help and feels a little better, the intensity of the urges warrants a medium severity rating.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 20:18:43"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Finally left. Heart's pounding. So scared but also... lighter? Don't know what to do next. Any resources for women leaving abusive relationships?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual is leaving an abusive relationship and is experiencing fear and uncertainty, which are risk factors for potential harm, particularly if they return to the abuser or lack adequate support.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 20:17:42"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Shook me up. Made me realize how easily things can escalate. Is there anywhere to learn de-escalation techniques? Feeling pretty helpless right now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight caused distress, but no direct threat to the individual or others is mentioned. The individual is seeking de-escalation techniques, indicating a desire to prevent future violence, rather than participate in it.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 20:16:41"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been rough lately. Walking on eggshells constantly. Is this normal? Feeling so lost.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a stressful and potentially harmful home environment ('walking on eggshells') leading to feelings of being lost. While not explicitly stating harm, it hints at a situation that could escalate.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 20:15:39"
  },
  {
    "title": "User Story: Suicide",
    "content": "Feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of isolation and being overwhelmed, but doesn't contain direct threats or explicit plans for self-harm or harm to others. It seems like a general expression of distress and a desire for connection.",
    "detected_category": "other",
    "timestamp": "2026-01-04 20:14:37"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight break out downtown. Shaken up. Makes you realize how quickly things can escalate. Anyone else witness it? Kinda need to vent.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates the user witnessed a fight and is shaken, but there's no direct threat to themselves or others. It expresses a need to vent, suggesting distress but not an immediate danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 20:13:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "---\n\nJust saw a post about someone OD'ing. Scared me. Happened to a friend last year. Narcan is crucial, people. Carry it if you can. It saves lives. Learn how to use it. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports an overdose incident (friend last year, recent post), highlighting risk, especially for those with substance use issues or in proximity to it.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 20:12:34"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight on my street last night. Shook me up. Called the cops but still feeling uneasy. Anyone else ever witness something like that? How do you cope?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't directly indicate immediate danger to the author or others. Unease and seeking coping mechanisms suggest distress, but not an imminent crisis.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 20:11:33"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out in case anyone else knows this feeling. Talking helps, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but does not contain any explicit threats, plans, or ideation related to self-harm, suicide, or violence. The individual is reaching out for support, which is a positive sign.",
    "detected_category": "other",
    "timestamp": "2026-01-04 20:10:31"
  },
  {
    "title": "User Story: Overdose",
    "content": "My brother almost didn't wake up yesterday. Scariest day of my life. Please, if you're struggling, reach out. There's help out there. Don't let this happen to your family. ❤️",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-death experience which implies a significant safety risk to the brother. The mention of struggling and encouragement to seek help further suggests a potential suicide attempt or serious self-harm event.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 20:09:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately. Like nothing matters. Reaching out to a friend, but it's hard. Anyone else ever feel this empty? Just looking for some support.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates feelings of emptiness and low mood, suggesting potential depression or suicidal ideation. The individual is reaching out for support, indicating they are aware of their distress, but the passive phrasing suggests a degree of hopelessness.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 19:16:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Trying to stay strong and reach out instead. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions the urge to cut, indicating active self-harm ideation. While the person is reaching out, the presence of the urge signifies a high risk.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 19:15:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Relapsed after 6 months clean. Feeling ashamed, but reaching out for support. Anyone else been there? It's so hard.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety combined with feelings of shame increases vulnerability and the risk of further unhealthy coping mechanisms. The individual is reaching out for support, which is a positive sign, but the relapse itself indicates a struggle and potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 19:13:59"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy shove his girlfriend on the street. Shook me up. Didn't know what to do, just kept walking. Feeling guilty now. Anyone else ever freeze like that? What *should* you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an act of violence (shoving) which could escalate. While it doesn't directly involve the author, it indicates a potential risk of harm to another person.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 19:12:57"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary stuff. Narcan worked, thank god. Really makes you think. If you're struggling, please reach out. There's help out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event indicating a potential risk of future overdoses in the area or among the individual's associates. While the person survived, the event itself points to a broader risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 19:11:56"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Just saw a fight break out on the bus. Dude got shoved, then swung. Shook me up pretty bad. Is there anywhere safe to report stuff like that happening?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A physical altercation occurred, indicating a risk of injury. While the observer wasn't directly involved, they express being shaken up, suggesting potential psychological distress.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 19:10:54"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to hurt myself is back. It's scary. Reached out to a friend, hoping it helps. Anyone else relate? Just feeling so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions the urge to hurt oneself, indicating active suicidal ideation or self-harm ideation. This requires immediate attention and support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 19:09:53"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just need someone to listen. It helps, even a little.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of urges, suggesting a potential risk. While the person reached out for help, the presence of urges necessitates monitoring.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 19:08:51"
  },
  {
    "title": "User Story: Abuse",
    "content": "Just need to vent. After another fight, he smashed my phone. Said it was my fault. I feel so isolated. Is this normal? I don't know what to do anymore.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a pattern of abuse (physical violence, blaming) and expresses feelings of isolation and desperation. The smashed phone indicates potential for escalation of violence.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 19:07:50"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Just wanted to reach out and say if you're struggling too, you're not alone. Talking helps. I'm trying to find the strength to keep going.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and struggling, but it also shows a desire to find strength and encourages talking as a coping mechanism. There are no explicit mentions of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2026-01-04 19:06:48"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes it feels like too much. Scared to admit I relapsed. Trying to get back on track. Anyone else been there? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse, which carries potential health risks depending on the nature of the relapse. While there's no explicit mention of self-harm or suicide, the feelings of being overwhelmed and scared suggest vulnerability and potential for escalation.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 18:20:45"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. If anyone has felt this way and found help, please share.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "unknown",
    "reason": "Expecting ',' delimiter: line 3 column 82 (char 107)",
    "detected_category": "unknown",
    "timestamp": "2026-01-04 18:19:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything feels heavy. Reaching out because I don't know what else to do. Is there anyone who understands?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating emotional distress and a need for support. While not explicitly suicidal, the feelings of hopelessness warrant concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 18:18:42"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight outside my kid's school today. Shook me up. Makes you wonder what's going on with people. Anyone else dealing with this in their neighborhood?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't directly indicate imminent danger to the author or others. It expresses concern and a desire for shared experiences, but lacks details suggesting escalation or direct threats.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 18:17:40"
  },
  {
    "title": "User Story: Suicide",
    "content": "It's been a rough few weeks. Feeling really lost and alone. Reaching out to a friend tomorrow. Hoping it helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text indicates feelings of loneliness and being lost, but it also shows an active coping mechanism by reaching out to a friend. There is no explicit mention of self-harm, suicide, violence, abuse, or overdose.",
    "detected_category": "other",
    "timestamp": "2026-01-04 18:16:39"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get shoved on the train for bumping into someone. Escalated so fast. Makes you wonder what's going on with people. Anyone else notice more aggression lately? Feeling anxious.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a physical altercation (shoving) in a public place, suggesting a risk of injury to the victim and potential escalation to more serious violence. The observer also expresses anxiety, indicating the event was distressing.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 18:15:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD downtown. Scariest thing ever. Narcan saved them, but it really shook me. Makes you realize how easily it can happen. Learn CPR, carry Narcan. Seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event. While Narcan was effective, the potential for fatality exists, and the text emphasizes the ease with which an overdose can occur, leading to a moderate level of concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 18:14:36"
  },
  {
    "title": "User Story: Abuse",
    "content": "**Option 1 (Seeking help):**\n\n> Feeling lost. Things at home are... not good. Is there anyone who can recommend resources? I'm scared.\n\n**Option 2 (Sharing a story):**\n\n> I used to think it was normal to be constantly yelled at. It's not. It's abuse, and I'm finally getting out.\n\n**Option 3 (Raising awareness):**\n\n> Emotional abuse leaves invisible scars. Don't dismiss it. It's real and it hurts.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While not explicitly stating intent to harm self or others, the text indicates distress, fear, and potentially ongoing abuse. Option 1 expresses feeling 'scared' and things at home 'not good', suggesting an unsafe environment. Option 2 confirms a past of abuse. This warrants a medium severity due to the potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 18:13:34"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything's okay. The constant put-downs are chipping away at me. Anyone else feel like they're walking on eggshells all the time? Is this normal?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being worn down, feeling vulnerable ('walking on eggshells'), and questioning the normalcy of the situation, suggesting emotional distress. While not explicitly stating suicidal ideation or self-harm, the language indicates a potentially escalating situation that requires attention.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 18:12:32"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Two guys just went at it. Shook me up bad. Makes you realize how quickly things can escalate. Anyone else feel on edge lately?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which is unsettling but doesn't indicate immediate danger to the original poster or others. There's no mention of injuries or weapons. The poster expresses being 'shook up' and 'on edge', indicating emotional distress but not an imminent threat.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 18:11:30"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved them, thank goodness. Makes you realize how close we all are to the edge. Learn CPR, carry Narcan. It could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event requiring Narcan intervention, indicating a potentially life-threatening situation. While Narcan was effective, the risk of overdose is a serious concern.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 17:16:41"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown yesterday. Scary. Naloxone saved them, thank goodness. Knowing how to use it is so important. Anyone else feel helpless sometimes?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports a recent overdose event, indicating the presence of a potentially life-threatening situation and highlighting the importance of emergency intervention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 17:15:40"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "**Option 1 (Seeking Help):**\n\n> Really struggling tonight. Urges are strong. Anyone else feel this way? Just need to know I'm not alone.\n\n**Option 2 (Sharing a small victory):**\n\n> Managed to distract myself instead of giving in. Small win, but it feels huge right now.\n\n**Option 3 (Raising Awareness):**\n\n> Just a reminder to be kind. You never know what someone's going through. Scars aren't always visible.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Option 1 indicates active struggle with strong urges, suggesting a potential for self-harm. While not explicitly stated, the combination of struggling and strong urges warrants a medium severity rating.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 17:14:38"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Punches thrown, guy on the ground. Shaken up. Is it just me, or is everyone on edge lately? Makes you wonder what sets people off.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A physical altercation occurred, resulting in injury. While not directly involving the reporter, it indicates a potential for violence and a feeling of unease in the environment.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 17:13:36"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the ambulance lights last night shook me. ODs are hitting our block hard. Know Narcan. Carry Narcan. It saves lives. Please look out for each other.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a high prevalence of overdoses in the immediate area, requiring immediate action of carrying/using Narcan, signalling a notable risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 17:12:35"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a bit. Just taking it one hour at a time. If you're struggling too, you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating a significant risk. While the person has reached out for help, the urge is still present, suggesting the situation requires continued monitoring and support.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 17:11:34"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Scary stuff. Makes you realize how quickly things can escalate. Anyone else feel on edge lately? Stay safe out there.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes witnessing a fight, which suggests a potential risk of violence but doesn't indicate a specific threat or target. The general warning to 'stay safe' implies awareness of potential danger.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 17:10:32"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Things got really dark last night. I hurt myself again. I'm so tired of this cycle. Reaching out to my therapist today. Wish me luck.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates self-harm, a recurring cycle of distress, and seeking help. While actively reaching out is positive, the mention of self-harm escalates the risk beyond low.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 17:09:30"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. He's been isolating me from my friends, and the constant put-downs... I feel so lost. Anyone else been through this? How did you find the strength to leave?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes isolation and emotional abuse (put-downs), indicating a potentially dangerous situation. The question about finding the strength to leave suggests the person recognizes the need to escape but may lack the resources or support to do so. This combination elevates the risk beyond 'low' due to the potential for escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 17:08:29"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got decked, and no one helped. Makes you wonder what's wrong with people. Shaken up.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing a violent altercation can be traumatizing and indicates a risk of potential violence in the area.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 17:07:27"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Things have been rough at home lately. Constant yelling, then apologies, then it starts again. Feels like I'm walking on eggshells. Is this normal? Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a stressful and unstable home environment with potential for emotional distress and anxiety. The feeling of 'walking on eggshells' suggests potential emotional abuse or volatile conflict, and the feeling of being 'lost' indicates a lack of support and coping mechanisms. While not explicitly stating harm, the situation warrants concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 16:18:45"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to cut is strong. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses a strong urge to self-harm, indicating active ideation and potential risk. While the person has reached out for help, the strength of the urge elevates the concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 16:17:43"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Everything's just...heavy. Reaching out to a friend, hoping it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Expresses feelings of being lost and heavy, indicating emotional distress. Reaching out to a friend is a positive coping mechanism. No explicit mention of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2026-01-04 16:16:42"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw someone OD in the park. Scariest thing ever. Called 911, they're okay now, but shaken. Learn naloxone. Carry it. Please. It can save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While the immediate overdose event is resolved, the text describes a serious medical emergency with potentially fatal consequences. The advice to carry naloxone indicates an ongoing risk of similar events.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 16:15:40"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Finally left. Packing was hell, but I'm out. Scared, but also...lighter? Anyone know resources for women escaping domestic situations in [City Name]? Need to figure out housing and legal stuff. Feeling so lost.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates the individual is escaping a domestic situation, implying potential ongoing risk of abuse or violence. The explicit request for resources suggests a level of urgency and potential immediate need.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 16:14:39"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... not good. Constant yelling, put-downs. Feels like I'm walking on eggshells. Anyone else been through this? How do you even start to cope?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a hostile and stressful home environment characterized by verbal abuse and a feeling of constant anxiety. While it doesn't explicitly mention violence, self-harm, or suicidal ideation, the situation described presents a significant risk for mental and emotional distress, which could potentially escalate. The phrase \"walking on eggshells\" points to a high-stress, unpredictable environment.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 16:13:37"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary. Narcan worked, thank god. Makes you realize how easily it can happen. Learn CPR and carry Narcan if you can. Could save a life.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests potential exposure to harm and highlights the risk of drug-related emergencies in the environment. While Narcan was effective, the incident underscores a dangerous situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 16:12:35"
  },
  {
    "title": "User Story: Overdose",
    "content": "Seeing the news about another OD... It hits different when you've been there. Scariest moment of my life. Reach out, please. There's help available. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text discusses a personal experience with overdose, indicating a past risk event. While it promotes seeking help, the underlying vulnerability suggests a potential for relapse or vicarious trauma. ",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 16:11:33"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD downtown today. Scary. Narcan saved him, thank god. Reminded me of my brother. We need more access to that stuff, seriously.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose suggests potential for future overdoses in the area and highlights the risk of drug use. While the individual was saved, the event indicates a problem requiring attention.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 16:10:31"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Ugh, bad day. The urge to cut is so strong tonight. Trying to resist, but it's exhausting. Anyone else relate? How do you cope? #selfharmrecovery #mentalhealth #copingmechanisms",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating an immediate risk. While the individual is trying to resist, the intensity of the urge and the associated exhaustion suggest a high level of distress and potential for action.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 16:09:30"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice helps.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, with a plea for help, suggesting potential for escalation if unaddressed.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 15:17:13"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scary stuff. Narcan saved them, but it really shook me up. Anyone know where I can learn more about overdose prevention in the city?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose indicates a significant risk of overdose in the area. While the individual was saved, the event was impactful and highlights the potential for future, possibly fatal, overdoses.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 15:16:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, hoping it helps. It's exhausting fighting this.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text explicitly mentions a strong urge to self-harm, indicating a significant risk. While the person has reached out for help, the urge itself suggests a high level of distress and potential for immediate action.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 15:15:10"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back and stronger. Reached out to a crisis line, just needed someone to listen. It helped a little. Taking it one hour at a time.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges and feelings of being overwhelmed, suggesting an increased risk. Reaching out for help is a positive sign, but the urges persisting warrants a medium severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 15:14:08"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a guy get punched outside the bar. Shook me up. Is it always gonna be like this? Feels like anger is everywhere lately. Anyone else feeling it?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Reports of violence outside a bar, though a single incident, suggests a potential risk of further altercations and harm to others in the area. The feeling of widespread anger also contributes to the concern.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 15:13:06"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Rough day. Urges were strong, but I distracted myself with music & a walk. Still shaky, but didn't give in. Small win. Anyone else feel this way sometimes?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates strong urges, suggesting a significant level of distress. While the individual used coping mechanisms, the shaking suggests the intensity of the urges and potential for escalation if coping mechanisms fail.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 15:12:04"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD in the park today. Shook me up bad. Narcan saved him. Learn the signs, people. It could save a life you know.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a traumatic event that can have a significant emotional impact. The fact that Narcan was needed indicates a potentially fatal situation.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 15:11:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Just saw a memorial for someone lost to overdose. Hurts so much. If you're struggling, please reach out. There's help available, you don't have to go through this alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text references a fatal overdose, suggesting the potential for similar incidents or ongoing struggles with substance use leading to overdose. While the message is supportive, the context indicates a tangible risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 15:10:01"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight downtown last night. Never seen anything like it. Shook me up bad. Makes you wonder, you know?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "Witnessing a fight can be unsettling, but the text doesn't indicate immediate danger to the speaker or others. The speaker expresses being shaken up, but not directly threatened or planning any harmful actions.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 15:09:00"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are strong. Trying to distract myself, but it's hard. Anyone else relate? Just feeling really alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions strong urges and feelings of isolation, which are potential risk factors for self-harm or suicidal ideation. While not explicitly stated, the combination of these factors warrants a medium severity assessment.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 15:07:58"
  },
  {
    "title": "User Story: Suicide",
    "content": "I've been feeling so overwhelmed lately. It's hard to see a way out. Talking to someone feels impossible, but I know I need to.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of overwhelm and hopelessness, suggesting a potential for escalation. The individual acknowledges the need for help but feels unable to reach out, indicating a barrier to support.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 14:17:13"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so trapped. Has anyone else dealt with this? Need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates potential emotional abuse and a feeling of being trapped, which can escalate to further safety risks. The controlling behavior mentioned can involve a range of dangers.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 14:16:12"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD downtown today. Scary stuff. Narcan saved their life. Carry it, learn how to use it, you might save someone's life too.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes an overdose event, which is a serious medical emergency. While the person survived due to Narcan, the potential for fatality associated with overdose indicates a medium level of risk.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 14:15:10"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out to a friend tonight. Hope it helps. It's okay to not be okay, right?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being lost and overwhelmed, metaphorically described as 'underwater.' Reaching out to a friend is a positive sign, but the underlying distress warrants a 'medium' severity. The phrase 'It's okay to not be okay, right?' suggests seeking reassurance, indicating vulnerability.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 14:14:09"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "\"Felt so overwhelmed last night. Didn't want to, but I relapsed. Day 1 again. Reaching out for support this time. Anyone else been there?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse suggests potential for harm (e.g., overdose, self-harm) depending on the substance/behavior relapsed to. The expressed feeling of being overwhelmed further increases concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 14:13:07"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple fighting on the street. He shoved her, hard. I froze. Wish I'd said something, done something. Now I just feel sick. Anyone else ever deal with this? What do you do?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes a violent act (shoving) with potential for physical harm. While the immediate danger might be over, the potential for escalation or repeated abuse is present. The poster also expresses distress, indicating a possible impact on their mental well-being.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 14:12:06"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a fight downtown. Dude got knocked out cold. Shook me up. Is this normal now? Feeling so unsafe lately.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Observed violence resulting in significant injury (loss of consciousness). Indicates a potential risk to public safety and personal vulnerability.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 14:11:03"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater. Reaching out because I don't know what else to do. Any advice appreciated.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of being lost and overwhelmed, indicating potential emotional distress and a plea for help. While not explicitly suicidal, the metaphor of being 'underwater' and feeling lost can suggest a sense of hopelessness.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 14:10:02"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"Still reeling from my last relationship. Gaslighting messes you up, makes you doubt everything. Anyone else been through this? How do you even start to trust yourself again?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses emotional distress and a lack of self-trust due to past gaslighting. While the user is suffering, there is no explicit mention or implication of self-harm, suicide, violence, or substance abuse.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 14:09:00"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's been happening again. I feel so stupid for letting him back in. I don't know what to do anymore. Feeling trapped and ashamed. Anyone else been through this?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates emotional distress, feelings of being trapped and ashamed, and a possible abusive relationship (implied by 'letting him back in' and 'happening again'). While there's no explicit mention of self-harm or suicide, the intense negative emotions and feeling trapped raise concerns.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 14:07:58"
  },
  {
    "title": "User Story: Violence",
    "content": "---\n\n\"Scared. My neighbor's been screaming for hours. Sounds like things are getting broken. Called the cops but they haven't come yet. Don't know what to do.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Screaming, breaking objects, and the neighbor's distress suggest a potential escalation to violence or abuse. The delayed police response increases the risk to the neighbor and potentially the reporting individual.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 13:25:14"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Urges are back. Reached out to a friend, just needed someone to listen. It helps. If you're struggling too, you're not alone. 💚",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text mentions 'urges' which suggests a potential risk, although the person reached out for help, indicating some protective factors.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 13:24:13"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so low lately, like nothing matters. Reaching out because I know I need to. Talking to someone tomorrow. It's a start.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Expresses feelings of hopelessness and a lack of motivation, indicating a potential risk of self-harm or suicidal ideation. While the person is reaching out for help and has a plan to talk to someone, the presence of negative emotions warrants a medium severity.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 13:23:11"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back, stronger than before. Reached out to a friend, just needed to say it out loud. It helps, even a little. Remember you're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of strong urges, suggesting a potential risk of engaging in a harmful behavior. While the individual reached out for help, the intensity of the urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 13:22:10"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"It's hard to admit, but things at home haven't been good. Constant put-downs, controlling behavior... I feel so isolated. Has anyone else dealt with this? Where do you even start to get help?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes controlling behavior and put-downs, suggesting emotional abuse and isolation. While there's no explicit mention of physical harm or immediate danger, the emotional distress and feeling of being isolated raise concerns and warrant further investigation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 13:21:08"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's hard to admit, but things at home have been bad lately. Constant put-downs, controlling behavior... I feel so isolated. Anyone else been through this? How did you find help?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes potential emotional and psychological abuse (put-downs, controlling behavior) leading to feelings of isolation. While not explicitly stating harm, the situation described poses a risk to the individual's well-being and mental health. The request for help suggests a desire to change the situation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 13:20:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's getting harder to pretend everything is okay. He's been isolating me from my friends and gets angry over little things. Is this normal? I feel so alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text describes isolation, controlling behavior, and expressions of feeling alone, suggesting potential emotional abuse and increased risk of escalation.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 13:19:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "I messed up. Clean for a few weeks, but relapsed tonight. Feels like such a failure. Reaching out before it gets worse. Anyone else been there?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Relapse after a period of sobriety suggests a potential for escalation of substance use. The feeling of failure and reaching out before it gets worse indicates awareness and a desire to prevent further negative outcomes, but the risk is present.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 13:18:04"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been having a rough time lately. Urges are back. Trying to distract myself but it's hard. Anyone else relate? How do you cope? Just need to know I'm not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a relapse of urges, suggesting a potential struggle with mental health or addiction. While not explicitly stating intent, the need for coping mechanisms and a feeling of isolation raise concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 13:17:02"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Sometimes things get so overwhelming. Feeling like I just need to feel *something* else, even if it hurts. Trying to find healthier ways to cope. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses overwhelming feelings and a desire for self-soothing, but lacks specific plans or intent for self-harm. It mentions trying to find healthier coping mechanisms, which is a positive sign.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 13:16:01"
  },
  {
    "title": "User Story: Violence",
    "content": "Just saw a couple arguing on the street, escalated so fast. He shoved her, I froze. Should I have done something? Feeling sick about it.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Physical violence (shoving) occurred, indicating a potential for further escalation and harm. While the observer wasn't directly harmed, the situation could escalate or the woman involved could be at risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 12:23:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scariest thing ever. Narcan saved them. Please, if you or someone you know is struggling, get help. There's resources out there. Don't be afraid to use them.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a serious event and indicates a risk of potential harm and death, even though Narcan was administered. The prompt emphasizes seeking help for addiction.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 12:22:15"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"I keep making excuses for him, but last night... I don't even know anymore. Is this normal? I feel so lost and scared. Has anyone else been through this?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text suggests the person is in distress, scared, and unsure if their situation is normal. The implicit reference to 'him' and making excuses hints at a potentially abusive situation. The feeling of being lost and scared elevates the risk beyond 'low'.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 12:21:13"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Scared. Heard shouting next door again last night, then a crash. Wish I knew what to do. Hate feeling so helpless.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "While there's no direct threat to the individual, the shouting, crash, and feeling of helplessness suggest potential violence or abuse next door, causing significant distress to the individual. The proximity to the situation elevates the risk.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 12:20:12"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so heavy lately. Just wanted to say if you're struggling, you're not alone. Talking to someone really does help. 988 is a good place to start.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text expresses feelings of being 'heavy' and struggling, suggesting potential mental health distress. The recommendation of 988 indicates awareness of suicidal ideation or mental health crisis, but the message also encourages seeking help.",
    "detected_category": "suicide",
    "timestamp": "2026-01-04 12:19:10"
  },
  {
    "title": "User Story: Violence",
    "content": "\"Saw a fight outside my kid's school today. So messed up. Makes you wonder what kind of world we're raising them in. Anyone else feeling this lately?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "A fight witnessed near a school suggests a potential risk of violence impacting children and the community. While not directly threatening or detailing specific plans, the observed violence raises concerns about safety and the environment children are exposed to.",
    "detected_category": "violence",
    "timestamp": "2026-01-04 12:18:09"
  },
  {
    "title": "User Story: Suicide",
    "content": "Been feeling so lost lately. Like I'm underwater and can't find the surface. Talking to a friend helped a little. If you're struggling too, please reach out to someone. You're not alone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text expresses feelings of being lost and overwhelmed, but also indicates help-seeking behavior (talking to a friend and encouraging others to reach out). There are no explicit mentions of self-harm or suicidal ideation.",
    "detected_category": "other",
    "timestamp": "2026-01-04 12:17:07"
  },
  {
    "title": "User Story: Abuse",
    "content": "It's so hard to admit, but things at home have been... rough. Walking on eggshells constantly. Is this normal? Feeling so lost and alone. Any advice?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a stressful and potentially harmful home environment. \"Walking on eggshells\" suggests potential emotional abuse or conflict. The feelings of being lost and alone amplify the concern.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 12:16:05"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. Old coping mechanisms creeping back in. Reached out to a friend, which helped a bit. Remember we're not alone in this. <3",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a return of old coping mechanisms, suggesting a potential relapse into harmful behaviors. While the individual reached out for help, the overwhelmed feeling and reliance on old coping mechanisms raise concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 12:15:04"
  },
  {
    "title": "User Story: Abuse",
    "content": "---\n\n\"Still processing things my ex said. Gaslighting is real, and it messes with your head. Anyone else been through this? How did you start to heal?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "low",
    "reason": "The text describes past emotional abuse (gaslighting) and seeks advice on healing, but does not express immediate danger or intent to harm self or others.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 12:14:03"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD last night. Scariest thing ever. Narcan worked, thank god. Please, if you're using, carry it. Could save a life. I'm still shaken.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "A person overdosed and, while Narcan was administered successfully, the event still represents a life-threatening situation. The text indicates significant emotional distress.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 11:16:23"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw someone OD at the park today. Scared me senseless. They're okay now, thankfully. But where do you even learn how to help in that situation? Feel so unprepared.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose is a distressing event and indicates the presence of potentially life-threatening situations in the environment. While the person survived, the experience caused significant distress to the witness and highlights a lack of preparedness, suggesting a potential need for resources and training in harm reduction.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 11:15:22"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost didn't wake up last night. Scariest thing ever. Narcan saved his life. Learn the signs of an overdose, please. It can happen to anyone.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a near-fatal overdose requiring Narcan intervention, indicating a high immediate risk to life.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 11:14:20"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, which helped a bit. Taking it one hour at a time. Anyone else relate?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text expresses a strong urge to self-harm, indicating a high risk of potential harm. While the person has reached out to a friend, the persistence of the urge warrants serious concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 11:13:19"
  },
  {
    "title": "User Story: Abuse",
    "content": "\"He's been getting worse. Yelling turned to pushing. Now I'm scared. Anyone know resources for domestic abuse in [city/state]? I feel so alone.\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "Escalating violence with a clear expression of fear indicates a high risk of severe harm.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 11:12:17"
  },
  {
    "title": "User Story: Overdose",
    "content": "Saw a guy OD at the park yesterday. Scary stuff. Narcan saved him, but it shook me up. Anyone know where I can get trained to use it, just in case? Feel helpless now.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "Witnessing an overdose, while the individual survived, indicates a potential public health crisis and highlights the risk of overdose deaths in the area. The reporter's distress and desire to obtain Narcan training suggests a concern about future incidents.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 11:11:16"
  },
  {
    "title": "User Story: Overdose",
    "content": "My friend almost died last night from an OD. Scared me senseless. Please, if you're struggling, reach out. There are people who care and want to help you stay safe.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text describes a recent overdose event that almost resulted in death, indicating a high level of immediate danger and potential for recurrence for the friend or others.",
    "detected_category": "overdose",
    "timestamp": "2026-01-04 11:10:14"
  },
  {
    "title": "User Story: Abuse",
    "content": "> \"Just realized patterns in my relationship might be abuse, not just 'rough patches.' Feeling lost & scared. Anyone else been through this? Where do I even start?\"",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The individual expresses fear and a realization that their relationship might be abusive, indicating potential for ongoing harm. The feeling of being 'lost' suggests vulnerability and a need for support.",
    "detected_category": "abuse",
    "timestamp": "2026-01-04 11:09:13"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been struggling lately. Urges are back. Just trying to get through the day without giving in. Anyone else feel this way?",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "medium",
    "reason": "The text indicates a struggle with urges, suggesting a potential risk of relapse. While the user is expressing a desire to resist, the return of urges warrants concern.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 11:08:12"
  },
  {
    "title": "User Story: Self-Harm",
    "content": "Been feeling so overwhelmed lately. The urge to self-harm is strong. Reached out to a friend, and it helped a little. Just trying to get through tonight.",
    "url": "https://example.com/synthetic-post",
    "original_query": "synthetic_generation",
    "severity": "high",
    "reason": "The text indicates a strong urge to self-harm, which constitutes a serious immediate risk to the individual's safety.",
    "detected_category": "self-harm",
    "timestamp": "2026-01-04 11:07:10"
  }
]